<HTML
><HEAD
><TITLE
>Configure dumb modem</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"><LINK
REL="HOME"
TITLE="Remote Serial Console HOWTO"
HREF="index.html"><LINK
REL="UP"
TITLE="Modem configuration"
HREF="modem.html"><LINK
REL="PREVIOUS"
TITLE="Using Minicom to give commands to
   a modem"
HREF="modem-minicom.html"><LINK
REL="NEXT"
TITLE="Configure modem with AT commands"
HREF="modem-hayes.html"></HEAD
><BODY
CLASS="SECTION"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Remote Serial Console HOWTO</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="modem-minicom.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Chapter 12. Modem configuration</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="modem-hayes.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECTION"
><H1
CLASS="SECTION"
><A
NAME="MODEM-DUMB"
></A
>12.2. Configure dumb modem</H1
><P
>Linux, like most <SPAN
CLASS="PRODUCTNAME"
>UNIX</SPAN
>-like
   operating systems, expects a serial console to be connected to a
   dumb modem.  Dumb modems are not seen much these days, perhaps only
   on exotic hardware such as <SPAN
CLASS="ACRONYM"
>ISDN</SPAN
> terminal adapters
   or satellite ground terminals.</P
><P
>A dumb modem is configured using hardware. <A
HREF="modem-dumb.html#MODEM-DUMB-FRONT"
>Figure 12-1</A
> shows the front panel of a fanciful
   dumb modem.  In reality the speed and mode settings are likely to
   be done using jumpers or DIP switches.</P
><DIV
CLASS="FIGURE"
><A
NAME="MODEM-DUMB-FRONT"
></A
><P
><B
>Figure 12-1. Front panel of a dumb modem</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>+-----------------------------+
|                             |
|    SPEED       MODE         |
|  [ ]  300    [ ] Originate  |
|  [ ]  600    [X] Answer     |
|  [ ] 2400                   |
|  [X] 9600                   |
|                             |
+-----------------------------+</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>The modem's speed is set to the desired bit rate, in our case
   9600<SPAN
CLASS="ABBREV"
>bps</SPAN
>.  The modem's mode is set to Answer,
   that is, to wait for incoming calls and to answer them.</P
><P
>If the <SPAN
CLASS="ACRONYM"
>RS-232</SPAN
> control line Data Terminal
   Ready is low, the modem will not answer a call.  The computer is
   off or the computer's serial interface is not yet initialized.
   Once <SPAN
CLASS="ACRONYM"
>DTR</SPAN
> is high the modem will answer incoming
   calls.</P
><P
>Once an incoming call is established the modem raises the
   Data Carrier Detect control line.  Only when DCD is high is
   received data valid (data receieved from a dumb modem when DCD is
   not asserted is probably line noise).  Only when DCD is high is
   transmitted data passed through the link.</P
><P
><SPAN
CLASS="APPLICATION"
>getty</SPAN
> on the Linux computer has
   been waiting for <SPAN
CLASS="ACRONYM"
>DCD</SPAN
> to come high, and
   <SPAN
CLASS="APPLICATION"
>getty</SPAN
> welcomes the user and requests
   them to log in.</P
><P
>Whilst the user is logged in and data is flowing, Clear to
   Send and Ready to Send are used between the modem and the computer
   to prevent data being sent too soon.  The computer lowers Ready to
   Send when it is too busy to receive a character.  The modem lowers
   Clear to Send when it is too busy to receive a character.</P
><P
>When the user hangs up, Data Carrier Detect falls and the
   hang up signal is sent to all processes associated with the dial in
   session.</P
><P
>Alternatively, the user can log out.  When the shell dies,
   the computer pulls Data Terminal Ready low, causing the modem to
   hang up.  When the <SPAN
CLASS="APPLICATION"
>getty</SPAN
> brings Data
   Terminal Ready high again, the modem will accept more incoming
   calls.</P
><P
>We have not yet described Data Set Ready.  This line is low
   if the modem is off or if the modem has not yet initialized.  When
   DSR is low all other signals from the modem are undefined.  For
   example, if DSR is low but DCD "floats" to the high voltage then
   software should behave as if DCD is not asserted.</P
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="modem-minicom.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="modem-hayes.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Using <SPAN
CLASS="PRODUCTNAME"
>Minicom</SPAN
> to give commands to
   a modem</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="modem.html"
ACCESSKEY="U"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Configure modem with <SPAN
CLASS="ACRONYM"
>AT</SPAN
> commands</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>