<HTML
><HEAD
><TITLE
>Use or configure a dumb modem</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"><LINK
REL="HOME"
TITLE="Remote Serial Console HOWTO"
HREF="index.html"><LINK
REL="UP"
TITLE="Security"
HREF="security.html"><LINK
REL="PREVIOUS"
TITLE="Obey Data Terminal Ready and Data Carrier Detect"
HREF="security-dtr.html"><LINK
REL="NEXT"
TITLE="Restrict console messages"
HREF="security-messages.html"></HEAD
><BODY
CLASS="SECTION"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Remote Serial Console HOWTO</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="security-dtr.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Chapter 9. Security</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="security-messages.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECTION"
><H1
CLASS="SECTION"
><A
NAME="SECURITY-DUMB"
></A
>9.3. Use or configure a dumb modem</H1
><P
>Most modems use the Hayes <SPAN
CLASS="ACRONYM"
>AT</SPAN
> command set.
   The modem's attention is gained by sending <TT
CLASS="LITERAL"
>+++</TT
>
   surrounded by some idle time.  Commands are then sent prefixed by
   <TT
CLASS="LITERAL"
>AT</TT
>.</P
><P
>Unfortunately, if the modem sees <TT
CLASS="LITERAL"
>+++</TT
>
   during a call it may revert to command mode.  The modem can then be
   configured by the caller.  For example, the modem could be set to
   permit incoming calls only from the number <SPAN
CLASS="QUOTE"
>"0"</SPAN
>, this
   would deny the system administrators access to the modem.</P
><P
>The attention command can be removed using <B
CLASS="COMMAND"
>AT
   S2=255</B
>.  Of course once that is done no more
   <SPAN
CLASS="ACRONYM"
>AT</SPAN
> commands can be given to the modem, so any
   other configuration of the modem needs to be done prior to that
   command.</P
><P
>Unfortunately, when power to the modem is applied the modem
   starts in command mode.  So a carefully chosen console message
   could disable the modem.</P
><P
>The best solution is to select a modem that has a
   <SPAN
CLASS="QUOTE"
>"dumb"</SPAN
> or <SPAN
CLASS="QUOTE"
>"select profile"</SPAN
>
   <SPAN
CLASS="ACRONYM"
>DIP</SPAN
> switch or jumper.  These switches disable
   command mode and load the modem's saved configuration when they
   start.</P
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="security-dtr.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="security-messages.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Obey Data Terminal Ready and Data Carrier Detect</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="security.html"
ACCESSKEY="U"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Restrict console messages</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>