<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="keywords" CONTENT="LinuxFocus, international magazine for Linux">
 <TITLE>LinuxFocus Magazine, January2000</TITLE>
</HEAD>

<BODY bgcolor="#ffffff">

<!-- MAP for top navegation bar -->  
<MAP name="top">  
<AREA shape="rect" coords="367,9,418,30" alt="Home" href="../index.shtml">  
<AREA shape="rect" coords="423,9,457,30" alt="Map" href="../map.html">  
<AREA shape="rect" coords="463,9,508,30" alt="Index" href="../indice.html">  
<AREA shape="rect" coords="514,9,558,30" alt="Search" href="../Search/index.html"> 
</MAP>  
  
<!-- MAP for bottom navegation bar -->  
<MAP name="bottom">  
<AREA shape="rect" coords="78,0,163,15" alt="News" href="../News/index.shtml">  
<AREA shape="rect" coords="189,0,284,15" alt="Archives" href="../Archives/index.html">  
<AREA shape="rect" coords="319,0,395,15" alt="Links" href="../Links/index.shtml">  
<AREA shape="rect" coords="436,0,523,15" alt="About LinuxFocus" href="../aboutus.html">  
</MAP>  
  
<!-- NAVEGATION BAR -->  
<CENTER>  
<IMG src="../../common/images/Topbar-en.gif" width="600" height="40" border="0"  ismap usemap="#top" alt="Topbar"><BR>  
<IMG src="../../common/images/Bottombar-en.gif" width="600" height="21" border="0"  ismap usemap="#bottom" alt="Bottombar"><BR>  
</CENTER>
<CENTER><h1>Januar 2000 LinuxFocus Ausgabe</h1></CENTER>
<p>
<img src="../../common/images/coverJanuary2000.gif" width=256 height=256 alt="cover image" align="left">
<br>
Willkommen im neuen Jahrtausend. Ein R&uuml;chblick auf 1999 zeigt, da&szlig;
Linux wirklich Atemberaubendes gelungen ist. Linux Weekly News hat
ein <a href="http://lwn.net/1999/features/Timeline/">Liste</a>
 mit den wichtigesten Ereignissen ver&ouml;ffentlicht.
1999 war das Jahr des Kernel 2.2, Gnome, einem sehr stabilen KDE und
nat&uuml;rich den B&ouml;rsenauftritten von RedHat, Cobalt Networks, VA Linux und
einigen anderen Firmen aus dem Linuxumfeld.
<br>
 Gnome und KDE haben die Auffassung, da&szlig; Linux nur eine Serverplattform
sei, ver&auml;ndert und die B&ouml;rseng&auml;nge haben viel &ouml;ffentliche Aufmerksamkeit
auf Linux gelenkt. Vor zwei Jahren war es oft n&ouml;tig, zu erkl&auml;ren was
Linux wirklich ist, pl&ouml;tzlich scheint nun jeder von Linux geh&ouml;rt zu haben.
<br>
Der Linuxmarkt w&auml;chst exponentiell und ich bin mir sicher, da&szlig; dieses
Jahr noch viel aufregender als das vergangene werden wird.
<br>
<br>
Trotz der Begeistrung sollten wir aber auf der Hut sein. Ein Patent 
h&auml;lt 20 Jahre und das ist eine sehr lange Zeit in der Softwarewelt.
Speziell im Softwarebereich werden immer mehr Patente f&uuml;r sehr
einfache Sachen angemeldet. Urspr&uuml;nglich waren Patente daf&uuml;r gedacht,
die Investionen in jahrelange Forschung und Entwicklung zu sch&uuml;tzen.
Leider werden heute Patente f&uuml;r sehr offensichtliche Sachen oder Technologien,
die schon in Gebrauch sind geschrieben. Diese Patente blockieren damit
die Verbreitung von Innovation.
Softwarepatente sind speziell ein Problem f&uuml;r die Entwickler
freier Software, da sie es unm&ouml;glich machen, die Idee in Form freier
Software zu ver&ouml;ffentlichen. Richard Stallman hat 
<a href="http://www.gnu.org/philosophy/amazon.html">zu einem Boykott</a>
von Amazon.com aufgerufen. Amazon, so scheint es, versucht sein Patent
f&uuml;r &quot;one click ordering&quot; gegen Barnes & Noble einzusetzen.
Der gro&szlig;e innovative Schritt von Amazons Patent ist das Abspeichern
von privaten Daten in einem Web Browser Cookie. F&uuml;r genau diese Technik
wurden aber Web Browser Cookies eigentlich erfunden.
<br>
</p>
<BR clear=all>
<!-- content -->

<H4> <FONT color="#660033"> System Administration </FONT> </H4>
<UL>
 <!-- item -->
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article135.shtml"> How to partition your hard drive for Linux</A>
, von Thomas Mangin<br>
Thomas erkl&auml;rt, wie er seine Festplatte partitioniert hat.
 </LI>
<br>
 <!-- item -->
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article134.shtml"> Home Networking, glossary and overview</A>
, von Guido Socher<br>
Dieses ist der erste Artikel in einer Serie &uuml;ber IP-Netze.
 </LI>
<br>
 <!-- item -->
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article129.shtml"> Mehrfache Verwendung einer IP Adresse mit Apache</A>
, von Atif Ghaffar<br>
Dieser Artikel zeigt, wie man virtuelle Webserver mit Apache unter
Linux einrichtet.
 </LI>
<br>
 <!-- item -->
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article133.shtml"> VXE, a Linux security tool</A>
, von Serge Lozovsky<br>
Serge Lozovsky pr&auml;sentiert ein Softwarepaket das er entwicklet hat, um
UNIX Systeme sicherer zu machen.
 </LI>
<br>
</UL>

<H4> <FONT color="#660033"> Anwendungen </FONT> </H4>
<UL>
 <!-- item -->
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article127.shtml">FSViewer, a File Manager for WindowMaker</A>
, von Georges Tarbouriech<br>
Eines der revolution&auml;ren Programme von NeXTStep und das erste, das
beim Starten auf dem Bildschirm erschien, war der File Viewer.
Dank der Pfadansicht in diesem File Manager wu&szlig;te man immer wo man
war. Der File Viewer war mehr als ein File Manager, es war ein Filesytembrowser.
FSViewer ist ein File Manager f&uuml;r WindowMaker der NeXTStep nachempfunden
wurde.
 </LI>
<br>
 <!-- item -->
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article128.shtml">WindowMaker the spirit of NextStep</A>
, von Georges Tarbouriech<br>
Window Maker 0.61.1 ist der neuste Release eines Windowmangagers der
NeXT nachempfunden wurde.
 </LI>
</UL>

<H4> <FONT color="#660033"> Software Entwicklung </FONT> </H4>
<UL>
 <!-- item -->
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article136.shtml">Perl Teil III</A>
, von Guido Socher<br>
Dieser Artikel zeigt, wie man Felder in Perl benutzt.
 </LI>
<br>
</UL>

<a name="tip"> </a>
<H4> <FONT color="#660033">Der LinuxFocus Tip</FONT> </H4>
<p>Das Linux ETX2 Dateisystem wird normalerweise nach 20
mount counts zwangsweise &uuml;berpr&uuml;ft. Bei heutigen Festplatten und
Partitionsgr&ouml;&szlig;en kann das mehrere Minuten dauern.
Heimcomputer werden zudem viel h&auml;ufiger als Server ein- und ausgeschaltet.
Als regelm&auml;&szlig;iger Computerbenutzer kann es deshalb sein, da&szlig;
die Nachricht <tt>... has reached maximum mount count, check forced</tt>
einige Male in der Woche auf dem Bildschirm erscheint.
<p>
Ein gelegentlicher Check des Dateisystems ist eine vern&uuml;nftige Sache,
aber ein- oder zweimal die Woche ist zu viel. Hier ist eine Beschreibung,
wie man den Max Mount Count einer Partition erh&ouml;hen kann.
</p>
<p>
<ol>
<li>Erste Regel: Benutze tune2fs niemals bei einem gemountetne
Dateisystem!! Es gibt verschiedene Rettungsdisketten f&uuml;r Linux. Tomsrtbt 
von <a href="http://www.toms.net/rb/">www.toms.net/rb/</a> ist ein
kleines Linuxsystem auf nur einer Diskette.
Man kann von dieser Diskette booten und dann tune2fs wie unten beschrieben
benutzen. <br>Tomsrtbt ist direkt hier erh&auml;ltlich, 
 <a href="../../common/src/January2000/tomsrtbt-1.6.362.tar.gz">tomsrtbt-1.6.362.tar.gz</a> oder <a href="../../common/src/January2000/tomsrtbt-1.7.185.tar.gz">tomsrtbt-1.7.185.tar.gz</a>
Lade das tomsrtbt einfach herunter und pack es aus. Eine Anleitung wie
man tomsrtbt benutzt ist enthalten.
<li>Nachdem man von der Diskette gebootet hat, kann man das
Kommando <br><tt>fdisk -l</tt><br>benutzen, um zu sehen, welche
Partitionen sich auf der Platte befinden.
<li>Mit dem Befehl <br><tt>dumpe2fs /dev/YourDev | grep Max</tt><br>
kann man sehen, was der augenblickliche Max Mount Count ist.
YourDev sollte durch das entsprechende Device (z.B hda5) ersetzt werden.
<li>Um den Max Mount Count auf einen h&ouml;heren Wert zu setzen (z.B 50),
benutzt man den Befehl:
<br><tt>tune2fs -c 50 /dev/YourDev </tt><br>
<li>Auf diese Art sollte man tune2fs auf alle Festplattenpartitionen
anwenden, die als &quot;Linux native&quot; unter fdisk markiert sind.
Man kann den Wert f&uuml;r den Max Mount Count bei jeder Partition etwas
variieren (z.B 50, 60, 70...). Auf diese Art werden nicht alle Partitionen
zur selben Zeit gecheckt.
</OL>

</p>

<!-- end content -->

<BR clear=all>
<!-- start of footer -->
<HR WIDTH="85%" noshade size="1">
 <CENTER> 
<table WIDTH="85%" >
 <TR bgcolor="#666666">
   <TD align="center">
   <FONT color="#FFFFFF">
    <B>&copy; 2000 LinuxFocus</B><BR>
    </FONT>
    <A href="../../common/lfteam.html"><FONT color="#FFFFFF">Dem LinuxFocus Team schreiben</FONT></A>
   </TD>
 </TR>
</TABLE>
</CENTER>
</BODY>
</HTML>
<!-- vim: set sw=2 ts=2 et: -->
