<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl3</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl02.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl04.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 3</P>
</font></B><P><HR>
<B><U><FONT FACE="Verdana" SIZE=2><P>Configuraci&oacute;n del Hardware de Red</P>
</font></u></B>
<dir> 
    <p><font face="Verdana" size="2"><a href="garl03.htm#3.1">3.1 Dispositivos, 
      Controladores, y todo lo dem&aacute;s</a><br>
      <a href="garl03.htm#3.2">3.2 Configuraci&oacute;n del n&uacute;cleo</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl03.htm#3.2.1">3.2.1 Opciones 
          del n&uacute;cleo de Linux 1.0 o Versiones Posteriores</a><br>
          <a href="garl03.htm#3.2.2">3.2.2 Opciones del n&uacute;cleo de Linux 
          1.1.14 y Versiones Posteriores</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl03.htm#3.3">3.3 Una Visita a 
      los Dispositivos de Red de Linux</a><br>
      <a href="garl03.htm#3.4">3.4 Instalaci&oacute;n Ethernet</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl03.htm#3.4.1">3.4.1 Cableado 
          de Ethernet</a><br>
          <a href="garl03.htm#3.4.2">3.4.2 Tarjetas Compatibles</a><br>
          <a href="garl03.htm#3.4.3">3.4.3 Autoverificaci&oacute;n de red Ethernet</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl03.htm#3.5">3.5 El controlador 
      PLIP</a><br>
      <a href="garl03.htm#3.6">3.6 Los controladores SLIP y PPP</a></font></p>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="3.1"></a>3.1 Dispositivos, Controladores, y todo lo dem&aacute;s</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Hasta ahora, hemos estado hablando bastante sobre los interfaces de red pero sin explicar realmente que es lo que pasa cuando el "c&oacute;digo de red" en el n&uacute;cleo accede a una parte del hardware. Para ello, y antes que nada, tenemos que hablar un poco sobre los conceptos de interface y controladores.</P>
<P>Primero, evidentemente, esta el hardware por s&iacute; mismo; por ejemplo, una tarjeta Ethernet es: una oblea de Silicio, atiborrada de montones de peque&ntilde;os chips con est&uacute;pidos n&uacute;meros en el lomo e insertada en una ranura de su PC. Esto es lo que por lo general denominamos un dispositivo.</P>
<P>Para poder utilizar la tarjeta Ethernet son necesarias una serie de funciones especiales definidas en el n&uacute;cleo de Linux que ser&aacute;n capaces de entender la forma particular de acceso al dispositivo. Esta serie de funciones son los denominados controladores1 del dispositivo. Por ejemplo, Linux tiene controladores de dispositivos para varias marcas de tarjetas Ethernet que son muy parecidas en su funcionamiento. Son conocidos como los "Controladores de la Serie Becker", debido a su autor, Donald Becker. Otro ejemplo puede ser el del controlador D-Link, que gestiona un adaptador de bolsillo D-Link conectado a un puerto paralelo.</P>
<P>Pero ¿qu&eacute; es lo que queremos decir con que un controlador "gestione" un dispositivo? Volvamos a la tarjeta Ethernet que examinamos antes. El controlador tiene que ser capaz de comunicarse de alguna forma con la l&oacute;gica interna de la tarjeta: tiene que enviar &oacute;rdenes y datos a la tarjeta, mientras que la tarjeta debe transmitir al controlador cualquier dato recibido.</P>
<P>_____________________________________________<BR>
1 N. del T.: Con frecuencia, la bibliograf&iacute;a especializada en espa&ntilde;ol tambi&eacute;n los llama manejadores</P>
<P>&nbsp;</P>
</FONT><P ALIGN="CENTER"><IMG SRC="fig3.1.gif" WIDTH=432 HEIGHT=274></P>
<FONT FACE="Verdana" SIZE=2><P>Figura 3.1: Relaci&oacute;n entre controladores, interfaces, y hardware.</P>
<P>&nbsp;</P>
<P>En un PC, esta comunicaci&oacute;n tiene lugar a trav&eacute;s de un &aacute;rea de memoria de E/S que se corresponde con los registros internos de la tarjeta y a la inversa. Todas las &oacute;rdenes y datos que el n&uacute;cleo env&iacute;a a la tarjeta tienen que ir a trav&eacute;s de estos registros. El &aacute;rea de memoria de E/S de la tarjeta se describe por lo general mediante su direcci&oacute;n base o de comienzo. Direcciones habituales para tarjetas Ethernet son la 0x300 o la 0x360.</P>
<P>Normalmente no hay que preocuparse por factores de hardware como las direcciones base, ya que en tiempo de arranque el n&uacute;cleo hace un intento para detectar la localizaci&oacute;n de la tarjeta. Esto se denomina autoverificacion2, que implica que el n&uacute;cleo lea varias posiciones de memoria y compare los datos le&iacute;dos con los que deber&iacute;a haber si existiese una tarjeta Ethernet instalada all&iacute;. De todas maneras, puede haber tarjetas Ethernet que no sean detectadas autom&aacute;ticamente; esto ocurre a veces con tarjetas Ethernet baratas que no son replicas exactas de tarjetas est&aacute;ndar de otros fabricantes. Por otro lado, el n&uacute;cleo intentara detectar un &uacute;nico dispositivo Ethernet al arrancar. Si se utiliza mas de una tarjeta, hay que indic&aacute;rselo expl&iacute;citamente al n&uacute;cleo.</P>
<P>Otro de los par&aacute;metros que se pueden decir de forma expl&iacute;cita al n&uacute;cleo es el canal de petici&oacute;n de interrupci&oacute;n. Los componentes hardware normalmente interrumpen al n&uacute;cleo cuando tienen necesidad de que &eacute;ste se ocupe de ellos, por ejemplo cuando han llegado datos, o se presenta una condici&oacute;n especial. En un PC, las interrupciones pueden comunicarse mediante uno de los 15 canales de interrupci&oacute;n numerados 0,1 y del 3 al 15. El n&uacute;mero de interrupci&oacute;n asignado a un componente hardware se denomina su n&uacute;mero de petici&oacute;n de interrupci&oacute;n, o IRQ3 4.</P>
<P>_____________________________________________<BR>
2 N. del T.: Del ingl&eacute;s autoprobing</P>
<P>&nbsp;</P>
<P>Como se explicaba en el cap&iacute;tulo 2, el n&uacute;cleo accede a un dispositivo mediante lo que llam&aacute;bamos una interfaz. Las interfaces ofrecen un conjunto abstracto de funciones que es el mismo para todo tipo de hardware. Por ejemplo, con funciones para enviar o recibir datagramas.</P>
<P>Los interfaces se identifican mediante nombres. Estos nombres se definen internamente en el n&uacute;cleo, y no son ficheros de dispositivos del directorio /dev. Nombres t&iacute;picos para los interfaces Ethernet son eth0, eth1, etc. La asignaci&oacute;n de interfaces a los dispositivos depende normalmente del orden en el que los dispositivos son configurados; por ejemplo la primera tarjeta Ethernet instalada ser&aacute; eth0, la siguiente eth1, y as&iacute; sucesivamente. Una excepci&oacute;n a esta regla son las interfaces SLIP y algunas otras, que son asignadas de forma din&aacute;mica; es decir, al establecerse una conexi&oacute;n SLIP, se asigna una interface al puerto serie.</P>
<P>El gr&aacute;fico de la figura 3.1 muestra la relaci&oacute;n entre el hardware, los controladores de dispositivos e interfaces.</P>
<P>Al arrancar, el n&uacute;cleo muestra cada dispositivo que es detectado, y que interfaces se est&aacute;n instalando. Lo siguiente es un extracto de la pantalla de arranque:</P><DIR>
<DIR>

<P>.<BR>
.<BR>
This processor honours the WP bit even when in supervisor mode. Good.Floppy drive(s): fd0 is 1.44M<BR>
Swansea University Computer Society NET3.010<BR>
IP Protocols: ICMP, UDP, TCP<BR>
PPP: version 0.2.1 (4 channels) OPTIMIZE FLAGS<BR>
TCP compression code copyright 1989 Regents of the University of California<BR>
PPP line discipline registered.<BR>
SLIP: version 0.7.5 (4 channels)<BR>
CSLIP: code copyright 1989 Regents of the University of California<BR>
dl0: D-Link DE-600 pocket adapter, Ethernet Address: 00:80:C8:71:76:95<BR>
Checking 386/387 coupling... Ok, fpu using exception 16 error reporting.<BR>
Linux version 1.1.11 (okir@monad) #3 Sat May 7 14:57:18 MET DST 1994</P></DIR>
</DIR>

<P><BR>
_____________________________________________<BR>
3 Los IRQs 2 y 9 son los mismos debido a que el PC tiene dos procesadores de interrupciones en cascada con 8 IRQs cada uno; el procesador secundario esta conectado al IRQ 2 del primario.<BR>
4 N. del T.: Del ingl&eacute;s Interrupt ReQuest</P>
<P>&nbsp;</P>
<P>Esta indica que el n&uacute;cleo ha sido compilado para TCP/IP, y se incluyen los controladores para SLIP, CSLIP, y PPP. La tercera l&iacute;nea antes del final indica que se ha detectado un adaptador de bolsillo D-Link e instalado como el interface dl0. Si usted tiene un tipo diferente de tarjeta Ethernet, el n&uacute;cleo mostrara normalmente una l&iacute;nea comenzando por eth0, seguida por el tipo de tarjeta detectado. Si usted tiene una tarjeta Ethernet instalada pero no se refleja en ning&uacute;n mensaje, significa que el n&uacute;cleo es incapaz de detectar su tarjeta adecuadamente. Trataremos este problema posteriormente.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="3.2"></a>3.2 Configuraci&oacute;n del n&uacute;cleo</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>La mayor&iacute;a de las versiones de Linux se distribuyen con discos de arranque 
  que funcionan en casi cualquier PC. Esto significa que el n&uacute;cleo tiene 
  en esos discos todo tipo de controladores configurados que rara vez utilizara, 
  pero que ocupan un espacio innecesario en el sistema de memoria ya que con el 
  n&uacute;cleo no puede hacerse swapping. Por tanto, ser&iacute;a conveniente 
  crear un n&uacute;cleo propio, incluyendo solo los controladores que realmente 
  necesite o desee.</P>
<P>Al trabajar con un sistema Linux, le deber&aacute; resultar familiar el proceso 
  de construcci&oacute;n del n&uacute;cleo. Los conceptos b&aacute;sicos de como 
  realizarlo se explican en la Gu&iacute;a de Matt Welsh: "Instalaci&oacute;n 
  y primeros pasos", que tambi&eacute;n forma parte de la serie de Documentaci&oacute;n 
  del Proyecto Linux. Por tanto, en esta secci&oacute;n solo trataremos las opciones 
  de configuraci&oacute;n que afectan a la red.</P>
<P>Al ejecutar make config, se le preguntara por una serie de configuraciones 
  generales, por ejemplo si desea emulaci&oacute;n matem&aacute;tica del n&uacute;cleo 
  o no, etc. Una de las preguntas ser&aacute; si desea o no soporte para red TCP/IP. 
  Si desea un n&uacute;cleo capaz de trabajar con la red debe ser contestada con 
  "y" (SI).</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="3.2.1"></a>3.2.1 Opciones del n&uacute;cleo de Linux 1.0 o Versiones 
  Posteriores</P>
</u></I> 
<P>Tras completar la parte de opciones generales, se pasara a configurar distintos 
  componentes: controladores SCSI, etc. La siguiente lista contiene las preguntas 
  que son sobre el soporte de red. N&oacute;tese que el conjunto de opciones de 
  configuraci&oacute;n esta en constante cambio debido al continuo desarrollo. 
  Una lista t&iacute;pica de opciones que ofrecen los n&uacute;cleos de versiones 
  entre la 1.0 y la 1.1 se parece a &eacute;sta (los comentarios est&aacute;n 
  en cursiva):</P>
<DIR> 
  <DIR> 
    <P>*<BR>
      * Network device support<BR>
      *<BR>
      Network device support? (CONFIG ETHERCARDS) [y]</P>
  </DIR>
</DIR>
<P>A pesar de que se muestre la contestaci&oacute;n por defecto entre corchetes, 
  la pregunta debe ser contestada con y si desea utilizar cualquier tipo de dispositivos 
  de red, no importa si son Ethernet, SLIP o PPP. Si contesta a la pregunta con 
  y, se activara autom&aacute;ticamente el soporte para dispositivos tipo Ethernet. 
  El soporte para otros tipos de controladores de red debe ser activado por separado:</P>
<DIR> 
  <DIR> 
    <P>SLIP (ser&iacute;al line) support? (CONFIG SLIP) [y]<BR>
      SLIP compressed headers (SL COMPRESSED) [y]<BR>
      PPP (point-to-point protocol) support (CONFIG PPP) [y]<BR>
      PLIP (parallel port) support (CONFIG PLIP) [n]</P>
  </DIR>
</DIR>
<P>Estas preguntas conciernen a los diversos protocolos de nivel de enlace soportados 
  por Linux. SLIP permite transportar datagramas IP a trav&eacute;s de l&iacute;neas 
  serie. La opci&oacute;n de compresi&oacute;n de cabecera proporciona el soporte 
  CSLIP, una t&eacute;cnica que reduce las cabeceras TCP/IP a tres bytes. Tenga 
  en cuenta que esta opci&oacute;n del n&uacute;cleo no activa autom&aacute;ticamente 
  el soporte para CSLIP, solamente proporciona las funciones necesarias del n&uacute;cleo 
  para ello.</P>
<P>PPP es otro de los protocolos para enviar tr&aacute;fico a la red a trav&eacute;s 
  de l&iacute;neas serie. Es mucho mas flexible que SLIP, y no se limita a IP, 
  sino que, una vez que se implemente, tambi&eacute;n soportara IPX. Ya que el 
  soporte para PPP ha sido incluido hace poco, esto opci&oacute;n puede no aparecer 
  en su n&uacute;cleo.</P>
<P>PLIP proporciona una forma de enviar datagramas IP a trav&eacute;s de un puerto 
  paralelo. Se utiliza generalmente para comunicar dos PCs bajo DOS. El resto 
  de las preguntas son acerca de tarjetas Ethernet de diversos fabricantes. A 
  medida que se desarrollan mas controladores, la lista de preguntas se hace mayor. 
  Si desea construir un n&uacute;cleo que quiera utilizar en varias m&aacute;quinas, 
  tiene la posibilidad de activar mas de un controlador.</P>
<P>&nbsp;</P>
<DIR> 
  <DIR> 
    <P>NE2000/NE1000 support (CONFIG EN2000) [y]<BR>
      WD80*3 support (CONFIG WD80x3) [n]<BR>
      SMC Ultra support (CONFIG ULTRA) [n]<BR>
      3c501 support (CONFIG EL1) [n]<BR>
      3c503 support (CONFIG EL3) [n]<BR>
      HP PCLAN support (CONFIG HPLAN) [n]<BR>
      AT1500 and EN2100 (LANCE and PCnet-ISA) support (CONFIG LANCE) [n]<BR>
      AT1700 support (CONFIG AT1700) [n]<BR>
      DEPCA support (CONFIG DEPCA) [n]<BR>
      D-Link DE600 pocket adaptor support (CONFIG DE600) [y]<BR>
      AT-LAN-TEC/RealTek pocket adaptor support (CONFIG ATP) [n]<BR>
      *<BR>
      * CD-ROM drivers<BR>
      *<BR>
      ...</P>
  </DIR>
</DIR>
<P>&nbsp;</P>
<P>Por &uacute;ltimo, en la secci&oacute;n del sistema de ficheros, el script 
  de configuraci&oacute;n le preguntara, entre otras cosas, si desea soporte para 
  NFS (networking filesystem), el sistema de ficheros en red. NFS le permitir&aacute; 
  exportar sistemas de ficheros a diversos nodos, de forma que parezcan como si 
  estuviesen en un disco duro normal conectado a la m&aacute;quina local.</P>
<DIR> 
  <DIR> 
    <P>NFS filesystem support (CONFIG NFS FS) [y]</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="3.2.2"></a>3.2.2 Opciones del n&uacute;cleo de Linux 1.1.14 y Versiones 
  Posteriores</P>
</u></I> 
<P>Comenzando con Linux 1.1.14, que inclu&iacute;a una versi&oacute;n alpha de 
  IPX, el proceso de configuraci&oacute;n vari&oacute; muy poco. Ahora las opciones 
  de car&aacute;cter general preguntan si se desea soporte de red en general. 
  A continuaci&oacute;n aparecen un par de preguntas adicionales.</P>
<DIR> 
  <DIR> 
    <P>*<BR>
      * Networking options<BR>
      *<BR>
      TCP/IP networking (CONFIG INET) [y]</P>
  </DIR>
</DIR>
<P>Para utilizar protocolos TCP/IP, se debe contestar con y. Pero aunque conteste 
  de forma negativa todav&iacute;a ser&aacute; capaz de poder compilar el n&uacute;cleo 
  para que soporte IPX.</P>
<DIR> 
  <DIR> 
    <P>IP fordwarding/gatewaying (CONFIG IP FORWARD) [n]</P>
  </DIR>
</DIR>
<P>Tendr&aacute; que activar esta opci&oacute;n si su sistema act&uacute;a como 
  un puente entre dos redes Ethernet, o entre una red Ethernet y un enlace SLIP, 
  etc. Aunque no cuesta nada activar esta opci&oacute;n por defecto, podr&iacute;a 
  querer desactivarla para configurar la m&aacute;quina como un cortafuegos5. 
  Los cortafuegos son nodos que se conectan a una o mas redes, pero no encaminan 
  tr&aacute;fico entre ellos. Se utilizan normalmente para proporcionar a los 
  usuarios en una empresa acceso a Internet con un riesgo m&iacute;nimo para la 
  red interna. A los usuarios se les permitir&aacute; acceder al cortafuegos y 
  utilizar servicios Internet, pero las m&aacute;quinas de la empresa estar&aacute;n 
  protegidas de ataques externos ya que cualquier conexi&oacute;n entrante no 
  puede cruzar el cortafuegos.</P>
<DIR> 
  <DIR> 
    <P>*<BR>
      * (it is safe to leave these untouched)<BR>
      PC/TCP compatibility mode (CONFIG INET PCTCP) [n]</P>
  </DIR>
</DIR>
<P>Esta opci&oacute;n evita incompatibilidades con algunas versiones de PC/TCP, 
  una implementaci&oacute;n comercial de TCP/IP basada en DOS para PCs. Si activa 
  esta opci&oacute;n, todav&iacute;a ser&aacute; capaz de comunicarse con m&aacute;quinas 
  UNIX normales, pero bajara el rendimiento cuando el enlace sea lento.</P>
<P>_____________________________________________<BR>
  5 N. del T.: Del ingl&eacute;s firewall</P>
<P>&nbsp;</P>
<DIR> 
  <DIR> 
    <P>Reverse ARP (CONFIG INET RARP) [n]</P>
  </DIR>
</DIR>
<P>Esta funci&oacute;n activa RARP, Protocolo de Resoluci&oacute;n de Direcciones 
  Inverso. RARP se utiliza en clientes sin disco y terminales X para pedir su 
  direcci&oacute;n IP al arrancar. Deber&aacute; activar RARP solo cuando planee 
  que su m&aacute;quina sea un servidor para este tipo de clientes.</P>
<P>El &uacute;ltimo paquete de utilidades de red (net-0.32d ) contiene una peque&ntilde;a 
  utilidad llamada rarp que permite a&ntilde;adir direcciones de nodos a una cache 
  RARP.</P>
<DIR> 
  <DIR> 
    <P>Assume subnets are local (CONFIG INET SNARL) [y]</P>
  </DIR>
</DIR>
<P>Al mandar datos TCP, el n&uacute;cleo tiene que dividir los env&iacute;os en 
  diversos paquetes antes de pas&aacute;rselo al nivel IP. Para m&aacute;quinas 
  accesibles en redes locales como Ethernet, se utilizaran paquetes mas grandes 
  que para m&aacute;quinas cuyos datos son enviados a trav&eacute;s de enlaces 
  de larga distancia.6 Si no se activa la opci&oacute;n SNARL, el n&uacute;cleo 
  asumir&aacute; como locales solo a aquellas redes con las que en ese momento 
  tenga una interface. Si revisa la red de clase B en la Universidad Groucho Marx, 
  toda la red de clase B es local pero la mayor&iacute;a de los hosts mantienen 
  una interface con solo una o dos subredes. Si se activa la opci&oacute;n SNARL, 
  el n&uacute;cleo asumir&aacute; todas las subredes como locales y utilizara 
  paquetes grandes cuando se comunique con todos los nodos del campus.</P>
<P>Si no desea utilizar tama&ntilde;os de paquete peque&ntilde;os para enviar 
  datos a m&aacute;quinas especificas (si, por ejemplo, utiliza un enlace SLIP 
  para la transmisi&oacute;n de datos), tendr&aacute; que hacerlo mediante la 
  opci&oacute;n mtu del encaminamiento (route), que se describe brevemente al 
  final de este cap&iacute;tulo.</P>
<DIR> 
  <DIR> 
    <P>Disable NAGLE algorithm (normally enabled) (CONFIG TCP NAGLE OFF) [n]</P>
  </DIR>
</DIR>
<P>La formula de Nagle es un m&eacute;todo heur&iacute;stico para evitar enviar 
  paquetes IP particularmente peque&ntilde;os, tambi&eacute;n denominados pequegramas7. 
  Los pequegramas son utilizados normalmente por herramientas de red interactivas 
  que transmiten pulsaciones &uacute;nicas de teclas, como telnet o rsh (remote 
  shell). Los pequegramas pueden llegar a ser particularmente ineficientes bajo 
  enlaces de banda estrecha como SLIP. El algoritmo de Nagle intenta evitarlos 
  reteniendo por poco tiempo la transmisi&oacute;n de datos TCP en algunas circunstancias.</P>
<P>Es recomendable desactivar el algoritmo de Nagle si tiene graves problemas 
  por paquetes perdidos.</P>
<P>_____________________________________________<BR>
  6 Esto evita la fragmentaci&oacute;n por enlaces que tienen un tama&ntilde;o 
  de paquete m&aacute;ximo muy peque&ntilde;o.<BR>
  7 N. del T.: Del ingl&eacute;s tinygrams</P>
<P>&nbsp;</P>
<DIR> 
  <DIR> 
    <P>The IPX protocol (CONFIG IPX) [n]</P>
  </DIR>
</DIR>
<P>Activa la capacidad de soportar el protocolo IPX, el protocolo de transporte 
  utilizado por Novell Networking; que sigue todav&iacute;a bajo desarrollo, y 
  aun no es realmente &uacute;til. Una ventaja de esto ser&aacute; cuando alg&uacute;n 
  d&iacute;a se intercambien datos con utilidades IPX basadas en DOS, y encaminen 
  tr&aacute;fico entre redes Novell mediante un enlace PPP. El soporte para protocolos 
  de alto nivel de redes Novell no esta todav&iacute;a a la vista, ya que las 
  especificaciones de estos protocolos tienen un coste econ&oacute;mico muy elevado.</P>
<P>A partir de la versi&oacute;n 1.1.16 del n&uacute;cleo, Linux soporta otro 
  tipo de controlador: el controlador vac&iacute;o (dummy). La siguiente pregunta 
  aparece hacia el comienzo de la secci&oacute;n de controladores de dispositivos:</P>
<DIR> 
  <DIR> 
    <P>Dummy net driver support (CONFIG DUMMY) [y]</P>
  </DIR>
</DIR>
<P>El controlador vac&iacute;o no hace realmente gran cosa, pero es bastante &uacute;til 
  en m&aacute;quinas aisladas o conectadas mediante SLIP. Es b&aacute;sicamente 
  un interface en bucle cerrado. La raz&oacute;n de tener este tipo de interface 
  es que en las m&aacute;quinas que se conectan con SLIP que no disponen de Ethernet, 
  es necesario tener un interface que continuamente maneje las direcciones IP. 
  Esto se discute mas profundamente en las secci&oacute;n La Interface Comod&iacute;n 
  del cap&iacute;tulo 5.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="3.3"></a>3.3 Una Visita a los Dispositivos de Red de Linux</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El n&uacute;cleo de Linux soporta controladores de hardware de diversas clases. En esta secci&oacute;n se introducen brevemente las familias de controladores disponibles, y los nombres de interfaces que utilizan.</P>
<P>Hay un conjunto de nombres est&aacute;ndares para los interfaces en Linux, que se enumeran a continuaci&oacute;n. La mayor&iacute;a de los controladores soportan mas de un interface, en cuyo caso las interfaces se numeran de la forma: eth0, eth1, etc.</P></FONT><DIR><DIR>
<FONT FACE="Verdana" SIZE=2>

</font><B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>lo</b></font><FONT FACE="Verdana" SIZE=2> Interface de bucle local o de lazo. Se utiliza para realizar pruebas, y para un par de aplicaciones de red. Funciona como un circuito cerrado en el que cualquier datagrama que se le pase como par&aacute;metro ser&aacute; inmediatamente devuelto a la capa de red del sistema. En el n&uacute;cleo siempre hay un dispositivo de bucle local, no tiene sentido tener mas de uno.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>ethn</b></font><FONT FACE="Verdana" SIZE=2> Tarjeta Ethernet n -sima. Este es el nombre de interface gen&eacute;rico para la mayor&iacute;a de las tarjetas Ethernet.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>dln</b></font><FONT FACE="Verdana" SIZE=2> Esta interface accede a un adaptador de bolsillo D-Link DE-600, otro dispositivo Ethernet. Tiene un car&aacute;cter un poco especial ya que esta conectado a un puerto paralelo.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>sln</b></font><FONT FACE="Verdana" SIZE=2> Interface SLIP n -sima. Las interfaces SLIP se asocian a l&iacute;neas serie en el orden en el que son instalados; por ejemplo, sl0, ser&aacute; la primera l&iacute;nea serie en ser configurada para SLIP, etc. El n&uacute;cleo soporta hasta cuatro interfaces SLIP.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>pppn</b></font><FONT FACE="Verdana" SIZE=2> Interface PPP n -sima. Como ocurre con las interfaces SLIP, una interface PPP se asocia a una l&iacute;nea serie una vez que se ha convertido a modo PPP. De momento, se pueden soportar hasta cuatro interfaces de este tipo.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>plipn</b></font><FONT FACE="Verdana" SIZE=2> Interface PLIP n -sima. PLIP transporta datagramas IP en l&iacute;neas paralelas. Se soportan hasta tres interfaces PLIP. El controlador PLIP asigna las interfaces en tiempo de arranque, y se mapean a los puertos paralelos.</font></P></DIR>
</DIR><FONT FACE="Verdana" SIZE=2>

<P>&nbsp;</P>
<P>Para otros controladores de interfaces que puedan ser a&ntilde;adidos en el futuro como RDSI (Red Digital de Servicios Integrados) o AX.25, se utilizaran otros nombres. Controladores como el de IPX (protocolo Novell de red) o AX.25 (utilizado por radio aficionados) est&aacute;n ya en desarrollo, aunque todav&iacute;a en versiones preliminares (alpha).</P>
<P>En las secciones siguientes se discutir&aacute;n los detalles de uso de los controladores anteriores.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="3.4"></a>3.4 Instalaci&oacute;n Ethernet</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>El c&oacute;digo de red actual de Linux soporta diversas marcas de tarjetas 
  Ethernet. Donald Becker (becker@cesdis.gsfc.nasa.gov) desarrollo la mayor&iacute;a 
  de los controladores, una familia para tarjetas basadas en el chip 8390 de National 
  Semiconductor; y se la conoce como los la Serie de Controladores Becker. Tambi&eacute;n 
  hay un par de productos de D-Link, entre ellos el adaptador de bolsillo D-Link 
  que permite acceder a una red Ethernet a trav&eacute;s de un puerto paralelo. 
  Un controlador para este dispositivo fue programado por Bjorn Ekwall (bjorn@blox.se), 
  mientras que el controlador DEPCA lo programo David C. Davies (davies@wanton.lkg.dec.com).</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="3.4.1"></a>3.4.1 Cableado de Ethernet</P>
</u></I> 
<P>Si usted esta instalando una red Ethernet por primera vez en su vida, son necesarios 
  algunos comentarios respecto al cableado. Ethernet tiene una caracteristicas 
  muy especiales de cableado. El cable debe terminar en ambos extremos con una 
  resistencia de 50 Ohm, y no debe tener ninguna ramificacion (p.e. tres cables 
  conectados en estrella). Si esta utilizando cable coaxial fino con conectores 
  BNC en forma de T, estos conectores deben estar directamente conectados al de 
  la tarjeta; no debe insertarse el cable directamente.</P>
<P>Si se conecta a una instalaci&oacute;n con cable grueso, debe conectar el ordenador 
  utilizando un transceptor (a veces denominado Unidad de Conexi&oacute;n Ethernet). 
  Puede conectarse el transceptor a un puerto AUI de 25 pines de la tarjeta mediante 
  un cable protegido.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="3.4.2"></a>3.4.2 Tarjetas Compatibles</P>
</u></I> 
<P>Una lista completa de las tarjetas compatibles esta disponible en los Ethernet 
  HOWTOs, publicada mensualmente en comp.os.linux.announce por Paul Gortmaker.8</P>
<P>Incluimos una lista de las tarjetas mas conocidas y utilizadas que soporta 
  Linux. La lista actual del HOWTO es casi tres veces mayor. Aunque encuentre 
  su tarjeta en esta lista, b&uacute;squela tambi&eacute;n en el HOWTO; a veces 
  hay detalles importantes sobre el modo de operaci&oacute;n de estas tarjetas. 
  Por ejemplo, algunas tarjetas Ethernet basadas en DMA que utilizan los mismos 
  canales DMA que los que el controlador de SCSI Adaptec 1542 usa por defecto. 
  Si no se cambia el canal de DMA en alguno de las dos, la tarjeta Ethernet podr&iacute;a 
  escribir paquetes de datos en posiciones arbitrarias del disco duro.</P>
<DIR> 
  <DIR> 
    <P><B>3Com EtherLink<BR>
      </b>Se soporta 3Com EtherLink tanto 3c503 como 3c503/16, adem&aacute;s de 
      las versiones 3c507 y 3c509. La 3c501 tambi&eacute;n se soporta aunque es 
      demasiado lenta como para merecer la pena.</P>
    <P><B>Novell Eagle <BR>
      </b>Se soportan Novell Eagle NE1000 y NE2000, as&iacute; como diversas cl&oacute;nicas. 
      Tambi&eacute;n soporta las NE1500 y NE2100.</P>
    <P><B>Western Digital/SMC<BR>
      </b>Hay que incluir entre las compatibles a la Western Digital/SMC WD8003 
      y WD8013 (igualmente la SMC Elite y la SMC Elite Plus), y tambi&eacute;n 
      la nueva SMC Elite 16 Ultra.</P>
    <P><B>Hewlett Packard<BR>
      </b>Las HP 27252, HP 27247B, y la HP J2405A.</P>
    <P><B>D-Link <BR>
      </b>El adaptador de bolsillo D-Link DE-600, DE-100, DE-200 y DE-220-T. Tambi&eacute;n 
      hay un kit de ampliaci&oacute;n para la DE-650-T, denominado tarjeta PCM-CIA9.</P>
    <B> 
    <P>DEC DEC DE200 (32K/64K), DE202, DE100, y DEPCA rev E.</P>
    <P>Allied Teliesis</P>
    <P>AT1500 y AT1700.</P>
    </b></DIR>
</DIR>
<P>_____________________________________________<BR>
  8 Paul puede ser localizado en gpg109@rsphysse.anu.edu.au.<BR>
  9 Puede conseguirse - junto con otro material relacionado con Laptop - en tsx-11.mit.edu, 
  en packages/laptops.</P>
<P>&nbsp;</P>
<P>Para utilizar cualquiera de estas tarjetas con Linux, debe utilizar un n&uacute;cleo 
  precompilado de una de las distribuciones de Linux. Estas versiones incluyen 
  normalmente controladores para todas las tarjetas. Aunque a la larga ser&aacute; 
  mejor confeccionarse su propio n&uacute;cleo y compilarlo solo con los controladores 
  que se necesiten en ese momento.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="3.4.3"></a>3.4.3 Autoverificacion de red Ethernet</P>
</u></I> 
<P>En tiempo de arranque, el c&oacute;digo para Ethernet intentara localizar la 
  tarjeta y determinar su tipo. Se comprueban por orden las siguientes direcciones:</P>
</FONT> 
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=367>
<TR><TD WIDTH="29%" VALIGN="TOP" BGCOLOR="#008080">
<B><FONT FACE="Verdana" SIZE=2 COLOR="#ffffff"><P ALIGN="CENTER">Tarjeta</font></B></TD>
<TD WIDTH="71%" VALIGN="TOP" BGCOLOR="#008080">
<B><FONT FACE="Verdana" SIZE=2 COLOR="#ffffff"><P ALIGN="CENTER">Verificaci&oacute;n de las direcciones</font></B></TD>
</TR>
<TR><TD WIDTH="29%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>WD/SMC</P>
<P>SMC 16 Ultra</P>
<P>3c501</P>
<P>3c503<BR>
</P>
<P>NEx000</P>
<P>HP<BR>
</P>
<P>DEPCA</FONT></TD>
<TD WIDTH="71%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>0x300, 0x280, 0x380, 0x240</P>
<P>0x300, 0x280</P>
<P>0x280</P>
<P>0x300, 0x310, 0x330, 0x350, 0x250, 0x280, 0x2a0, 0x2e0</P>
<P>0x300, 0x280, 0x320, 0x340, 0x360</P>
<P>0x300, 0x320, 0x340, 0x280, 0x2C0, 0x200, 0x240</P>
<P>0x300, 0x320, 0x340, 0x360</FONT></TD>
</TR>
</TABLE>
</CENTER><p></P>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
<P>El c&oacute;digo de autoverificaci&oacute;n tiene dos limitaciones. Una de ellas es que no reconoce todas las tarjetas correctamente. Esto ocurre frecuentemente con algunas de las tarjetas cl&oacute;nicas m&aacute;s baratas, pero tambi&eacute;n con algunas tarjetas WD80x3. La otra limitaci&oacute;n es que el n&uacute;cleo no verificar&aacute; mas de una tarjeta por defecto. Esto se hace as&iacute; porque se asume que se desea tener control sobre que tarjeta es asignada a que interface.</P>
<P>Si esta utilizando mas de una tarjeta, o si el proceso de autoverificaci&oacute;n no consigue detectar su tarjeta, debe indicar expl&iacute;citamente al n&uacute;cleo el nombre y direcci&oacute;n base de la tarjeta.</P>
<P>Con Net-3, se tienen dos posibilidades diferentes ante un caso de fallo en la autoverificaci&oacute;n. Una de ellas es cambiar o a&ntilde;adir informaci&oacute;n en el fichero del c&oacute;digo fuente del n&uacute;cleo drivers/net/Space.c, que contiene toda la informaci&oacute;n sobre controladores. Solo es recomendable en el caso de que el c&oacute;digo de red le sea familiar. Una forma mucho mejor es proporcionar al n&uacute;cleo esta informaci&oacute;n en tiempo de arranque. Si utiliza lilo al arrancar el sistema, puede pasarle par&aacute;metros al n&uacute;cleo, especific&aacute;ndolos mediante la opci&oacute;n append en el fichero lilo.conf. Por ejemplo, para informar al n&uacute;cleo sobre la existencia de un dispositivo Ethernet, puede pasarse el siguiente par&aacute;metro:</P><DIR>
<DIR>

<P>ether=irq , dir_base , param1 ,param2 ,nombre</P></DIR>
</DIR>

<P>Los cuatro primeros argumentos son num&eacute;ricos, mientras que el &uacute;ltimo es el nombre de un dispositivo. Todos los valores num&eacute;ricos son opcionales: si se omiten o se dejan a cero, el n&uacute;cleo intentara averiguar su valor mediante autoverificaci&oacute;n, o utilizando un valor por defecto.</P>
<P>El primer par&aacute;metro indica el IRQ asignado al dispositivo. Por defecto, el n&uacute;cleo intentar&aacute; autodetectar el canal IRQ del dispositivo. El controlador 3c503 tiene un funcionamiento especial seleccionando un canal libre IRQ de la lista 5, 9, 3, 4, y configura la tarjeta para utilizar esta l&iacute;nea.</P>
<P>El par&aacute;metro dir_base define la direcci&oacute;n base de E/S de la tarjeta; si vale cero, el n&uacute;cleo probara con las direcciones de la lista anterior.</P>
<P>Los dos par&aacute;metros restantes pueden ser utilizados de forma diferente por controladores diferentes. Para tarjetas de memoria compartida como la WD80x3, especifican la direcci&oacute;n de comienzo y de fin del &aacute;rea de memoria compartida. Otras tarjetas utilizan normalmente el param1 para seleccionar el nivel de informaci&oacute;n de depuraci&oacute;n para el usuario. Los valores del 1 al 7 denotan niveles de detalle en la informaci&oacute;n, mientras que el valor 8 desactiva todos; por defecto se toma el valor cero. El controlador 3c503 utiliza el param2 para seleccionar el transceptor interno (por defecto) o un transceptor externo (valor 1). El primero utiliza un conector de tarjeta tipo BNC; el &uacute;ltimo utiliza su puerto AUI.</P>
<P>Si se tienen dos tarjetas Ethernet, puede hacerse que Linux autodetecte una de ellas, y pasar los par&aacute;metros de la segunda mediante lilo. Sin embargo, hay que estar seguros de que el controlador accidentalmente no encuentra la segunda tarjeta primero, en cuyo caso la otra no se detectara. Esto se consigue pasando la opci&oacute;n reserve a lilo, que indica expl&iacute;citamente al n&uacute;cleo que no verifique el espacio de E/S reservado para la segunda tarjeta.</P>
<P>Por ejemplo, para hacer que Linux instale una segunda tarjeta Ethernet en la direcci&oacute;n (0x300) como eth1, hay que pasarle los siguientes par&aacute;metros al n&uacute;cleo:</P><DIR>
<DIR>

<P>reserve=0x300,32 ether=0,0x300,eth1</P></DIR>
</DIR>

<P>La opci&oacute;n reserve asegura que ning&uacute;n controlador accede al espacio de E/S del n&uacute;cleo cuando verifica alg&uacute;n dispositivo. Tambi&eacute;n pueden utilizarse los par&aacute;metros del n&uacute;cleo para evitar realizar la verificaci&oacute;n para eth0:</P><DIR>
<DIR>

<P>reserve=0x340,32 ether=0,340,eth0</P></DIR>
</DIR>

<P>Para evitar completamente la fase de autoverificaci&oacute;n, se especifica el argumento</P><DIR>
<DIR>

<P>dir_base a -1:<BR>
ether=0,-1,eth0</P></DIR>
</DIR>

<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="3.5"></a>3.5 El controlador PLIP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>PLIP permite trabajar con una L&iacute;nea Paralela IP, y es una forma barata de interconexi&oacute;n cuando se desea conectar solamente dos m&aacute;quinas. Utiliza un puerto paralelo y un cable especial, alcanzando velocidades entre 10kBps a 20kBps.</P>
<P>PLIP fue desarrollado en principio por Crynwr, Inc. Su dise&ntilde;o es mas que ingenioso (o, si se prefiere, mas propio de un hacker): durante muchos a&ntilde;os, los puertos paralelos del PC se utilizaban como puertos para impresora unidireccionales; es decir las ocho l&iacute;neas de datos podr&iacute;an ser utilizados solamente para env&iacute;os desde el PC al dispositivo perif&eacute;rico, pero no en sentido inverso. El PLIP saca un mejor provecho utilizando la l&iacute;nea de estado n&uacute;mero cinco del puerto, que se limita a transferir todos los datos simplemente como nibbles (es decir, medio byte). Hoy en d&iacute;a, estos puertos unidireccionales no son muy utilizados. Por tanto tambi&eacute;n hay una extensi&oacute;n denominada modo 1 que utiliza la interface completa de 8 bits.</P>
<P>Actualmente Linux solo soporta el modo 0. A diferencia de versiones mas antiguas del c&oacute;digo que maneja el PLIP, ahora se intenta hacerlo compatible con las implementaciones PLIP de Cynwr, y para el controlador PLIP en el NCSA telnet 10. Para conectar dos m&aacute;quinas utilizando PLIP, se necesita un cable especial que se vende en algunas tiendas como cable de "Impresora Nula" ("Null Printer") o "Turbo Laplink". Es posible fabricarlo de forma casera, en el Ap&eacute;ndice A se indica como.</P>
<P>El controlador PLIP para Linux es el trabajo de un n&uacute;mero casi incontable de personas. Actualmente esta mantenido por Niibe Yutaka. Si se compila en el n&uacute;cleo, configura una interface de red para cada posible puerto de impresora, con plip0 correspondiendo al puerto paralelo lp0, plip1 correspondiendo a lp1, etc. El mapeado del interface a los puertos es ahora mismo el siguiente:</P></FONT>
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=240>
<TR><TD WIDTH="36%" VALIGN="TOP" BGCOLOR="#008080">
<B><FONT FACE="Verdana" SIZE=2 COLOR="#ffffff"><P ALIGN="CENTER">Interface</font></B></TD>
<TD WIDTH="40%" VALIGN="TOP" BGCOLOR="#008080">
<B><FONT FACE="Verdana" SIZE=2 COLOR="#ffffff"><P ALIGN="CENTER">Puerto E/S</font></B></TD>
<TD WIDTH="24%" VALIGN="TOP" BGCOLOR="#008080">
<B><FONT FACE="Verdana" SIZE=2 COLOR="#ffffff"><P ALIGN="CENTER">IRQ</font></B></TD>
</TR>
<TR><TD WIDTH="36%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">plip0</P>
<P ALIGN="CENTER">plip1</P>
<P ALIGN="CENTER">plip2</FONT></TD>
<TD WIDTH="40%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">0x3BC</P>
<P ALIGN="CENTER">0x378</P>
<P ALIGN="CENTER">0x278</FONT></TD>
<TD WIDTH="24%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">7</P>
<P ALIGN="CENTER">7</P>
<P ALIGN="CENTER">5</FONT></TD>
</TR>
</TABLE>
</CENTER><p></P>

<FONT FACE="Verdana" SIZE=2><P>_____________________________________________<BR>
10 El NCSA telnet es un programa bastante conocido para DOS que trabaja con TCP/IP en redes Ethernet o PLIP, y soporta telnet, FTP y algunas otras aplicaciones sencillas.</P>
<P>&nbsp;</P>
<P>Si se tiene configurado el puerto de la impresora de forma diferente, hay que cambiar estos valores en el fichero drivers/net/Space.c del c&oacute;digo fuente de Linux, y construir un nuevo n&uacute;cleo.</P>
<P>Este mapeado no implica que no se puedan utilizar los puertos paralelos de forma normal. Solo son accedidos por el controlador de PLIP cuando el interface correspondiente ha sido configurado como activo.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="3.6"></a>3.6 Los controladores SLIP y PPP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>SLIP (Ser&iacute;al Line IP, Protocolo Internet en L&iacute;nea Serie), y PPP (Point-to-Point Protocol, Protocolo Punto-a-Punto) son protocolos muy utilizados para enviar paquetes IP a trav&eacute;s de enlaces serie. Varias instituciones ofrecen acceso telef&oacute;nico SLIP y PPP a m&aacute;quinas conectadas a Internet: esto proporciona conectividad IP a los particulares (algo que de otra forma ser&iacute;a dif&iacute;cil de conseguir debido al elevado coste de otros tipos de conexiones).</P>
<P>Para trabajar con SLIP o PPP, no son necesarias modificaciones en el hardware; puede utilizarse cualquier puerto serie. Ya que es especifica la configuraci&oacute;n del puerto serie para interconexi&oacute;n TCP/IP, se le dedicara un cap&iacute;tulo aparte. Para mas informaci&oacute;n consultar el cap&iacute;tulo 4.</P></FONT></BODY>
</HTML>
