<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl16</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl15.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl17.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 16</P>
</font></B><P><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>Netnews</P>
</font></u></B> 
<dir> 
    <p><font face="Verdana" size="2"><a href="garl16.htm#16.1">16.1 Historia de 
      Usenet</a><br>
      <a href="garl16.htm#16.2">16.2 ¿Qu&eacute; es, en definitiva, Usenet?</a><br>
      <a href="garl16.htm#16.3">16.3 ¿C&oacute;mo maneja Usenet las noticias?</a></font></p>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="16.1"></a>16.1 Historia de Usenet</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>La idea de las noticias en red naci&oacute; en 1979, cuando dos estudiantes de graduado, Tom Truscott y Jim Ellis, pensaron en usar UUCP para conectar ordenadores con el prop&oacute;sito de intercambiar informaci&oacute;n entre usuarios de UNIX. Instalaron una peque&ntilde;a red de tres ordenadores en Carolina del Norte.</P>
<P>Inicialmente el tr&aacute;fico de informaci&oacute;n era manejado por cierto n&uacute;mero de shell scripts (mas tarde reescritos en C), pero que nunca fueron hechos p&uacute;blicos. Fueron r&aacute;pidamente reemplazados por "A" news, la primera edici&oacute;n publica de programas para news.</P>
<P>"A" news no estaba dise&ntilde;ado para manejar mas que unos pocos art&iacute;culos por grupo y d&iacute;a. Cuando el volumen de informaci&oacute;n continuo creciendo, fue reescrito por Mark Horton y Matt Glickman, quienes lo denominaron la versi&oacute;n "B" (tambi&eacute;n conocido como Bnews).</P>
<P>El primer lanzamiento publico de Bnews fue la versi&oacute;n 2.1, en 1982. Se fue expandiendo continuamente, conforme se le a&ntilde;ad&iacute;an nuevas prestaciones. La versi&oacute;n actual es Bnews 2.11.</P>
<P>Poco a poco se va quedando obsoleta, habi&eacute;ndose pasado a INN su &uacute;ltimo mantenedor oficial.</P>
<P>Geoff Collyer y Henry Spencer reescribieron y lanzaron en 1987 otra nueva versi&oacute;n, conocida como versi&oacute;n "C" o Cnews . En el tiempo transcurrido desde entonces ha habido algunos parches para Cnews , siendo el m&aacute;s notable de ellos la Cnews Performance Release.</P>
<P>En sistemas que transportan un gran n&uacute;mero de grupos, el consumo de recursos producido al ejecutar frecuentemente relaynews (el programa encargado de procesar los art&iacute;culos) es bastante significativo. La Performance Release a&ntilde;ade una opci&oacute;n que permite ejecutar relaynews en modo daemon, es decir, ejecut&aacute;ndose como tarea de fondo.</P>
<P>La Performance Release es la versi&oacute;n de Cnews que se incluye en la mayor&iacute;a de las distribuciones de Linux actuales.</P>
<P>Todas las versiones hasta la "C" est&aacute;n principalmente dise&ntilde;adas para utilizarse en redes UUCP, aunque igualmente pueden utilizarse en otros entornos. La transferencia eficiente de noticias sobre redes tipo TCP/IP, DECNet o similares, requiere otro planteamiento. Esta es la raz&oacute;n por la que en 1986 se introdujo el "Network News Transfer Protocol" (NNTP) o Protocolo de Transferencia de Noticias a trav&eacute;s de la Red. Este protocolo esta basado en conexiones de red, y especifica cierto n&uacute;mero de comandos para transferir los art&iacute;culos de forma interactiva.</P>
<P>Hay bastantes aplicaciones basadas en el NNTP disponibles en la Red. Una de ellas es el paquete nntpd, de Brian Barber y Phil Lapsley, que puede usarse, entre otras cosas, para proporcionar un servicio de lectura de noticias a distintos nodos de una red local. nntpd fue dise&ntilde;ado para complementarse con Bnews o Cnews y darles prestaciones NNTP.</P>
<P>Otra aplicaci&oacute;n NNTP diferente es INN, o Internet News. No es simplemente un interfaz, sino un sistema de noticias por derecho propio. Consta de un sofisticado demonio de noticias que es capaz de mantener varias conexiones NNTP simultaneas, y es por lo tanto, el software elegido por muchos servidores en Internet.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="16.2"></a>16.2 ¿Qu&eacute; es, en definitiva, Usenet?</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Una de las cosas m&aacute;s asombrosas de Usenet es que no forma parte de ninguna organizaci&oacute;n, ni tiene ninguna clase de autoridad central. De hecho, parte del saber popular de Usenet consiste en que excepto por una descripci&oacute;n t&eacute;cnica, no se puede definir que es, tan solo que no es. Si tiene Vd. a mano el excelente "Zen and the Art of the Internet" (disponible en Internet o a trav&eacute;s de Prentice-Hall, ver [Kehoe92]), de Brendan Kehoe, encontrar&aacute; una sorprendente lista de impropiedades de Usenet.</P>
<P>A riesgo de sonar tonto, podr&iacute;a definirse Usenet como la colaboraci&oacute;n de servidores separados que intercambian noticias de Usenet. Para ser un servidor en Usenet, todo lo que hay que hacer es encontrar otro servidor Usenet y llegar a un acuerdo con sus propietarios y administradores para intercambiar noticias con ellos. Proporcionar art&iacute;culos a otro servidor se denomina tambi&eacute;n alimentaci&oacute;n o feeding, de donde se origina otro axioma com&uacute;n de Usenet: "Consigue alguien que te pase las noticias, y ya eres parte de Usenet".</P>
<P>La unidad fundamental de las noticias de Usenet es el art&iacute;culo. Es un mensaje que un usuario escribe y "publica" en la red. Para posibilitar que los sistemas de noticias lo manejen, esta precedido de informaci&oacute;n administrativa, conocida como cabecera del art&iacute;culo.</P>
<P>Es muy similar a la cabecera utilizada para el correo que se describe en el est&aacute;ndar RFC 822, y como &eacute;sta, consiste en varias l&iacute;neas de texto, cada una de las cuales comienza con el nombre de un campo terminado en dos puntos, siguiendo despu&eacute;s el valor de dicho campo.1</P>
<P>_____________________________________________<BR>
1 El formato de los mensajes de noticias de Usenet se especifica en la RFC 1036, "Standard for interchange of USENET messages".</P>
<P>&nbsp;</P>
<P>Los art&iacute;culos son enviados a uno o m&aacute;s grupos de noticias. Podr&iacute;an considerarse a los grupos como foros para art&iacute;culos relativos a una misma tem&aacute;tica. Todos los grupos est&aacute;n organizados en una jerarqu&iacute;a, en la cual el nombre de cada grupo indica su lugar en la misma. Esto a menudo hace m&aacute;s f&aacute;cil ver sobre que versa un grupo de noticias. Por ejemplo, todo el mundo puede deducir por el nombre que comp.os.linux.announce se usa para anuncios relativos a un sistema operativo para computadoras llamado Linux.</P>
<P>Estos art&iacute;culos son intercambiados entre todos los servidores de Usenet a los que interese tener noticias de este grupo. Cuando dos servidores acuerdan intercambiar noticias, son libres de intercambiar cualquier grupo que deseen, y pueden incluso a&ntilde;adir sus propias jerarqu&iacute;as locales. Por ejemplo, groucho.edu puede tener un enlace de noticias con barnyard.edu, un gran servidor de noticias, y varios enlaces con servidores menores a los que alimenta con noticias. El Colegio Barnyard puede recibir todos los grupos de Usenet, mientras que la UGM solo quiere algunas jerarqu&iacute;as mayores como sci, comp, rec, etc.</P>
<P>Algunos servidores situados m&aacute;s abajo en esta cadena, digamos un servidor UUCP llamado brewhq, querr&aacute;n incluso menos grupos, ya que no tendr&aacute;n los suficientes recursos de hardware o de red. Por otro lado, brewhq puede querer recibir grupos de la jerarqu&iacute;a fj que la UGM no tiene. Por lo tanto, mantiene otro enlace con gargleblaster.com, quien tiene todos los grupos fj y se los pasa a brewhq. El flujo de noticias se muestra en la figura 16.1.</P>
<P>Las etiquetas en las flechas que parten de brewhq pueden requerir ciertas explicaciones. Por defecto, brewhq quiere que todas las noticias generadas localmente sean enviadas a groucho.edu. Sin embargo, ya que groucho.edu no lleva los grupos fj, no hay raz&oacute;n para enviar ning&uacute;n art&iacute;culo de estos grupos. Por tanto, la alimentaci&oacute;n de brewhq a la UGM esta etiquetada all,!fj, lo que significa que se env&iacute;an todos los grupos excepto los fj.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="16.3"></a>16.3 ¿C&oacute;mo maneja Usenet las noticias?</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Hoy en d&iacute;a, Usenet ha crecido hasta alcanzar dimensiones enormes. Los servidores que llevan la totalidad de los grupos suelen tener que transferir unos sesenta megabytes por dia.2 Por supuesto esto requiere mucho mas que enredar con unos cuantos ficheros. Veamos como se las apa&ntilde;an la mayor&iacute;a de sistemas UNIX para manejar las noticias.</P>
<P>Las noticias se distribuyen por la red de varias formas. El medio hist&oacute;rico sol&iacute;a ser UUCP, pero hoy en d&iacute;a el caudal principal es llevado por servidores permanentemente conectados a Internet. El algoritmo para encaminar se denomina inundaci&oacute;n: cada servidor mantiene cierto n&uacute;mero de enlaces con otros servidores. Cualquier art&iacute;culo generado o recibido por el sistema local de noticias es enviado a estos servidores, a no ser que ya haya pasado por ellos. Se puede saber por que servidores ha pasado un art&iacute;culo mirando el campo Path: de la cabecera. Este campo contiene una lista con todos los sistemas por los que el art&iacute;culo ha pasado, separados por un signo de admiraci&oacute;n.</P>
<P>_____________________________________________<BR>
2 Un momento: 60 Mb a 9600 bps, o sea, 60 millones por 1200, eso es. . . murmullo, murmullo,. . . ¡Eh! ¡Son 34 horas!</P>
<P>&nbsp;</P>
</FONT><P ALIGN="CENTER"><IMG SRC="fig16.1.gif" WIDTH=308 HEIGHT=298></P>
<FONT FACE="Verdana" SIZE=2><P>Figura 16.1: Flujo de noticias a trav&eacute;s de la Universidad Groucho Marx</P>
<P>&nbsp;</P>
<P>Para distinguir entre los art&iacute;culos y reconocer los duplicados, los art&iacute;culos de Usenet llevan un identificativo (especificado en el campo Message-Id: de la cabecera) que combina el nombre del servidor donde se publico y un n&uacute;mero de serie "&lt;num-serie@servidor&gt;".</P>
<P>Cada vez que se procesa un art&iacute;culo, el sistema de noticias registra su identificativo en un fichero (generalmente llamado history) con el que despu&eacute;s se coteja cualquier nuevo art&iacute;culo.</P>
<P>El flujo entre dos servidores puede ser limitado por dos criterios: por un lado, al art&iacute;culo se le asigna una distribuci&oacute;n (campo Distribution: de la cabecera) que puede ser usada para confinarlo a cierto grupo de servidores. Por otro lado, los grupos de noticias intercambiados pueden limitarse tanto en el sistema emisor como en el receptor. El conjunto de grupos y distribuciones que se permite transmitir a un sistema se suelen especificar en el fichero sys.</P>
<P>Debido al gran n&uacute;mero de art&iacute;culos, habitualmente se necesita mejorar el esquema anterior. En las redes UUCP, lo natural es recoger los art&iacute;culos durante un cierto periodo de tiempo y combinarlos en un solo fichero, que posteriormente es comprimido y enviado a un sistema remoto. Esto se llama batching.3</P>
<P>Una t&eacute;cnica alternativa es la del protocolo ihave/sendme (tengo/env&iacute;ame) que evita que los duplicados sean enviados en primer lugar, ahorrando ancho de banda. En vez de empaquetar todos los art&iacute;culos en ficheros y enviarlos, solo se env&iacute;an los identificativos de los mensajes en un gigantesco mensaje "ihave". El sistema remoto lee el mensaje, lo compara con su fichero hist&oacute;rico (history), y env&iacute;a un mensaje "sendme" con la lista de art&iacute;culos que quiere. De este modo, solo se enviaran estos art&iacute;culos.</P>
<P>Por supuesto, el protocolo ihave/sendme solo tiene sentido si ata&ntilde;e a dos grandes sistemas que reciben noticias desde varios sitios independientes, y que se intercambian art&iacute;culos entre s&iacute; con la suficiente frecuencia como para mantener un flujo de noticias eficiente.</P>
<P>Los servidores conectados a Internet generalmente se basan en programas bajo TCP/IP que usan el protocolo NNTP4, mencionado anteriormente. Con este protocolo se transfieren art&iacute;culos entre servidores y se da acceso a Usenet a usuarios individuales en sistemas remotos.</P>
<P>NNTP contempla tres formas diferentes de transferir las noticias. Una es una versi&oacute;n en tiempo real de ihave/sendme, tambi&eacute;n conocida como empujar las noticias. La segunda t&eacute;cnica se denomina tirar de las noticias. El cliente solicita una lista de art&iacute;culos de un grupo o jerarqu&iacute;a determinado que ha llegado al servidor despu&eacute;s de una fecha especificada, y elige los que no puede encontrar en su fichero hist&oacute;rico. La tercera forma es para lectura interactiva, y permite al lector escoger art&iacute;culos de grupos especificados, as&iacute; como publicar art&iacute;culos con cabeceras incompletas.</P>
<P>En cada sistema, las noticias se guardan en una estructura de directorios bajo /var/spool/news, cada art&iacute;culo en un fichero separado, y cada grupo en un directorio separado. El nombre del directorio se crea a partir del nombre del grupo, donde los componentes del mismo son los componentes de la ruta. As&iacute; pues, los art&iacute;culos de comp.os.linux.misc se guardan en /var/spool/news/comp/os/linux/misc. A cada art&iacute;culo se le asigna un n&uacute;mero seg&uacute;n su orden de llegada. Este n&uacute;mero sirve como nombre de fichero. El rango de art&iacute;culos vigentes en un momento dado se guarda en un fichero llamado active, que al mismo tiempo sirve como lista de grupos disponibles en el sistema.</P>
<P>Puesto que el espacio en disco es un recurso finito,5 uno tiene que empezar a desechar los art&iacute;culos de cierta antig&uuml;edad. Esto se denomina expiraci&oacute;n. Generalmente, los art&iacute;culos de un determinado grupo o jerarqu&iacute;a expiran al transcurrir un n&uacute;mero determinado de d&iacute;as desde de su llegada. El autor puede modificar este valor especificando una fecha de expiraci&oacute;n en el campo Expires: de la cabecera del art&iacute;culo.</P>
<P>_____________________________________________<BR>
3 La regla de oro de las noticias de red, seg&uacute;n Geoff Collyer: "Empaquetar&aacute;s tus art&iacute;culos".<BR>
4 Descrito en la RFC 977.<BR>
5 Alguna gente afirma que Usenet es un conspiraci&oacute;n entre vendedores de m&oacute;dems y discos duros.</P></FONT></BODY>
</HTML>
