<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl13</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl12.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl14.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 13</P>
</font></B><P><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>Correo Electr&oacute;nico</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Uno de los usos m&aacute;s comunes de las redes inform&aacute;ticas desde sus 
  or&iacute;genes ha sido el correo electr&oacute;nico. Empez&oacute; siendo un 
  simple servicio que copiaba un fichero de una m&aacute;quina a otra, y lo a&ntilde;ad&iacute;a 
  al fichero mailbox (buz&oacute;n de correo) del destinatario. B&aacute;sicamente, 
  en esto sigue consistiendo el e-mail (correo electr&oacute;nico), aunque el 
  crecimiento continuo de la red y, consiguientemente, el aumento de la complejidad 
  de encaminado, ha hecho necesario un esquema m&aacute;s elaborado.</P>
<P>Se han dise&ntilde;ado varios est&aacute;ndares de intercambio de correo. Los 
  nodos conectados a la Internet cumplen uno recogido en el RFC 822, complementado 
  en algunos RFCs que describen un m&eacute;todo independiente de la m&aacute;quina 
  para transferir caracteres especiales, y similares. Mucho se ha discutido recientemente 
  sobre el "correo multimedia", que tiene que ver con incluir im&aacute;genes 
  y sonido en los mensajes de correo. Otro est&aacute;ndar, X.400, ha sido definido 
  por el CCITT.</P>
<P>Hay ya una gran cantidad de programas de transporte de correo para sistemas 
  UNIX. Uno de los mas conocidos es el sendmail, de la Universidad de Berkeley, 
  que se usa en diversas plataformas. El autor original fue Eric Allman, que esta 
  trabajando activamente en el equipo sendmail de nuevo. Hay dos adaptaciones 
  para Linux del sendmail-5.56c disponibles, una de las cuales se describir&aacute; 
  en el cap&iacute;tulo 15. La versi&oacute;n de sendmail actualmente en desarrollo 
  es la 8.6.5.</P>
<P>El agente de correo de uso mas com&uacute;n en Linux es el smail-3.1.28, escrito 
  por Curt Landon Noll y Ronald S. Karr y con Copyright de los mismos autores. 
  Este es el que se incluye en la mayor&iacute;a de las distribuciones de Linux. 
  En lo sucesivo nos referiremos a &eacute;l simplemente como smail, aunque hay 
  otras versiones del mismo programa que son totalmente diferentes, y que no describiremos 
  aqu&iacute;.</P>
<P>Comparado con sendmail, smail es bastante joven aun. Si se ocupan del correo 
  de un nodo peque&ntilde;o sin necesidades de direccionamiento complicadas, sus 
  capacidades son muy parecidas. Para nodos grandes, sin embargo, sendmail siempre 
  gana, porque su m&eacute;todo de configuraci&oacute;n es mucho mas flexible.</P>
<P>Ambos smail y sendmail admiten un conjunto de ficheros de configuraci&oacute;n 
  que deben ser adaptados a cada caso particular. Aparte de la informaci&oacute;n 
  que se necesita para hacer funcionar el subsistema de correo (como puede ser 
  el nombre del ordenador local), hay muchos mas par&aacute;metros que pueden 
  ajustarse. El fichero principal de configuraci&oacute;n de sendmail es muy dif&iacute;cil 
  de entender a la primera. Parece como si el gato se hubiese echado una siesta 
  sobre el teclado con la tecla de may&uacute;sculas pulsada. Los ficheros de 
  configuraci&oacute;n de smail est&aacute;n m&aacute;s estructurados y son m&aacute;s 
  f&aacute;ciles de entender que los del sendmail, pero no dan al usuario tanto 
  poder a la hora de ajustar el comportamiento del gestor de correo.</P>
<P>De todos modos, para nodos peque&ntilde;os de UUCP o Internet, el trabajo que 
  se necesita para poner a punto cualquiera de ellos es pr&aacute;cticamente el 
  mismo.</P>
<P>En este cap&iacute;tulo trataremos sobre que es el 'e-mail' y que temas tendr&aacute; 
  que abordar usted como administrador del sistema. Los cap&iacute;tulos 14 y 
  15 dar&aacute;n instrucciones para poner a punto smail y sendmail por primera 
  vez. La informaci&oacute;n que se suministra debe bastar para poner en marcha 
  peque&ntilde;os nodos, pero hay muchas mas opciones y usted podr&aacute; pasar 
  muchas horas felices frente a su ordenador configurando las caracter&iacute;sticas 
  m&aacute;s superficiales.</P>
<P>Hacia el final de este cap&iacute;tulo nos ocuparemos brevemente de como poner 
  a punto elm, un programa para usuario de correo muy com&uacute;n en muchos sistemas 
  UNIX, incluyendo Linux.</P>
<P>Para mas informaci&oacute;n sobre temas espec&iacute;ficos de correo electr&oacute;nico 
  sobre Linux, por favor, consulte el 'Electronic Mail HOWTO' de Vince Skahan, 
  que aparece en comp.os.linux.announce con regularidad. Las distribuciones fuente 
  de elm, smail y sendmail contienen tambi&eacute;n una documentaci&oacute;n muy 
  extensa que debe solucionar la mayor&iacute;a de sus dudas sobre instalaci&oacute;n 
  y puesta a punto. Si busca informaci&oacute;n sobre correo electr&oacute;nico 
  en general, hay varios RFCs que tratan espec&iacute;ficamente este tema. Una 
  lista de ellos se encuentra en la bibliograf&iacute;a al final del libro.</P>
</FONT>
<dir> 
    <p><font face="Verdana" size="2"><a href="garl13.htm#13.1">13.1 ¿Qu&eacute; 
      es un mensaje de correo?</a><br>
      <a href="garl13.htm#13.2">13.2 ¿Como se reparte el correo?</a><br>
      <a href="garl13.htm#13.3">13.3 Direcciones de correo electr&oacute;nico</a><br>
      <a href="garl13.htm#13.4">13.4 ¿C&oacute;mo funciona el encaminado del correo?</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl13.htm#13.4.1">13.4.1 Encaminado 
          de correo en la Internet</a><br>
          <a href="garl13.htm#13.4.2">13.4.2 Encaminado de correo en el mundo 
          UUCP</a><br>
          <a href="garl13.htm#13.4.3">13.4.3 Mezcla de UUCP y RFC 822</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl13.htm#13.5">13.5 Formatos de 
      Fichero Mapa y Alias de Ruta</a><br>
      <a href="garl13.htm#13.6">13.6 Configuraci&oacute;n de elm</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl13.htm#13.6.1">13.6.1 Opciones 
          Globales de elm</a><br>
          <a href="garl13.htm#13.6.2">13.6.2 Conjuntos de Caracteres Nacionales</a></font></p>
      </dir>
    </dir>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="13.1"></a>13.1 ¿Que es un mensaje de correo?</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Un mensaje de correo consta de un contenido (body), que es el texto que ha escrito el remitente, y datos especiales que especifican el destinatario o destinatarios, el medio de transporte, etc., de manera similar a lo que aparece en el sobre de una carta ordinaria.</P>
<P>Estos datos administrativos se clasifican en dos categor&iacute;as; en la primera categor&iacute;a est&aacute;n los datos que son espec&iacute;ficos del medio de transporte, como son las direcciones del remitente y del destinatario. A esto se le llama el sobre (envelope). Puede ser modificado por el software de transporte a medida que el mensaje es transmitido.</P>
<P>La segunda variedad es cualquier dato necesario para la manipulaci&oacute;n del mensaje, que no es propio de ning&uacute;n mecanismo de transporte, como es la l&iacute;nea del encabezado en la que indicamos el tema del mensaje (Subject), la lista de todos los destinatarios, y la fecha en la que se env&iacute;o el mensaje. En muchas redes, se ha convertido en un est&aacute;ndar incluir estos datos al comienzo del mensaje, formando lo que se denomina encabezado del mensaje (mail header). Se separa del contenido del mensaje (mail body) por una l&iacute;nea en blanco. 1</P>
<P>La mayor&iacute;a del software para transporte de correo que se usa en el mundo UNIX usa un formato de encabezado definido en el RFC 822. Su prop&oacute;sito original era especificar un est&aacute;ndar para usar en la ARPANET, pero dado que fue dise&ntilde;ado para ser independiente del entorno de uso, ha sido f&aacute;cilmente adaptado a otras redes, incluyendo muchas basadas en UUCP.</P>
<P>Pero RFC 822 es solo el m&aacute;ximo denominador com&uacute;n. Otros est&aacute;ndares mas recientes han sido concebidos para dar respuesta a las crecientes necesidades como pueden ser, por ejemplo, encriptaci&oacute;n de datos, soporte de conjuntos de caracteres internacionales, y extensiones de correo multimedia (multimedia mail extension, MIME).</P>
<P>En todos esos est&aacute;ndares, el encabezado consiste en varias l&iacute;neas, separadas por caracteres de retorno de carro. Cada l&iacute;nea consiste en un nombre de campo, que comienza en la columna uno, y el campo en si, separados por dos puntos (:) o un espacio. El formato y la sem&aacute;ntica de cada campo varia dependiendo del nombre del mismo. Un campo del encabezado se puede continuar m&aacute;s all&aacute; de una l&iacute;nea, si la l&iacute;nea siguiente comienza con un car&aacute;cter de tabulaci&oacute;n. Los campos pueden aparecer en cualquier orden.</P>
<P>Un encabezado de correo t&iacute;pico puede ser algo as&iacute;:</P><DIR>
<DIR>

<P>From brewhq.swb.de!ora.com!andyo Wed Apr 13 00:17:03 1994<BR>
Return-Path: &lt;brewhq.swb.de!ora.com!andyo&gt;<BR>
Received: from brewhq.swb.de by monad.swb.de with uucp<BR>
(Smail3.1.28.1 #6) id m0pqqlT-00023aB; Wed, 13 Apr 94 00:17 MET DST<BR>
Received: from ora.com (ruby.ora.com) by brewhq.swb.de with smtp<BR>
(Smail3.1.28.1 #28.6) id &lt;m0pqoQr-0008qhC&gt;; Tue, 12 Apr 94 21:47 MEST<BR>
Received: by ruby.ora.com (8.6.8/8.6.4) id RAA26438; Tue, 12 Apr 94 15:56 -0400<BR>
Date: Tue, 12 Apr 1994 15:56:49 -0400<BR>
Message-Id: &lt;199404121956.PAA07787@ruby&gt;<BR>
From: andyo@ora.com (Andy Oram)<BR>
To: okir@monad.swb.de<BR>
Subject: Re: Tu parte de RPC</P></DIR>
</DIR>

<P>_____________________________________________<BR>
  1 Se suele a&ntilde;adir una firma (signature) o .sig a un mensaje, usualmente 
  conteniendo informaci&oacute;n sobre el autor, junto con un chiste o cita c&eacute;lebre. 
  Se separa del resto del mensaje con una l&iacute;nea conteniendo "--".</P>
<P>&nbsp;</P>
<P>Usualmente, todos los campos del encabezado necesarios son generados por la interface con el servidor de correo que usted use, como elm, pine, mush, o mailx. Algunos, sin embargo, son opcionales, y pueden ser a&ntilde;adidos por el usuario. elm, por ejemplo, permite editar parte del encabezado del mensaje. Otros campos son a&ntilde;adidos por el software de transporte de correo. Una lista de campos de encabezado comunes y su significado se da a continuaci&oacute;n:</P>
<P><b>From:</b><BR>
Contiene la direcci&oacute;n de correo electr&oacute;nico del remitente, y posiblemente el "nombre real". Un verdadero zool&oacute;gico de formatos distintos se usa aqu&iacute;.</P>
<P><b>To:</b><BR>
Esta es la direcci&oacute;n de e-mail del destinatario.</P>
<P><b>Subject:</b><BR>
Describe el contenido del mensaje en pocas palabras. Al menos eso es lo que debiera hacer.</P>
<P><b>Date:</b><BR>
La fecha en la que el mensaje fue enviado.</P>
<P><b>Reply-To:</b><BR>
Especifica la direcci&oacute;n a la que el remitente desea que el destinatario le conteste. Esto puede ser &uacute;til si se tienen varias direcciones, pero se desea recibir la mayor parte del correo solo en aquella que se usa mas a menudo. Este campo es opcional.</P>
<P><b>Organization:</b><BR>
La organizaci&oacute;n que posee la m&aacute;quina desde la que se ha enviado el mensaje. Si la m&aacute;quina usada es la suya propia no incluya este campo, o bien indique "privado" o cualquier trivialidad sin sentido. Este campo es opcional.</P>
<P><b>Message-ID:</b><BR>
Una cadena generada por el transporte de correo en el sistema remitente. Es &uacute;nica para cada mensaje.</P>
<P><b>Received:</b><BR>
Cada nodo que procesa su correo (incluyendo las m&aacute;quinas del remitente y el destinatario) insertan este campo en el encabezado, dando el nombre del nodo, una identificaci&oacute;n de mensaje, hora y fecha a la que lo recibieron, de que nodo procede, y que software de transporte ha sido usado. Esto se hace as&iacute; para que usted pueda conocer la ruta que su mensaje ha seguido, y pueda protestar a la persona responsable si algo ha ido mal.</P>
<P><b>X-cualquier-cosa:</b><BR>
Ning&uacute;n programa relacionado con el correo debe protestar sobre cualquier encabezado que comience con X-. Esto se usa para implementar caracter&iacute;sticas adicionales que aun no han sido incluidas en un RFC, o que no lo ser&aacute;n nunca. Esto se usa, por ejemplo, en la lista de correo de los Activistas de Linux, donde el canal a usar se selecciona con el campo de encabezado X-Mn-Key:.</P>
<P>La &uacute;nica excepci&oacute;n a esta estructura es la primera l&iacute;nea. Comienza con la palabra clave From seguida de un espacio en blanco, en vez de dos puntos. Para distinguirlo del campo ordinario From: se suele denotar como From_. Contiene la ruta que ha seguido el mensaje, escrita al estilo ruta bang de UUCP (explicado mas adelante), la hora y la fecha en que fue recibido por la &uacute;ltima m&aacute;quina que lo ha procesado, y una parte opcional que especifica desde que m&aacute;quina ha sido recibido. Como este campo es regenerado por cada sistema que procesa el mensaje, alguna veces queda incluido en los datos del sobre.</P>
<P>El campo From_ contin&uacute;a existiendo por compatibilidad con procesadores de correo antiguos, pero no se usa demasiado en la actualidad excepto por algunos interfaces de usuario de correo que se basan en &eacute;l para marcar el comienzo de un mensaje en el buz&oacute;n del usuario. Para evitar problemas potenciales con l&iacute;neas del contenido del mensaje que comiencen tambi&eacute;n con "From ", se ha convertido en practica com&uacute;n distinguir este &uacute;ltimo caso precedi&eacute;ndolo de un "&gt;".</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="13.2"></a>13.2 ¿Como se reparte el correo?</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Generalmente, usted escribir&aacute; su correo usando un interface de correo como mail o mailx; u otros mas sofisticados como elm, mush, o pine. Estos programas se denominan agentes de usuario de correo (mail user agents), o MUAs para abreviar. Si usted env&iacute;a un mensaje de correo, el programa interface en la mayor&iacute;a de los casos se lo pasara a otro programa para que lo transmita. Este programa se denomina el agente de transporte de correo (mail transport agent), o MTA. En algunos sistemas hay agentes de transporte de correo distintos para env&iacute;os locales o lejanos; en otros hay solo un MTA. El comando para env&iacute;os lejanos se denomina usualmente rmail, el otro se denomina lmail (si existe).</P>
<P>Un env&iacute;o local de correo es, por supuesto, algo mas que a&ntilde;adir el mensaje al buz&oacute;n del destinatario. Usualmente el MTA local entender&aacute; como usar alias (definir direcciones locales de destinatarios que dirigen a otras direcciones) y como usar redirecciones2, es decir, dirigir el correo de un usuario a otra direcci&oacute;n). Tambi&eacute;n, los mensajes que no pudieron ser enviados deben ser normalmente devueltos (bounced) al remitente junto con alg&uacute;n mensaje de error.</P>
<P>Para env&iacute;os lejanos, el software de transporte usado depende del tipo de enlace. Si el correo debe enviarse a trav&eacute;s de una red que usa TCP/IP, se usar&aacute; normalmente SMTP.</P>
<P>SMTP son las siglas de Simple Mail Transfer Protocol, o Protocolo Simple de Trasferencia de Correo que se define en el RFC 788 y RFC 821. SMTP usualmente conecta con la m&aacute;quina del destinatario directamente, negociando la transferencia del mensaje con el demonio SMTP del otro lado.</P>
<P>_____________________________________________<BR>
2 N. del T.: Del ingl&eacute;s forwarding</P>
<P>&nbsp;</P>
<P>En redes tipo UUCP, el correo no suele ser enviado directamente, sino que es redirigido hasta su destino a trav&eacute;s de un conjunto de m&aacute;quinas intermedias. Para enviar un mensaje a trav&eacute;s de un enlace UUCP, el MTA remitente ejecutara usualmente rmail en la m&aacute;quina intermedia usando uux, y suministr&aacute;ndole el mensaje en la entrada est&aacute;ndar.</P>
<P>Dado que esto se hace para cada mensaje por separado, puede producir una carga considerable de trabajo en un nodo procesador de correo grande, adem&aacute;s de inundar las colas UUCP con cientos de peque&ntilde;os mensajes que ocupan una cantidad de disco desproporcionada. 3 Por esto algunos MTAs permiten recopilar varios mensajes de un sistema remoto en un solo lote. El fichero de lotes contiene los comandos SMTP que el nodo local ejecutar&iacute;a normalmente si usara una conexi&oacute;n SMTP directa. A esto se le llama BSMTP, o batched SMTP (SMTP por lotes). El lote es suministrado al programa rsmtp o bsmtp en el sistema remoto, que procesara la entrada como si una conexi&oacute;n SMTP normal hubiese ocurrido.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="13.3"></a>13.3 Direcciones de correo electr&oacute;nico</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Para el correo electr&oacute;nico, una direcci&oacute;n consiste en, al menos, 
  el nombre de la m&aacute;quina que maneja el correo del destinatario, y una 
  identificaci&oacute;n de usuario reconocida por ese sistema. Puede ser el nombre 
  de acceso del destinatario, pero puede ser tambi&eacute;n cualquier otra cosa. 
  Otros esquemas de direcciones, como el X.400, usan un conjunto mas general de 
  "atributos" que se utilizan para buscar la m&aacute;quina del destinatario en 
  un servidor de directorio X.500.</P>
<P>La forma en que se interpreta un nombre de m&aacute;quina, es decir, a que 
  nodo va a llegar finalmente nuestro mensaje, y como combinar este nombre con 
  el nombre de usuario del destinatario depende enormemente de la red en la que 
  nos encontremos.</P>
<P>Los nodos en la Internet siguen el est&aacute;ndar RFC 822, que requiere una 
  notaci&oacute;n usuario@maquina.dominio, donde maquina.dominio es el nombre 
  de dominio totalmente cualificado (Fully Qualified Domain Name, o FQDN) de la 
  m&aacute;quina. El signo de arroba que aparece entre medias se suele denominar 
  signo "at"4. Dado que esta notaci&oacute;n no indica la ruta hasta la m&aacute;quina 
  de destino, sino que da el nombre (&uacute;nico) de dicha m&aacute;quina, a 
  esto se le suele llamar una direcci&oacute;n absoluta.</P>
<P>En el entorno UUCP original, la forma predominante era ruta!maquina!usuario, 
  donde ruta describ&iacute;a una secuencia de m&aacute;quinas a trav&eacute;s 
  de las cuales deb&iacute;a viajar el mensaje para llegar a m&aacute;quina, su 
  destino final. Esta notaci&oacute;n se llama la ruta bang, porque un signo de 
  exclamaci&oacute;n se denomina coloquialmente "bang". Hoy en d&iacute;a muchas 
  redes basadas en UUCP han adoptado el RFC 822, y entender&aacute;n ese tipo 
  de direcci&oacute;n.</P>
<P>_____________________________________________<BR>
  3 Esto es as&iacute; porque el espacio de disco se asigna usualmente en bloques 
  de 1024 Bytes. Incluso un mensaje de como mucho 400 Bytes ocupara 1 Kb completo.<BR>
  4 N. del T. de la preposici&oacute;n inglesa "at", que significa "en"</P>
<P>&nbsp;</P>
<P>Estos dos tipos de direcciones no se mezclan muy bien. Supongamos una direcci&oacute;n 
  maquinaA!usuario@maquinaB. No queda claro si el signo '@' tiene precedencia 
  sobre la ruta o viceversa: ¿Hemos de enviar el mensaje a maquinaB, que lo enviar&aacute; 
  a maquinaA!usuario, o debe ser enviado maquinaA, que lo redirigir&aacute; a 
  usuario@maquinaB?</P>
<P>Las direcciones que mezclan diferentes tipos de operadores de direcci&oacute;n 
  se denominan direcciones h&iacute;bridas. El m&aacute;s notorio es el ejemplo 
  anterior. Se resuelve usualmente d&aacute;ndole precedencia al signo '@' sobre 
  la ruta. En el ejemplo anterior, esto significa enviar el mensaje a maquinaB 
  primero.</P>
<P>De todos modos, hay una forma de especificar rutas acorde con RFC 822: &lt;@maquinaA,@maquinaB:usuario@maquinaC&gt; 
  denota la direcci&oacute;n de usuario en maquinaC, indicando que se debe llegar 
  a maquinaC a trav&eacute;s de maquinaA y maquinaB (en ese orden). Este tipo 
  de direcci&oacute;n se suele llamar una direcci&oacute;n route-addr (de route, 
  ruta y address, direcci&oacute;n).</P>
<P>Y tambi&eacute;n existe el operador de direcci&oacute;n '%': usuario%maquinaB@maquinaA 
  ser&aacute; enviado primero a maquinaA, que sustituir&aacute; el signo de tanto 
  por ciento que se encuentre m&aacute;s a la derecha en la expresi&oacute;n (en 
  este caso el &uacute;nico) por un signo '@'. La direcci&oacute;n quedara ahora 
  usuario@maquinaB, y el gestor de correo redirigir&aacute; alegremente el mensaje 
  a la maquinaB que lo entregara a usuario. Este tipo de direcci&oacute;n se suele 
  denominar a veces como "Ye Olde ARPANET Kludge" ("La Vieja Chapuza de ARPANET") 
  y su uso est&aacute; desaconsejado. A&uacute;n as&iacute; muchos agentes de 
  transporte de correo generan este tipo de direcciones.</P>
<P>Otras redes tienen mas formas de expresar direcciones. Las redes basadas en 
  el protocolo DECnet, por ejemplo, usan dos signos de dos puntos como separador, 
  dando lugar a direcciones como m&aacute;quina::usuario .5 Finalmente, el est&aacute;ndar 
  X.400 usa un esquema totalmente distinto, describiendo a un destinatario por 
  un conjunto de pares atributo-valor, como pa&iacute;s u organizaci&oacute;n.</P>
<P>En FidoNet, cada usuario se identifica por un c&oacute;digo como 2:320/204.9, 
  que consiste en cuatro n&uacute;meros que denotan la zona (2 es Europa), red 
  (320 es Par&iacute;s y Banlieve), nodo (el repetidor/BBS local), y punto (el 
  PC del usuario). Las direcciones Fidonet se pueden traducir a RFC 822: la anterior 
  se escribir&iacute;a Thomas.Quinot@p9.f204.n320.z2.fidonet.org.</P>
<P>¿No he dicho antes que los nombres de dominio son f&aacute;ciles de recordar?</P>
<P>Hay algunas implicaciones al usar esos tipos diferentes de direcciones que 
  ser&aacute;n descritas a lo largo de las pr&oacute;ximas secciones. De todos 
  modos, en un entorno RFC 822 raramente se usara otra cosa que direcciones absolutas 
  como usuario@m&aacute;quina.dominio.</P>
<P>_____________________________________________<BR>
  5 Cuando se intente llegar a una direcci&oacute;n DECnet desde un entorno RFC 
  822 se puede usar maquina::usuario.@relevo, donde relevo es el nombre de una 
  pasarela Internet-DECnet conocida.</P>
<P>&nbsp;</P>
<B><U> 
<P><a name="13.4"></a><font color="#008080">13.4 ¿Como funciona el encaminado 
  del correo?</font></P>
</u></B> 
<P>El proceso de dirigir un mensaje a la m&aacute;quina del destinatario se denomina 
  encaminado. Adem&aacute;s de encontrar una ruta desde el nodo emisor al receptor, 
  este proceso incluye tambi&eacute;n chequeo de errores as&iacute; como optimizaci&oacute;n 
  de velocidad y coste.</P>
<P>Hay mucha diferencia en la forma en la que un nodo UUCP maneja el encaminado 
  y la forma en que lo hace un nodo Internet. En la Internet, el trabajo principal 
  de dirigir datos al nodo del destinatario (una vez que se conoce por su direcci&oacute;n 
  IP) se realiza por la capa IP de control de red, mientras que en UUCP, la ruta 
  debe ser suministrada por el usuario, o generada por el agente de transporte 
  de correo.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="13.4.1"></a>13.4.1 Encaminado de correo en la Internet</P>
</u></I> 
<P>En la Internet, depende enteramente del nodo de destino el que se realice alg&uacute;n 
  encaminado especifico de correo. El comportamiento por defecto consiste en enviar 
  el mensaje al nodo de destino buscando su direcci&oacute;n IP, y dejando el 
  encaminado de los datos en si a la capa IP de transporte.</P>
<P>Generalmente, la mayor&iacute;a de los nodos querr&aacute;n que todo el correo 
  entrante se dirija a un servidor de correo f&aacute;cilmente accesible que sea 
  capaz de procesar todo ese tr&aacute;fico, y que distribuir&aacute; ese correo 
  localmente. Para anunciar ese servicio, el nodo publica el llamado campo MX 
  para su dominio local en la base de datos DNS. MX significa Mail Exchanger (Intercambiador 
  de correo) y b&aacute;sicamente quiere decir que el servidor va a actuar como 
  un redistribuidor de correo para todas las m&aacute;quinas de este dominio. 
  Los campos MX tambi&eacute;n pueden usarse para manipular el tr&aacute;fico 
  dirigido a m&aacute;quinas que no est&aacute;n ellas mismas conectadas a la 
  Internet, como redes UUCP o redes corporativas que contienen informaci&oacute;n 
  confidencial.</P>
<P>Los campos MX tambi&eacute;n tienen una preferencia asociada. Es un entero 
  positivo. Si existen varios intercambiadores de correo para una m&aacute;quina, 
  el agente de transporte de correo intentara enviar el mensaje al intercambiador 
  con menor valor de preferencia, y solo si &eacute;ste falla probara uno con 
  mayor valor. Si el nodo local es &eacute;l mismo un intercambiador de correo 
  para la direcci&oacute;n de destino, no redirigir&aacute; los mensajes a cualquier 
  m&aacute;quina MX que tenga un valor de preferencia mayor que el suyo propio: 
  esta es una forma segura de evitar bucles de correo.</P>
<P>Supongamos que una organizaci&oacute;n, digamos la Sociedad ACME, quiere que 
  todo su correo sea manipulado por su m&aacute;quina llamada mailhub. Entonces 
  tendr&aacute;n un campo MX como el siguiente en su base de datos DNS:</P>
<DIR> 
  <DIR> 
    <P>acme.com IN MX 5 mailhub.acme.com</P>
  </DIR>
</DIR>
<P>Esto anuncia que mailhub.acme.com es un intercambiador de correo para acme.com 
  con un valor de preferencia de 5. Una m&aacute;quina que desee enviar un mensaje 
  a joe@greenhouse.acme.com buscar&aacute; el registro DNS de acme.com, y encontrar&aacute; 
  el campo MX apuntando hacia mailhub. Si no hay ning&uacute;n MX con un valor 
  de preferencia menor que 5, el mensaje ser&aacute; enviado a mailhub, que lo 
  entregara a greenhouse.</P>
<P>Lo anterior es solo un esbozo de como funcionan los campos MX. Para mas informaci&oacute;n 
  sobre encaminado de correo en la Internet, por favor consulte el RFC 974.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="13.4.2"></a>13.4.2 Encaminado de correo en el mundo UUCP</P>
</u></I> 
<P>El encaminado de correo en redes UUCP es mucho mas complicado que en la Internet, 
  porque el software de transporte no realiza ning&uacute;n encaminado. Al principio, 
  todo el correo tenia que ser dirigido usando rutas bang. Las rutas bang especifican, 
  como hemos dicho ya, una lista de nodos a trav&eacute;s de los cuales enviar 
  el mensaje, separados por signos de admiraci&oacute;n, y seguida del nombre 
  del usuario. Para dirigir una carta a Juanita, usuaria de una m&aacute;quina 
  llamada mor&iacute;a, deber&iacute;amos usar la ruta eel!swim!moria!juanita. 
  Esto enviar&iacute;a el correo desde nuestro nodo a eek, desde alli a swim y 
  finalmente a mor&iacute;a.</P>
<P>El inconveniente obvio de esta t&eacute;cnica es que obliga a que recordemos 
  mucho sobre la topolog&iacute;a de la red, enlaces r&aacute;pidos, etc. Aun 
  peor, cualquier cambio en la topolog&iacute;a de la red _como enlaces que se 
  eliminan o nodos que se quitan_ puede causar que el mensaje no llegue al destino 
  simplemente porque no se estaba al tanto del cambio. Y finalmente en caso de 
  que nos mudemos a otro lugar, deberemos actualizar todas esas rutas.</P>
<P>Sin embargo, un hecho que hizo que fuese necesario el uso del encaminado manual 
  fue la presencia de nombres de nodo ambiguos: por ejemplo, supongamos que hay 
  dos m&aacute;quinas llamadas mor&iacute;a, una en los EE.UU., y otra en Francia. 
  ¿A cual de ellas nos referimos con moria!juanita? Esto puede quedar claro especificando 
  que ruta seguir para llegar a mor&iacute;a.</P>
<P>El primer paso para eliminar ambig&uuml;edades en nombres de nodos fue la fundaci&oacute;n 
  del Proyecto de Cartograf&iacute;a UUCP (The UUCP Mapping Project). Se encuentra 
  en la Universidad de Rutgers, y lleva el registro de todos los nombres de nodos 
  oficiales UUCP, junto con informaci&oacute;n de sus vecinos UUCP y su localizaci&oacute;n 
  geogr&aacute;fica, asegur&aacute;ndose de que ning&uacute;n nombre se repite. 
  La informaci&oacute;n recogida por el Proyecto de Cartograf&iacute;a se publica 
  como los Mapas de Usenet, que se distribuyen regularmente en Usenet.6 Una entrada 
  t&iacute;pica para un sistema en un mapa (despu&eacute;s de eliminar los comentarios) 
  seria algo as&iacute;:</P>
<DIR> 
  <DIR> 
    <P>moria<BR>
      bert(DAILY/2),<BR>
      swim(WEEKLY)</P>
  </DIR>
</DIR>
<P>Esta entrada dice que moria tiene un enlace con bert, al que llama dos veces 
  al d&iacute;a (DAILY=diariamente), y con swim, al que llama una vez a la semana 
  (WEEKLY). Volveremos de nuevo al formato del fichero mapa mas adelante.</P>
<P>Usando la informaci&oacute;n sobre conectividad proporcionada en los mapas, 
  se pueden generar autom&aacute;ticamente las rutas completas de nuestra m&aacute;quina 
  a cualquier nodo de destino. Esta informaci&oacute;n se almacena usualmente 
  en el fichero paths, tambi&eacute;n llamado base de datos de alias de rutas 
  (pathalias database). Suponiendo que los mapas indican que se puede llegar a 
  bert a trav&eacute;s de ernie, entonces una entrada de alias de ruta para mor&iacute;a 
  generada a partir del fragmento de mapa anterior quedar&iacute;a tal que as&iacute;:</P>
<DIR> 
  <DIR> 
    <P>mor&iacute;a ernie!bert!moria!%s</P>
  </DIR>
</DIR>
<P>Si ahora damos una direcci&oacute;n de destino de juanita@moria.uucp, nuestro 
  MTA escoger&aacute; la ruta mostrada anteriormente, y enviara el mensaje a ernie 
  con una direcci&oacute;n en el sobre de bert!moria!juanita.</P>
<P>De todos modos, construir un fichero paths a partir de los mapas completos 
  de Usenet no es una buena idea. La informaci&oacute;n proporcionada en ellos 
  normalmente esta bastante distorsionada, y a veces es obsoleta. As&iacute;, 
  solo unos pocos nodos grandes usan los mapas mundiales completos de UUCP para 
  construir su fichero paths. La mayor&iacute;a de los nodos solo mantienen informaci&oacute;n 
  de encaminado hacia los nodos en sus cercan&iacute;as, y env&iacute;an cualquier 
  correo dirigido a nodos que no encuentran en sus bases de datos a un nodo mas 
  inteligente, con una informaci&oacute;n de encaminado mas completa. Este esquema 
  se denomina encaminado por nodo inteligente (smart-host routing). Las m&aacute;quinas 
  que tienen un solo enlace de correo UUCP (llamadas nodos hoja) no realizan ning&uacute;n 
  encaminado propio; conf&iacute;an enteramente en su nodo inteligente para esta 
  tarea.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="13.4.3"></a>13.4.3 Mezcla de UUCP y RFC 822</P>
</u></I> 
<P>La mejor cura contra los problemas vistos con el encaminado en redes UUCP es 
  la adopci&oacute;n del sistema de nombres de dominio en ellas. Por supuesto, 
  no se pueden hacer peticiones a un servidor de nombres usando UUCP. Aun as&iacute;, 
  muchos nodos UUCP han formado peque&ntilde;os dominios que coordinan su encaminado 
  internamente. En los mapas, estos dominios publican uno o dos nodos como sus 
  pasarelas de correo, de modo que no tenga que haber una entrada en el mapa para 
  cada nodo en el dominio. Las pasarelas pueden distribuir todo el correo que 
  fluye hacia dentro y hacia fuera del dominio. El esquema de encaminado dentro 
  del dominio es completamente invisible para el resto del mundo.</P>
<P>_____________________________________________<BR>
  6 Los mapas de nodos registrados en el Proyecto de Cartograf&iacute;a UUCP se 
  distribuyen en el grupo de noticias comp.mail.maps; otras organizaciones pueden 
  publicar mapas separados para su red.</P>
<P>&nbsp;</P>
<P>Esto funciona muy bien con el esquema de encaminado por nodo inteligente descrito 
  anteriormente. La informaci&oacute;n de encaminado global se encuentra solo 
  en las pasarelas; a los nodos menores dentro de un dominio les basta con un 
  peque&ntilde;o fichero paths escrito a mano que contiene la lista de las rutas 
  dentro de su dominio, y la ruta al concentrador de correo. Incluso las pasarelas 
  de correo no tienen por que incluir informaci&oacute;n de encaminado hacia cada 
  una de las m&aacute;quinas UUCP en el mundo. Aparte de la informaci&oacute;n 
  completa de encaminado para el dominio al que sirven, ahora solo necesitan tener 
  en sus bases de datos rutas a dominios completos. Por ejemplo, la siguiente 
  entrada alias de ruta encaminar&aacute; todo el correo para nodos del dominio 
  sub.org a smurf:</P>
<DIR> 
  <DIR> 
    <P>.sub.org swim!smurf!%s</P>
  </DIR>
</DIR>
<P>Cualquier correo dirigido a claire@jones.sub.org ser&aacute; enviado a swim 
  con una direcci&oacute;n en el sobre tal como smurf !jones!claire.</P>
<P>La organizaci&oacute;n jer&aacute;rquica del espacio de nombres de dominio 
  permite a los servidores de correo mezclar rutas mas especificas con otras menos 
  especificas. Por ejemplo, un sistema en Francia puede tener rutas especificas 
  hacia subdominios de fr, pero encaminar cualquier correo dirigido a m&aacute;quinas 
  del dominio us hacia alg&uacute;n sistema en los EE.UU.</P>
<P>De esta forma, el encaminado basado en dominios (que es como se denomina esta 
  t&eacute;cnica) reduce enormemente el tama&ntilde;o de las bases de datos de 
  encaminado, as&iacute; como las tareas de administraci&oacute;n requeridas.</P>
<P>El mayor beneficio de usar nombres de dominio en un entorno UUCP, de todos 
  modos, es que al cumplir con RFC 822 se pueden f&aacute;cilmente usar pasarelas 
  entre redes UUCP y la Internet. Hoy en d&iacute;a, muchos dominios UUCP tienen 
  un enlace con una pasarela a Internet que act&uacute;a como su nodo inteligente. 
  Enviar mensajes a trav&eacute;s de la Internet es mas r&aacute;pido, y la informaci&oacute;n 
  de encaminado es mucho mas fiable porque los nodos en la Internet pueden usar 
  DNS en vez de mapas Usenet.</P>
<P>Para poder ser alcanzables desde la Internet, los dominios basados en UUCP 
  usualmente hacen que su pasarela a Internet anuncie una entrada MX para ellos 
  (las entradas MX que fueron descritas anteriormente). Por ejemplo, supongamos 
  que mor&iacute;a pertenece al dominio orcnet.org y que gcc2.groucho.edu act&uacute;a 
  como su pasarela a Internet. Entonces mor&iacute;a usar&iacute;a gcc2 como su 
  nodo inteligente, de modo que todo el correo hacia dominios remotos ser&iacute;a 
  enviado a trav&eacute;s de la Internet. Por otro lado, gcc2 anunciar&iacute;a 
  una entrada MX para orcnet.org, y enviar&iacute;a todo el correo entrante para 
  nodos de orcnet a mor&iacute;a.</P>
<P>El &uacute;nico problema que queda es que los programas de transporte UUCP 
  no pueden manejar nombres de dominio totalmente cualificados. La mayor&iacute;a 
  de los paquetes integrados de UUCP fueron dise&ntilde;ados para tratar con nombres 
  de nodos de ocho caracteres como m&aacute;ximo, algunos incluso menos, y usar 
  caracteres no alfanum&eacute;ricos, como puntos, est&aacute; totalmente fuera 
  de lugar para la mayor&iacute;a.</P>
<P>As&iacute;, es imprescindible disponer de alguna forma de relacionar nombres 
  RFC 822 y UUCP. La forma en que esto se hace es totalmente dependiente de la 
  implementaci&oacute;n. Una manera com&uacute;n de relacionar FQDNs con nombres 
  UUCP es usar el fichero de alias de ruta para esto:</P>
<DIR> 
  <DIR> 
    <P>moria.orcnet.org ernie!bert!moria!%s</P>
  </DIR>
</DIR>
<P>Esto producir&aacute; una ruta bang al estilo UUCP puro a partir de una direcci&oacute;n 
  que especifica un nombre de dominio totalmente cualificado. Algunos programas 
  de correo suministran un fichero especial para esto; sendmail, por ejemplo, 
  usa el fichero uucpxtable.</P>
<P>La transformaci&oacute;n inversa (llamada coloquialmente dominizar) se necesita 
  a veces cuando se env&iacute;a correo desde una red UUCP a la Internet. Mientras 
  el remitente use el nombre de dominio totalmente cualificado en la direcci&oacute;n 
  de destino, este problema se puede evitar no eliminando el nombre del dominio 
  de la direcci&oacute;n del sobre cuando se redirige el mensaje al nodo inteligente. 
  De todos modos, siguen existiendo algunos nodos UUCP que no son parte de ning&uacute;n 
  dominio. Estos se dominizan usualmente a&ntilde;adiendo el pseudo-dominio uucp.</P>
<P>&nbsp;</P>
<U> 
<P><font color="#008080"><b><a name="13.5"></a>13.5 Formatos de Fichero Mapa y 
  Alias de Ruta</b></font> </P>
</u> 
<P>La base de datos de alias de ruta ofrece la informaci&oacute;n de encaminado 
  principal en redes basadas en UUCP. Una entrada t&iacute;pica ser&aacute; como 
  sigue (nombre del nodo y ruta separadas por tabuladores): &nbsp;</P>
<DIR> 
  <DIR> 
    <P>moria.orcnet.org ernie!bert!moria!%s<BR>
      mor&iacute;a ernie!bert!moria!%s</P>
  </DIR>
</DIR>
<P>Esto hace que cualquier mensaje a mor&iacute;a sea enviado v&iacute;a ernie 
  y bert. Ambos nombres de mor&iacute;a (su nombre totalmente cualificado y su 
  nombre UUCP) deben ser suministrados si el programa no tiene una forma separada 
  de relacionar ambos.</P>
<P>Si se quieren dirigir los mensajes destinados a m&aacute;quinas dentro de alg&uacute;n 
  dominio a su concentrador de correo, se debe tambi&eacute;n especificar un camino 
  en la base de datos de alias de ruta, dando el nombre del dominio como objetivo, 
  precedido de un punto. Por ejemplo, si todas las m&aacute;quinas de sub.org 
  pueden ser alcanzadas a trav&eacute;s de swim!smurf, la entrada de alias de 
  ruta debe ser:</P>
<DIR> 
  <DIR> 
    <P>.sub.org swim!smurf!%s</P>
  </DIR>
</DIR>
<P>Escribir un fichero de alias de ruta es aceptable solo cuando se esta manejando 
  un nodo que no necesita hacer demasiados encaminados. Si se tienen que hacer 
  encaminados hacia un gran n&uacute;mero de m&aacute;quinas, una manera mejor 
  es usar el comando pathalias para crear el fichero a partir de los ficheros 
  de mapa. Los mapas se pueden mantener con mas facilidad, porque solo hay que 
  a&ntilde;adir o quitar un sistema editando la entrada de dicho sistema en el 
  mapa, y volver a crear el fichero de mapa. Aunque los mapas publicados por el 
  Proyecto de Cartograf&iacute;a de Usenet ya no se usan demasiado para encaminar, 
  las redes UUCP peque&ntilde;as pueden suministrar informaci&oacute;n de encaminado 
  en su propio conjunto de mapas.</P>
<P>Un fichero de mapa consiste principalmente en una lista de nodos, junto con 
  los nodos que cada sistema registra o lo registran. El nombre del sistema comienza 
  en la columna uno, y sigue una lista de enlaces separados por comas. La lista 
  se puede continuar en varias l&iacute;neas, comenzando cada nueva l&iacute;nea 
  con un tabulador. Cada enlace consiste en el nombre del nodo enlazado, seguido 
  del coste, entre corchetes. El coste es una expresi&oacute;n aritm&eacute;tica, 
  consistente en n&uacute;meros y costes simb&oacute;licos. Las l&iacute;neas 
  que comienzan con un signo hash (#) se ignoran.</P>
<P>Como ejemplo, consideremos mor&iacute;a, que registra a swim.twobirds.com dos 
  veces al d&iacute;a, y a bert.sesame.com una vez a la semana. Adem&aacute;s 
  el enlace con bert usa solo un m&oacute;dem lento de 2400bps. mor&iacute;a publicar&iacute;a 
  la siguiente entrada en los mapas:</P>
<DIR> 
  <DIR> 
    <P>moria.orcnet.org<BR>
      swim.twobirds.com(DAILY/2),<BR>
      bert.sesame.com(WEEKLY+LOW)<BR>
      moria.orcnet.org = mor&iacute;a</P>
  </DIR>
</DIR>
<P>La &uacute;ltima l&iacute;nea lo har&iacute;a ser conocido bajo su nombre UUCP 
  tambi&eacute;n. Obs&eacute;rvese que debe ser DAILY/2, porque llamar dos veces 
  al d&iacute;a reduce a la mitad el coste de ese enlace.</P>
<P>Usando la informaci&oacute;n de dichos ficheros de mapa, pathalias puede calcular 
  rutas &oacute;ptimas para cualquier destino que aparezca en el fichero de rutas, 
  y producir una base de datos de alias de ruta a partir de &eacute;ste, que se 
  puede usar para encaminar hacia esos nodos.</P>
<P>pathalias proporciona varias posibilidades mas, como esconder nodos (es decir, 
  hacerlos accesibles solo a trav&eacute;s de una pasarela), etc. V&eacute;ase 
  la p&aacute;gina del manual sobre pathalias para mas detalles, adem&aacute;s 
  de una lista completa de costes de enlace.</P>
<P>Los comentarios en el fichero de mapa contienen generalmente informaci&oacute;n 
  adicional sobre los nodos descritos en &eacute;l. Existe un formato r&iacute;gido 
  para especificar &eacute;sta, de manera que pueda ser recuperada de los mapas. 
  Por ejemplo, un programa llamado uuwho usa una base de datos creada a partir 
  de los ficheros de mapa para presentar esta informaci&oacute;n de una manera 
  elegante.</P>
<P>Cuando se registra un nodo con una organizaci&oacute;n que distribuye ficheros 
  de mapa a sus miembros, generalmente se debe rellenar una de esas entradas de 
  mapa.</P>
<P>A continuaci&oacute;n hay una entrada de mapa de ejemplo (de hecho, es la del 
  nodo del autor):</P>
<DIR> 
  <DIR> 
    <P>#N monad, monad.swb.de, monad.swb.sub.org<BR>
      #S AT 486DX50; Linux 0.99<BR>
      #O private<BR>
      #C Olaf Kirch<BR>
      #E okir@monad.swb.de<BR>
      #P Kattreinstr. 38, D-64295 Darmstadt, FRG<BR>
      #L 49 52 03 N / 08 38 40 E<BR>
      #U brewhq<BR>
      #W okir@monad.swb.de (Olaf Kirch); Sun Jul 25 16:59:32 MET DST 1993<BR>
      #<BR>
      monad brewhq(DAILY/2)<BR>
      # Domains<BR>
      monad = monad.swb.de<BR>
      monad = monad.swb.sub.org</P>
  </DIR>
</DIR>
<P>El espacio en blanco detr&aacute;s de los primeros dos caracteres es un tabulador. 
  El significado de la mayor&iacute;a de los campos es bastante obvio; recibiremos 
  una descripci&oacute;n detallada del dominio con el que vayamos a registrarnos. 
  El campo L es el mas divertido de averiguar: da nuestra posici&oacute;n geogr&aacute;fica 
  en latitud/longitud y se usa para dibujar los mapas postscript que muestran 
  todos los nodos de cada pa&iacute;s, as&iacute; como los del mundo entero. 7</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="13.6"></a>13.6 Configuraci&oacute;n de elm</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>elm significa "electronic mail" (correo electr&oacute;nico) y es una de las 
  utilidades UNIX mas razonablemente bautizadas. Proporciona una interface de 
  pantalla completa con una buena utilidad de ayuda. No vamos a explicar aqu&iacute; 
  como se usa elm, solo nos detendremos en sus opciones de configuraci&oacute;n.</P>
<P>_____________________________________________<BR>
  7 Aparecen regularmente en news.lists.ps-maps. Cuidado: son enormes.</P>
<P>&nbsp;</P>
<P>Te&oacute;ricamente, se puede usar elm sin configurar, y todo funciona bien, 
  con suerte. Pero hay algunas opciones que deben definirse, aunque solo se necesitan 
  en contadas ocasiones.</P>
<P>Cuando comienza, elm lee un conjunto de variables de configuraci&oacute;n desde 
  el fichero elm.rc en /usr/lib/elm. Entonces, intentara leer el fichero .elm/elmrc 
  en nuestro directorio personal. Normalmente este fichero no se genera a mano. 
  Se crea cuando se escoge "save options" (grabar opciones) desde el men&uacute; 
  de opciones de elm.</P>
<P>El conjunto de opciones para el fichero privado elmrc tambi&eacute;n esta disponible 
  en el fichero global elm.rc. La mayor&iacute;a de las definiciones en el fichero 
  privado elmrc sustituir&aacute;n a las del fichero global.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="13.6.1"></a>13.6.1 Opciones Globales de elm </P>
</u></I>
<P>En el fichero global elm.rc, se deben definir las opciones que pertenecen a 
  nuestro nombre de m&aacute;quina. Por ejemplo, en la Cervecera Virtual, el fichero 
  para vlager contendr&aacute; lo siguiente:</P>
<DIR> 
  <DIR> 
    <P>#<BR>
      # El nombre del nodo local<BR>
      hostname = vlager<BR>
      #<BR>
      # Nombre del dominio<BR>
      hostdomain = .vbrew.com<BR>
      #<BR>
      # Nombre de dominio totalmente cualificado (FQDN)<BR>
      hostfullname = vlager.vbrew.com</P>
  </DIR>
</DIR>
<P>Estas opciones definen la idea que tiene elm sobre el nombre de la m&aacute;quina 
  local. Aunque esta informaci&oacute;n se usa raramente, debemos definir estas 
  opciones. Obs&eacute;rvese que estas opciones solo tienen efecto cuando se dan 
  en el fichero global de configuraci&oacute;n; cuando se encuentran en nuestro 
  elmrc privado, ser&aacute;n ignoradas.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="13.6.2"></a>13.6.2 Conjuntos de Caracteres Nacionales</P>
</u></I> 
<P>Recientemente, han habido propuestas para corregir el est&aacute;ndar RFC 822 
  para soportar varios tipos de mensajes, como texto simple, datos binarios, ficheros 
  Postscript, etc. El conjunto de est&aacute;ndares y RFCs que cubren estos aspectos 
  se suelen conocer como MIME, o Extensiones de Correo Internet Multiprop&oacute;sito 
  (Multipurpose Internet Mail Extensions).</P>
<P>Entre otras cosas, esto permite al destinatario saber si un conjunto de caracteres 
  distinto del est&aacute;ndar ASCII ha sido usado al escribir el mensaje, por 
  ejemplo usando los acentos o di&eacute;resis del castellano. Esto tiene soporte 
  en elm hasta cierto punto.</P>
<P>El conjunto de caracteres usado por Linux internamente para representar caracteres 
  se suele denominar ISO-8859-1, que es el nombre del est&aacute;ndar que cumple. 
  Tambi&eacute;n se conoce como Latin-1. Cualquier mensaje que use caracteres 
  de ese conjunto debe llevar la siguiente l&iacute;nea en su encabezado:</P>
<DIR> 
  <DIR> 
    <P>Content-Type: text/plain; charset=iso-8859-1</P>
  </DIR>
</DIR>
<P>El sistema que recibe el mensaje debe reconocer este campo y tomar las medidas 
  apropiadas cuando muestra el mensaje. El valor por defecto para mensajes text/plain 
  (texto simple) es un valor de charset (conjunto de caracteres) de us-ascii.</P>
<P>Para poder mostrar mensajes con conjuntos de caracteres distintos al ASCII, 
  elm debe saber como mostrar esos caracteres. Por defecto, cuando elm recibe 
  un mensaje con un campo charset distinto de us-ascii (o un tipo de contenido 
  distinto de text/plain, a todos los efectos), intenta mostrar el mensaje usando 
  un comando llamado metamail. Los mensajes que requieren metamail para ser mostrados 
  aparecen con una 'M' en la primera columna en la pantalla de listado de mensajes 
  (overview).</P>
<P>Como el conjunto de caracteres nativo de Linux es ISO-8859-1, llamar a metamail 
  no es necesario para mostrar mensajes que usen dicho conjunto. Si se le dice 
  a elm que la pantalla entiende ISO-8859-1, no usara metamail sino que mostrar&aacute; 
  el mensaje directamente. Esto se puede hacer definiendo la siguiente opci&oacute;n 
  en el elm.rc global:</P>
<DIR> 
  <DIR> 
    <P>displaycharset = iso-8859-1</P>
  </DIR>
</DIR>
<P>Obs&eacute;rvese que se puede definir esta opci&oacute;n incluso cuando nunca 
  vayamos a enviar o recibir mensajes que realmente contengan caracteres distintos 
  del ASCII. Esto es as&iacute; porque la gente que env&iacute;a esos mensajes, 
  usualmente configura su programa de correo para que incluya el campo Content-Type: 
  (tipo de contenido) adecuado en el encabezado de correo por defecto, vayan o 
  no a enviar mensajes solo ASCII.</P>
<P>De todos modos, definir esta opci&oacute;n en elm.rc no es suficiente. El problema 
  es que cuando muestra los mensajes con el paginador incorporado, elm llama a 
  una funci&oacute;n de biblioteca por cada car&aacute;cter para determinar si 
  es mostrable o no. Por defecto, esta funci&oacute;n solo reconoce caracteres 
  ASCII como mostrables, y muestra todos los dem&aacute;s como "^?".</P>
<P>Debemos solucionar esto definiendo la variable de entorno LC_CTYPE como ISO-8859-1, 
  que le indica a la biblioteca que acepte caracteres Latin-1 como mostrables. 
  El soporte para esta y otras caracter&iacute;sticas esta disponible a partir 
  de la libc-4.5.8.</P>
<P>Cuando enviamos mensajes que contienen caracteres especiales del ISO-8859-1, 
  debemos asegurarnos de definir dos variables mas en el fichero elm.rc:</P>
<DIR> 
  <DIR> 
    <P>charset = iso-8859-1<BR>
      textencoding = 8bit</P>
  </DIR>
</DIR>
<P>Esto hace que elm defina el conjunto de caracteres como ISO-8859-1 en el encabezado 
  de correo, y lo env&iacute;e como valores de 8 bit (el comportamiento por defecto 
  es recortar todos los caracteres a 7 bit).</P>
<P>Por supuesto, cualquiera de estas opciones se puede definir tambi&eacute;n 
  en el fichero elmrc privado en lugar de en el global.</P>
</FONT> 
</BODY>
</HTML>
