<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl17</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl16.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl18.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 17</P>
</font></B><P ALIGN="CENTER"><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>C-News</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Uno de los paquetes de software m&aacute;s populares para las NetNews es C-News. 
  Fue dise&ntilde;ado para servidores que llevan noticias sobre enlaces UUCP. 
  Este cap&iacute;tulo discutir&aacute; los conceptos centrales de C-News, y las 
  tareas de instalaci&oacute;n b&aacute;sica y de mantenimiento.</P>
<P>C-News almacena sus ficheros de configuraci&oacute;n en /usr/lib/news, y la 
  mayor&iacute;a de sus ficheros binarios en el directorio /usr/lib/news/bin. 
  Los art&iacute;culos se guardan en /var/spool/news. Ud. debe estar seguro de 
  que todos los ficheros en estos directorios son propiedad del usuario news, 
  grupo news. La mayor&iacute;a de los problemas surgen de la inaccesibilidad 
  de los ficheros por C-News. Ud. debe tener como regla general el ser usuario 
  news usando su antes de tocar nada ah&iacute;. La &uacute;nica excepci&oacute;n 
  es setnewsids, que se usa para establecer la identificaci&oacute;n real del 
  usuario de algunos programas de noticias. Este debe ser propiedad del root y 
  debe tener el bit setuid activado.</P>
<P>A continuaci&oacute;n, describimos todos los ficheros de configuraci&oacute;n 
  de C-News en detalle, y le mostraremos lo que tiene que hacer para mantener 
  su servidor en funcionamiento.</P>
</FONT>
<dir> 
    <p><font face="Verdana" size="2"><a href="garl17.htm#17.1">17.1 Entrega de 
      Noticias</a><br>
      <a href="garl17.htm#17.2">17.2 Instalaci&oacute;n</a><br>
      <a href="garl17.htm#17.3">17.3 El fichero sys</a><br>
      <a href="garl17.htm#17.4">17.4 El fichero active</a><br>
      <a href="garl17.htm#17.5">17.5 Procesado de art&iacute;culos por lotes</a><br>
      <a href="garl17.htm#17.6">17.6 Noticias caducadas</a><br>
      <a href="garl17.htm#17.7">17.7 Ficheros diversos</a><br>
      <a href="garl17.htm#17.8">17.8 Mensajes de Control</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl17.htm#17.8.1">17.8.1 El 
          Mensaje cancel</a><br>
          <a href="garl17.htm#17.8.2">17.8.2 newgroup y rmgroup</a><br>
          <a href="garl17.htm#17.8.3">17.8.3 El Mensaje checkgroups</a><br>
          <a href="garl17.htm#17.8.4">17.8.4 sendsys, versi&oacute;n, y senduuname</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl17.htm#17.9">17.9 C-News en 
      un Entorno NFS</a><br>
      <a href="garl17.htm#17.10">17.10 Herramientas y Tareas de Mantenimiento</a></font></p>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="17.1"></a>17.1 Entrega de Noticias</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Los art&iacute;culos deben ser suministrados a C-News de varias maneras. Cuando un usuario local env&iacute;a un art&iacute;culo, el lector de noticias usualmente lo entrega al comando inews, el cual completa la informaci&oacute;n de cabecera. Las noticias del servidor remoto, tanto si es un &uacute;nico mensaje como un lote entero, son entregadas al comando rnews, el cual lo almacena en el directorio /var/spool/news/in.coming, de donde lo coger&aacute; newsrun mas tarde. Sin embargo, con cualquiera de estas dos t&eacute;cnicas el art&iacute;culo ser&aacute; finalmente entregado al comando relaynews.</P>
<P>Para cada art&iacute;culo, el comando relaynews consulta primero si el art&iacute;culo ha sido visto en el servidor local buscando el identificador del mensaje en el fichero history. Los art&iacute;culos duplicados ser&aacute;n eliminados. Entonces, relaynews mira la l&iacute;nea de cabecera del Newsgroup: para averiguar si el servidor local solicita art&iacute;culos de cualquiera de estos grupos. Si lo hace, y el grupo de noticias esta listado en el fichero active, relaynews intenta almacenar el art&iacute;culo en el correspondiente directorio en el &aacute;rea de cola de noticias. Si no existe este directorio, se crea. El identificador del mensaje del art&iacute;culo ser&aacute; entonces registrado en el fichero history. De otra manera, relaynews elimina el mensaje.</P>
<P>Si relaynews falla al almacenar un art&iacute;culo entrante porque un grupo al que sido enviado no esta listado en su fichero activo, el art&iacute;culo ser&aacute; movido al grupo junk.1 relaynews tambi&eacute;n comprobara art&iacute;culos caducados o mal fechados y los rechazara. Los lotes entrantes que fallan por cualquier raz&oacute;n son movidos a /var/spool/news/in.coming/bad, y es registrado un mensaje de error.</P>
<P>Despu&eacute;s de esto, el art&iacute;culo ser&aacute; transmitido a todos los otros servidores que soliciten noticias de estos grupos, usando el transporte especificado para cada servidor determinado.</P>
<P>Para estar seguro de que no es enviado a un servidor que ya lo ha visto, cada servidor de destino es comparado con el campo Path: de cabecera del art&iacute;culo, el cual contiene la lista de servidores hasta los que el art&iacute;culo ha llegado, escritos en notaci&oacute;n de camino UUCP con signos de admiraci&oacute;n. Solo si el nombre del servidor de destino no aparece en esta lista el art&iacute;culo le ser&aacute; enviado.</P>
<P>C-News es usado com&uacute;nmente para transmitir noticias entre servidores UUCP, aunque es tambi&eacute;n posible usarlo bajo un entorno NNTP. Para entregar noticias a un servidor remoto UUCP _tanto un solo art&iacute;culo como lotes enteros_ uux es usado para ejecutar el comando rnews en el servidor remoto, y entregarle el art&iacute;culo o lote por su entrada est&aacute;ndar.</P>
<P>Cuando el proceso por lotes esta permitido para un servidor dado, C-News no manda inmediatamente ning&uacute;n art&iacute;culo entrante, sino que anexiona su nombre de camino a un fichero, usualmente out.going/nodo/togo. Peri&oacute;dicamente, un programa por lotes es ejecutado desde la l&iacute;nea de una tabla de tareas planeadas, 2 3 lo que sit&uacute;a a los art&iacute;culos en uno o m&aacute;s ficheros, opcionalmente los comprime, y los manda a rnews en el servidor remoto.</P>
<P>La figura 17.1 muestra las noticias fluyendo a trav&eacute;s de relaynews. Los art&iacute;culos deben ser transmitidos al servidor local (denotado por ME), a alg&uacute;n servidor llamado ponderosa v&iacute;a correo electr&oacute;nico, y a un servidor llamado moria, para el cual el proceso por lotes esta permitido.</P>
<P>_____________________________________________<BR>
1 Debe haber una diferencia entre los grupos que existen en su servidor, y aquellos que su servidor est&aacute; preparado para recibir. Por ejemplo, la lista de subscripci&oacute;n debe especificar comp.all, lo que significa todos los grupos de noticias bajo la jerarqu&iacute;a comp, pero en su servidor, solo un n&uacute;mero de grupos comp son listados en activo. Los art&iacute;culos enviados a esos grupos ser&aacute;n movidos a junk.<BR>
2 N. del T.: crontab<BR>
3 Note que esto deber&iacute;a ser la tabla de tareas planeadas del usuario noticias, para no destrozar los permisos de los ficheros.</P>
<P>&nbsp;</P>
</FONT><P ALIGN="CENTER"><IMG SRC="fig17.1.gif" WIDTH=342 HEIGHT=237></P>
<FONT FACE="Verdana" SIZE=2><P>Figura 17.1: Flujo de noticias mediante relaynews.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="17.2"></a>17.2 Instalaci&oacute;n</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Para instalar C-News, descomprima con tar los ficheros en el lugar apropiado, si no lo ha hecho todav&iacute;a, y edite los ficheros de configuraci&oacute;n listados abajo. Todos est&aacute;n situados en /usr/lib/news. Sus formatos ser&aacute;n descritos en las siguientes secciones.</P>
<P><B>sys<BR>
</b>Probablemente Ud. tendr&aacute; que modificar la l&iacute;nea ME que describe su sistema, aunque usar all/all es tambi&eacute;n una apuesta segura. Ud. tambi&eacute;n tendr&aacute; que a&ntilde;adir una l&iacute;nea por cada servidor al que quiera mandar noticias.</P>
<P>Si Ud. es un servidor hoja, solo necesita una l&iacute;nea que mande todos los art&iacute;culos generados localmente a su fuente. Suponga que su fuente es moria, entonces su fichero sys deber&iacute;a parecerse a:</P><DIR>
<DIR>

<P>ME:all/all::<BR>
moria/moria.orcnet.org:all/all,!local:f:</P></DIR>
</DIR>

<P><B>organization<BR>
</b>El nombre de su organizaci&oacute;n. Por ejemplo, "Cervecera Virtual, Inc.". En su m&aacute;quina de casa, introduzca "sitio privado", o cualquier cosa que desee. La mayor&iacute;a de la gente no dir&aacute; que su servidor est&aacute; configurado correctamente hasta que no haya configurado este fichero.</P>
<B><P>newsgroups</P>
</B><P><B>mailname<BR>
</b>El nombre de su servidor de correo, por ejemplo vbrew.com.</P>
<P><B>whoami<BR>
</b>El nombre de su servidor para prop&oacute;sitos de noticias. Con frecuencia, se usa, por ejemplo, el nombre del servidor UUCP. vbrew.</P>
<P><B>explist<BR>
</b>Probablemente Ud. deber&iacute;a editar este fichero para reflejar sus tiempos de expiraci&oacute;n preferidos para alg&uacute;n grupo de noticias en especial. El espacio de disco debe jugar un importante papel en esto.</P>
<P>Para crear una jerarqu&iacute;a inicial de grupos de noticias, obtenga un fichero active y un fichero newsgroups del servidor que le provee, e inst&aacute;lelos en /usr/lib/news, asegur&aacute;ndose de que son propiedad del usuarios news y tienen un modo de protecci&oacute;n 664. Elimine todos los grupos to.* del fichero active, y a&ntilde;ada to.mi servidor y to.sitio proveedor, al igual que junk y control. Los grupos to.* se usan normalmente para intercambiar mensajes ihave/sendme 4, pero Ud. deber&iacute;a crearlos tanto si planea usar ihave/sendme como sino. Despu&eacute;s, sustituya todos los n&uacute;meros de los art&iacute;culos en el segundo y tercer campo de active usando el siguiente comando:</P><DIR>
<DIR>

<P># cp active active.old<BR>
# sed 's/ [0-9]* [0-9]* / 0000000000 00001 /' active.old &gt; active<BR>
# rm active.old</P></DIR>
</DIR>

<P>El segundo comando es una invocaci&oacute;n de sed(1), uno de mis comandos UNIX favoritos. Esta invocaci&oacute;n sustituye dos cadenas de d&iacute;gitos por una cadena de ceros y la cadena 000001, respectivamente.</P>
<P>Finalmente, cree el directorio de cola de noticias y los directorios usados para noticias entrantes y salientes:</P><DIR>
<DIR>

<P># cd /var/spool<BR>
# mkdir news news/in.coming news/out.going<BR>
# chown -R news.news news<BR>
# chmod -R 755 news</P></DIR>
</DIR>

<P>Si Ud. esta usando una versi&oacute;n de C-News mas reciente, deber&aacute; crear el directorio out.master en el directorio de cola de noticias.</P>
<P>Si est&aacute; usando lectores de noticias de una distribuci&oacute;n diferente de la de C-News, puede descubrir que algunos de ellos esperan encontrar la cola de noticias en /usr/spool/news en vez de en /var/spool/news. Si su lector de noticias no parece encontrar ning&uacute;n art&iacute;culo, cree un enlace simb&oacute;lico de /usr/spool/news a /var/spool/news.</P>
<P>_____________________________________________<BR>
4 N. del T.: Tengo/Env&iacute;a</P>
<P>&nbsp;</P>
<P>Ahora, Ud. esta preparado para recibir noticias. Note que no tiene que crear ning&uacute;n otro directorio mas que los vistos arriba, porque cada vez que C-News recibe un art&iacute;culo de un grupo para el que todav&iacute;a no hay directorio de cola, lo crea.</P>
<P>En particular, esto le ocurre a todos los grupos a los que se ha enviado un art&iacute;culo cruzado. As&iacute; que, despu&eacute;s de un cierto tiempo, encontrar&aacute; su cola de noticias llena con directorios para grupos de noticias a los que Ud. nunca se ha subscrito, como alt.lang.teco.</P>
<P>Puede evitar esto tanto borrando todos los grupos no deseados de active, como ejecutando regularmente un script del shell que borre todos los directorios vac&iacute;os de /var/spool/news (excepto out.going y in.coming, por supuesto).</P>
<P>C-News necesita un usuario a quien mandar los mensajes de error y los informes de estado. Por defecto, este es usenet. Si usa el valor por defecto, tiene que establecer un alias para &eacute;l, el cual remite todo su correo a una o m&aacute;s personas responsables. (Los cap&iacute;tulos 14 y 15 explican como hacerlo para smail y sendmail ). Tambi&eacute;n puede modificar este comportamiento estableciendo la variable de entorno NEWSMASTER con el nombre apropiado. Debe hacerlo en el fichero de la tabla de tareas planeadas de noticias, as&iacute; como cada vez que invoque manualmente una herramienta administrativa, por lo que instalar un alias es probablemente m&aacute;s f&aacute;cil.</P>
<P>Aprovechando que esta modificando /etc/passwd, aseg&uacute;rese de que cada usuario tiene su nombre real en el campo pw_gecos del fichero de contrase&ntilde;a (&eacute;ste es el cuarto campo). Es una cuesti&oacute;n de normas de etiqueta de Usenet el que el nombre real del remitente aparezca en el campo From: del art&iacute;culo. Por supuesto, Ud. querr&aacute; hacerlo de cualquier manera cuando use el correo.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="17.3"></a>17.3 El fichero sys</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El fichero sys, situado en /usr/lib/news, controla que jerarqu&iacute;as recibe y remite a otros servidores. Aunque hay herramientas de mantenimiento llamadas addfeed y delfeed, creo que es mejor mantener este fichero a mano.</P>
<P>El fichero sys contiene entradas para cada servidor al que Ud. reenv&iacute;a noticias adem&aacute;s de descripciones de los grupos de noticias que Ud. acepta. Una entrada se parece a:</P><DIR>
<DIR>

<P>sitio [/exclusiones ]:listagrupos [/listadist ] [:flags [:cmds ]]</P></DIR>
</DIR>

<P>Las entradas pueden continuar a lo largo de varias l&iacute;neas usando una barra invertida (\). Una almohadilla (#) denota un comentario.</P>
<P><B>sitio<BR>
</b>Este es el nombre de los servidores a los que se aplica la entrada. Usualmente se elige el nombre del servidor UUCP para esto. Tiene que haber tambi&eacute;n una entrada para su servidor en el fichero sys, sino no recibir&aacute; ning&uacute;n art&iacute;culo.</P>
<P>El nombre especial de servidor ME indica su servidor. La entrada ME define todos los grupos de noticias que Ud. esta preparado para almacenar localmente. Los art&iacute;culos que no concuerden con la l&iacute;nea ME ir&aacute;n al grupo junk.</P>
<P>Puesto que C-News compara el servidor con los nombres de los servidores en la cabecera del campo Path:, hay que estar seguro de que realmente coinciden. Algunos servidores usan su nombre de dominio completamente cualificado en este campo, o un alias como news.sitio.dominio . Para prevenir que cualquier art&iacute;culo regrese a estos servidores, tiene que a&ntilde;adir esto a la lista de exclusi&oacute;n, separada por comas.</P>
<P>Por ejemplo, para la entrada aplicada al servidor moria, el campo del servidor contendr&iacute;a moria/moria.orcnet.org.</P>
<P><B>listagrupos<BR>
</b>Esta es una lista de suscripci&oacute;n, separada por comas, de grupos y jerarqu&iacute;as para ese servidor en particular. Una jerarqu&iacute;a debe especificarse dando el prefijo de la jerarqu&iacute;a (como comp.os para todos los grupos cuyos nombres empiezan con este prefijo), seguido opcionalmente por la palabra clave all (por ejemplo, comp.os.all).</P>
<P>Para excluir una jerarqu&iacute;a o grupo de reemisi&oacute;n, debe ser precedido con una exclamaci&oacute;n. Si un grupo de noticias encaja con mas de una definici&oacute;n de la lista, se aplica el emparejamiento mas larga. Por ejemplo, si la listagrupos contiene</P><DIR>
<DIR>

<P>!comp,comp.os.linux,comp.folklore.computers</P></DIR>
</DIR>

<P>ning&uacute;n grupo de la jerarqu&iacute;a comp excepto comp.folklore.computers y todos los grupos bajo comp.os.linux ser&aacute;n administrados a ese servidor.</P>
<P>Si el servidor requiere que se le reenv&iacute;en todas las noticias que Ud. recibe, introduzca all como listagrupos .</P>
<P><B>listadist<BR>
</b>est&aacute; separado de listagrupos por un barra inclinada, y contiene una lista de distribuciones para ser reenviada. Ud. puede de nuevo excluir ciertas distribuciones precedi&eacute;ndolas con una exclamaci&oacute;n. Todas las distribuciones se denotan con all. El omitir listadist implica una lista de all.</P>
<P>Por ejemplo, puede usar una lista de distribuci&oacute;n de all,!local para impedir que las noticias de uso solo local sean enviadas a servidores remotos.</P>
<P>Usualmente hay al menos dos distribuciones: world, que es a menudo la distribuci&oacute;n por defecto usada cuando el usuario no especifica nada, y local. Puede haber otras distribuciones que se empleen para una cierta regi&oacute;n, estado, pa&iacute;s, etc. Finalmente, hay dos distribuciones usadas solamente por C-News; &eacute;stas son sendme y ihave, y son usadas para el protocolo ihave/sendme.</P>
<P>El uso de distribuciones es materia de debate. Para unos, algunos lectores de noticias crean falsas distribuciones simplemente usando la jerarqu&iacute;a de alto nivel, por ejemplo comp cuando se env&iacute;a un mensaje a comp.os.linux. </P>
<P>Las distribuciones que se emplean en regiones son a menudo tambi&eacute;n cuestionables, porque las noticias deben viajar fuera de su regi&oacute;n cuando son enviadas a trav&eacute;s de Internet.5 Sin embargo, las distribuciones empleadas para una organizaci&oacute;n, son muy significativas, por ejemplo para evitar la salida de informaci&oacute;n confidencial de la red de la compa&ntilde;&iacute;a. No obstante, este prop&oacute;sito generalmente se consigue mejor creando un grupo de noticias o una jerarqu&iacute;a separados.</P>
<P><B>flags<BR>
</b>este campo describe ciertos par&aacute;metros para la fuente. Puede estar vac&iacute;o, o ser una combinaci&oacute;n de lo siguiente:</P>
</FONT><B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>F</b></font><FONT FACE="Verdana" SIZE=2> Este flag permite el proceso por lotes.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>f</b></font><FONT FACE="Verdana" SIZE=2> Este es casi id&eacute;ntico al flag F, pero permite a C-News calcular el tama&ntilde;o de los lotes salientes con mas precisi&oacute;n.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>I</b></font><FONT FACE="Verdana" SIZE=2> Este flag hace que C-News produzca una lista de art&iacute;culos apta para ser usada por el protocolo ihave/sendme. Hay que hacer modificaciones adicionales al fichero sys y al fichero batchparms para habilitar ihave/sendme.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>n</b></font><FONT FACE="Verdana" SIZE=2> Este flag crea ficheros por lotes para clientes de transferencia NNTP activa como nntpxmit (ver cap&iacute;tulo 18). Los ficheros por lotes contienen el nombre de fichero del art&iacute;culo junto con su identificador de mensaje.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>L</b></font><FONT FACE="Verdana" SIZE=2> Este flag indica a C-News que solo transmita los mensajes generados en su servidor. Este flag puede ir ser seguido por un n&uacute;mero decimal n , el cual hace que C-News solo transfiera art&iacute;culos generados a n saltos desde su servidor. C-News determina el n&uacute;mero de saltos a partir del campo Path:.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>u</b></font><FONT FACE="Verdana" SIZE=2> Este flag indica a C-News que procese por lotes solo los art&iacute;culos de los grupos no moderados.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>m</b></font><FONT FACE="Verdana" SIZE=2> Este flag indica a C-News que procese por lotes solo los art&iacute;culos de los grupos moderados.</font></P><FONT FACE="Verdana" SIZE=2>
<P>Debe usar a lo sumo uno de F, f, I, o n.</P>
<P>_____________________________________________<BR>
5 No es infrecuente para un art&iacute;culo enviado en, digamos Hamburgo, ir a Frankfurt v&iacute;a reston.ans.net en Holanda, o inclusive v&iacute;a alg&uacute;n servidor en E.E.U.U.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P><B>cmds</b><BR>
Este campo contiene un comando a ser ejecutado para cada art&iacute;culo, a menos que el proceso por lotes este habilitado. El art&iacute;culo ser&aacute; suministrado al comando a trav&eacute;s de la entrada est&aacute;ndar. Esto solo deber&iacute;a usarse para fuentes muy peque&ntilde;as; de otra manera la carga en ambos sistemas ser&iacute;a demasiado alta.</P>
<P>El comando por defecto es</P><DIR>
<DIR>

<P>uux - -r -z system !rnews</P></DIR>
</DIR>

<P>lo que invoca rnews en el sistema remoto, administrando el art&iacute;culo mediante la entrada est&aacute;ndar.</P>
<P>El camino de b&uacute;squeda por defecto para los comandos indicados en este campo es /bin:/usr/bin:/usr/lib/news/bin/batch. El &uacute;ltimo directorio contiene un cierto n&uacute;mero de guiones del interprete de comandos cuyos nombres empiezan por v&iacute;a; se describen brevemente mas adelante en este mismo cap&iacute;tulo.</P>
<P>Si el proceso por lotes esta habilitado usando bien los flags F o f, I o n, C-News espera encontrar un nombre de fichero en este campo en vez de un comando. Si el nombre de fichero no empieza con una barra inclinada (/), se supone que es relativo a /var/spool/news/out.going. Si el campo esta vac&iacute;o, su valor por defecto es system /togo.</P>
<P>Cuando configure C-News, probablemente tendr&aacute; que escribir su propio fichero sys. Para ayudarle con ello, incluimos abajo un fichero de ejemplo para vbrew.com, del cual puede copiar lo que necesite.</P><DIR>
<DIR>

<P># Tomamos lo que nos dan.<BR>
ME:all/all::<BR>
<BR>
# Enviamos todo lo que recibimos a moria, excepto los art&iacute;culos locales y<BR>
# relacionados con cerveceras. Usamos proceso por lotes.<BR>
moria/moria.orcnet.org:all,!to,to.moria/all,!local,!brewery:f:<BR>
<BR>
# Mandamos comp.risks a jack@ponderosa.uucp<BR>
ponderosa:comp.risks/all::rmail jack@ponderosa.uucp<BR>
<BR>
# swim obtiene solo algunos grupos<BR>
swim/swim.twobirds.com:comp.os.linux,rec.humor.oracle/all,!local:f:<BR>
<BR>
# Guardar los art&iacute;culos de mapas de correo para procesarlos luego<BR>
usenet-maps:comp.mail.maps/all:F:/var/spool/uumaps/work/batch</P></DIR>
</DIR>

<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="17.4"></a>17.4 El fichero active</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El fichero active esta situado en /usr/lib/news y lista todos los grupos conocidos en su servidor, y los art&iacute;culos disponibles actualmente. Rara vez tendr&aacute; que tocarlo, pero, sin embargo, lo explicamos por completitud. Las entradas tiene la siguiente forma:</P><DIR>
<DIR>

<P>gruponoticias alto bajo perm</P></DIR>
</DIR>

<P>gruponoticias es, por supuesto, el nombre del grupo. bajo y alto son los n&uacute;meros m&aacute;s bajo y m&aacute;s alto de los art&iacute;culos actualmente disponibles. Si no hay ninguno disponible en ese momento, bajo es igual a alto +1.</P>
<P>Al menos, eso es lo que el campo bajo pretende hacer. Sin embargo, por razones de eficiencia, C-News no actualiza este campo. Esto no ser&iacute;a una gran perdida si no hubiera algunos lectores de noticias que dependen de &eacute;l. Por ejemplo, trn comprueba este campo para ver si puede purgar cualquier art&iacute;culo de su base de datos de hilos. Para actualizar el campo bajo, tiene por lo tanto que ejecutar regularmente el comando updatemin (o, en una versi&oacute;n m&aacute;s antigua de C-News, la macro upact).</P>
<P><B>perm</b> es un par&aacute;metro que detalla el tipo de acceso que los usuarios tienen concedido en el grupo. Toma uno de los siguientes valores:</P>
<P><B>y</b> Se permite a los usuarios enviar art&iacute;culos a este grupo.</P>
<P><B>n</b> No est&aacute; permitido a los usuarios enviar art&iacute;culos a este grupo. Sin embargo, el grupo puede todav&iacute;a ser le&iacute;do.</P>
<P><B>x</b> Este grupo ha sido deshabilitado localmente. Esto ocurre algunas veces cuando los administradores de noticias (o sus superiores) se ofenden por art&iacute;culos enviados a ciertos grupos.</P>
<P>Los art&iacute;culos recibidos para estos grupos no son almacenados localmente aunque son reenviados a los servidores que los piden.</P>
<P><B>m</b> Esto denota un grupo moderado. Cuando un usuario intenta enviar un art&iacute;culo a este grupo, un lector de noticias inteligente lo notificar&aacute; al usuario, y en su lugar enviara el art&iacute;culo al moderador. La direcci&oacute;n del moderador se toma del fichero moderators de /usr/lib/news.</P>
<P><B>=real-group<BR>
</b>Esto marca a newsgroup como un alias local para otro grupo, a saber real-group . Todos los art&iacute;culos enviados a gruponoticias ser&aacute;n redirigidos a &eacute;l.</P>
<P>En C-News, generalmente no tendr&aacute; que acceder directamente a este fichero. Los grupos deben ser a&ntilde;adidos o borrados localmente usando addgroup y delgroup (ver abajo en la secci&oacute;n Herramientas y Tareas de Mantenimiento). Cuando se a&ntilde;aden o borran grupos para la Usenet entera, esto se hace habitualmente por medio de un mensaje de control newgroup o rmgroup, respectivamente. ¡Nunca env&iacute;e Ud. un mensaje de este tipo!</P>
<P>Para saber como crear un grupo de noticias, lea los mensajes enviados mensualmente a news.announce.newusers.</P>
<P>Un fichero estrechamente relacionado con active es active.times. Cada vez que se crea un grupo, C-News registra un mensaje en este fichero, conteniendo el nombre del grupo creado, la fecha de creaci&oacute;n, si fue hecho por un mensaje de control newgroup o localmente, y quien lo hizo. Esto es para facilitar la vida a los lectores de noticias, quienes pueden notificar al usuario los grupos reci&eacute;n creados. Tambi&eacute;n lo usa el comando NEWGROUPS de NNTP.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="17.5"></a>17.5 Procesado de art&iacute;culos por lotes</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Los lotes de noticias siguen un formato particular, el cual es el mismo para Bnews, C-News, e INN. Cada art&iacute;culo esta precedido por una l&iacute;nea como esta:</P><DIR>
<DIR>

<P>#! rnews cuenta</P></DIR>
</DIR>

<P>donde cuenta es el n&uacute;mero de bytes en el art&iacute;culo. Cuando se usa la compresi&oacute;n de lotes, el fichero resultante es comprimido como un todo, y precedido por otra l&iacute;nea, que indica el mensaje a ser usado por la descompresi&oacute;n. La herramienta de compresi&oacute;n est&aacute;ndar es compress, la cual se indica con:</P><DIR>
<DIR>

<P>#! cunbatch</P></DIR>
</DIR>

<P>Algunas veces, cuando hay que enviar los lotes usando un software de correo que elimina el octavo bit de todos los datos, se puede proteger un lote usando lo que se llama codificaci&oacute;n C7; estos lotes ser&aacute;n marcados por c7unbatch.</P>
<P>Cuando se le administra un lote a rnews en el servidor remoto, comprueba esas marcas y procesa el lote apropiadamente. Algunos servidores tambi&eacute;n usan otras herramientas de compresi&oacute;n, como gzip, y en su lugar preceden sus ficheros comprimidos con zunbatch. C-News no reconoce cabeceras no est&aacute;ndares como esas; Ud. tiene que modificar el c&oacute;digo fuente para soportarlas.</P>
<P>En C-News, el proceso por lotes de archivos lo realiza /usr/lib/news/bin/batch/sendbatches, el cual recoge la lista de art&iacute;culos del fichero site /togo, y los pone en varios lotes de noticias. Deber&iacute;a ejecutarse una vez cada hora, o incluso mas a menudo, dependiendo del volumen del tr&aacute;fico.</P>
<P>Su operaci&oacute;n es controlada por el fichero batchparms situado en /usr/lib/news. Este fichero describe el m&aacute;ximo tama&ntilde;o de lote permitido para cada servidor, el tipo de proceso por lotes y opcionalmente el programa de compresi&oacute;n a ser usado, y m&eacute;todo de transporte para entregarlo al servidor remoto. Ud. puede especificar los par&aacute;metros del proceso por lotes para cada servidor, adem&aacute;s de un conjunto de par&aacute;metros por defecto para servidores no mencionados expl&iacute;citamente.</P>
<P>Para llevar a cabo el proceso por lotes para un servidor especifico, se invoca como:</P><DIR>
<DIR>

<P># su news -c "/usr/lib/news/bin /batch/sendbatches site "</P></DIR>
</DIR>

<P>Cuando es invocado sin argumentos, sendbatches maneja todas las colas de lotes. La interpretaci&oacute;n de "todas" depende de la presencia de una entrada por defecto en batchparms.</P>
<P>Si se encuentra una, se comprueban todos los directorios de /var/spool/news/out.going, si no, recorre todas las entradas de batchparms. Note que sendbatches, cuando explora el directorio out.going, toma solo aquellos directorios que no contienen ning&uacute;n punto o arroba (@) como nombre de servidor.</P>
<P>Cuando instale C-News, seguramente hallar&aacute; un fichero batchparms en su distribuci&oacute;n que contenga una entrada por defecto razonable, as&iacute; que es muy probable que no tenga que tocar el fichero. No obstante, describimos su formato por si acaso. Cada l&iacute;nea consta de seis campos, separados por espacios o tabuladores:</P><DIR>
<DIR>

<P>site size max batcher muncher transport</P></DIR>
</DIR>

<P>El significado de estos campos es el siguiente:</P>
<P><B>site<BR>
</b>es el nombre del servidor al que se aplica la entrada. El fichero togo para este servidor debe residir en out.going/togo bajo la cola de las noticias. El nombre de servidor /default/ denota la entrada por defecto.</P>
<P><B>size<BR>
</b>es el tama&ntilde;o m&aacute;ximo de los lotes creados (antes de la compresi&oacute;n). Para aquellos art&iacute;culos que son mayores que este valor C-News hace una excepci&oacute;n y los pone en un lote ellos solos.</P>
<P><B>max<BR>
</b>es el m&aacute;ximo n&uacute;mero de lotes creados y programados para la transferencia antes de que el proceso por lotes se pare para este servidor particular. Esto es &uacute;til en el caso de que el servidor remoto no este disponible durante un largo periodo de tiempo, porque previene que C-News ateste sus directorios de cola UUCP con millones de lotes de noticias.</P>
<P>C-News determina el n&uacute;mero de lotes que hay en cola usando el script queulen de /usr/lib/news/bin. La versi&oacute;n newspak de Vince Skahan deber&iacute;a contener un gui&oacute;n para UUCPs compatibles con BNU. Si usa una clase diferente de directorios de cola, por ejemplo UUCP de Taylor, tendr&iacute;a que escribir el suyo propio.6</P>
<P>El campo batcher contiene el comando usado para producir un lote a partir de la lista de art&iacute;culos del fichero togo. Para las fuentes habituales, este es generalmente batcher.</P>
<P>Puede que se proporcionen otros empaquetadores para otros prop&oacute;sitos. Por ejemplo, el protocolo ihave/sendme requiere que la lista de art&iacute;culos sea convertida en mensajes de control ihave/sendme, los cuales se env&iacute;an al grupo to.site. Los comandos encargados de esto son batchih y batchsm.</P>
<P>El campo muncher especifica el comando a usar para la compresi&oacute;n de los lotes. Generalmente, se usa compcun, que es un gui&oacute;n que produce un lote comprimido.7 Alternativamente, puede proporcionar un muncher que use gzip, digamos gzipcun (para ser claros: tiene que escribirlo Ud. mismo). Debe asegurarse de que uncompress en el servidor remoto est&aacute; parcheado para reconocer ficheros comprimidos con gzip.</P>
<P>Si el servidor remoto no tiene un comando uncompress, debe especificar nocomp lo que implica el no hacer ninguna compresi&oacute;n.</P>
<P>El &uacute;ltimo campo, transport , describe el transporte a utilizar. Hay disponibles varios comandos est&aacute;ndar para diferentes transportes cuyos nombres empiezan por v&iacute;a. sendbatches les pasa el nombre del servidor de destino en la l&iacute;nea de comandos. Si la entrada batchparms no era /default/, el nombre del servidor se obtiene del campo site suprimiendo cualquier cosa despu&eacute;s e incluyendo el primer punto o barra inclinada. Si la entrada era /default/, se usan los nombres de directorio de out.going.</P>
<P>_____________________________________________<BR>
6 Si no le importa el n&uacute;mero de ficheros de cola (porque Ud. es la &uacute;nica persona usando el ordenador, y no escribe art&iacute;culos de megabytes), puede reemplazar los contenidos del gui&oacute;n por una simple sentencia exit 0.<BR>
7 Tal como se distribuye con C-News, compcun usa compress con la opci&oacute;n 12 bit, ya que este es el m&iacute;nimo com&uacute;n denominador de la mayor&iacute;a de los servidores. Ud. puede hacer una copia de &eacute;l, llam&eacute;mosla compcun16, y usar la compresi&oacute;n 16 bit. De todas formas, la mejora no es muy impresionante.</P>
<P>&nbsp;</P>
<P>Hay dos comandos que usan uux para ejecutar rnews en el servidor remoto; viauux y viauuxz. El &uacute;ltimo establece el flag -z para (las versiones mas antiguas de) uux para evitar que devuelva mensajes de &eacute;xito por cada art&iacute;culo entregado. Otro comando, viamail, manda lotes de art&iacute;culos al usuario rnews en el sistema remoto v&iacute;a correo. Por supuesto, esto requiere que el sistema remoto administre de alguna manera todo el correo para rnews a su sistema local de noticias. Para obtener una lista completa de estos transportes, refi&eacute;rase a la pagina del manual newsbatch(8).</P>
<P>Todos los comandos de los tres &uacute;ltimos campos deben estar situados, bien en out.going/ site o bien en /usr/lib/news/bin/batch. La mayor&iacute;a de ellos son scripts, de tal forma que Ud. pueda confeccionar f&aacute;cilmente nuevas herramientas para sus necesidades personales. Son invocados con tuber&iacute;as. Se administra la lista de art&iacute;culos al batcher a trav&eacute;s de la entrada est&aacute;ndar, quien produce el lote en su salida est&aacute;ndar. Esta a su vez se entuba en el muncher , y as&iacute; sucesivamente.</P>
<P>Abajo se ofrece un fichero de ejemplo.</P><DIR>
<DIR>

<P># fichero batchparms para la cervecera<BR>
#           site   |   size   |   max  |  batcher |  muncher  |  transport<BR>
#-------------+--------+-------+---------+-----------+-----------<BR>
/default/           100000      22       batcher    compcun     viauux<BR>
swim                10000        10       batcher    nocomp      viauux</P>
<P>&nbsp;</P></DIR>
</DIR>

<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="17.6"></a>17.6 Noticias caducadas</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>En Bnews, la caducidad de las noticias sol&iacute;a realizarse por medio de un programa llamado expire, el cual recib&iacute;a como argumento una lista de grupos de noticias, junto con una especificaci&oacute;n del tiempo despu&eacute;s del cual los art&iacute;culos caducaban. Para hacer que diferentes jerarqu&iacute;as caducaran en momentos distintos, Ud. tenia que escribir un script que invocara a expire para cada uno de ellos de forma individual. C-News ofrece una soluci&oacute;n m&aacute;s conveniente a esto: en un fichero llamado explist, Ud. puede especificar los grupos de noticias y los intervalos de caducidad. Una vez al d&iacute;a se suele ejecutar desde cron un comando llamado doexpire, que procesa todos los grupos de acuerdo a esta lista.</P>
<P>Ocasionalmente, Ud. puede querer mantener art&iacute;culos de ciertos grupos incluso despu&eacute;s de que hayan caducado; por ejemplo, podr&iacute;a querer mantener los programas enviados a comp.sources.unix. A esto se le llama archivado. explist le permite marcar grupos para el archivado.</P>
<P>Una entrada en explist se parece a esto:</P><DIR>
<DIR>

<P>grouplist perm times archive</P></DIR>
</DIR>

<P>grouplist es una lista separada por comas de los grupos de noticias a los que aplica la entrada. Se pueden especificar jerarqu&iacute;as completas indicando el prefijo del nombre del grupo, a&ntilde;adiendo opcionalmente all. Por ejemplo, para una indicar una entrada que se aplique a todos los grupos de comp.os, puede introducir en grouplist o bien comp.os o bien comp.os.all.</P>
<P>Cuando se van a caducar las noticias de un grupo, se contrasta el nombre del grupo con todas las entradas de explist en el orden dado. La entrada empleada es la primera que concuerda. Por ejemplo, para eliminar la mayor&iacute;a de comp despu&eacute;s de cuatro d&iacute;as, excepto comp.os.linux.announce que quiere mantener durante una semana, debe simplemente tener una entrada para lo &uacute;ltimo, que especifique un periodo de caducidad de siete d&iacute;as, seguida por una para comp que especifique cuatro d&iacute;as.</P>
<P>El campo perm detalla si la entrada se aplica a grupos moderados, no moderados, o a cualquier grupo. Debe tomar los valores m, u, o x, lo que designa moderados, no moderados, o cualquier tipo.</P>
<P>El tercer campo, times, contiene usualmente un solo n&uacute;mero. Este es el n&uacute;mero de d&iacute;as despu&eacute;s de los cuales caducaran los art&iacute;culos si no se les ha asignado una fecha de caducidad artificial en el campo Expires: de la cabecera del art&iacute;culo. D&eacute;se cuenta que &eacute;ste es el n&uacute;mero de d&iacute;as contando desde la llegada a su servidor, no desde la fecha de emisi&oacute;n.</P>
<P>Sin embargo, el campo times puede ser mas complejo que eso. Puede ser una combinaci&oacute;n de hasta tres n&uacute;meros, separados unos de otros por un gui&oacute;n. El primero designa el n&uacute;mero de d&iacute;as que tienen que pasar antes de que el art&iacute;culo sea considerado candidato para estar caducado. Rara vez es &uacute;til usar otro valor que no sea cero. El segundo campo es el valor mencionado arriba, es decir, el n&uacute;mero por defecto de d&iacute;as despu&eacute;s de los cuales caducar&aacute;. El tercero es el n&uacute;mero de d&iacute;as despu&eacute;s de los cuales un art&iacute;culo caducar&aacute; incondicionalmente, sin reparar en si tiene un campo Expires: o no. Si solo se indica el n&uacute;mero de en medio, los otros dos toman valores por defecto. Estos pueden especificarse usando la entrada especial /bounds/, que se describe mas abajo.</P>
<P>El cuarto campo, archive, designa si el grupo de noticias tiene que archivarse, y donde. Si no se desea archivarlo, deber&iacute;a usar un gui&oacute;n. De lo contrario, use un nombre de camino absoluto (apuntando a un directorio), o una arroba (@). La arroba designa el directorio de archivo por defecto, cuyo valor debe darse a doexpire usando el flag -a en la l&iacute;nea de comandos. El directorio de archivo debe ser propiedad de news. Cuando doexpire archiva un art&iacute;culo de, digamos, comp.sources.unix, lo almacena en el directorio comp/sources/unix bajo el directorio de archivo, cre&aacute;ndolo si no existe. Sin embargo, no se crear&aacute; el propio directorio de archivo.</P>
<P>Hay dos entradas especiales en su fichero explist de las que depende doexpire. En vez de una lista de grupos de noticias, tienen las palabras clave /bounds/ y /expired/. La entrada /bounds/ contiene los valores por defecto para los tres valores del campo times descrito arriba.</P>
<P>El campo /expired/ determina cuanto tiempo guardara C-News las l&iacute;neas del fichero history. Esto es necesario porque C-News no borrar&aacute; una l&iacute;nea del fichero de historial una vez que el (los) art&iacute;culo(s) correspondiente(s) hayan caducado, pero lo guardara por si acaso llega un duplicado tras esa fecha. Si recibe las noticias de solo un servidor, puede mantener este valor peque&ntilde;o. De lo contrario, un par de semanas es un valor aconsejable para las redes UUCP, dependiendo de los retrasos que Ud. experimente con los art&iacute;culos de esos servidores.</P>
<P>A continuaci&oacute;n se reproduce un fichero explist de ejemplo con unos intervalos de expiraci&oacute;n bastante ajustador.</P><DIR>
<DIR>

<P># Mantiene las l&iacute;neas de historial durante dos semanas. Nadie consigue mas<BR>
# de tres meses<BR>
/expired/ x 14 -<BR>
/bounds/ x 0-1-90 -<BR>
<BR>
# Los grupos que queremos mantener mas tiempo que el resto<BR>
comp.os.linux.announce m 10 -<BR>
comp.os.linux x 5 -<BR>
alt.folklore.computers u 10 -<BR>
rec.humor.oracle m 10 -<BR>
soc.feminism m 10 -<BR>
<BR>
# Archiva los grupos *.sources<BR>
comp.sources,alt.sources x 5 @<BR>
<BR>
# valores por defecto para los grupos de tecnologia<BR>
comp,sci x 7 -<BR>
<BR>
# bastante para un fin de semana largo<BR>
misc,talk x 4 -<BR>
<BR>
# desecha rapidamente lo inservible<BR>
junk x 1 -<BR>
<BR>
# los mensajes de control tambi&eacute;n son de escaso interes<BR>
control x 1 -<BR>
<BR>
# para el resto de ellos la entrada comodin<BR>
all x 2 -</P>
<P>&nbsp;</P></DIR>
</DIR>

<P>Hay un cierto n&uacute;mero de problemas potenciales con la caducidad en C-News. Uno es que su lector de noticias puede depender del tercer campo del fichero active, el cual contiene el n&uacute;mero del art&iacute;culo m&aacute;s bajo disponible. Cuando C-News caduca los art&iacute;culos no actualiza este campo. Si Ud. necesita (o quiere) que este campo represente la situaci&oacute;n real, necesita ejecutar un programa llamado updatemin despu&eacute;s de cada ejecuci&oacute;n de doexpire.8</P>
<P>Segundo, C-News no caduca los art&iacute;culos examinando el directorio de los grupos de noticias, sino que simplemente comprueba en el fichero history si el art&iacute;culo debe caducar.9 Si su fichero de historia consigue de alguna manera estar fuera de sincronismo, sus art&iacute;culos pueden permanecer en su disco duro para siempre, porque C-News los ha olvidado literalmente.10 Puede reparar esto usando el script addmissing de /usr/lib/news/bin/maint, el cual a&ntilde;adir&aacute; los art&iacute;culos perdidos al fichero history, o mkhistory, el cual reconstruye el fichero desde cero. No olvide ser news antes de invocarlo, o de lo contrario terminar&aacute; con un fichero history imposible de leer por C-News.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="17.7"></a>17.7 Ficheros diversos</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Hay algunos ficheros que controlan el comportamiento de C-News, pero no son esenciales para su funcionamiento. Todos ellos residen en /usr/lib/news. Los describiremos brevemente.</P>
<P><B>newsgroups<BR>
</b>Se trata de un fichero que acompa&ntilde;a al fichero active y contiene una lista de nombres de grupos de noticias, junto con una descripci&oacute;n, en una sola l&iacute;nea, de su tema principal. Este fichero se actualiza autom&aacute;ticamente cuando C-News recibe un mensaje de control checknews (ver secci&oacute;n 17.8).</P>
<P><B>localgroups<BR>
</b>Si Ud. tiene grupos locales de los que no quiere que C-News se queje cada vez que Ud. recibe un mensaje checknews, ponga sus nombres y una descripci&oacute;n en este fichero, justo como aparecer&iacute;an en el fichero newsgroups.</P>
<P><B>mailpaths<BR>
</b>Este fichero contiene la direcci&oacute;n del moderador para cada grupo moderado.</P>
<P>Cada l&iacute;nea contiene el nombre del grupo, seguido por la direcci&oacute;n de correo electr&oacute;nico del moderador (separada por un tabulador).</P>
<P>_____________________________________________<BR>
8 En versiones anteriores de C-News, esto era hecho por un script llamado upact.<BR>
9 La fecha de llegada del art&iacute;culo se almacena en el campo de en medio de la l&iacute;nea de historia, dado en segundos desde el 1 de Enero de 1970.<BR>
10 No se porqu&eacute; ocurre esto, a mi me lo hace de vez en cuando.</P>
<P>&nbsp;</P>
<P>Hay dos entradas especiales que son proporcionadas por defecto. Estas son backbone e internet. Ambas proporcionan _en notaci&oacute;n UUCP de signos de admiraci&oacute;n_ el camino al servidor principal mas cercano y el servidor que reconoce direcciones del estilo RFC 822 (user@host). Las entradas por defecto son</P><DIR>
<DIR>

<P>internet backbone</P></DIR>
</DIR>

<P>Ud. no tendr&aacute; que cambiar la entrada internet si no tiene instalado smail o sendmail, porque entienden direccionamiento RFC 822.</P>
<P>La entrada backbone se usa cada vez que un usuario env&iacute;a un mensaje a un grupo moderado cuyo moderador no este listado expl&iacute;citamente. Si el nombre del grupo de noticias es alt.sewer, y la entrada backbone contiene path!%s, C-News enviara por correo el art&iacute;culo a path!alt-sewer, esperando que la m&aacute;quina principal pueda reenviar el art&iacute;culo. Para averiguar que camino usar, pregunte al administrador de noticias del servidor que le pasa las mismas. C&oacute;mo &uacute;ltimo recurso, puede usar tambi&eacute;n uunet.uu.net!%s.</P>
<P><B>distributions<BR>
</b>Este fichero no es realmente un fichero C-News, pero es usado por algunos lectores de noticias y nntpd. Contiene la lista de distribuciones reconocida por su servidor, y una descripci&oacute;n de su efecto (deseado). Por ejemplo, la Cervecera Virtual tiene el siguiente fichero:</P><DIR>
<DIR>

<P>world cualquier lugar del mundo<BR>
local solo local a este servidor<BR>
nl solo Holanda<BR>
mugnet solo MUGNET<BR>
fr solo Francia<BR>
de solo Alemania<BR>
brewery solo Cerveceria Virtual</P>
<P>&nbsp;</P></DIR>
</DIR>

<P><B>log<BR>
</b>Este fichero contiene un registro de todas las actividades de C-News. Se recorta regularmente ejecutando newsdaily; las copias de ficheros de los registro antiguos se guardan en log.o, log.oo, etc.</P>
<P><B>errlog<BR>
</b>Este es un registro de todos los mensajes de error creados por C-News. Estos no incluyen art&iacute;culos desechados debido a grupos incorrectos, etc. De no estar vac&iacute;o en el momento de ejecutar newsdaily, ser&aacute; enviado por correo al administrador de las noticias (usenet por defecto) autom&aacute;ticamente. newsdaily se encarga de limpiar errlog. Las copias antiguas se guardan en errlog.o y compa&ntilde;&iacute;a.</P>
<P><B>batchlog<BR>
</b>Este fichero registra todas las ejecuciones de sendbatches. Normalmente no tiene inter&eacute;s su contenido. Tambi&eacute;n es atendido por newsdaily.</P>
<P><B>watchtime<BR>
</b>Este es un fichero vac&iacute;o que se crea cada vez que se ejecuta newswatch.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="17.8"></a>17.8 Mensajes de Control</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>El protocolo de noticias Usenet reconoce art&iacute;culos de una categor&iacute;a 
  especial, los cuales provocan ciertas respuestas o acciones del sistema. Estos 
  son los llamados mensajes de control. Se reconocen por la presencia de un campo 
  Control: en la cabecera del art&iacute;culo, el cual contiene el nombre de la 
  operaci&oacute;n de control a realizar. Existen varios tipos de ellas, todas 
  ellas manejadas por guiones del interprete de comandos situados en /usr/lib/news/ctl.</P>
<P>La mayor&iacute;a de &eacute;stos realizaran su acci&oacute;n autom&aacute;ticamente 
  en el momento en que C-News procese el art&iacute;culo, sin notificar al administrador 
  de noticias. Por defecto, solo los mensajes checkgroups ser&aacute;n entregados 
  al administrador de noticias,11 pero Ud. puede cambiar esto editando los scripts.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="17.8.1"></a>17.8.1 El Mensaje cancel</P>
</u></I> 
<P>El mensaje mas conocido es cancel, con el cual un usuario puede cancelar un 
  art&iacute;culo enviado por &eacute;l en otro momento. Esto borra el art&iacute;culo 
  de los directorios de cola, si existe. El mensaje cancel se reenv&iacute;a a 
  todos los servidores que reciben noticias de los grupos afectados, sin reparar 
  en si el art&iacute;culo ha sido visto ya o no. Esto es para tener el cuenta 
  la posibilidad de que el art&iacute;culo original se haya retrasado sobre el 
  mensaje de cancelaci&oacute;n. Algunos sistemas de noticias permiten a los usuarios 
  cancelar los mensajes de otras personas. Por supuesto esto es algo que no se 
  deber&iacute;a hacer.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="17.8.2"></a>17.8.2 newgroup y rmgroup</P>
</u></I> 
<P>Dos mensajes que se ocupan de la creaci&oacute;n y borrado de grupos de noticias 
  son los mensajes newgroup y rmgroup. Los grupos de noticias bajo las jerarqu&iacute;as 
  "usuales" solo puede ser creados despu&eacute;s de que se haya mantenido una 
  discusi&oacute;n y voto entre los lectores de Usenet. Las reglas aplicadas a 
  la jerarqu&iacute;a alt permiten algo similar a la anarqu&iacute;a. Para mas 
  informaci&oacute;n, ver los mensajes regulares de news.announce.newusers y news.announce.newgroups. 
  Nunca mande un mensaje newgroup o rmgroup usted mismo a menos que sepa con seguridad 
  que tiene permiso para hacerlo.</P>
<P>_____________________________________________<BR>
  11 Hay una errata divertida en el RFC 1036 (pag.12): "Los implementadores y 
  administradores pueden elegir el permitir que los mensajes de control se lleven 
  a cabo autom&aacute;ticamente, o encolarlos para su proceso anual."</P>
<P><I><U> </u></I></P>
<I><U> 
<P><a name="17.8.3"></a>17.8.3 El Mensaje checkgroups</P>
</u></I> 
<P>Los mensajes checkgroups son mandados por los administradores de noticias para 
  hacer que todos los servidores de una red sincronicen sus ficheros active con 
  la realidad de Usenet. Por ejemplo, los proveedores de servicio de Internet 
  deber&iacute;an mandar tal mensaje a los servidores de sus clientes. Una vez 
  al mes, el moderador del grupo comp.announce.newgroups env&iacute;a el mensaje 
  "oficial" checkgroups para las principales jerarqu&iacute;as. Sin embargo, se 
  env&iacute;a como un art&iacute;culo ordinario, no como un mensaje de control. 
  Para realizar la operaci&oacute;n checkgroups, salve este art&iacute;culo en 
  un fichero, digamos /tmp/check, borre todo hasta el principio del mismo mensaje 
  de control, y env&iacute;e al programa checkgroups usando el siguiente comando:</P>
<DIR> 
  <DIR> 
    <P># su news -c "/usr/lib/news/bin /ctl/checkgroups" &lt; /tmp/check</P>
  </DIR>
</DIR>
<P>Esto actualizara su fichero newsgroups, a&ntilde;adiendo los grupos listados 
  en localgroups. El antiguo fichero newsgroups ser&aacute; movido a newsgroups.bak. 
  Note que rara vez funciona el enviar el mensaje localmente, porque inews rechaza 
  aceptar un art&iacute;culo tan grande.</P>
<P>Si C-News encuentra desigualdades entre la lista checkgroups y el fichero active, 
  producir&aacute; una lista de comandos que actualizar&iacute;a su servidor, 
  y lo enviar&aacute; por correo al administrador de noticias. T&iacute;picamente 
  la salida se parece a esto:</P>
<DIR> 
  <DIR> 
    <P>From news Sun Jan 30 16:18:11 1994<BR>
      Date: Sun, 30 Jan 94 16:18 MET<BR>
      From: news (News Subsystem)<BR>
      To: usenet<BR>
      Subject: Problems with your active file<BR>
      <BR>
      The following newsgroups are not valid and should be removed.<BR>
      alt.ascii-art<BR>
      bionet.molbio.gene-org<BR>
      comp.windows.x.intrisics<BR>
      de.answers<BR>
      <BR>
      You can do this by executing the commands:<BR>
      /usr/lib/news/bin/maint/delgroup alt.ascii-art<BR>
      /usr/lib/news/bin/maint/delgroup bionet.molbio.gene-org<BR>
      /usr/lib/news/bin/maint/delgroup comp.windows.x.intrisics<BR>
      /usr/lib/news/bin/maint/delgroup de.answers<BR>
      <BR>
      The following newsgroups were missing.<BR>
      comp.binaries.cbm<BR>
      comp.databases.rdb<BR>
      comp.os.geos<BR>
      comp.os.qnx<BR>
      comp.unix.user-friendly<BR>
      misc.legal.moderated<BR>
      news.newsites<BR>
      soc.culture.scientists<BR>
      talk.politics.crypto<BR>
      talk.politics.tibet</P>
  </DIR>
</DIR>
<P>&nbsp;</P>
<P>Cuando reciba un mensaje como &eacute;ste de su sistema de noticias, no lo 
  crea ciegamente.</P>
<P>Dependiendo de quien envi&oacute; el mensaje checkgroups, puede que carezca 
  de unos pocos grupos e incluso de jerarqu&iacute;as enteras; por lo tanto deber&iacute;a 
  tener cuidado al borrar cualquier grupo.</P>
<P>Si Ud. encuentra grupos listados como no presentes que quiera tener en su servidor, 
  tiene que a&ntilde;adirlos usando la herramienta addgroup. Salve la lista de 
  grupos que le faltan en un fichero y p&aacute;seselo al siguiente gui&oacute;n:</P>
<DIR> 
  <DIR> 
    <P>#!/bin/sh<BR>
      cd /usr/lib/news<BR>
      <BR>
      while read group; do<BR>
      if grep -si "^$group[[:space:]].*moderated" newsgroup; then<BR>
      mod=m<BR>
      else<BR>
      mod=y<BR>
      fi<BR>
      /usr/lib/news/bin/maint/addgroup $group $mod<BR>
      done</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="17.8.4"></a>17.8.4 sendsys, version, y senduuname</P>
</u></I> 
<P>Finalmente, hay tres mensajes que pueden usarse para averiguar la topolog&iacute;a 
  de la red.</P>
<P>Estos son sendsys, version, y senduuname. Respectivamente, hacen que C-News 
  devuelva al remitente el fichero sys, una cadena con la versi&oacute;n del software, 
  y la salida de uuname(1).</P>
<P>C-News es muy lac&oacute;nica con respecto a los mensajes version; devuelve 
  una simple "C", sin adornos.</P>
<P>Insistimos de nuevo, Ud. nunca deber&iacute;a distribuir tal mensaje, a menos 
  que este seguro de que no puede dejar su red (regional). Las respuestas a los 
  mensajes sendsys pueden hacer caer r&aacute;pidamente una red UUCP.12</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="17.9"></a>17.9 C-News en un Entorno NFS</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Una manera simple de distribuir noticias en una red local es guardar todas 
  las noticias en un nodo central, y exportar los directorios relevantes v&iacute;a 
  NFS, de manera que los lectores de noticias puedan examinar los art&iacute;culos 
  directamente. La ventaja de este m&eacute;todo sobre NNTP es que la sobrecarga 
  implicada en recuperar y enhebrar art&iacute;culos es significativamente mas 
  baja. Por otra parte, NNTP gana en una red heterog&eacute;nea donde el equipamiento 
  var&iacute;a mucho entre nodos, o donde los usuarios no tienen cuentas equivalentes 
  en la m&aacute;quina servidora.</P>
<P>Cuando se usa NFS, los art&iacute;culos enviados al nodo local tienen que ser 
  reenviados a la m&aacute;quina central, porque de otro modo el acceso a los 
  ficheros administrativos expondr&iacute;a al sistema a condiciones de carrera 
  y dejar&iacute;an los ficheros inconsistentes. Tambi&eacute;n Ud. podr&iacute;a 
  querer proteger su &aacute;rea de cola de noticias export&aacute;ndola como 
  s&oacute;lo-lectura, lo cual requiere tambi&eacute;n el reenv&iacute;o a la 
  m&aacute;quina central.</P>
<P>C-News maneja esto transparentemente. Cuando env&iacute;a un art&iacute;culo, 
  su lector de noticias normalmente llamara a inews para inyectar el art&iacute;culo 
  en el sistema de noticias. Este comando ejecuta algunas comprobaciones sobre 
  el art&iacute;culo, completa la cabecera, y comprueba el fichero server en /usr/lib/news. 
  Si este fichero existe y contiene un nombre de nodo diferente del nombre del 
  sistema local, se invoca inews en ese servidor remoto v&iacute;a rsh.</P>
<P>Puesto que el gui&oacute;n inews usa comandos binarios y ficheros de apoyo 
  de C-News, Ud. tiene que tener C-News instalado localmente, o montar el software 
  de noticias desde el servidor.&nbsp;</P>
<P>Para que la invocaci&oacute;n de rsh funcione correctamente, cada usuario debe 
  tener una cuenta equivalente en el sistema del servidor, esto es, una a la que 
  pueda acceder sin necesitar contrase&ntilde;a.</P>
<P>Aseg&uacute;rese de que el nombre del sistema indicado en server coincida literalmente 
  con la salida del comando hostname(1) en la m&aacute;quina servidora, si no 
  C-News entrar&aacute; en un bucle infinito cuando intente entregar el art&iacute;culo.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="17.10"></a>17.10 Herramientas y Tareas de Mantenimiento</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>A pesar de la complejidad de C-News, la vida de un administrador de noticias 
  puede ser bastante f&aacute;cil, porque C-News proporciona una amplia variedad 
  de herramientas de mantenimiento. Es deseable que algunos de &eacute;stos sean 
  ejecutados regularmente desde cron, como newsdaily. El uso de estos programas 
  reduce dr&aacute;sticamente los requisitos diarios de cuidado y administraci&oacute;n 
  de su instalaci&oacute;n de C-News.</P>
<P>_____________________________________________<BR>
  12 Yo tampoco intentar&iacute;a esto en Internet.</P>
<P>&nbsp;</P>
<P>A menos que se indique lo contrario, estos comandos est&aacute;n situados en 
  /usr/lib/news/bin/maint. Note que Ud. debe ser el usuario news antes de invocar 
  estos comandos. Ejecut&aacute;ndolos como super-usuario puede volver estos ficheros 
  inaccesibles a C-News.</P>
<P><B>newsdaily<BR>
  </b>El nombre ya lo dice: ejecutar esto una vez al d&iacute;a. Es un gui&oacute;n 
  importante que le ayuda a mantener los ficheros de registro peque&ntilde;os, 
  conservando copias de cada todos ellos de las tres &uacute;ltimas ejecuciones. 
  Tambi&eacute;n intenta detectar cualquier anomal&iacute;a, como lotes atascados 
  en los directorios de entrada y salida, env&iacute;os a grupos de noticias moderados 
  o desconocidos, etc. Los mensajes de error resultantes ser&aacute;n enviados 
  por correo al administrador de noticias.</P>
<P><B>newswatch<BR>
  </b>Se trata de un script que deber&iacute;a ejecutarse regularmente para buscar 
  anomal&iacute;as en el sistema de noticias, una vez cada hora mas o menos. Esta 
  destinado a detectar problemas que tendr&aacute;n efectos inmediatos en la operatibilidad 
  de su sistema de noticias y enviar un informe de problemas al administrador 
  de noticias. Las cosas comprobadas incluyen ficheros de bloqueo pasados que 
  no fueron borrados, lotes de entrada desatendidos y la falta de espacio de disco.</P>
<P><B>addgroup<BR>
  </b>A&ntilde;ade un grupo localmente a su servidor. La invocaci&oacute;n adecuada 
  es</P>
<DIR> 
  <DIR> 
    <P>addgroup groupname y|n|m|=realgroup</P>
  </DIR>
</DIR>
<P>El segundo argumento tiene el mismo significado que el modificador del fichero 
  active, significando que cualquiera puede enviar un art&iacute;culo al grupo 
  (y), que nadie puede enviar (n), que es moderado (m), o que es un alias para 
  otro grupo (=realgroup ).</P>
<P>Ud. podr&iacute;a querer usar addgroup cuando los primeros art&iacute;culos 
  de un grupo reci&eacute;n creado lleguen antes que el mensaje de control newgroup 
  destinado a crearlo.</P>
<P><B>delgroup<BR>
  </b>Le permite borrar localmente un grupo. Inv&oacute;quelo como</P>
<DIR> 
  <DIR> 
    <P>delgroup groupname</P>
  </DIR>
</DIR>
<P>Todav&iacute;a tiene que borrar los art&iacute;culos que permanecen el directorio 
  de cola del grupo de noticias. Aunque se puede dejar esta tarea al proceso natural 
  de expiraci&oacute;n de los art&iacute;culos.</P>
<P><B>addmissing<BR>
  </b>A&ntilde;ade art&iacute;culos perdidos al fichero historial. Ejecute este 
  gui&oacute;n cuando haya art&iacute;culos que parezcan quedarse para siempre.13</P>
<P><B>newsboot<BR>
  </b>Este gui&oacute;n se deber&iacute;a ejecutar cuando arranca el sistema. 
  Elimina cualquier fichero de bloqueo que se dejo atr&aacute;s cuando se mataron 
  los procesos al apagar, y cierra y ejecuta cualquier lote dejado por las conexiones 
  NNTP que se cerraron cuando se apago el sistema.</P>
<P><B>newsrunning<BR>
  </b>Este reside en /usr/lib/news/bin/input, y puede ser usado para deshabilitar 
  el desempaquetado de los lotes de noticias entrantes, por ejemplo durante las 
  horas de trabajo. Ud. puede desconectar el desempaquetado de lotes invocando</P>
<DIR> 
  <DIR> 
    <P>/usr/lib/news/bin /input/newsrunning off</P>
  </DIR>
</DIR>
<P>Se conecta usando on en vez de off.</P>
<P>_____________________________________________<BR>
  13 ¿Alguna vez se ha preguntado como librarse del art&iacute;culo "¡Ayuda! ¡¡¡No 
  puedo hacer que las X11 funcionen con 0.97.2!!!"?</P>
</FONT>
</BODY>
</HTML>
