<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl18</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl17.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl19.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 18</P>
</font></B><P ALIGN="CENTER"><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>Una descripci&oacute;n de NNTP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
</FONT>
<dir> 
    <p><font face="Verdana" size="2"><a href="garl18.htm#18.1">18.1 Introducci&oacute;n</a><br>
      <a href="garl18.htm#18.2">18.2 Instalaci&oacute;n del servidor NNTP</a><br>
      <a href="garl18.htm#18.3">18.3 Restricciones de acceso NNTP</a><br>
      <a href="garl18.htm#18.4">18.4 Autorizaci&oacute;n NNTP</a><br>
      <a href="garl18.htm#18.5">18.5 Interacci&oacute;n de nntpd con Cnews</a></font></p>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="18.1"></a>18.1 Introducci&oacute;n</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El NNTP proporciona una forma de intercambio de noticias totalmente diferente de Cnews, para adaptarse a los protocolos de transporte usados en la Red. NNTP son las siglas de "Network News Transfer Protocol" (Protocolo de Transferencia de Noticias de Red), y no consiste en un paquete de programas en particular, sino que es un est&aacute;ndar de Internet1 Esta basado en una comunicaci&oacute;n orientada a la conexi&oacute;n _generalmente sobre TCP_ entre un cliente en alg&uacute;n lugar de la red, y un servidor que almacena las noticias en disco.</P>
<P>La conexi&oacute;n de flujo permite al cliente y al servidor negociar la transferencia de art&iacute;culos interactivamente, sin apenas retrasos, manteniendo bajo el n&uacute;mero de art&iacute;culos duplicados.</P>
<P>Junto con los altos ratios de transferencia de Internet, esto supone un transporte de noticias que supera ampliamente a las redes UUCP originales. Mientras que hace algunos a&ntilde;os no era extra&ntilde;o que un articulo tardase dos semanas o m&aacute;s en llegar hasta el &uacute;ltimo rinc&oacute;n de Usenet, ahora suele tardar menos de dos d&iacute;as; en la propia Internet, es incluso cuesti&oacute;n de minutos.2</P>
<P>Varios comandos permiten a los clientes obtener, enviar y publicar art&iacute;culos. La diferencia entre enviar y publicar es que esto &uacute;ltimo puede incluir a art&iacute;culos con cabeceras incompletas.3 La obtenci&oacute;n de art&iacute;culos puede ser usada por clientes de transporte de noticias o por lectores de noticias. Esto hace del NNTP una excelente herramienta para proporcionar acceso a muchos clientes de una red local sin tener que pasar por las dificultades que implica usar NFS.</P>
<P>_____________________________________________<BR>
1 Especificado formalmente en la RFC 977.<BR>
2 N. del T.: Parece ser que el autor tiene la fortuna de no conocer los servidores espa&ntilde;oles.<BR>
3 Cuando se publica un articulo mediante NNTP, el servidor siempre a&ntilde;ade como m&iacute;nimo un campo en la cabecera: NNTP-Posting-Host:, que contiene el nombre del sistema del cliente.</P>
<P>&nbsp;</P>
<P>El NNTP tambi&eacute;n proporciona una forma activa y otra pasiva de transmitir las noticias, llamadas coloquialmente "empujar" y "tirar". Empujar es b&aacute;sicamente lo mismo que el protocolo ihave/sendme de Cnews. El cliente ofrece un articulo al servidor a trav&eacute;s del comando "IHAVE &lt;msgid&gt;", a lo que el servidor responde con un c&oacute;digo que indica si ya tiene el art&iacute;culo o si lo quiere. En el &uacute;ltimo caso, el cliente env&iacute;a el art&iacute;culo, terminado en un solo punto en una l&iacute;nea separada.</P>
<P>Empujar las noticias tiene la &uacute;nica desventaja de que consume muchos recursos del servidor, ya que &eacute;ste tiene que buscar en su archivo hist&oacute;rico para cada art&iacute;culo.</P>
<P>La t&eacute;cnica opuesta es tirar de las noticias, en la que el cliente solicita una lista de todos los art&iacute;culos disponibles en un grupo que hayan llegado despu&eacute;s de una fecha especificada.</P>
<P>La consulta es llevada a cabo por el comando NEWNEWS. De la lista de identificativos de mensaje obtenida, el cliente selecciona aquellos que aun no tenga, usando el comando ARTICLE para obtener cada uno de ellos.</P>
<P>El problema de esta t&eacute;cnica es que necesita un estricto control por parte del servidor, que debe tener en cuenta que grupos y distribuciones permite solicitar al cliente. Por ejemplo, debe asegurarse de que ning&uacute;n material confidencial de sus grupos locales sea enviado a clientes no autorizados.</P>
<P>Existe tambi&eacute;n cierto n&uacute;mero de comandos convenientes para los lectores de noticias que permiten obtener la cabecera del articulo y el cuerpo del mismo separadamente, o incluso solo ciertos campos de la cabecera de un rango de art&iacute;culos. Esto permite mantener todas las noticias en un servidor central, con todos los usuarios de la red (presumiblemente local) utilizando programas clientes basados en el NNTP para leer y publicar. Esto es una alternativa a exportar los directorios mediante NFS tal como se describe en el cap&iacute;tulo 17.</P>
<P>Un problema extendido en NNTP es que permite a gente con los conocimientos suficientes insertar art&iacute;culos con remitentes falsos en el flujo de noticias. Esto se conoce como falsificar las noticias.4 Una extensi&oacute;n del NNTP permite requerir autentificaci&oacute;n del usuario para ciertos comandos.</P>
<P>Hay cierto n&uacute;mero de paquetes NNTP disponibles. Uno de los mas conocidos es el demonio NNTP, tambi&eacute;n conocido como la implementaci&oacute;n de referencia. Fue escrito originalmente por Stan Barber y Phil Lapsley para ilustrar los detalles de la RFC 977. Su versi&oacute;n m&aacute;s reciente es nntpd-1.5.11, que se describir&aacute; a continuaci&oacute;n. Usted puede obtener el c&oacute;digo fuente y compilarlo por su cuenta, o usar el nntpd del paquete binario net-std de Fred van Kempen. No se proporcionan ejecutables del nntpd listos para funcionar, ya que varios valores espec&iacute;ficos de cada sistema deben ser introducidos antes de la compilaci&oacute;n.</P>
<P>_____________________________________________<BR>
4 El mismo problema existe con el SMTP, el Simple Mail Transfer Protocol (Protocolo Simple para Transferencia de Correo).</P>
<P>&nbsp;</P>
<P>El paquete nntpd consiste en un servidor y dos clientes para empujar y tirar de las noticias, respectivamente, as&iacute; como un sustituto para inews. Est&aacute;n pensados para trabajar en el entorno de Bnews, pero trabaj&aacute;ndoselo un poco lo har&aacute;n con Cnews sin demasiada dificultad. Sin embargo, si planea Vd. usar el NNTP para algo mas que ofrecer acceso a su servidor a los lectores de noticias, la implementaci&oacute;n de referencia no es realmente una opci&oacute;n. Por tanto, discutiremos solamente el demonio NNTP contenido en el paquete nntpd, dejando de lado los programas clientes.</P>
<P>Tambi&eacute;n hay un paquete llamado "InterNet News", o INN para abreviar, escrito por Rich Salz. Este paquete proporciona tanto transporte NNTP como UUCP, y es el m&aacute;s adecuado para grandes servidores. En lo que a transporte NNTP se refiere, es definitivamente mejor que nntpd. La versi&oacute;n actual de INN es inn-1.4sec. Existe un paquete de Arjan de Vet para construir INN en una maquina Linux; esta disponible en sunsite.unc.edu en el directorio system/Mail. Si quiere configurar INN, por favor rem&iacute;tase a la documentaci&oacute;n que acompa&ntilde;a al c&oacute;digo fuente, as&iacute; como al FAQ de INN, publicado regularmente en news.software.b.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="18.2"></a>18.2 Instalaci&oacute;n del servidor NNTP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El servidor NNTP se llama nntpd, y puede ser compilado de dos maneras, seg&uacute;n el tr&aacute;fico que se espera que soporte el sistema de noticias. No hay versiones compiladas disponibles, ya que algunos valores por defecto dependientes del sistema en que se vaya a instalar deben ser especificados antes de la compilaci&oacute;n. Toda la configuraci&oacute;n se hace a trav&eacute;s de macros #define en common/conf.h.</P>
<P>nntpd puede ser configurado como un servidor independiente que se inicie desde rc.inet2 al arrancar, o como un demonio controlado por inetd. En el &uacute;ltimo caso se tendr&aacute; que a&ntilde;adir la siguiente entrada en /etc/inetd.conf:</P><DIR>
<DIR>

<P>nntp stream tcp nowait news /usr/etc/in.nntpd nntpd</P></DIR>
</DIR>

<P>Si configura Vd. nntpd como servidor independiente, aseg&uacute;rese de que la l&iacute;nea anterior esta comentada en inetd.conf. En cualquier caso, tendr&aacute; Vd. que asegurarse de que existe la siguiente l&iacute;nea en /etc/services:</P><DIR>
<DIR>

<P>nntp 119/tcp readnews untp # Network News Transfer Protocol</P></DIR>
</DIR>

<P>Para almacenar temporalmente los art&iacute;culos que llegan al sistema, etc, nntpd tambi&eacute;n necesita un subdirectorio .tmp en el directorio de almacenamiento de noticias. Puede Vd. crearlo usando</P><DIR>
<DIR>

<P># mkdir /var/spool/news /.tmp<BR>
# chown news.news /var/spool/news /.tmp</P>
<P>&nbsp;</P></DIR>
</DIR>

</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="18.3"></a>18.3 Restricciones de acceso NNTP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El acceso a los recursos NNTP se rige por el fichero nntp_access en /usr/lib/news. Las l&iacute;neas del fichero describen los derechos de acceso para ordenadores ajenos. Cada l&iacute;nea tiene el siguiente formato:</P><DIR>
<DIR>

<P>site read|xfer|both|no post|no [!exceptgroups]</P></DIR>
</DIR>

<P>Si un cliente se conecta al puerto NNTP, nntpd intenta obtener su nombre completo en la red a partir de su direcci&oacute;n IP. El nombre del ordenador del cliente y su direcci&oacute;n IP son contrastados con el campo site de cada entrada, en el mismo orden en el que aparecen en el fichero. Las coincidencias pueden ser parciales o exactas. Si una entrada coincide exactamente, se aplica; si la coincidencia es parcial, solo se aplica si no hay otra entrada posterior igual o mejor. site puede especificarse de una de las siguientes formas:</P>
</FONT><B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>nombre del ordenador<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Este es el nombre completo del ordenador. Si coincide literalmente con el nombre can&oacute;nico del cliente, se aplica directamente esta entrada ignor&aacute;ndose las siguientes.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>direcci&oacute;n IP<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esta es la direcci&oacute;n IP representada por cuatro n&uacute;meros separados por puntos. Si la direcci&oacute;n IP del cliente coincide con ella, se aplica la entrada ignor&aacute;ndose las siguientes.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>nombre del dominio<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esto es un nombre de dominio, especificado como *.dominio . Si el dominio del cliente coincide con &eacute;l, se aplica la entrada.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>nombre de la red<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esto es el nombre de una red tal y como se especifica en /etc/networks. Si el n&uacute;mero de red de la direcci&oacute;n IP del cliente coincide con el n&uacute;mero de red asociado al nombre de la red, se aplica la entrada.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>default<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Es la entrada por omisi&oacute;n; se aplica a cualquier cliente.</font></P><FONT FACE="Verdana" SIZE=2>
<P>Las entradas con especificaciones mas generales deber&iacute;an ser introducidas al principio del fichero, ya que despu&eacute;s pueden ser descartadas al encontrarse mejores coincidencias en entradas posteriores.</P>
<P>Los campos segundo y tercero describen los derechos de acceso que se otorgan al cliente. </P>
<P>El segundo detalla los permisos de lectura (read) y transmisi&oacute;n por empuje (xfer) de noticias. </P>
<P>El valor both habilita ambos, el valor no niega el acceso a los dos. El tercer campo detalla si el cliente puede publicar art&iacute;culos, es decir, enviar art&iacute;culos con informaci&oacute;n incompleta en la cabecera que ser&aacute; completada por los programas de noticias. Si el segundo campo contiene no, el tercero es ignorado.</P>
<P>El cuarto campo es opcional. Contiene una lista de grupos separados por comas a los que el cliente no puede acceder.</P>
<P>A continuaci&oacute;n se muestra un fichero nntp_access de ejemplo:</P><DIR>
<DIR>

<P>#<BR>
# por defecto, cualquiera puede transferir noticias, pero no<BR>
# leerlas o publicarlas<BR>
default xfer no<BR>
#<BR>
# public.vbrew.com ofrece acceso publico via modem, as&iacute; que les<BR>
# dejamos leer y publicar en cualquier grupo menos en los local.*<BR>
public.vbrew.com read post !local<BR>
#<BR>
# el resto de ordenadores de vbrew.com puede leer y publicar<BR>
*.vbrew.com read post</P>
<P>&nbsp;</P></DIR>
</DIR>

</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="18.4"></a>18.4 Autorizaci&oacute;n NNTP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Al poner en may&uacute;sculas los elementos del fichero nntp_acces, tales como xfer o read, nntpd exige que el cliente este autorizado para realizar dichas operaciones. Por ejemplo, si se especifica el permiso Xfer o XFER, nntpd no dejara transmitir art&iacute;culos al cliente a menos que &eacute;ste acredite que esta autorizado.</P>
<P>El proceso de autorizaci&oacute;n se lleva a cabo por un nuevo comando del NNTP llamado AUTHINFO. Usando este comando, el cliente transmite un nombre de usuario y una contrase&ntilde;a al servidor NNTP. nntpd los validara comprobando el fichero /etc/passwd, y verificando que el usuario pertenece al grupo nntp.</P>
<P>Lo actual implementaci&oacute;n de la autorizaci&oacute;n NNTP es solo experimental, por lo que no se ha hecho muy portable. Por ello solo funcionara con ficheros /etc/passwd normales; el shadow password no esta soportado.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="18.5"></a>18.5 Interacci&oacute;n de nntpd con Cnews</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Cuando recibe un articulo, nntpd debe pasarlo al sistema de noticias. Dependiendo de si lo recibi&oacute; mediante el comando IHAVE o el POST, lo enviara a rnews o inews, respectivamente. En vez de llamar a rnews, nntpd tambi&eacute;n puede configurarse (antes de la compilaci&oacute;n) para empaquetar los art&iacute;culos entrantes, y dejar los paquetes resultantes en el directorio /var/spool/news/in.coming, donde ser&aacute;n procesados por relaynews la pr&oacute;xima vez que se le invoque.</P>
<P>Para llevar a cabo con &eacute;xito el protocolo ihave/sendme, nntpd tiene que poder acceder al fichero hist&oacute;rico history. Por tanto, antes de la compilaci&oacute;n hay que asegurarse de que la ruta a dicho fichero esta correctamente especificada. Tambi&eacute;n hay que asegurarse de que Cnews y nntpd usen el mismo formato de fichero hist&oacute;rico. Cnews usa funciones dbm para acceder al fichero; sin embargo hay bastantes implementaciones ligeramente incompatibles de la librer&iacute;a dbm. Si Cnews esta enlazado con una librer&iacute;a dbm distinta a la de libc, tambi&eacute;n deber&aacute; enlazarse nntpd con dicha librer&iacute;a.</P>
<P>Un s&iacute;ntoma t&iacute;pico de que nntpd y Cnews discrepan en el formato del fichero hist&oacute;rico son los mensajes de error de que nntpd no puede abrirlo, o la recepci&oacute;n de art&iacute;culos duplicados por NNTP. Una prueba conveniente es coger un articulo del sistema, hacer telnet por el puerto del nntpd, y ofrec&eacute;rselo a nntpd tal como se muestra en el ejemplo de abajo.</P>
<P>Por supuesto, deber&aacute; reemplazarse &lt;msg@id&gt; con el identificativo del articulo que quiera ofrecerse a nntpd.</P><DIR>
<DIR>

<P>$ telnet localhost nntp<BR>
Trying 127.0.0.1...<BR>
Connected to loalhost<BR>
Escape characters is '^]'.201 vstout NNTP[auth] server version 1.5.11t (16 November 1991) ready at<BR>
Sun Feb 6 16:02:32 1194 (no posting)<BR>
IHAVE &lt;msg@id&gt;<BR>
435 Got it.<BR>
QUIT</P></DIR>
</DIR>

<P>Este di&aacute;logo muestra la reacci&oacute;n correcta de nntpd : el mensaje "Got it" indica que ya tiene dicho articulo. En cambio, si se obtuviese un mensaje como "335 Ok", significar&iacute;a que nntpd no ha podido acceder adecuadamente al fichero hist&oacute;rico. Cierre la sesi&oacute;n telnet con Ctrl-D. Puede comprobar que ha ido mal revisando el archivo de registro (log) del sistema; nntpd env&iacute;a todo tipo de mensajes a syslog. El uso de una librer&iacute;a dbm incompatible suele reflejarse en un mensaje que indica que dbminit ha fallado.</P></FONT></BODY>
</HTML>
