<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="fr">
<HEAD>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<TITLE>LinuxFocus Juillet 1998 </TITLE>
</HEAD>

<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Page d'accueil" href="../index.shtml">
<AREA shape="rect" coords="423, 9, 457, 30" alt="Carte" href="../map.html">
<AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="../Themes/index.html">
<AREA shape="rect" coords="514, 9, 558, 30" alt="Recherche" href="../Search/index.html">
</MAP>
<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15" alt="Nouvelles" href="../../English/News/index.html">
<AREA shape="rect" coords="189, 0, 284, 15" alt="Archives" href="../Archives/index.html">
<AREA shape="rect" coords="319, 0, 395, 15" alt="Liens" href="../Links/index.html">
<AREA shape="rect" coords="436, 0,  523, 15" alt="A propos de LF" href="../aboutus.html">
</MAP>

<CENTER>
<IMG src="../../common/images/../../common/images/Topbar-fr.gif" width="600" height="40" border="0" alt="[Top Bar]" ismap usemap="#top" ><BR>
<IMG src="../../common/images/../../common/images/Bottombar-fr.gif" width="600" height="21" border="0" alt="[Bottom Bar]" ismap usemap="#bottom">
</CENTER>
<CENTER>
<H1> <FONT color="#ff0000">Linux Focus de Juillet</FONT>   1998</H1>
</CENTER>

<TABLE  align="center" width="75%"  cellspacing="0" cellpadding="15" border="0">

<TR>
<TD>
<IMG src="../../common/images/July1998.jpg" alt="Cover Picture" width="198" height="149" align="left">

</TD>

<TD align="top">
Voici le nouveau num&eacute;ro du premier magazine
multilingue libre de Web pour et par des utilisateurs de Linux.  Notre
couverture de juillet montre la mascotte de LF dans la baie de San Francisco.,
Ceci symbolise la fin d'une &eacute;poque pour  LinuxFocus
et  le d&eacute;but d'une nouvelle
&egrave;re.  
LinuxFocus se d&eacute;place de Pittsburgh &agrave;
San Fransisco, ce sera un changement passionnant &eacute;tant donn&eacute;
le nombre et la force des utilisateurs de Linux dans la Silicon Valley. 
LF fera son possible pour vous apporter des histoires et des entrevues
 int&eacute;rieurs d'une communaut&eacute; enthousiaste.
</TD>


</TR>

<TR>

<TD colspan="2">
<B>Merci Upv</B><BR>
<IMG src="bescut.gif" width="75" height="73" alt="UPV Stamp" align="right">
Ce nouveau num&eacute;ro de notre magazine vous apporte un m&eacute;lange
d' articles s'&eacute;tendant du graphiques &agrave; la s&eacute;curit&eacute;
 syst&egrave;me.  Nous souhaitons remercier tous les auteurs partageant avec nous
leurs connaissances et leurs travails, mais ce mois nous voudrions
remercier en particulier les &eacute;tudiants et le personnel du service
informatique
<I>de l'universit&eacute; polytechnique de Valencia</I> (UPV) pour leur nombreux  articles, traductions, et leur chaleureux
support.
</TD>

</TR>

</TABLE>

<HR size=1 noshade>

<TABLE align="center" width="100%"  cellspacing="0" cellpadding="15" border="0">

<TR>

<TD width="40%" valign="top">

<FONT size=-1>
<B>Nouveaux produits et services de Linux. </B> <BR> 

<P><i> CrossWind Technologies </i> a r&eacute;cemment sortie
(juin 23, 1998) 
<A href="http://www.crosswind.com">
CyberScheduler 2,1</A> pour Linux, calendrier et agenda bas&eacute;s sur le WEB pour le travail de groupes.
.Il fonctionne avec le serveur  web Apache
et supporte n'importe quel navigateur.  Les formats RPM et TAR sont
disponibles pour  l'installation .

</P>

<P>Il y a une nouveau forum de discussion Linux accessible &acute; partir du 
Web, celui-ci est disponible pour des discussions sur les sujets de linux, pour des 
questions, pour des HOWTOs en ligne, etc...  Il est nomm&eacute; est <I>Linux-Chat</I> et il peut &ecirc;tre consult&eacute; par l'interm&eacute;diaire de
telnet (linux.intergrafix.net 5000) ou <A href="http://www.intergrafix.net/linux/java">  d'une applet Java </A>.</P>

<P><B>La page des consultants LF </B> est gratuite 
pour l'acc&egrave;s aux articles dans sa totalit&eacute;.  Par cons&eacute;quent nous
n'avons pas de fonds pour payer aux auteurs et aux traducteurs leur
travail.  N&eacute;anmoins nous sentons que nous devons &agrave; beaucoup de
gens quelque chose pour leurs efforts soutenus &aacute; animer 
ce magazine.  A partir de septembre 1998 LF cr&eacute;era une "page de
consultants", chaque auteur et collaborateur du magazine aura un
petit espace pour pr&eacute;senter ses
qualifications, son d'email ou ses pages Web.  Nous pr&eacute;voyons que ce nouveau
service sera non seulement une bonne mani&egrave;re de r&eacute;tribuer nos
collaborateurs mais &eacute;galement de bonnes sources d'information pour la
communaut&eacute; Linux.</P>


</FONT>

</TD>

<TD  width="60%" valign="top" >

<FONT size=-1>
<P><B>Qu'est ce que <FONT color="#ff0000">Linux Focus</FONT>?</B> Nous
sommes des passion&eacute;s de Linux (partout dans le monde) , notre
but est de faire le meilleur magazine en ligne sur Linux sans
ignorer la pluralit&eacute; de sa communaut&eacute;.  Nous &eacute;crivons et traduisons tous
nos articles dans diverses langues aidant de ce fait &agrave; rendre accesible 
a de nouvelles et plus jeunes personnes le monde merveilleux de Linux et
d'Unix.  Contrairement &agrave; ce que vous avez pu lire sur le Web, notre
magazine ne peut pas &ecirc;tre vraiment d&eacute;crit comme une collection "de trucs et astuces".
Nous visons
&agrave; fournir des informations d&eacute;taill&eacute;es, nous avons des s&eacute;ries
d'articles sur des sujets sp&eacute;cifiques. Les lecteurs
voyagent avec la s&eacute;rie ils peuvent faire la transition qui consiste &agrave;
partir de l&ecute:tat de d&eacute;butant &agrave; celui d' utilisateur avanc&eacute;.
</P>

<P><B>Dans combien de langues <FONT color="#ff0000"> Linux Focus</FONT> est il traduit ?</B>
Il est difficile de le dire parce que notre personnel continue &agrave; se d&eacute;velopper.  
Il y a quatres &eacute;quipes  d&eacute;j&agrave; bien
d&eacute;velopp&eacute;s :  Anglais, fran&ccedil;ais, Allemand
et Espagnol.  Il y a &eacute;galement de plus petits groupes dont le nombre
de personnes fluctue  et qui travaillent sur d'autres versions:  Russe,
Italien, Portugais, Hollandais.  Nous voudrions voir ces groupes 
devenir plus forts et plus stables.  Nos portes sont toujours ouvertes
aux nouvelles personnes, si vous voulez en faire partie, contactez 
l'&eacute;diteur  LF appropri&eacute; dans "<A href="../aboutus.html"> A propos de LF</A>" et
&eacute;crivez nous.  Nous sommes toujours heureux de voir de nouveaux
visages.
</P>


<P><B>Au sujet du copyright et des droits:</B> toute la
mati&egrave;re de notre site web est propri&eacute;t&eacute; de leurs auteurs 
respectifs.  <FONT color="#ff0000"> Linux Focus</FONT> ne poss&egrave;de pas
de copyright sur les articles soumis.  Le mati&egrave;re fournie par LF
sous la forme du magazine est distribu&eacute; avec le consentement implicite
des auteurs.  Les auteurs nous donnent &eacute;galement la permission de
traduire et distribuer les articles librement par
l'interm&eacute;diaire du Web, ftp, tous les autres medias, toujours dans le
contexte du magazine.  LF autorise seulement l'usage
non-commercial de ses articles.  Pour utiliser des articles et des
traductions de LF dans des buts commerciaux vous devez en demander la
permission explicite aupr&egrave;s des auteurs et/ou de l'&eacute;ditorial de LF.
</P> 


</FONT>

</TD>

</TR>


<TR>
<TD colspan="2">
<H2>Nos Sponsors</H2>
      <A href="http://www.nova.es"><IMG src="../../common/sponsors/nova.gif" alt="Nova Internet" width="100" height="100"></A>
      <A href="http://www.ctv.es"><IMG src="../../common/sponsors/ctv.gif" alt="CTV" width="100" height="100"></A>
      <A href="http://www.penguincomputing.com"><IMG src="../../common/sponsors/penguinc.gif" alt="Penguin Computing" width="160" height="80"></A>
      <HR size=1 noshade>

      <H3><FONT face="Helvetica, Arial" color="#660033">Table des mati&egrave;res</FONT></H3>
       <H4><FONT face="Helvetica, Arial" color="#660033">Revues De Mat&eacute;riel Et De Logiciel</FONT></H4>
       <UL>
      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
      <A href="article55.html">La suite de StarOffice (Le traitement de texte) </A> 
      par <A href="mailto:iripoll@disca.upv.es"> Ismael Ripoll  </A>  
      <BR>C'est le deuxi&egrave;me article sur la suite StarOffice.
 Dans le premier, après pass&eacute; en revue la
suite enti&egrave;re, nous nous sommes concentr&eacute;s sur la conception des
pr&eacute;sentations.  Maintenant, avec le deuxi&egrave;me article sur cette
s&eacute;rie, nous ferons face &agrave; l'outil principal des suites bureautiques:
  l'&eacute;diteur de texte.      

</LI>

      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
      <A href="article59.html">  MySQL.  Un serveur de base de donn&eacute;es</A> 
      par <A href="mailto:fgcia@correoweb.com"> Jose M. Fern&aacute;ndez   </A> 
      <BR>MySQL est un serveur de base de donn&eacute;es de SQL (langage
d'interrogation structur&eacute;) support&eacute; par un certain nombre de
plate-formes, y compris Linux. 
</LI>
      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
      <A href="article52.html">  Enlightenment  </A> 
      par <A href="mailto:coreyg@mindspring.com"> Geoffrey W. Corey  </A>
      <BR>Enlightenment   est un gestionnaire de fen&ecirc;tr&egrave;s fortement
param&eacute;trable pour Linux. Cet article expose les fonctionnalités,
l'installation, et la personnalisation d'Enlightenment.
 La version en cours d'Enlightenment  est
encore consid&eacute;r&eacute;e comme une version de d&eacute;veloppement.  Vous devez avoir 
une bonne connaissance des processus de compilation sous Linux.      
</LI>
      </UL>

      <H4><FONT face="Helvetica, Arial" color="#660033">Syst&egrave;me</FONT></H4>
      <UL>
      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>

      <A href="article60.html">Ajouter la s&eacute;curit&eacute; aux distributions standard de Linux  </A> 
      par <A href="mailto:mike@westphila.net">  Michael Jastremski   </A> 
      <BR>Cet article discute des moyens par lesquels les administrateurs de systèmes Linux
      peuvent stopper les intrus.  Il
      discute plusieurs voies d'am&eacute;lioration sur la s&eacute;curit&eacute; des syst&egrave;mes 
Linux. </LI>



      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
   <A href="article61.html"> TCPD et pare-feux avec IPFWADM  </A> 
      par <A href="mailto:javipolo@infomail.lacaixa.es" >  Javi Polo   </A> 
      <BR>Cet article décrit brièvement comment configurer les services inetd afin d'améliorer la sécurité de votre système. Les détails
     se concentrent sur l'outils IPFWADM pour administrer et configurer les services inetd.</LI>
      </UL>
     <H4><FONT face="Helvetica, Arial" color="#660033">Programmation</FONT></H4>

     <UL>

     <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>

      <A href="article57.html"> Programmer en Java. Partie I</A> 
      par <A href="mailto:fgcia@correoweb.com"> Jose M. Fern&aacute;ndez </A> 
      <BR>Voici le premier article d'une série sur la programmation en Java.
 La première partie décriera le langage Java, ses
caractéristiques générales et les sources d'informations utiles.</LI>


      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
     <A href="article58.html">Didacticiel SQL Partie II </A> 
      par <A href="mailto:manu@europa3.com"> Manuel Soriano   </A> 
      <BR>la seconde partie de ce didacticiel décrit plusieurs instructions de base du langage SQL.</LI>
     </UL>

     <H4><FONT face="Helvetica, Arial" color="#660033">Le coin du Graphiste</FONT></H4>
    <UL>
      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
      <A href="article51.html">
      Créer et éditer une Animation avec GIMP </A> 
      par <A href="mailto:phil@ryoko.cis.pitt.edu"> Phil Ross </A>
      <BR>Dans cet article nous allons décrire queques techniques simples de création et d'édition d'animation grace au logiciel GIMP.
      </LI>

      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
      <A href="article50.html">Conception de structure itérative avec POVRAY. Partie III  </A> 
      par <A href="mailto:acastro@ctv.es"> Antonio Castro  </A>
     <BR>Cette article est le troisième de la série POVRAY. En juillet, l'auteur explore l'utilisation
	des structure itératives et les superbes images qu'elles peuvent générer.</LI>
       <LI>
        <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
      <A href="article62.html"> RenderMan: Les bases du placement des Cameras</A> 
      par <A href="mailto:ccgrau@disca.upv.es"> Carlos Calzada   </A> 
      <BR>Dans ce second article sur RenderMan, nous verons la configutation et le positionnement
       de la camera, mais aussi quelques effets sp&eacute;ciaux. Bien que le positionnement ne soit
	pas aussi intuitif qu'avec Pov-Ray, il est plus performant en terme de trajectoire de caméras. Une partie
	de ce dernier point sera traitée dans un troisième article.</LI>
     </UL>
     <H4><FONT face="Helvetica, Arial" color="#660033">Les notions de bases d'UNIX</FONT></H4>
      <UL>
      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
     <A href="article53.html">  
     Expressions Régulieres</A> 
      par <A href="mailto:guido@bearix.oche.de"> Guido Socher  </A>
      <BR>Les expressions régulières peuvent &ecirc;tre utilisées pour des recherches ou des modifications dans des fichiers textes.
     Elles peuvent &ecirc;tre utilisées dans beaucoup d'éditeurs, d'outils de recherche et de langages.</LI>
      </UL>
  <H4><FONT face="Helvetica, Arial" color="#660033">Le coin du Noyau</FONT></H4>
           <UL>
      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
      <A href="article56.html">Linux Temps Réel. Partie II </A> 
      par <A href="mailto:iripoll@disca.upv.es"> Ismael Ripoll  </A>
       <FONT color="#006699">(Cet article est en cours de traduction)</FONT>
      <BR>Dans cette seconde partie de Linux Temps réel, l'auteur nous montre un aspect plus
	pratique de Linux RT. Dans le préambule, l'auteur passe rapidement en revue un nouveau système
	d'exploitation temps réel: Linux KURT</LI>
      </UL>
       <H4><FONT face="Helvetica, Arial" color="#660033">Interviews</FONT></H4>
       <UL>  
      <LI>
      <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
      </A>
      <A href="article54.html"> Linux au service des artistes chez BUF COMPAGNIE  </A> 
      par <A href="mailto:vidalc@club-internet.fr"> Charles Vidal  </A>  
      <BR>BUF Companie un des grands noms de l'image de synthèse, nous explique comment et pourquoi ils utilisent linux
        comme serveur de calculs. On y apprend aussi comment une société privée utilise le logiciel libre.      </LI>
      </UL>
</TD>

</TR>

</TABLE>


<!-- ARTICLE FOOT -->
<BR clear="all">
<CENTER>
<TABLE width="95%">
<TR>
 <TD align="center" bgcolor="#666666">
  <FONT color="#ffffff">
  This website is maintained by Miguel Angel Sepulveda<BR>
 <B>&copy; 1998  LinuxFocus</B>
  </FONT>
 </TD>
</TR>

</TABLE>
</CENTER>



</BODY>

</HTML>






