<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>L'acc&egrave;s &agrave; Linux : HOWTO</TITLE>
</HEAD>
<BODY>
<H1>L'acc&egrave;s &agrave; Linux : HOWTO</H1>

<H2>Michael De La Rue,  
<A HREF="mailto:access-howto@ed.ac.uk">&lt;access-howto@ed.ac.uk&gt;</A><BR>
Traduit par Olivier Tharan, 
<A HREF="mailto:Olivier.Tharan@int-evry.fr">Olivier.Tharan@int-evry.fr</A></H2>v2.11, 28 mars 1997
<HR>
<EM>Le HOWTO Acc&egrave;s &agrave; Linux couvre l'utilisation des technologies adaptives
avec Linux, en particulier l'utilisation des technologies adaptives pour
rendre Linux accessibles &agrave; ceux qui ne pourraient pas l'utiliser
autrement. Il couvre aussi des domaines dans lesquels on peut utiliser
Linux au moyen de technologies adaptives plus g&eacute;n&eacute;rales.</EM>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>

<P>Le but de ce document est de servir d'introduction aux technologies
disponibles pour permettre l'utilisation de Linux aux personnes qui, &agrave;
cause d'une incapacit&eacute;, auraient des probl&egrave;mes &agrave; l'utiliser. En d'autres
mots, les groupes cibles de la technologie sont les aveugles, les
d&eacute;ficients visuels, les sourds et les personnes handicap&eacute;es physiques. Les
technologies ou autres informations seront ajout&eacute;es au fur et &agrave; mesure de
leur d&eacute;couverte. </P>

<P>Ces informations ne sont pas seulement destin&eacute;es &agrave; ces personnes (bien que
ce soit sans doute le but principal) mais aussi pour permettre aux
d&eacute;veloppeurs de Linux de prendre conscience des difficult&eacute;s impliqu&eacute;es
l&agrave;-dedans. Le plus gros probl&egrave;me est probablement que, pour l'instant,
tr&egrave;s peu de d&eacute;veloppeurs Linux sont conscients des probl&egrave;mes et des
nombreuses fa&ccedil;ons simples pour faciliter la vie des impl&eacute;menteurs de ce
syst&egrave;me. Ceci a, cependant, chang&eacute; consid&eacute;rablement depuis la naissance de
ce document, au moins en partie gr&acirc;ce &agrave; ce document, mais aussi en plus
grande partie gr&acirc;ce au travail de certains d&eacute;veloppeurs d&eacute;vou&eacute;s, dont de
nombreux sont mentionn&eacute;s dans les remerciements du document.</P>

<P>Envoyez tout commentaire ou information suppl&eacute;mentaire ou offres de
soutien &agrave; 
<A HREF="mailto:access-howto@ed.ac.uk">&lt;access-howto@ed.ac.uk&gt;</A>. Cette adresse pourrait devenir une
liste de
distribution dans le futur, ou &ecirc;tre pass&eacute;e automatiquement au futur
mainteneur de ce HOWTO, alors veuillez ne pas l'utiliser pour du courrier
personnel.</P>
<P>Je n'ai pas le temps de suivre le d&eacute;veloppement dans tous les domaines. Je
ne lirai probablement pas un courrier avant d'avoir le temps de mettre ce
document &agrave; jour. Ils sont toujours re&ccedil;us gracieusement. Si un courrier est
envoy&eacute; sur les listes <CODE>blind-list</CODE> ou <CODE>access-list</CODE>, je les
<I>lirai</I> finalement et mettrai toute information utile dans le document.
Sinon, veuillez envoyer une copie de tout ce qui peut &ecirc;tre int&eacute;ressant &agrave;
l'adresse &eacute;lectronique ci-dessus.</P>

<P>On peut envoyer le courrier normal &agrave;</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Linux Access HOWTO
23 Kingsborough Gardens
Glasgow G12 9NH
Scotland
U.K.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Et celui-ci fera petit &agrave; petit son chemin autour du monde jusqu'&agrave; moi. Le
courrier &eacute;lectronique sera plus rapide de quelques semaines.</P>


<P>On peut me contacter personnellement en utilisant 
<A HREF="mailto:miked@ed.ac.uk">&lt;miked@ed.ac.uk&gt;</A>. Puisque je
filtre
automatiquement tout le courrier que je re&ccedil;ois, veuillez utiliser l'autre
adresse sauf pour du courrier personnel. Ceci risque plus de mener &agrave; une
r&eacute;ponse appropri&eacute;e.</P>

<H2><A NAME="ss1.1">1.1 Politique de distribution</A>
</H2>

<P>
<BLOCKQUOTE><CODE>
Le ACCESS-HOWTO est copyright (c) 1996 Michael De La Rue
</CODE></BLOCKQUOTE>
</P>
<P>
<BLOCKQUOTE><CODE>
Le ACCESS-HOWTO peut &ecirc;tre distribu&eacute;, &agrave; votre guise, soit sous les termes
de la licence publique du GNU (GPL) version 2 ou plus, soit sous les
termes du projet de documentation Linux (LDP). Ces licences devraient &ecirc;tre
disponibles &agrave; l'endroit o&ugrave; vous avez eu ce document. Veuillez noter que
puisque les termes du LDP n'autorisent pas la modification (autre que la
traduction), les versions modifi&eacute;es seront soumises de fait &agrave; la GPL.
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="s2">2. Comparaison entre Linux et les autres syst&egrave;mes d'exploitation</A></H2>

<H2><A NAME="ss2.1">2.1 Comparaison G&eacute;n&eacute;rale</A>
</H2>

<P>Le meilleur endroit pour en parler est dans des documents tels que 'La
Feuille d'Informations Linux', la 'Meta FAQ Linux' et la 'FAQ Linux'
(voir la section 
<A HREF="#linux-docs">Documentation Linux</A>). Les
raisons
majeures pour une personne malvoyante d'utiliser Linux inclueraient le
r&eacute;seau int&eacute;gr&eacute; qui donne un acc&egrave;s complet &agrave; Internet. De fa&ccedil;on plus
g&eacute;n&eacute;rale, les utilisateurs sont attir&eacute;s par l'environnement de
d&eacute;veloppement complet inclus. De plus, &agrave; l'inverse de la plupart des
autres environnements graphiques modernes, l'interface graphique de Linux
(X Window) est clairement s&eacute;par&eacute;e de l'environnement sous-jacent et il
existe un ensemble complet de programmes modernes comme des navigateurs
Web et des logiciels de fax qui fonctionnent directement dans un
environnement non graphique. Ceci augmente les possibilit&eacute;s de fournir des
chemins d'acc&egrave;s diff&eacute;rents aux fonctionnalit&eacute;s du syst&egrave;me ;  Emacspeak en
est un bon exemple.</P>
<P>Pour d'autres utilisateurs, la comparaison est probablement moins
favorable et moins claire. Les gens qui ont des besoins tr&egrave;s sp&eacute;cifiques
et complexes trouveront que le syst&egrave;me de d&eacute;veloppement complet permet des
solutions proprement personnalis&eacute;es. Cependant, la plupart des logiciels
existant sur d'autres syst&egrave;mes commence juste &agrave; &ecirc;tre disponible.
Cependant, le d&eacute;veloppement s'&eacute;tend dans quasiment toutes les directions.</P>

<H2><A NAME="ss2.2">2.2 Disponibilit&eacute; de la technologie adaptive</A>
</H2>

<P>Il n'y a rien qui soit disponible dans le commerce <EM>sp&eacute;cifiquement</EM>
pour Linux. Il y a un nombre remarquable de logiciels gratuits qui
seraient utiles en adaptation, par exemple un synth&eacute;tiseur vocal
gratuit et quelques logiciels de contr&ocirc;le vocaux gratuits. Il y a aussi
un certain nombre de paquetages gratuits qui fournissent un bon support
pour les
terminaux Braille, par exemple.</P>

<H2><A NAME="ss2.3">2.3 Usage pratique</A>
</H2>

<P>Linux a un grand avantage par rapport &agrave; Windows : la plupart de ses
logiciels sont orient&eacute;s vers la ligne de commande. Ceci est en train de
changer et presque tout est maintenant disponible avec une interface
graphique. Cependant, parce que c'est &agrave; l'origine un syst&egrave;me
d'exploitation de programmeurs, on &eacute;crit encore des programmes en ligne
de commande qui couvrent presque tous les centres d'int&eacute;r&ecirc;t. Pour les
handicap&eacute;s physiques, ceci veut dire qu'il est facile de construire des
programmes sp&eacute;cialis&eacute;s pour r&eacute;pondre &agrave; leurs besoins. Pour les
malvoyants, ceci devrait rendre l'utilisation d'un synth&eacute;tiseur vocal
ou d'un terminal Braille facile et utile dans le futur proche.</P>

<P>Le syst&egrave;me de consoles virtuelles multiples de Linux le rendent pratique
&agrave; utiliser comme syst&egrave;me d'exploitation multit&acirc;ches par une personne
malvoyante travaillant directement avec le Braille.</P>

<P>Le syst&egrave;me de fen&ecirc;trage utilis&eacute; par Linux (X11) est livr&eacute; avec beaucoup
d'outils de programmation, et devrait &ecirc;tre adaptable. Cependant, en
pratique, les programmes adaptifs disponibles jusqu'&agrave; pr&eacute;sent ont &eacute;t&eacute;
plus primitifs que ceux sur le Macintosh ou Windows. Ils sont, cependant,
compl&egrave;tement gratuits (contrairement &agrave; des centaines de francs) et leur
qualit&eacute; s'am&eacute;liore vraiment.</P>

<P>En principe il devrait &ecirc;tre possible d'assembler un syst&egrave;me Linux complet
et utilisable pour une personne handicap&eacute;e visuellement pour &agrave; peu pr&egrave;s
500 $ (un PC de base, peu cher + une carte son). Ceci &agrave; comparer &agrave;
plusieurs milliers de dollars pour d'autres syst&egrave;mes d'exploitation
(logiciel de lecture d'&eacute;cran / mat&eacute;riel de synth&egrave;se vocale). Je dois
encore voir &ccedil;a. Je doute que cela fonctionne en pratique car les
synth&eacute;tiseurs vocaux disponibles pour Linux ne sont pas suffisamment
bons. Pour une personne handicap&eacute;e physique, la limitation viendra tout
de m&ecirc;me de la d&eacute;pense en mat&eacute;riel de saisie.</P>

<H2><A NAME="s3">3. Malvoyants</A></H2>

<P>J'utiliserai deux cat&eacute;gories ici. Les gens qui voient partiellement et
ont besoin d'aide pour voir / d&eacute;chiffrer / suivre le texte et ceux qui
sont incapables d'utiliser une quelconque interface visuelle.</P>

<H2><A NAME="ss3.1">3.1 Voir l'&eacute;cran avec une vision basse</A>
</H2>

<P>Il y a beaucoup de probl&egrave;mes diff&eacute;rents. Souvent l'agrandissement
peut &ecirc;tre utile, mais ce n'est pas tout. Certaines
personnes ne peuvent pas suivre un mouvement, d'autres ne peuvent
pas trouver le curseur sauf s'il bouge. Ceci fait appel &agrave; une panoplie de
techniques, dont la plupart sont en cours d'ajout &agrave; X.</P>

<H3>SVGATextMode</H3>

<P>Ce programme est utile pour am&eacute;liorer la visibilit&eacute; de l'&eacute;cran texte
normal que fournit Linux. L'&eacute;cran normal fourni par Linux affiche 80
caract&egrave;res de large sur 25 lignes. On peut changer ceci (et am&eacute;liorer la
qualit&eacute; des caract&egrave;res) en utilisant <CODE>SVGATextMode</CODE>. Il permet un acc&egrave;s
complet aux modes possibles
d'une carte graphique SVGA. Par exemple, on peut rendre le texte plus
large pour que seulement 50 caract&egrave;res par 15 apparaissent &agrave;
l'&eacute;cran. Il n'y a pas de moyen simple de zoomer sur
des parties de l'&eacute;cran, mais vous pouvez redimensionner au besoin.</P>

<H3>Syst&egrave;me X Window</H3>

<P>Pour les personnes qui peuvent voir l'&eacute;cran, il y a de bien nombreuses
fa&ccedil;ons d'am&eacute;liorer X Window. Elles ne se
combinent pas encore pour former un ensemble coh&eacute;rent de possibilit&eacute;s,
mais peuvent r&eacute;soudre bien des probl&egrave;mes si on les configure
correctement.</P>

<H3>Diff&eacute;rentes r&eacute;solutions d'&eacute;cran</H3>

<P>On peut configurer le serveur X avec beaucoup de r&eacute;solutions diff&eacute;rentes.
La frappe d'une simple touche peut alors changer entre celles-ci,
permettant de voir un texte difficile &agrave; lire.</P>
<P>Dans le fichier <CODE>/etc/XF86config</CODE>, vous avez une entr&eacute;e dans la
section <CODE>Screen</CODE> avec une ligne commen&ccedil;ant par <CODE>Modes</CODE>. Si, par
exemple, vous la mettez &agrave; :
<BLOCKQUOTE><CODE>
<PRE>
Modes       "1280x1024" "1024x768" "800x600" "640x480" "320x240"
</PRE>
</CODE></BLOCKQUOTE>

avec chaque mode configur&eacute; correctement (ce qui demande un moniteur assez
bon pour la plus haute r&eacute;solution), vous serez capable d'avoir quatre
agrandissements d'&eacute;cran, en changeant entre les diff&eacute;rents niveaux avec :</P>
<P><CODE>Ctrl + Alt + Pav&eacute;-Plus</CODE> et <CODE>Ctrl + Alt + Pav&eacute;-Moins</CODE></P>

<P>Bouger la souris autour de l'&eacute;cran vous fera glisser vers des parties
diff&eacute;rentes de l'&eacute;cran. Pour plus de d&eacute;tails sur la mani&egrave;re de configurer
ceci, vous devriez voir la documentation qui vient avec le serveur X
<B>XFree86</B>.</P>


<H3><A NAME="screen-mag"></A> Agrandissement de l'&eacute;cran</H3>

<P>Il y a plusieurs programmes connus pour l'agrandissement d'&eacute;cran,
<CODE>xmag</CODE> qui
agrandira une partie de l'&eacute;cran autant que d&eacute;sir&eacute; mais il est tr&egrave;s
primitif. Un autre est <CODE>xzoom</CODE>. Je viens de dire qu'il devait y
avoir mieux que <CODE>xmag</CODE>, le voil&agrave;. Voyez la section 
<A HREF="#xzoom">xzoom</A>.</P>
<P>Un autre programme disponible est <CODE>puff</CODE>. Celui-ci est sp&eacute;cifiquement
destin&eacute; aux utilisateurs d&eacute;ficients visuels. Il fournit des
caract&eacute;ristiques telles qu'une bo&icirc;te autour du pointeur pour le situer
plus facilement. D'autres caract&eacute;ristiques int&eacute;ressantes de <CODE>puff</CODE> font
que, s'il est configur&eacute; correctement, il est possible de s&eacute;lectionner et
d'agrandir des portions de l'&eacute;cran en m&ecirc;me temps qu'elles sont mises &agrave;
jour. Cependant, il semble y avoir des interactions entre <CODE>puff</CODE> et le
gestionnaire de fen&ecirc;tres qui pourraient le rendent difficile
d'utilisation. Quand je l'ai utilis&eacute; avec ma configuration <CODE>fvwm</CODE>, il
ne r&eacute;pondait pas du tout &agrave; mes frappes de touches. Cependant,
l'utilisation de <CODE>twm</CODE> a am&eacute;lior&eacute; la situation.</P>
<P>Le dernier programme que j'ai vu fonctionner est <CODE>dynamag</CODE>. Celui-ci a
aussi des avantages sp&eacute;cifiques comme la possibilit&eacute; de s&eacute;lectionner une
partie sp&eacute;cifique de l'&eacute;cran et de la surveiller, en rafraichissant
l'affichage agrandi &agrave; intervalles r&eacute;guliers entre quelques dixi&egrave;mes de
seconde et vingt secondes. <CODE>dynamag</CODE> fait partie de la distribution
UnWindows. Voyez 
<A HREF="#unwindows">unwindows</A>
 pour plus de d&eacute;tails.</P>


<H3>Changer la fonte &eacute;cran</H3>

<P>Les fontes &eacute;cran pour tout logiciel X proprement &eacute;crit doivent &ecirc;tre
modifiables. Vous pouvez simplement les rendre assez grandes pour que
vous puissiez les lire. On fait g&eacute;n&eacute;ralement ceci en mettant une ligne
dans le fichier <CODE>.Xdefaults</CODE> qui devrait &ecirc;tre dans votre r&eacute;pertoire
personnel. En mettant les lignes correctes dans celui-ci, vous pouvez
changer la fonte de vos programmes, par exemple :</P>
<P>
<PRE>
Emacs.font: -sony-fixed-medium-r-normal--16-150-75-75-c-80-iso8859-*
</PRE>
</P>
<P>Pour voir quelles fontes sont disponibles, utilisez le programme
<CODE>xfontsel</CODE> sous X.</P>
<P>Il devrait y avoir un moyen de changer les choses &agrave; un niveau plus
fondamental pour que tout ressorte avec une fonte agrandie. On peut
r&eacute;aliser
ceci en renommant les fontes, et en disant aux programmes g&eacute;n&eacute;rateurs de
fontes d'utiliser un niveau d'&eacute;chelles diff&eacute;rent. Si quelqu'un r&eacute;ussit &agrave; faire
tourner ceci proprement, qu'il m'envoie les d&eacute;tails du processus.</P>

<H3>Curseurs en croix, etc.</H3>

<P>Pour les gens qui ont des probl&egrave;mes &agrave; suivre les curseurs, il y a beaucoup de
choses qui peuvent aider :</P>
<P>
<UL>
<LI>les curseurs en croix (une ligne verticale et une autre horizontale
&agrave; partir du bord de l'&eacute;cran) ;
</LI>
<LI>des curseurs clignotants (qui clignotent en pressant une touche).</LI>
</UL>
</P>

<P>Aucun logiciel &agrave; ma connaissance ne fournit sp&eacute;cifiquement de curseur
en croix. <CODE>puff</CODE>, mentionn&eacute; dans la section pr&eacute;c&eacute;dente fournit
cependant une bo&icirc;te clignotante autour du curseur qui peut rendre ce
dernier beaucoup plus facile &agrave; situer. </P>

<P>Pour l'instant le mieux qui puisse &ecirc;tre fait est de changer l'image du
curseur. Fabriquez un fichier bitmap comme vous voulez, et un autre de la m&ecirc;me
taille, mais compl&egrave;tement noir. Convertissez-les au format XBM et lancez</P>
<P>
<PRE>
        xsetroot -cursor curseur.xbm bitmap-noir.xbm
</PRE>
</P>
<P>En fait, si vous comprenez les masques, le fichier noir n'a pas besoin d'&ecirc;tre
compl&egrave;tement noir, mais commencez avec &ccedil;a. Le fichier <CODE>.Xdefaults</CODE>
contr&ocirc;le les curseurs utilis&eacute;s par les applications en cours. Pour avoir
beaucoup plus d'informations, veuillez consulter le mini HOWTO X Big
Cursor, de Joerg Schneider, 
<A HREF="mailto:schneid@ira.uka.de">&lt;schneid@ira.uka.de&gt;</A></P>

<H3>Sonorisation</H3>

<P>En supposant que l'utilisateur puisse entendre, la communication sonore
peut &ecirc;tre tr&egrave;s utile pour faire un environnement de travail plus
sympathique et agr&eacute;able. Pour une personne &agrave; la vue basse, les indices
sonores peuvent servir &agrave; aider &agrave; situer le pointeur (voir 
<A HREF="#unwindows">UnWindows</A>). Pour un utilisateur en mode console qui
utilise Emacspeak (voir 
<A HREF="#emacspeak">Emacspeak</A>), les icones
sonores disponibles fourniront une souplesse tr&egrave;s utile.</P>
<P>La configuration du son sous Linux est couverte dans le HOWTO Linux Sound
(voir 
<A HREF="#linux-docs">Linux Documentation</A>). Une fois que le
son est install&eacute;, on peut jouer des sons avec la commande <CODE>play</CODE>
include dans de nombreuses versions de Linux. C'est la mani&egrave;re dont
j'utilise ma version de UnWindows.</P>

<H3>Produire une impression large</H3>

<P>Utiliser une impression large avec Linux est assez facile. Il y a plusieurs
techniques.</P>

<H3>LaTeX / TeX</H3>

<P>LaTeX est un syst&egrave;me de pr&eacute;paration de documents extr&ecirc;mement puissant. On
peut l'utiliser pour produire des documents imprim&eacute;s en gros de n'importe
quelle sorte. Bien qu'il soit quelque peu compliqu&eacute; &agrave; apprendre, beaucoup de
documents sont produits avec LaTeX ou le programme de mise en page
sous-jacent, TeX.</P>

<P>Ceci produira du texte raisonnablement grand :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
\font\magnifiedtenrm=cmr10 at 20pt  % mettre une grande fonte
\magnifiedtenrm
voici du grand texte
\bye
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>Pour plus de d&eacute;tails, voyez un livre LaTeX disponible dans toute librairie
informatique. Il y a aussi un grand nombre d'introductions disponibles sur
Internet.</P>

<H3>Sortir du texte large</H3>

<P>Quasiment toutes les impressions sous Linux utilisent PostScript, et Linux
peut piloter presque n'importe quelle imprimante en l'utilisant. Je sors des
textes d'apprentissage larges en utilisant une imprimante matricielle Epson
normale.</P>
<P>Pour les utilisateurs de X, il y a plusieurs outils disponibles qui
peuvent produire du texte large. Ceux-ci comprennent <CODE>LyX</CODE>, et beaucoup
de traitements de texte commerciaux.</P>

<H2><A NAME="ss3.2">3.2 Aides pour ceux qui ne peuvent pas utiliser de sortie visuelle</A>
</H2>

<P>Pour quelqu'un qui est compl&egrave;tement incapable d'utiliser un &eacute;cran normal, il y
a deux alternatives : le Braille et la parole. Evidemment pour les gens qui
ont aussi perdu l'ouie, la parole n'est pas toujours utile, de sorte que le
Braille sera toujours important.</P>
<P>Si vous pouvez choisir, lequel choisir ? Ceci fait l'objet d'un d&eacute;bat
<EM>vigoureux</EM>. La parole est rapide d'utilisation, relativement bon
march&eacute; et
vraiment bonne pour les applications textuelles (par exemple lire un long
document comme celui-ci). Les probl&egrave;mes sont d'avoir un environnement calme,
peut-&ecirc;tre des &eacute;couteurs pour travailler sans d&eacute;ranger les autres et &eacute;viter
d'&ecirc;tre &eacute;cout&eacute; par les autres (non disponible pour tous les synth&eacute;tiseurs
vocaux).</P>
<P>Le Braille est meilleur pour les applications o&ugrave; un positionnement pr&eacute;cis est
important (par exemple les tableurs). Il peut aussi &ecirc;tre utile pour v&eacute;rifier
le d&eacute;but d'une phrase quand vous arrivez &agrave; la fin. Le Braille est, cependant,
bien plus cher et plus lent pour lire du texte. Evidemment, plus vous
utilisez le Braille, plus vous &ecirc;tes rapide. Le Braille Niveau II est
difficile &agrave; apprendre, mais &ccedil;a en vaut certainement la peine puisque c'est
beaucoup plus rapide. Ceci veut dire que si vous n'utilisez pas le Braille
pendant assez longtemps, vous ne pourrez jamais d&eacute;couvrir son plein potentiel
et d&eacute;cider. De toute fa&ccedil;on, j'en ai assez dit sur ce sujet assez controvers&eacute;.</P>
<P>bas&eacute; sur l'original par James Bowden 
<A HREF="mailto:jrbowden@bcs.org.uk">&lt;jrbowden@bcs.org.uk&gt;</A></P>

<H3>Terminaux Braille</H3>

<P>Les terminaux Braille contiennent g&eacute;n&eacute;ralement une ou deux lignes de Braille.
Puisqu'ils font au plus 80 caract&egrave;res de large, et normalement 40, ils
sont
quelque peu limit&eacute;s. J'en connais de deux sortes :</P>
<P>
<UL>
<LI>les terminaux Braille pilot&eacute;s par mat&eacute;riel ;</LI>
<LI>les terminaux Braille pilot&eacute;s par logiciel.</LI>
</UL>
</P>

<P>La premi&egrave;re sorte ne fonctionne que quand l'ordinateur est en mode texte et
lit la m&eacute;moire &eacute;cran directement. Voyez la section 
<A HREF="#memmap-braille">Terminaux Braille pilot&eacute;s par mat&eacute;riel</A>.</P>

<P>La seconde sorte de terminaux Braille est similaire, en bien des fa&ccedil;ons, &agrave; un
&eacute;cran de terminal normal que Linux supporte automatiquement. Malheureusement,
ils ont besoin de logiciels sp&eacute;ciaux pour les rendre utilisables.</P>

<P>Il y a deux paquetages qui aident &agrave; cela. Le premier, <CODE>BRLTTY</CODE>, fonctionne
avec plusieurs sortes d'afficheurs Braille et les auteurs peuvent en supporter
plus au fur et &agrave; mesure qu'ils obtiennent les informations. En ce moment
<CODE>BRLTTY</CODE> supporte les mod&egrave;les CombiBraille de Tieman B.V., les mod&egrave;les ABT3
de Alva B.V. et les mod&egrave;les PowerBraille et Navigator de Telesensory Systems
Inc. L'utilisation du Braille Lite de Blazie Engineering comme afficheur
Braille est d&eacute;courag&eacute;e, mais le support peut &ecirc;tre renouvel&eacute; sur demande.
Voyez la section 
<A HREF="#serial-braille">Terminaux Braille logiciels</A>.</P>

<P>L'autre paquetage dont j'ai connaissance est Braille Enhanced Screen. Il
est fait pour fonctionner sur d'autres syst&egrave;mes Unix comme sur Linux. Ceci
devrait autoriser l'acc&egrave;s pour
l'utilisateur &agrave; un terminal Braille avec beaucoup de possibilit&eacute;s utiles comme
la possibilit&eacute; de lancer des programmes diff&eacute;rents dans diff&eacute;rents
<EM>terminaux
virtuels</EM> en m&ecirc;me temps.</P>

<H3>Synth&egrave;se vocale</H3>

<P>Les synth&eacute;tiseurs vocaux prennent (normalement) du texte ASCII et le
convertissent en vraie sortie parl&eacute;e. Il est possible de les installer de
mani&egrave;re soit mat&eacute;rielle soit logicielle. Malheureusement, les
synth&eacute;tiseurs vocaux gratuits pour Linux ne sont, para&icirc;t-il, pas assez
bons comme seul moyen de sortie. </P>

<P>Les synth&eacute;tiseurs vocaux mat&eacute;riels sont l'alternative. Le principal que je
connaisse qui fonctionne est DECtalk de Digital, pilot&eacute; par
<CODE>emacspeak</CODE>. Cependant, &agrave; ce jour (mars 1997) un pilote pour le
synth&eacute;tiseur Doubletalk a &eacute;t&eacute; annonc&eacute;. Utiliser l'acc&egrave;s complet de
<CODE>emacspeak</CODE> pour l'ensemble des possibilit&eacute;s de
Linux est assez facile. Ceci comprend l'utilisation normale du shell, d'un
navigateur World Wide Web et de beaucoup d'autres possibilit&eacute;s similaires,
comme le courrier &eacute;lectronique. Bien qu'il n'agisse que comme un simple
lecteur de texte (similaire &agrave; celui d'IBM pour le PC) quand il contr&ocirc;le des
programmes qu'il ne comprend pas, avec ceux qu'il comprend il peut fournir des
contr&ocirc;les bien plus sophistiqu&eacute;s. Voyez la section 
<A HREF="#emacspeak">Emacspeak</A> pour plus d'informations sur <CODE>emacspeak</CODE>.</P>

<H3>Manipuler la sortie console</H3>

<P>Quand il d&eacute;marre, Linux pour l'instant affiche tous ses messages
directement sur
l'&eacute;cran normal (visuel). Ceci pourrait &ecirc;tre chang&eacute; si quelqu'un avec un niveau
de base en programmation du noyau voulait le faire. Ceci veut dire qu'il est
impossible pour la plupart des p&eacute;riph&eacute;riques Braille d'obtenir des
informations sur ce que fait Linux avant que le syst&egrave;me d'exploitation
fonctionne compl&egrave;tement.</P>

<P>C'est seulement &agrave; cette &eacute;tape que vous pouvez d&eacute;marrer le programme dont vous
avez besoin pour l'acc&egrave;s. Si on utilise le programme <CODE>BRLTTY</CODE> et on le
lance tr&egrave;s t&ocirc;t dans le processus de d&eacute;marrage, alors &agrave; partir de l&agrave; on pourra
lire les messages de l'&eacute;cran. La plupart des mat&eacute;riels et logiciels
devront
tout de m&ecirc;me attendre que le syst&egrave;me soit compl&egrave;tement pr&ecirc;t. Ceci rend
l'administration d'un syst&egrave;me Linux difficile, mais pas impossible pour une
personne mal-voyante. Une fois que le syst&egrave;me est pr&ecirc;t, cependant, vous
pouvez revenir en arri&egrave;re en, pressant (sur la disposition du clavier par
d&eacute;faut) les touches <CODE>Shift-PageUp</CODE>.</P>

<P>Il y a un syst&egrave;me Braille qui peut utiliser la console directement, appel&eacute; le
Braillex. Il est fait pour lire directement la m&eacute;moire &eacute;cran. Malheureusement
le d&eacute;filement normal du terminal l'en emp&ecirc;che. Si vous utilisez un noyau plus
r&eacute;cent que 1.3.75, entrez simplement <CODE>linux no-scroll</CODE> au prompt LILO ou
configurez LILO pour le faire automatiquement. Si vous avez une version plus
ancienne de Linux, voyez la section 
<A HREF="#memmap-braille">Terminaux Braille et m&eacute;moire &eacute;cran</A>.</P>

<P>Une autre chose connue et utile est d'utiliser les sons pour indiquer quelle
&eacute;tape du processus de d&eacute;marrage a &eacute;t&eacute; atteinte. (suggestion de T.V. Raman)</P>

<H3>Reconnaissance optique de caract&egrave;res</H3>

<P>Il existe un programme de reconnaissance optique de caract&egrave;res (OCR),
gratuit pour Linux appel&eacute; <CODE>xocr</CODE>.  En principe, s'il est assez bon, ce
programme devrait permettre aux personnes malvoyantes de lire des livres
normaux jusqu'&agrave; un certain point. (La pr&eacute;cision de l'OCR n'est jamais
assez grande.) Cependant, selon la documentation, ce programme demande de
l'entra&icirc;nement pour reconna&icirc;tre la fonte particuli&egrave;re qu'il va utiliser et
je n'ai aucune id&eacute;e sur sa valeur puisque je n'ai pas le mat&eacute;riel pour le
tester.</P>

<H2><A NAME="ss3.3">3.3 Commencer &agrave; apprendre Linux</A>
</H2>

<P>Commencer &agrave; apprendre Linux peut sembler difficile et intimidant pour
quelqu'un qui n'a aucune connaissance en informatique ou des connaissances
uniquement en DOS. Les choses suivantes peuvent aider :</P>
<P>
<UL>
<LI>Apprenez &agrave; utiliser Linux (ou UNIX) sur le syst&egrave;me de quelqu'un
d'autre avant de mettre le v&ocirc;tre en place ;
</LI>
<LI>Contr&ocirc;lez Linux au d&eacute;part &agrave; partir de votre propre terminal Braille
ou vocal que vous connaissez. Si vous pr&eacute;voyez d'utiliser la parole, vous
d&eacute;sirerez apprendre <CODE>emacs</CODE> tout de suite. Vous pouvez aussi
l'apprendre au fur et &agrave; mesure. Voir ci-dessous ;
</LI>
<LI>Si vous avez l'habitude de MS-DOS, lisez le mini-HOWTO DOS2Linux
pour vous aider &agrave; la conversion. (voir la section 
<A HREF="#HOWTOs">Les documents HOWTO Linux</A>).
</LI>
</UL>
</P>
<P>Le HOWTO Emacspeak &eacute;crit par Jim Van Zandt (
<A HREF="mailto:jrv@vanzandt.mv.com">&lt;jrv@vanzandt.mv.com&gt;</A>)
couvre ceci en plus grands d&eacute;tails. (voir 
<A HREF="#HOWTOs">Les documents HOWTO Linux</A>). </P>

<P>Si vous pensez utiliser Emacspeak, vous devriez savoir qu'Emacspeak
n'essaie pas d'enseigner Emacs, donc dans ce sens, la connaissance
pr&eacute;alable d'Emacs est toujours utile. Ceci dit, vous n'avez s&ucirc;rement pas
besoin d'en conna&icirc;tre beaucoup sur Emacs avant de commencer &agrave; utiliser
Emacspeak. En fait, une fois qu'Emacspeak est install&eacute; et fonctionne, il
fournit une interface facile vers l'ensemble vari&eacute; de documentation en
ligne qui contient les pages info, et facilite l'apprentissage de ce dont
vous avez besoin.</P>
<P>&lt;&lt; En r&eacute;sum&eacute; : commencer &agrave; utiliser Emacspeak demande peu
d'apprentissage. Obtenir le meilleur d'Emacs et d'Emacspeak, surtout si
vous voulez l'utiliser comme substitut de X Window comme je le fais
demande en fait de devenir familier avec de nombreuses extensions d'Emacs
; mais ceci est un processus progressif et ne n&eacute;cessite pas un seul jour
de travail. &gt;&gt; - <CODE>T.V. Raman</CODE></P>
<P>Une autre option qui peut vous int&eacute;resser sont les cassettes
d'entra&icirc;nement RNIB dont l'une d'entre elles couvre Unix. Vous pouvez les
obtenir chez :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
RNIB
Customer Services
PO Box 173
Peterborough
Cambridgeshire PE2 6WS
Tel: 01345 023153 (ne fonctionne probablement qu'en Grande-Bretagne)
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss3.4">3.4 Le Braille en relief</A>
</H2>

<P>Linux devrait &ecirc;tre la plate-forme parfaite pour piloter une presse Braille. Il
y a beaucoup d'outils de formatage destin&eacute;s sp&eacute;cifiquement aux 
p&eacute;riph&eacute;riques &agrave;
taille fixe. On peut simplement connecter une presse Braille au port s&eacute;rie en
utilisant les m&eacute;canismes standards d'impression de Linux. Pour plus
d'informations, voyez le Linux Printing HOWTO.</P>

<P>Il y a un paquetage logiciel gratuit qui fonctionne comme un traducteur
multi-lingual niveau deux disponible pour Linux &agrave; la <EM>F&eacute;d&eacute;ration
Nationale pour les Aveugles</EM> am&eacute;ricaine (<EM>National Federation for the
Blind</EM>).
Son nom est NFBtrans. Voyez la section 
<A HREF="#nfbtrans">traducteur NFB</A> pour plus de d&eacute;tails.</P>

<H2><A NAME="s4">4. Probl&egrave;mes d'audition</A></H2>

<P>En majorit&eacute;, il y a peu de probl&egrave;mes &agrave; utiliser un ordinateur chez les
gens
ayant des probl&egrave;mes d'audition. Quasiment toutes les sorties sont visuelles.
Il y a quelques situations o&ugrave; la sortie sonore est utilis&eacute;e, cependant. Pour
celles-ci, on peut quelquefois contourner le probl&egrave;me en utilisant une sortie
visuelle &agrave; la place.</P>

<H2><A NAME="ss4.1">4.1 Les cloches visuelles</A>
</H2>

<P>Traditionnellement, les ordinateurs font `beep' quand un programme leur
envoie un
code sp&eacute;cial. Ceci est utilis&eacute; en g&eacute;n&eacute;ral pour pr&ecirc;ter attention au programme
et peu d'autres choses. Dans la plupart des cas, il est possible de
remplacer
ceci
en faisant clignoter l'&eacute;cran entier (ou l'&eacute;mulateur de terminal). La mani&egrave;re
de le faire est par contre tr&egrave;s variable.</P>
<P>
<DL>

<DT><B>xterm (sous X)</B><DD><P>Pour xterm, vous pouvez soit changer la configuration
en pressant le bouton du milieu de la souris tout en appuyant sur la
touche contr&ocirc;le, ou en mettant une ligne avec <CODE>XTerm*visualBell: true</CODE>
dans le fichier <CODE>.Xdefaults</CODE> de votre r&eacute;pertoire personnel. </P>

<DT><B>la console (sans X)</B><DD><P>La console est l&eacute;g&egrave;rement plus complexe.
Veuillez voir le
mini HOWTO Visual Bell d'Alessandro Rubini pour des d&eacute;tails l&agrave;-dessus.
Disponible avec tout le reste de la documentation Linux. (voyez la section
<A HREF="#linux-docs">autres documents Linux</A>). La plupart du temps, la
configuration se fait par application, ou en changeant le noyau Linux
lui-m&ecirc;me.</P>

</DL>
</P>

<H2><A NAME="s5">5. Probl&egrave;mes physiques</A></H2>

<P>On doit prendre beaucoup de ces probl&egrave;mes individuellement. Les besoins de
chacun, les mani&egrave;res dont on peut g&eacute;n&eacute;rer une entr&eacute;e et d'autres facteurs
varient tellement que tout ce que ce HOWTO peut fournir est un ensemble
g&eacute;n&eacute;rique de pointeurs vers des logiciels et des conseils utiles.</P>

<H2><A NAME="ss5.1">5.1 Incapacit&eacute; &agrave; utiliser une souris ou un pointeur</A>
</H2>

<P>Une mobilit&eacute; limit&eacute;e peut rendre l'utilisation d'une souris difficile. Pour
certaines personnes, un trackball peut &ecirc;tre une tr&egrave;s bonne solution, mais pour
d'autres le seul p&eacute;riph&eacute;rique d'entr&eacute;e possible est un clavier (ou m&ecirc;me
quelque chose qui simule un clavier). Pour une utilisation normale de
Linux
ceci ne devrait pas &ecirc;tre un probl&egrave;me (mais voyez la section 
<A HREF="#keyb-behave">Rendre le clavier docile</A>), mais pour les utilisateurs
de X, ceci peut causer de gros probl&egrave;mes sous certaines circonstances.</P>
<P>Heureusement, le gestionnaire de fen&ecirc;tres <CODE>fvwm</CODE> a &eacute;t&eacute; fait pour &ecirc;tre
utilis&eacute; sans pointeur et on peut faire la plupart des choses en utilisant 
un clavier.
Je fais en fait ceci moi-m&ecirc;me quand je perds ma souris (ne me demandez pas
pourquoi) ou si je veux juste taper. En fait l'utilisation d'autres programmes
d&eacute;pendra de leur capacit&eacute; &agrave; accepter les entr&eacute;es au clavier. Beaucoup de
programmes X le font pour toutes les fonctions. Beaucoup ne le font pas. Je
pense que les touches qui &eacute;mulent la souris, qui devraient se
trouver dans la version courante de X, faciliteront ceci.</P>

<H3>Incapacit&eacute; &agrave; utiliser un clavier</H3>

<P>Les personnes qui sont incapables d'utiliser un clavier normalement peuvent
quelquefois en utiliser un par l'interm&eacute;diaire d'un b&acirc;ton dirig&eacute; par la t&ecirc;te
ou par la bouche. Ceci demande une configuration sp&eacute;ciale pour le clavier.
Veuillez voir aussi la section 
<A HREF="#keyb-behave">rendre le clavier docile</A>.</P>

<H3>Autre mat&eacute;riel d'entr&eacute;e (syst&egrave;me X Window seulement)</H3>

<P>D'autres personnes ne peuvent pas utiliser le clavier du tout et seuls
des p&eacute;riph&eacute;riques de pointage sont disponibles. Dans ce cas, aucune
solution n'est disponible sous la console normale Linux et on devra
utiliser X. Si on peut faire en sorte que l'extension XInput utilise le
p&eacute;riph&eacute;rique et si on peut trouver le bon logiciel pour convertir des
donn&eacute;es de pointeur en caract&egrave;res (je n'en ai pas encore trouv&eacute;), alors
tout dispositif de pointage devrait &ecirc;tre utilisable sans clavier.</P>
<P>Il y a un certain nombre de p&eacute;riph&eacute;riques qu'il est bon de regarder pour
de telles acquisitions de donn&eacute;es, comme les &eacute;crans tactiles ou les
pointeurs oculaires. Nombre d'entre eux n&eacute;cessiteront un <EM>pilote de
p&eacute;riph&eacute;rique</EM> &eacute;crit sp&eacute;cifiquement. Ceci n'est pas vraiment difficile si
la documentation est disponible, mais demande quelqu'un qui poss&egrave;de des
bonnes comp&eacute;tences en programmation C. Veuillez voir le <I>Kernel
Hacker's Guide</I> et autres r&eacute;f&eacute;rences sur le noyau pour plus
d'informations. Une fois que ceci sera mis en place, il devrait &ecirc;tre
possible d'utiliser ces p&eacute;riph&eacute;riques comme une souris normale.</P>

<H3>Contr&ocirc;ler le mat&eacute;riel physique depuis Linux</H3>

<P>Le principal groupe d'int&eacute;r&ecirc;t ici est le Projet de Laboratoire Linux
(Linux Lab Project). En g&eacute;n&eacute;ral, on peut contr&ocirc;ler la plupart des
mat&eacute;riels GPIB (une interface normalis&eacute;e pour l'&eacute;quipement scientifique,
aussi connue sous le nom de bus IEEE). Ceci donne virtuellement beaucoup
de potentiel pour des projets tr&egrave;s ambitieux d'accessibilit&eacute;. Autant que
je sache, aucun d'entre eux n'a encore &eacute;t&eacute; mis sur pied.</P>


<H2><A NAME="ss5.2">5.2 Reconnaissance vocale</A>
</H2>

<P>La reconnaissance vocale est un outil tr&egrave;s utile pour permettre
l'utilisation d'un ordinateur. Je connais deux syst&egrave;mes de reconnaissance
pour Linux, le premier est <CODE>ears</CODE> qui est d&eacute;crit ainsi : ``la
reconnaissance n'est pas optimale. Mais c'est bon pour jouer et &ccedil;a sera
am&eacute;lior&eacute;'', le deuxi&egrave;me est <CODE>AbbotDemo</CODE>, ``Un syst&egrave;me de reconnaissance
vocale continu ind&eacute;pendant de la personne'', qui peut &ecirc;tre plus
int&eacute;ressant, bien qu'il ne soit pas disponible pour un usage commercial
sans arrangement pr&eacute;alable. Voyez la carte des logiciels Linux pour les
d&eacute;tails (section 
<A HREF="#linux-docs">Autres documents Linux</A>). </P>

<H2><A NAME="keyb-behave"></A> <A NAME="ss5.3">5.3 Rendre le clavier docile</A>
</H2>

<H3>Le syst&egrave;me X Window</H3>

<P>Le dernier serveur X qui est distribu&eacute; avec Linux peut inclure beaucoup
de caract&eacute;ristiques qui assistent l'acquisition. Ceci comprend des
caract&eacute;ristiques telles que StickKeys, MouseKeys, RepeatKeys, BounceKeys,
SlowKeys et TimeOut. Celles-ci permettent de param&eacute;trer le clavier selon
les besoins de l'utilisateur. Elles sont fournies avec l'extension
<CODE>XKB</CODE> dans les versions de X apr&egrave;s la version 6.1. Pour trouver votre
version et voir si vous avez l'extension install&eacute;e, vous pouvez essayer :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
xdpyinfo -queryExtensions
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Se d&eacute;barasser de la r&eacute;p&eacute;tition automatique</H3>

<P>Pour arr&ecirc;ter la r&eacute;p&eacute;tition des touches sur la console Linux, lancez cette
commande (je pense qu'on doit la lancer une fois par console ; un bon endroit
pour la lancer serait dans vos fichiers de login, <CODE>.profile</CODE> ou <CODE>.login</CODE>
dans votre r&eacute;pertoire personnel) :</P>
<P>
<PRE>
setterm -repeat off
</PRE>
</P>

<P>Pour vous d&eacute;barasser de la r&eacute;p&eacute;tition automatique dans n'importe quel
serveur X, vous pouvez utiliser la commande : </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
xset -r 
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>que vous pourriez mettre dans le fichier lanc&eacute; quand vous commencez &agrave; utiliser
X (souvent <CODE>.xsession</CODE> ou <CODE>.xinit</CODE> sous certaines configurations).</P>

<P>Il est bon de regarder ces deux commandes de plus pr&egrave;s pour d'autres mani&egrave;res
de changer le comportement de la console.</P>

<H3>Macros : beaucoup d'entr&eacute;e pour peu de touches press&eacute;es</H3>

<P>Souvent dans de telles situations, le plus grand probl&egrave;me est celui de
la rapidit&eacute; d'entr&eacute;e. Ici la chose la plus importante &agrave; viser est le
nombre de commandes le plus grand en un minimum de frappes de touches.
Pour les utilisateurs du shell <CODE>bash</CODE> ou <CODE>tcsh</CODE>, vous devriez
regarder la page de manuel, en particulier la compl&eacute;tion de commandes et
de noms de fichiers (pressez la touche TAB et <CODE>bash</CODE> essaie de deviner
ce qui vient derri&egrave;re). Pour toute information sur les macros qui
fournissent des s&eacute;quences de commandes en appuyant sur une seule touche,
jetez un coup d'oeil au HOWTO Keystroke.</P>

<H3><A NAME="sticky-key"></A> Les touches collantes</H3>

<P>Les touches collantes sont une caract&eacute;ristique qui permet &agrave; quelqu'un
qui ne peut presser de mani&egrave;re fiable qu'un bouton &agrave; la fois d'utiliser
un clavier avec toutes les touches de modification telles que <CODE>Shift</CODE>
et <CODE>Control</CODE>. Ces touches, au lieu qu'on doive les maintenir enfonc&eacute;es
en m&ecirc;me temps que l'autre touche deviennent plut&ocirc;t comme la touche
<CODE>Caps Lock</CODE> et restent activ&eacute;es pendant que l'on presse l'autre touche.
Elles peuvent alors soit se d&eacute;sactiver ou rester telles quelles pour la
touche suivante selon ce dont on a besoin. Pour avoir des informations sur
la mani&egrave;re de configurer ceci, veuillez voir le HOWTO Linux Keyboard,
surtout la section <EM>Je ne peux utiliser qu'un doigt pour taper</EM>
(section 15 dans la version que j'ai). - Information de Toby Reed.</P>

<H2><A NAME="s6">6. Probl&egrave;mes de programmation g&eacute;n&eacute;raux</A></H2>

<P>Beaucoup de probl&egrave;mes qu'il est important de tenir en compte sont les m&ecirc;mes
quand on &eacute;crit des logiciels faits pour faciliter l'acc&egrave;s que quand on essaie
de suivre de bons principes de programmation.</P>

<H2><A NAME="ss6.1">6.1 Essayez de faciliter la mise en place d'interfaces multiples</A>
</H2>

<P>Si votre logiciel n'est utilisable qu'&agrave; travers une interface graphique, il
peut &ecirc;tre tr&egrave;s difficile de le rendre utilisable pour une personne qui ne peut
pas voir. Si on ne peut l'utiliser qu'&agrave; travers une interface orient&eacute;e ligne,
quelqu'un qui ne peut pas taper aura des difficult&eacute;s.</P>
<P>Fournissez des raccourcis claviers aussi bien que l'utilisation du pointeur X
normal (g&eacute;n&eacute;ralement la souris). Vous pouvez presque certainement compter sur
l'utilisateur pour qu'il g&eacute;n&egrave;re des frappes de touches sur votre application.</P>

<H2><A NAME="ss6.2">6.2 Rendez le logiciel configurable</A>
</H2>

<P>S'il est facile de changer de fonte alors les gens pourront la changer pour
celle qu'il peuvent lire. Si on peut changer l'ensemble de couleurs alors les
gens qui ne voient pas les couleurs seront plus aptes &agrave; l'utiliser. Si on peut
changer les fontes facilement alors les malvoyants trouveront votre logiciel
plus utile.</P>

<H2><A NAME="ss6.3">6.3 Testez le logiciel sur les utilisateurs</A>
</H2>

<P>Si quelques personnes peuvent utiliser votre logiciel, chacune avec un
probl&egrave;me
d'acc&egrave;s diff&eacute;rent, elles seront plus &agrave; m&ecirc;me de d&eacute;celer les probl&egrave;mes
sp&eacute;cifiques. Evidemment, ceci ne sera pas pratique pour tout le monde, mais
vous pouvez toujours demander un retour d'informations.</P>

<H2><A NAME="ss6.4">6.4 Rendez la sortie distincte</A>
</H2>

<P>A chaque fois que c'est possible, clarifiez les diff&eacute;rentes parties de votre
programme. Formatez les messages d'erreurs de mani&egrave;re sp&eacute;cifique pour les
identifier. Sous X, assurez-vous que chaque pan de votre fen&ecirc;tre a un nom pour
qu'un logiciel de lecture d'&eacute;cran puisse l'identifier.</P>

<H2><A NAME="ss6.5">6.5 Licences</A>
</H2>

<P>Certains logiciels pour Linux (bien que ce ne soient pas les programmes
cl&eacute;s) ont des licences telles que <EM>pas pour une utilisation
commerciale</EM>. Ceci pourrait &ecirc;tre mauvais pour une personne qui commence
par utiliser le logiciel pour son travail personnel et qui commence &agrave;
pouvoir travailler pour son emploi ; elle ne pourrait pas le faire avec
ceci. Ce pourrait &ecirc;tre quelque chose qui les lib&egrave;re de d&eacute;pendances
financi&egrave;res et autres de la part d'autres personnes. M&ecirc;me si l'auteur du
logiciel est pr&ecirc;t &agrave; faire des exceptions, cela rend l'utilisateur
vuln&eacute;rable aux changements des conditions commerciales (une certaine
soci&eacute;t&eacute; en ach&egrave;te les droits) et au refus des gens pour qui ils pourraient
travailler (beaucoup de soci&eacute;t&eacute;s ont tr&egrave;s peur des licences). Il est
beaucoup mieux d'&eacute;viter ce genre de licence quand c'est possible. La
protection contre l'abus commercial des logiciels peut &ecirc;tre acquise au
besoin avec des licences plus sp&eacute;cifiques telles que la licence publique
du GNU ou la licence artistique. </P>

<H2><A NAME="s7">7. Autres informations</A></H2>

<H2><A NAME="linux-docs"></A> <A NAME="ss7.1">7.1 Documentation sur Linux</A>
</H2>

<P>La documentation Linux est essentielle &agrave; l'utilisation de Linux et la plupart
des documents mentionn&eacute;s ici devraient &ecirc;tre inclus dans les versions r&eacute;centes
de Linux, de toutes les sources que je connais.</P>
<P>Si vous voulez obtenir les informations sur Internet, voici quelques exemples
de sites. Ils devraient y avoir des miroirs sur les principaux sites FTP dans
le monde.</P>
<P>
<UL>
<LI>ftp.funet.fi (128.214.6.100) : 
<A HREF="ftp://ftp.funet.fi/pub/OS/Linux/doc/">/pub/OS/Linux/doc/</A></LI>
<LI>tsx-11.mit.edu (18.172.1.2) : 
<A HREF="ftp://tsx-11.mit.edu/pub/linux/docs/">/pub/linux/docs/</A></LI>
<LI>sunsite.unc.edu (152.2.22.81) :
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/">/pub/Linux/docs/</A></LI>
<LI>ftp.ibp.fr (132.227.77.2) :
<A HREF="ftp://ftp.ibp.fr/pub/linux/french/docs/">/pub/linux/french/docs/</A></LI>
</UL>
</P>

<H3>La Feuille d'Informations Linux</H3>

<P>Une explication simple et efficace de ce qu'est Linux. C'est une des choses
que vous devriez remettre quand vous voulez expliquer pourquoi vous voulez
Linux et ce pour quoi il est bon.</P>
<P>La Feuille d'Informations Linux est disponible sur le World Wide Web &agrave;
<A HREF="http://sunsite.unc.edu/mdw/HOWTO/INFO-SHEET.html">http://sunsite.unc.edu/mdw/HOWTO/INFO-SHEET.html</A> et autres
miroirs.</P>


<H3>La Meta-FAQ Linux</H3>

<P>Une liste d'autres ressources d'informations, bien plus compl&egrave;tes que
celle-ci. La Meta-FAQ est disponible sur le World Wide Web &agrave; 
<A HREF="http://sunsite.unc.edu/mdw/HOWTO/META-FAQ.html">http://sunsite.unc.edu/mdw/HOWTO/META-FAQ.html</A> et autres 
miroirs.</P>

<H3>La carte des logiciels Linux</H3>

<P>La liste des logiciels disponibles pour Linux sur Internet. Bien des
paquetages list&eacute;s ici ont &eacute;t&eacute; trouv&eacute;s gr&acirc;ce &agrave; elle. Elle est disponible sous
forme d'index de recherche &agrave;
<A HREF="http://www.boutell.com/lsm/">http://www.boutell.com/lsm/</A>. Elle est aussi disponible comme un
simple fichier texte sur tous les sites FTP d&eacute;crits dans la section 
<A HREF="#linux-docs">Documentation Linux</A>.</P>

<H3><A NAME="HOWTOs"></A> Les documents HOWTO Linux</H3>

<P>Les documents HOWTO constituent la documentation principale de Linux. Cet
HOWTO Acc&egrave;s &agrave; Linux en est un exemple.</P>
<P>Le site de base du Projet de Documentation Linux qui produit ces informations
est 
<A HREF="http://sunsite.unc.edu/mdw/linux.html">http://sunsite.unc.edu/mdw/linux.html</A>. Il y a aussi beaucoup
de soci&eacute;t&eacute;s qui les produisent sous forme de livres. Contactez un fournisseur
Linux local pour plus de d&eacute;tails.</P>
<P>Les documents HOWTO Linux seront dans le r&eacute;pertoire <CODE>HOWTO</CODE> dans tous les
sites FTP mentionn&eacute;s dans la section 
<A HREF="#linux-docs">Documentation Linux</A>.</P>

<H3>La FAQ Linux</H3>

<P>Une liste des `Questions Fr&eacute;quemment Pos&eacute;es' avec les r&eacute;ponses qui devraient
r&eacute;soudre bien des questions g&eacute;n&eacute;rales. La liste FAQ est disponible &agrave;
<A HREF="http://www.cl.cam.ac.uk/users/iwj10/linux-faq/">http://www.cl.cam.ac.uk/users/iwj10/linux-faq/</A> comme dans tous les
sites FTP mentionn&eacute;s dans la section
<A HREF="#linux-docs">Documentation Linux</A>.</P>

<H2><A NAME="ss7.2">7.2 Listes de distribution</A>
</H2>

<P>Je connais deux listes couvrant ces probl&egrave;mes sp&eacute;cifiquement pour Linux.
Il y en a aussi d'autres qu'il est bon de regarder et qui couvrent
l'utilisation des ordinateurs plus g&eacute;n&eacute;ralement. Par le fait, si un
courrier est envoy&eacute; &agrave; l'une de ces listes je le <EM>lirai</EM> finalement et
incluerai toute information importante dans le HOWTO Access, vous n'avez
donc pas besoin de m'en adresser une copie s&eacute;par&eacute;e sauf si &ccedil;a a l'air
urgent.</P>

<H3>La liste Linux Access</H3>

<P>Voici une liste g&eacute;n&eacute;rale couvrant les probl&egrave;mes d'acc&egrave;s &agrave; Linux. Elle est
faite <EM>pour servir les besoins des utilisateurs et des d&eacute;veloppeurs du
syst&egrave;me
d'exploitation Linux et de logiciels, qui sont soit handicap&eacute;s ou veulent
aider &agrave; rendre Linux plus accessible</EM>. Pour vous abonner, envoyez un
courrier
&agrave; 
<A HREF="majordomo@ssv1.union.utah.edu">majordomo@ssv1.union.utah.edu</A> et dans le CORPS (pas le
sujet) du
message,
mettez :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
subscribe linux-access &lt;votre-adresse-email>
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>La liste Linux Blind</H3>

<P>Voici une liste de distribution couvrant l'utilisation de Linux pour les
utilisateurs aveugles. Il y a aussi une liste de logiciels importants et
utiles rassembl&eacute;s dans l'archive de la liste. Pour vous abonner, envoyez un
courrier &agrave; 
<A HREF="blinux-list-request@redhat.com">&lt;blinux-list-request@redhat.com&gt;</A> avec le <CODE>subject: help</CODE>. 
Cette liste est maintenant mod&eacute;r&eacute;e.</P>

<H2><A NAME="www"></A> <A NAME="ss7.3">7.3 R&eacute;f&eacute;rences WWW</A>
</H2>

<P>Le World Wide Web, par sa nature, change tr&egrave;s rapidement. Si vous lisez une
vieille version de ce document quelques informations risquent d'&ecirc;tre p&eacute;rim&eacute;es.
La version d'origine que je garde sur le WWW ne devrait pas &ecirc;tre trop vieille
de plus d'un ou deux mois, alors veuillez vous y rapporter.</P>
<P>La documentation sur Linux est disponible &agrave;
<A HREF="http://sunsite.unc.edu/mdw/linux.html">http://sunsite.unc.edu/mdw/linux.html</A></P>
<P>Acc&egrave;s &agrave; Linux sur le Web
<A HREF="http://www.tardis.ed.ac.uk/~mikedlr/access/">http://www.tardis.ed.ac.uk/~mikedlr/access/</A> avec toutes
les versions du HOWTO &agrave;
<A HREF="http://www.tardis.ed.ac.uk/~mikedlr/access/HOWTO/">http://www.tardis.ed.ac.uk/~mikedlr/access/HOWTO/</A>.
De pr&eacute;f&eacute;rence, cependant, t&eacute;l&eacute;chargez &agrave; partie d'un des principaux sites FTP
Linux. Si j'ai beaucoup de trafic je devrai fermer ces pages et les d&eacute;placer
autre part.</P>
<P>Le projet de documentation et de d&eacute;veloppement BLINUX 
<A HREF="http://leb.net/blinux/">http://leb.net/blinux/</A>. &lt;&lt; Le but du projet de documentation
et de d&eacute;veloppement BLINUX est de servir de catalyseur qui stimulera et
acc&eacute;l&egrave;rera le d&eacute;veloppement des logiciels et de la documentation qui
permettront aux utilisateurs aveugles de faire tourner leur propre station
Linux.&gt;&gt; </P>
<P>Page WWW d'Emacspeak :</P>
<P>
<A HREF="http://www.research.digital.com/CRL/personal/raman/emacspeak/emacspeak.html">http://www.research.digital.com/CRL/personal/raman/emacspeak/emacspeak.html</A></P>
<P>Page WWW non officielle de BRLTTY :
<A HREF="http://www.sf.co.kr/t.linux/new/brltty.html">http://www.sf.co.kr/t.linux/new/brltty.html</A></P>
<P>Yahoo (l'un des plus grands catalogues sur Internet) :</P>
<P>
<A HREF="http://www.yahoo.com/Society_and_Culture/Disabilities/Adaptive_Technology/">http://www.yahoo.com/Society_and_Culture/Disabilities/Adaptive_Technology/</A></P>
<P>Le projet Linux Lab 
<A HREF="http://www.fu-berlin.de/~clausi/">http://www.fu-berlin.de/~clausi/</A>.</P>
<P>Les pages BLYNX : des fichiers de support pour Lynx faits pour les
utilisateurs aveugles et d&eacute;ficients visuels 
<A HREF="http://leb.net/blinux/blynx/">http://leb.net/blinux/blynx/</A>.</P>

<H2><A NAME="ss7.4">7.4 Fournisseurs</A>
</H2>

<P>Voici un fournisseur britannique pour le Braillex</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Alphavision Limited
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss7.5">7.5 Fabricants</A>
</H2>

<H3>Alphavision</H3>

<P>Je pense que ce sont des fabricants ? RNIB ne les liste que comme
fournisseurs, mais d'autres disent qu'ils fabriquent le Braillex.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Alphavision Ltd
Seymour House
Copyground Lane
High Wycombe
Bucks HP12 3HE
England
U.K.
</PRE>
</CODE></BLOCKQUOTE>

<DL>
<DT><B>T&eacute;l&eacute;phone :</B><DD><P>+44 1494-530 555</P>
</DL>
</P>

<H3>Produits Alphavision AT support&eacute;s par Linux</H3>

<P>
<UL>
<LI>Braillex</LI>
</UL>
</P>

<H3>Blazie Engineering</H3>

<P>Le Braille Lite &eacute;tait support&eacute; dans la version d'origine de 
<CODE>BRLTTY</CODE>. Ce support s'est maintenant arr&ecirc;t&eacute;. Si vous en avez un et voulez
l'utiliser avec Linux, cela pourrait &ecirc;tre possible en utilisant cette version
du logiciel.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Blazie Engineering
105 East Jarrettsville Rd. 
Forest Hill, MD 21050 
U.S.A.
</PRE>
</CODE></BLOCKQUOTE>

<DL>
<DT><B>T&eacute;l&eacute;phone :</B><DD><P>+1 (410) 893-9333</P>
<DT><B>FAX :</B><DD><P>+1 (410) 836-5040 </P>
<DT><B>BBS :</B><DD><P>+1 (410) 893-8944 </P>
<DT><B>E-Mail :</B><DD><P>
<A HREF="mailto:info@blazie.com">&lt;info@blazie.com&gt;</A></P>
<DT><B>WWW :</B><DD><P>
<A HREF="http://www.blazie.com/">http://www.blazie.com/</A></P>
</DL>
</P>

<H3>Produits AT Blazie</H3>

<P>
<UL>
<LI>Braille Lite (support arr&ecirc;t&eacute;)</LI>
</UL>
</P>

<H3>Digital Equipment Corporation</H3>

<P>
<BLOCKQUOTE><CODE>
<PRE>
Digital Equipment Corporation
P.O. Box CS2008
Nashua
NH 03061-2008
U.S.A
</PRE>
</CODE></BLOCKQUOTE>

<DL>
<DT><B>Commandes :</B><DD><P>+1 800-722-9332</P>
<DT><B>Infos techniques :</B><DD><P>+1 800-722-9332</P>
<DT><B>FAX :</B><DD><P>+1 603-884-5597</P>
<DT><B>WWW :</B><DD><P>
<A HREF="http://www.digital.com/">http://www.digital.com/</A></P>
</DL>
</P>

<H3>Produits DEC AT support&eacute;s par Linux</H3>

<P>
<UL>
<LI>DECTalk Express</LI>
</UL>
</P>

<H3>Kommunikations-Technik Stolper GmbH</H3>

<P>
<BLOCKQUOTE><CODE>
<PRE>
KTS Stolper GmbH
Herzenhaldenweg 10
73095 Albershausen
Germany
</PRE>
</CODE></BLOCKQUOTE>

<DL>
<DT><B>T&eacute;l&eacute;phone :</B><DD><P>+49 7161 37023</P>
<DT><B>Fax :</B><DD><P>+49 7161 32632</P>
</DL>
</P>

<H3>Produits KTG AT support&eacute;s par Linux</H3>

<P>
<UL>
<LI>Brailloterm</LI>
</UL>
</P>

<H2><A NAME="s8">8. Paquetages logiciels</A></H2>

<P>Les r&eacute;f&eacute;rences de cette section sont tir&eacute;es directement de la carte des
logiciels Linux que l'on peut trouver dans tous les endroits standards pour la
documentation Linux et qui liste quasiment tous les logiciels disponibles pour
Linux.</P>

<H2><A NAME="emacspeak"></A> <A NAME="ss8.1">8.1 Emacspeak</A>
</H2>

<P>Emacspeak est la partie logicielle d'une interface vocale pour Linux.
Tout autre programme bas&eacute; sur les caract&egrave;res, comme un browser WWW, ou
<CODE>telnet</CODE> ou un autre &eacute;diteur peuvent th&eacute;oriquement &ecirc;tre utilis&eacute;s avec
<CODE>emacspeak</CODE>. La diff&eacute;rence principale entre &ccedil;a et un logiciel de lecture
d'&eacute;cran normal pour un syst&egrave;me d'exploitation tel que DOS est qu'il a aussi
plein de possibilit&eacute;s en plus. Il est bas&eacute; sur l'&eacute;diteur Emacs.</P>
<P>Un &eacute;diteur de texte est en g&eacute;n&eacute;ral simplement un programme qui vous permet
de changer le contenu d'un fichier, par exemple, en ajoutant des
informations nouvelles &agrave; une lettre. Emacs est en fait loin d'&ecirc;tre un
&eacute;diteur de texte normal, et donc ce paquetage est beaucoup plus utile que
vous ne pourriez l'imaginer. Vous pouvez lancer n'importe quel autre
programme &agrave; partir d'Emacs, avec toute sortie qu'il g&eacute;n&egrave;re pouvant
appara&icirc;tre dans l'&eacute;mulateur de terminal d'Emacs.</P>
<P>Les raisons pour lesquelles Emacs est un meilleur environnement pour
Emacspeak est qu'il peut comprendre la disposition sur l'&eacute;cran et peut
interpr&eacute;ter intelligemment la signification de, par exemple, un
calendrier, qui serait sinon un simple tableau d&eacute;sordonn&eacute; de nombres.
L'auteur de ce paquetage parvient &agrave; g&eacute;rer enti&egrave;rement sa propre machine
Linux en faisant toute l'administration &agrave; partir d'Emacs. Il l'utilise
aussi pour contr&ocirc;ler une grande vari&eacute;t&eacute; d'autres machines et de logiciels
directement de cette machine.</P>
<P>Emacspeak est inclus dans la distribution Debian Linux et est inclus en
tant que logiciel contribu&eacute; dans la distribution Slackware. Ceci veut dire
qu'il est disponible sur de nombreuses distributions Linux sur CD-ROM. &Agrave;
l'heure o&ugrave; ceci sera publi&eacute;, la version incluse sera 5 ou mieux, mais &agrave;
pr&eacute;sent je n'ai que la version 4 disponible pour l'examiner.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Begin3
Titre :         emacspeak - interface de sortie parl&eacute;e pour Emacs
Version :       4.0
Entr&eacute; le :      30 MAI 96
Description :   Emacspeak est le premier syst&egrave;me complet de synth&egrave;se
                vocale qui permettra &agrave; toute personne malvoyante de
                travailler directement sur un syst&egrave;me Unix. (Jusqu'&agrave;
                maintenant, la seule alternative disponible aux
                utilisateurs d&eacute;ficients visuels &eacute;tait d'utiliser un PC
                dot&eacute; de parole comme terminal.) Emacspeak repose sur
                Emacs. Une fois que vous avez d&eacute;marr&eacute; Emacs avec Emacspeak
                charg&eacute;, vous avez une r&eacute;ponse parl&eacute;e &agrave; tout ce que vous
                faites. Cela d&eacute;pendra de ce que vous &ecirc;tes capable de faire
                avec Emacs. Il n'y a rien que vous ne puissiez faire avec
                Emacs :-)
Mots cl&eacute;s :     handicap acc&egrave;s d&eacute;ficient visuel aveugle parole Emacs
Auteur :        raman@adobe.com (T. V. Raman)
Maintenu par :  jrv@vanzandt.mv.com (Jim Van Zandt)
Site de base :  sunsite.unc.edu apps/sound/speech
                124kB   emacspeak-4.0.tgz
Autre site :
Site d'origine : http://www.cs.cornell.edu /pub/raman/emacspeak
                123kB   emacspeak.tar.gz/Info/People/raman/emacspeak/emacspeak.tar.gz
Platformes :    DECtalk Express ou synth&eacute;tiseur vocal DEC Multivoice,
                GNU FSF Emacs 19 (version 19.23 ou plus) et TCLX
                7.3B (TCL &eacute;tendu).
Licence :       GPL
End
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="brltty"></A> <A NAME="ss8.2">8.2 BRLTTY</A>
</H2>

<P>Voici un programme pour faire tourner un terminal Braille sur le port
s&eacute;rie. Il a &eacute;t&eacute; largement test&eacute; et utilis&eacute;, et supporte de nombreux
diff&eacute;rents types de mat&eacute;riels (voir l'entr&eacute;e sur la Carte des Logiciels
Linux ci-dessous).</P>
<P>Le mainteneur est Nikhil Nair, 
<A HREF="mailto:nn201@cus.cam.ac.uk">&lt;nn201@cus.cam.ac.uk&gt;</A>. Les autres personnes qui travaillent
dessus sont Nicolas Pitre, 
<A HREF="mailto:nico@cam.org">&lt;nico@cam.org&gt;</A> et St&eacute;phane Doyon, 
<A HREF="mailto:doyons@jsp.umontreal.ca">&lt;doyons@jsp.umontreal.ca&gt;</A>. Veuillez envoyer tout commentaire
&agrave; chacun d'entre eux.</P>
<P>Les auteurs semblent int&eacute;r&eacute;ss&eacute;s pour recevoir du support pour plus de
p&eacute;riph&eacute;riques diff&eacute;rents, et donc si vous en avez un, vous devriez penser
&agrave; les contacter. Ils auront certainement besoin d'information sur la
programmation du p&eacute;riph&eacute;rique, donc si vous pouvez contacter votre
fabricant et l'obtenir, ils seront plus &agrave; m&ecirc;me de vous aider.</P>
<P>Voici une petite liste (tir&eacute;e de leur fichier <CODE>README</CODE>) pour vous
mettre l'eau &agrave; la bouche :</P>
<P>
<UL>
<LI>int&eacute;gration compl&egrave;te des possibilit&eacute;s normales de visualisation de
l'&eacute;cran ;
</LI>
<LI>une grande &eacute;tendue de capacit&eacute;s suppl&eacute;mentaires en option, comme le
curseur clignotant et les lettres majuscules, le gel de l'&eacute;cran pour une
lecture plus commode, l'affichage avec attributs pour rep&eacute;rer le texte
s&eacute;lectionn&eacute;, les liens hypertextes, etc. ;
</LI>
<LI>routage du curseur <EM>intelligent</EM>. Ceci facilite le mouvement du
curseur dans les &eacute;diteurs de texte, etc. sans enlever les mains de
l'afficheur Braille ;
</LI>
<LI>une fonction de copier / coller. Ceci est particuli&egrave;rement utile
pour copier des noms de fichiers longs, des commandes compliqu&eacute;es, etc. ;
</LI>
<LI>possibilit&eacute; d'aide en ligne ;
</LI>
<LI>support pour plusieurs codes Braille ;
</LI>
<LI>une conception modulaire qui permet l'ajout relativement facile d'un
nouveau pilote pour d'autres afficheurs Braille, ou m&ecirc;me (on peut
l'esp&eacute;rer) le portage vers d'autres plate-formes <EM>Unix-like</EM>.
</LI>
</UL>
</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Begin3
Titre :         BRLTTY - Logiciel d'acc&egrave;s &agrave; Unix pour une personne aveugle
                utilisant un terminal Braille
Version :       0.22, 22SEP95
Date-entr&eacute;e :   24SEP95
Description :   BRLTTY est un daemon qui fournit l'acc&egrave;s &agrave; une console Unix
                pour une personne aveugle utilisant un afficheur Braille
                (voir le fichier README pour plus d'explications).

                BRLTTY ne fonctionne qu'avec les applications en mode texte.

                Nous esp&eacute;rons que ce syst&egrave;me sera &eacute;tendu pour supporter
                d'autres afficheurs Braille, et m&ecirc;me d'autres
                plate-formes Unix.
Mots-Cl&eacute;s :     Braille console acc&egrave;s malvoyant aveugle
Auteur :        nn201@cam.ac.uk (Nikhil Nair)
                nico@cam.org (Nicolas Pitre)
                doyons@jsp.umontreal.ca (Stephane Doyon)
                jrbowden@bcs.org.uk (James Bowden)
Maintenu-par :  nn201@cam.ac.uk (Nikhil Nair)
Site-de-base :  sunsite.unc.edu /pub/Linux/system/Access
                110kb brltty-1.0.2.tar.gz (avec le fichier README)
                6kb brltty-0.22.README
                1kb brltty-1.0.2.lsm
Plate-formes :  Linux (noyau 1.1.92 ou plus) sur un PC ou DEC Alpha.
                Pas de X/graphiques.
                - Tieman B.V.'s CombiBraille 25/45/85 ;
                - Alva B.V. mod&egrave;les ABT3xx ;
                - Telesensory Systems Inc. PowerBraille 40 (pas les
                65/80), Navigator 20/40/80 (derni&egrave;re version logiciel
                fabricant seulement ?).
Copying-Policy : GPL
End
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss8.3">8.3 Screen</A>
</H2>

<P>Screen est un logiciel standard qui permet &agrave; plusieurs programmes
diff&eacute;rents de tourner en m&ecirc;me temps sur un seul terminal. Il a &eacute;t&eacute;
am&eacute;lior&eacute; pour supporter directement certains terminaux Braille (ceux de
Telesensory).</P>

<H2><A NAME="ss8.4">8.4 Rsynth</A>
</H2>

<P>Voici un synth&eacute;tiseur vocal list&eacute; dans la Carte des Logiciels Linux. Il ne
marche apparamment pas assez bien pour qu'une personne malvoyante l'utilise.
Utilisez du mat&eacute;riel &agrave; la place, ou am&eacute;liorez-le... Un synth&eacute;tiseur vocal
gratuit serait vraiment utile.</P>

<H2><A NAME="ss8.5">8.5 xocr</A>
</H2>

<P><CODE>xocr</CODE> est un paquetage qui met en place la reconnaissance optique de
caract&egrave;res pour Linux. Comme pour <CODE>Rsynth</CODE>, je ne pense pas que ce
paquetage soit acceptable comme seul moyen d'entr&eacute;e pour une personne
malvoyante. Je suspecte que l'algorithme utilis&eacute; aie besoin d'&ecirc;tre examin&eacute;
par
quelqu'un qui puisse v&eacute;rifier qu'il lit correctement. J'aimerais qu'on me
prouve le contraire.</P>

<H2><A NAME="xzoom"></A> <A NAME="ss8.6">8.6 xzoom</A>
</H2>

<P><CODE>xzoom</CODE> est un agrandisseur d'&eacute;cran, du m&ecirc;me genre que <CODE>xmag</CODE>, mais
suffisamment meilleur pour &ecirc;tre tr&egrave;s utile &agrave; une personne malvoyante. Les
principaux d&eacute;savantages de <CODE>xzoom</CODE> sont qu'il ne peut pas agrandir sous
lui-m&ecirc;me, que certaines touches de contr&ocirc;le ne sont pas compatibles avec
<CODE>fvwm</CODE>, le gestionnaire de fen&ecirc;tres normal sous Linux et que sa
configuration par d&eacute;faut ne fonctionne pas &agrave; travers le r&eacute;seau (ceci peut &ecirc;tre
r&eacute;solu au prix d'une baisse de vitesse). A part cela sinon, il est excellent.
Il fait de l'agrandissement continu ce qui vous permet, par exemple, de
faire d&eacute;filer un document vers le haut et vers le bas tout en gardant agrandie
la section que vous lisez. De m&ecirc;me, vous pouvez d&eacute;placer une petite bo&icirc;te
autour de l'&eacute;cran, en en agrandissant le contenu et en vous laissant chercher
la partie que vous voulez voir. <CODE>xzoom</CODE> est aussi disponible sous forme de
RPM sur les sites normaux de RedHat, ce qui le rend tr&egrave;s facile &agrave; installer
pour les gens qui utilisent le syst&egrave;me RPM (comme les utilisateurs RedHat).</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Begin3
Titre:          xzoom
Version:        0.1
Date-entr&eacute;e:    Mar 30 1996
Description:    xzoom peut agrandir (par valeurs enti&egrave;res) tourner
                (par un multiple de 90 degr&eacute;s) et faire un miroir autour
                des axes X ou Y des parties de l'&eacute;cran X11
                et les afficher dans sa fen&ecirc;tre.
Mots-Cl&eacute;s:      X11 zoom agrandi xmag
Auteur:         Itai Nahshon &lt;nahshon@best.com>
Maintenu-par:   Itai Nahshon &lt;nahshon@best.com>
Site-de-base:   sunsite.unc.edu
                probablement dans /pub/Linux/X11/xutils/xzoom-0.1.tgz
Plate-formes:   Linux+11. Support seulement pour 8-bit.
                Test&eacute; seulement sur Linux 1.3.* avec le serveur XSVGA 3.1.2
                N&eacute;cessite l'extension XSHM.
Copying-policy: Gratuit
End
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="nfbtrans"></A> <A NAME="ss8.7">8.7 NFBtrans</A>
</H2>

<P><CODE>nfbtrans</CODE> est un programme de traduction Braille multi-niveaux
distribu&eacute; par la F&eacute;d&eacute;ration Nationale des Aveugles aux Etats-Unis. Il est
distribu&eacute; gratuitement dans l'espoir que quelqu'un l'am&eacute;liore. Les langues
couvertes sont l'anglais am&eacute;ricain, l'anglais britannique, l'espagnol, le
russe, l'esperanto, l'allemand, l'h&eacute;breu biblique et le grec biblique,
bien que d'autres puissent &ecirc;tre ajout&eacute;es en &eacute;crivant simplement une table
de traduction. Sont aussi couverts certains symboles informatiques et
math&eacute;matiques. J'ai r&eacute;ussi &agrave; le compiler sous Linux, mais comme je n'ai
pas de presse Braille disponible en ce moment, je n'ai pas pu le tester. </P>
<P>NFBtrans est disponible &agrave;
<A HREF="ftp://nfb.org/ftp/nfb/braille/nfbtrans/">ftp://nfb.org/ftp/nfb/braille/nfbtrans/</A>. Apr&egrave;s l'avoir t&eacute;l&eacute;charg&eacute;,
vous devrez le compiler.</P>

<H3>Compiler NFBtrans sur Linux</H3>

<P>J'ai envoy&eacute; ce patch au mainteneur de NFBtrans et il dit qu'il l'a inclus,
donc si vous avez une version plus r&eacute;cente que 740, vous n'aurez s&ucirc;rement rien
de sp&eacute;cial &agrave; faire. Suivez juste les instructions incluses dans le paquetage.</P>

<P>
<BLOCKQUOTE><CODE>
<PRE>
unzip -L NFBTR740.ZIP   #ou tout nom de fichier que vous ayez
mv makefile Makefile
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>Apr&egrave;s sauvez ce qui suit dans un fichier (par exemple <CODE>patch-file</CODE>)</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
*** nfbpatch.c.orig     Tue Mar 12 11:37:28 1996
--- nfbpatch.c  Tue Mar 12 11:37:06 1996
***************
*** 185,190 ****
--- 185,193 ----
    return (finfo.st_size);
  }                /* filelength */
  
+ #ifndef linux 
+ /* pretty safe to assume all linux has usleep I think ?? this should be
+ done properly anyway */
  #ifdef SYSVR4
  void usleep(usec)
    int usec;
***************
*** 195,200 ****
--- 198,204 ----
  }                /* usleep */
  
  #endif
+ #endif 
  
  void beep(count)
    int count;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>et lancez</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
patch &lt; patch-file
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>puis tapez</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
make
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>et le programme devrait compiler.</P>

<H2><A NAME="unwindows"></A> <A NAME="ss8.8">8.8 UnWindows</A>
</H2>

<P>UnWindows est un paquetage d'utilitaires d'acc&egrave;s sous X qui fournit de
nombreuses capacit&eacute;s utiles pour les d&eacute;ficients visuels (pas les
aveugles). Il comprend un agrandisseur d'&eacute;cran et d'autres utilitaires
personnalis&eacute;s pour aider &agrave; situer le pointeur. Vous pouvez charger
UnWindows depuis 
<A HREF="ftp://ftp.cs.rpi.edu/pub/unwindows">ftp://ftp.cs.rpi.edu/pub/unwindows</A>.</P>
<P>Livr&eacute; par d&eacute;faut, le paquetage ne fonctionnera pas sur Linux parce qu'il
d&eacute;pend de certaines capacit&eacute;s des Sun. Cependant, certains des utilitaires
fonctionnent et j'ai r&eacute;ussi &agrave; porter la plupart du reste de sorte que ce
paquetage peut int&eacute;resser certaines personnes. Mon portage sera soit
r&eacute;incorpor&eacute; dans l'original ou bien sera disponible dans les archives
BLINUX (voir 
<A HREF="#www">r&eacute;f&eacute;rences WWW</A>). L'utilitaire restant
qui ne fonctionne pas encore est l'utilitaire de configuration.</P>
<P>Dans ma version les programmes, au lieu de g&eacute;n&eacute;rer eux-m&ecirc;mes les sons, ne
font qu'appeler un autre programme. L'autre programme pourrait &ecirc;tre par
exemple :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
play /usr/lib/games/xboing/sounds/ouch.au
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>qui rendrait le son &lt;&lt; ouch &gt;&gt; de <CODE>xboing</CODE>, par exemple il
pourrait faire cela quand le pointeur atteint le bord gauche de l'&eacute;cran. </P>

<H3>dynamag</H3>

<P><CODE>dynamag</CODE> est un programme d'agrandissement d'&eacute;cran. Veuillez voir
la section sur l'agrandissement d'&eacute;cran (
<A HREF="#screen-mag">agrandissement</A>). Ce programme fonctionnait dans la distribution
par d&eacute;faut.</P>

<H3>coloreyes</H3>

<P><CODE>coloreyes</CODE> facilite la localisation du pointeur de souris. Il
consiste en une paire d'yeux qui regardent toujours dans la direction du
pointeur (comme <CODE>xeyes</CODE>) et changent de couleur selon la distance de la
souris aux yeux (diff&eacute;rent d'<CODE>xeyes</CODE>). Ceci ne fonctionne pas dans la
distribution par d&eacute;faut, mais la version de test, au m&ecirc;me endroit, semble
fonctionner.</P>

<H3>border</H3>

<P><CODE>border</CODE> est un programme qui d&eacute;tecte quand le pointeur de la souris
a atteint le bord de l'&eacute;cran et fait un son selon le bord de l'&eacute;cran qui a
&eacute;t&eacute; atteint. La version disponible utilise un syst&egrave;me de son sp&eacute;cifique &agrave;
Sun. Je l'ai maintenant chang&eacute; pour qu'au lieu de cela, il lance
simplement une commande, qui peut &ecirc;tre n'importe quel programme de son
sous Linux.</P>

<H3>un-twm</H3>

<P>Le gestionnaire de fen&ecirc;tres est un programme sp&eacute;cial qui contr&ocirc;le
l'emplacement de toutes les autres fen&ecirc;tres (programmes) affich&eacute;es sur
l'&eacute;cran X. <CODE>un-twm</CODE> en est une version sp&eacute;ciale qui fait un son &agrave;
chaque fois que le pointeur entre dans une fen&ecirc;tre diff&eacute;rente. Le son
d&eacute;pendra de la fen&ecirc;tre dans laquelle on vient d'entrer. La version
distribu&eacute;e ne fonctionne pas avec Linux parce que, comme <CODE>border</CODE>, elle
d&eacute;pend des capacit&eacute;s sonores des Sun. Encore une fois, j'ai d&eacute;j&agrave; une
version sp&eacute;ciale qui sera disponible au moment o&ugrave; vous lirez ceci.</P>

<H2><A NAME="s9">9. Mat&eacute;riel</A></H2>

<H2><A NAME="memmap-braille"></A> <A NAME="ss9.1">9.1 Terminaux Braille pilot&eacute;s &agrave; partir de la m&eacute;moire &eacute;cran</A>
</H2>

<P>Voici des terminaux Braille qui peuvent lire la m&eacute;moire &eacute;cran directement en
mode texte normal. Il est possible de l'utiliser pour fonctionner avec Linux
pour quasiment toutes les choses qu'un utilisateur voyant peut faire sur la
console, en comprenant l'installation. Cependant, il a un probl&egrave;me avec le
d&eacute;filement du noyau Linux normal, un patch du noyau doit donc &ecirc;tre appliqu&eacute;.
Voyez 
<A HREF="#memmap-patch">Patcher le noyau pour Braillex et Brailloterm</A>.</P>

<H3>Braillex </H3>

<P>Le Braillex est un terminal qui est fait pour lire directement la m&eacute;moire
&eacute;cran, s'affranchissant de tout probl&egrave;me avec les programmes MS-DOS qui se
comportent de fa&ccedil;on bizarre. Si vous pouviez voir quelque chose &agrave; l'&eacute;cran,
alors ce
terminal devrait &ecirc;tre capable de l'afficher en Braille. Sous Linux,
malheureusement, la manipulation de l'&eacute;cran est faite diff&eacute;remment de MS-DOS,
et ceci doit par cons&eacute;quent &ecirc;tre un peu modifi&eacute;.</P>
<P>Pour faire fonctionner ce terminal, vous devez appliquer le patch donn&eacute;
ci-dessous dans la section 
<A HREF="#memmap-patch">Patcher le noyau</A>.
Une fois que ceci est fait, le Braillex devient une des mani&egrave;res les plus
pratiques d'utiliser Linux puisqu'il permet de lire toutes les informations
normalement disponibles pour une personne voyante. D'autres terminaux ne
d&eacute;marrent pas tant que le syst&egrave;me d'exploitation a enti&egrave;rement d&eacute;marr&eacute;.</P>
<P>Le Braillex est disponible en deux arrangements de cellules Braille (80x1 ou
40x2) et il y a un mod&egrave;le, appel&eacute; IB 2-D qui poss&egrave;de aussi une barre verticale
pour montrer les informations sur toutes les lignes de l'&eacute;cran (en utilisant
4 points programmables par ligne d'&eacute;cran).</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Prix: 8,995 UKP (livres sterling) ou 11495 UKP pour le 2-D
Fabricant: Alphavision Limited (UK)
Fournisseurs: ????
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Brailloterm</H3>

<P>``Qu'est-ce que Brailloterm ?</P>

<P> C'est un afficheur Braille rafraichissable, fabriqu&eacute; par KTS
Kommunikations-Technik Stolper GmbH. Il poss&egrave;de 80 cellules Braille sur
une ligne unique. Chaque cellule poss&egrave;de 8 points qui sont combin&eacute;s
(haut/bas)  pour repr&eacute;senter un caract&egrave;re. Par d&eacute;faut, Brailloterm me
montre la ligne sur laquelle le curseur &eacute;cran se trouve. Je peux utiliser
certaines fonctions du Brailloterm pour voir n'importe quelle ligne de
l'&eacute;cran.'' - <I>Jose Vilmar Estacio de Souza</I> 
<A HREF="mailto:jvilmar@embratel.net.br">&lt;jvilmar@embratel.net.br&gt;</A></P>

<P>Jose continue en disant que le terminal peut aussi utiliser le port s&eacute;rie sous
DOS mais qu'il n&eacute;cessite un programme sp&eacute;cial. Je ne sais pas si l'un de ceux
pour Linux fonctionnerait.</P>

<P>Comme pour le Braillex, ceci n&eacute;cessite un patch sp&eacute;cial pour fonctionner
correctement avec le noyau. Voyez la section 
<A HREF="#memmap-patch">Patcher le noyau</A>.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Prix: autour de 23.000,- DM /  $ 15.000,
Fabricant: Kommunikations-Technik Stolper GmbH
Fournisseurs: ????
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H3><A NAME="memmap-patch"></A> Patcher le noyau pour le Braillex et le Brailloterm</H3>

<P>Ceci s'applique aussi probablement &agrave; tout autre terminal qui lit directement
la m&eacute;moire &eacute;cran pour fonctionner sous MS-DOS. Cablez-moi pour confirmer que
tous les terminaux que vous trouvez fonctionnent. Ceci ne s'applique pas
aux terminaux pilot&eacute;s avec le logiciel BRLTTY et peut en fait perdre
certaines caract&eacute;ristiques.</P>

<P>Je me suis laiss&eacute; dire que ce patch s'applique &agrave; tous les noyaux version
1.2.X. Il devrait aussi fonctionner sur tous les noyaux de 1.1.X &agrave; 1.3.72,
avec un simple avertissement (warning) de <CODE>patch</CODE> (J'ai test&eacute; que le patch
s'appliquait au moins jusqu'&agrave; 1.3.68). <B>A partir de 1.3.75 le patch n'est
plus n&eacute;cessaire</B> parce qu'on peut configurer le noyau pour ne pas d&eacute;filer en
utilisant `<CODE>linux no-scroll</CODE>' au prompt LILO. Voyez le HOWTO Boot Prompt
pour plus de d&eacute;tails.</P>

<P>
<BLOCKQUOTE><CODE>
<PRE>
*** drivers/char/console.c~     Fri Mar 17 07:31:40 1995
--- drivers/char/console.c      Tue Mar  5 04:34:47 1996
***************
*** 601,605 ****
  static void scrup(int currcons, unsigned int t, unsigned int b)
  {
!       int hardscroll = 1;
  
        if (b > video_num_lines || t >= b)
--- 601,605 ----
  static void scrup(int currcons, unsigned int t, unsigned int b)
  {
!       int hardscroll = 0;
  
        if (b > video_num_lines || t >= b)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Pour l'appliquer :</P>
<P>
<OL>
<LI>sauvez le texte ci-dessus dans un fichier (disons <CODE>patch-file</CODE>) ;</LI>
<LI>allez dans le r&eacute;pertoire <CODE>drivers/char</CODE> dans vos
sources du noyau ;</LI>
<LI>lancez 
<BLOCKQUOTE><CODE>
<PRE>
                patch &lt; patch-file
        
</PRE>
</CODE></BLOCKQUOTE>
</LI>
<LI>compilez votre noyau comme d'habitude.</LI>
</OL>
</P>

<P>Appliquez ces patches et vous devriez &ecirc;tre capable d'utiliser le terminal
Braille comme d'habitude pour lire la console Linux.</P>

<P>En bref, le patch veut juste dire &lt;&lt; change le 1 en 0 dans la
premi&egrave;re ligne de la fonction <CODE>scrup</CODE> qui devrait &ecirc;tre vers la ligne
603 dans le fichier <CODE>drivers/char/console.c</CODE> &gt;&gt;. La chose
principale &agrave; propos de <CODE>patch</CODE> est que ce programme comprend ceci, et
qu'il sait deviner que faire quand les d&eacute;veloppeurs Linux changent des
choses dans ce fichier. </P>

<P>Si vous voulez utiliser un noyau plus moderne avec le d&eacute;filement compl&egrave;tement
d&eacute;sactiv&eacute;, (au lieu de la solution du prompt de d&eacute;marrage que j'ai d&eacute;j&agrave;
mentionn&eacute;e), veuillez utiliser le patch suivant. <B>Ceci ne s'applique pas
aux noyaux ant&eacute;rieurs &agrave; 1.3.75</B>.</P>

<P>
<BLOCKQUOTE><CODE>
<PRE>
*** console.c~  Fri Mar 15 04:01:45 1996
--- console.c   Thu Apr  4 13:29:48 1996
***************
*** 516,520 ****
  unsigned char has_wrapped;          /* all of videomem is data of fg_console */
  static unsigned char hardscroll_enabled;
! static unsigned char hardscroll_disabled_by_init = 0;

  void no_scroll(char *str, int *ints)
--- 516,520 ----
  unsigned char has_wrapped;          /* all of videomem is data of fg_console */
  static unsigned char hardscroll_enabled;
! static unsigned char hardscroll_disabled_by_init = 1;

  void no_scroll(char *str, int *ints)
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="serial-braille"></A> <A NAME="ss9.2">9.2 Terminaux Braille pilot&eacute;s par logiciel</A>
</H2>

<P> Le principe de fonctionnement de ces terminaux est tr&egrave;s proche de
celui d'un terminal comme le VT100. Ils se connectent sur le port s&eacute;rie et
l'ordinateur doit lancer un programme qui leur envoie une sortie. En ce
moment on connait deux programmes pour Linux. <CODE>BRLTTY</CODE>, voir la section
<A HREF="#brltty">BRLTTY</A>) et l'&eacute;cran am&eacute;lior&eacute; Braille.</P>

<H3>Tieman B.V.</H3>

<H3>CombiBraille</H3>

<P>Ce terminal Braille est support&eacute; par le logiciel <CODE>BRLTTY</CODE>. IL est
fourni en trois versions avec 25, 45 ou 85 cellules Braille. Les cinq
cellules suppl&eacute;mentaires par rapport &agrave; un affichage normal sont utilis&eacute;es
pour les informations d'&eacute;tat.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Prix: autour de 4600 UKP pour le mod&egrave;le 45 cellules...
Fabricant: Tieman B.V.
Fournisseurs: Concept Systems, Nottingham, England (t&eacute;l&eacute;phone +44 115 925 5988)
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Alva B.V.</H3>

<P>Les mod&egrave;les ABT3xx sont support&eacute;s par <CODE>BRLTTY</CODE>. Seul le ABT340 est
s&ucirc;r de fonctionner en ce moment. Veuillez donner des informations aux
auteurs de <CODE>BRLTTY</CODE> sur les autres mod&egrave;les.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Prix : 20 cellules, 2200 UKP ; 40 cellules, 4500 UKP ; 80 cellules, 8000 UKP
Fabricant : Alva
Fournisseurs : Professional Vision Services LTD, Hertshire, Angleterre
               (+44 1462 677331)
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Afficheurs Telesensory Systems Inc.</H3>

<P>Les afficheurs Telesensory sont support&eacute;s &agrave; la fois par <CODE>BRLTTY</CODE> et
<CODE>screen</CODE>, parce qu'ils ont fourni des informations sur la
programmation aux d&eacute;veloppeurs.</P>

<H3>PowerBraille</H3>

<P>Il y a trois mod&egrave;les, le 40, le 65 et le 80. Seul le 40 est support&eacute;
par <CODE>BRLTTY</CODE>.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
NdT : prix apparemment faux dans la version originale
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Navigator</H3>

<P>Encore une fois, il y a trois mod&egrave;les, le 20, le 60 et le 80. Des
versions r&eacute;centes fonctionnent toutes avec <CODE>BRLTTY</CODE> mais le fait que
des versions plus anciennes (avec un logiciel constructeur plus ancien)
fonctionnent aussi n'a pas &eacute;t&eacute; confirm&eacute;.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Prix : 80 cellules, 7800 UKP
Fabricant : Alva
Fournisseurs : Professional Vision Services LTD, Hertshire, Angleterre
               (+44 1462 677331)
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Braille Lite</H3>

<P>Ceci est plus un ordinateur portable qu'un terminal. Il pourrait, cependant,
&ecirc;tre utilis&eacute; avec BRLTTY version 0.22 (mais pas les versions plus r&eacute;centes)
comme si c'&eacute;tait un terminal Braille normal. Malheureusement, beaucoup des
possibilit&eacute;s disponibles avec le CombiBraille ne peuvent pas &ecirc;tre utilis&eacute;es
avec le Braille Lite. Ceci veut dire que l'on devrait l'&eacute;viter autant que
possible pour une utilisation avec Linux.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Prix: $3,395.00
Fabricant: Blazie Engineering
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss9.3">9.3 Synth&eacute;tiseurs vocaux</A>
</H2>

<P>Les synt&eacute;htiseurs vocaux se connectent g&eacute;n&eacute;ralement sur le port s&eacute;rie d'un PC.
Les possibilit&eacute;s utiles comprennent :</P>
<P>
<UL>
<LI>des libell&eacute;s en Braille sur les parties ;
</LI>
<LI>beaucoup de voix pour permettre &agrave; des parties diff&eacute;rentes d'un
document d'&ecirc;tre parl&eacute;es diff&eacute;remment ; 
</LI>
<LI>l'utilisation avec des &eacute;couteurs (non disponible sur tous les mod&egrave;les).
</LI>
</UL>
</P>
<P>Le probl&egrave;me critique est celui de la qualit&eacute; de parole. Ceci est beaucoup
plus important pour quelqu'un qui utilise le synth&eacute;tiseur vocal comme
principale source d'informations que pour quelqu'un qui obtient simplement
des beaux sons dans un jeu. Pour cette raison, T.V. Raman semble ne
recommander que le DECTalk. D'autres options acceptables viendraient bien
&agrave; propos.</P>

<H3>DECTalk Express</H3>

<P>Ceci est un synth&eacute;tiseur vocal mat&eacute;riel. Il est recommand&eacute; de l'utiliser avec
Emacspeak et en fait la gamme des DECTalk sont les seuls synth&eacute;tiseurs vocaux
qui fonctionnent avec ce paquetage en ce moment. Ce synth&eacute;tiseur poss&egrave;de
toutes les possibilit&eacute;s utiles que je connaisse. Le seul d&eacute;savantage que je
connaisse en ce moment est le prix.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Prix: $1195.00
Fabricant: Digital Equipment Corporation

Fournisseurs: Beaucoup. J'aimerais des d&eacute;tails sur ceux qui ont un
support sp&eacute;cifique &agrave; Linux / livraisons internationales ou autres choses
notables. Sinon reportez-vous aux organisations locales, &agrave; Digital m&ecirc;me ou au
pages WWW d'Emacspeak.
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Accent SA</H3>

<P>Voici un synth&eacute;tiseur fabriqu&eacute; par Aicom Corporation. Un effort a
d&eacute;marr&eacute; pour en &eacute;crire un pilote, mais cependant ils ont besoin d'aide.
Veuillez voir 
<A HREF="http://www.cyberspc.mb.ca/~astrope/speak.html">http://www.cyberspc.mb.ca/~astrope/speak.html</A> si
vous pensez pouvoir apporter votre aide.</P>


<H3>puce Speak and Spell SPO256-AL2</H3>

<P>Un int&eacute;r&ecirc;t a &eacute;t&eacute; prononc&eacute; pour l'utilisation de cette puce dans des
circuits vocaux en kit. Je serais int&eacute;ress&eacute; de savoir si quelqu'un a
trouv&eacute; ceci utile. Un paquetage logiciel, <CODE>speak-0.2pl1.tar.gz</CODE>, a &eacute;t&eacute;
produit par David Sugar, 
<A HREF="mailto:dyfet@tycho.com">&lt;dyfet@tycho.com&gt;</A>. Ce que je redoute, cependant, est que la
qualit&eacute; du rendu ne soit pas assez bonne pour une utilisation r&eacute;guli&egrave;re.</P>

<H2><A NAME="s10">10. Remerciements</A></H2>

<P>De nombreuses parties de ce document ont &eacute;t&eacute; cr&eacute;&eacute;es &agrave; partir de sources
d'informations vari&eacute;es sur Internet, beaucoup trouv&eacute;es sur Yahoo et le moteur
de recherche AltaVista de DEC. Celles-ci comprenaient la documentation de la
plupart des paquetages logiciels mentionn&eacute;s dans ce texte. Certaines
informations ont &eacute;t&eacute; glan&eacute;es dans les feuilles d'aide du Royal National
Institute for the Blind (institut royal national pour les aveugles).</P>
<P>T.V. Raman, l'auteur d'Emacspeak a apport&eacute; de mani&egrave;re fiable des
commentaires, des informations et du texte et m'a mis en contact avec
d'autres personnes qu'il connaissait sur Internet. </P>
<P>Kenneth Albanowski 
<A HREF="mailto:kjahds@kjahds.com">&lt;kjahds@kjahds.com&gt;</A> a fourni le patch n&eacute;cessaire au
Brailloterm et les informations s'y rapportant.</P>
<P>Roland Dyroff de 
<A HREF="http://www.suse.de/">S.u.S.E. GmbH</A>
(Les distributeurs et fabricants de S.u.S.E. Linux (Anglais/Allemand)) 
ont recherch&eacute; KTS Stolper GmbH &agrave; ma demande et ont obtenu quelques d&eacute;tails
mat&eacute;riels et des informations sur le Brailloterm. </P>
<P>Les v&eacute;rifications les plus grandes et les plus attentionn&eacute;es de ce
document ont &eacute;t&eacute; faites par James Bowden, 
<A HREF="mailto:jrbowden@bcs.org.uk">&lt;jrbowden@bcs.org.uk&gt;</A> et
Nikhil Nair 
<A HREF="mailto:nn201@cus.cam.ac.uk">&lt;nn201@cus.cam.ac.uk&gt;</A>, les auteurs de <CODE>BRLTTY</CODE> qui ont
sugg&eacute;r&eacute; un grand nombre de corrections autant que des informations
suppl&eacute;mentaires sur certains sujets. </P>
<P>Les contributeurs des listes de distribution blinux et linux-access ont
contribu&eacute; &agrave; ce document en me fournissant des informations pour que je
les lise.</P>
<P>Mark E. Novak, du centre de recherches Trace, 
<A HREF="http://trace.wisc.edu/">http://trace.wisc.edu/</A>, m'a dirig&eacute; vers plusieurs paquetages
logiciels et des informations que je n'avais encore jamais vus. Il a aussi
fait certains commentaires sur la structure du document que j'ai en partie
pris en compte et je devrais s&ucirc;rement en faire plus.</P>
<P>D'autres contributeurs comprennent Nicolas Pitrie et Stephane Doyon.</P>
<P>Quelques autres personnes ont apport&eacute; des commentaires et des informations.
Les apports sp&eacute;cifiques sont remerci&eacute;s dans le document.</P>
<P>Cette version a &eacute;t&eacute; produite sp&eacute;cialement pour le livre Dr. Linux de
<A HREF="http://www.redhat.com/">RedHat</A>. Ceci parce qu'ils
m'ont averti de sa sortie imm&eacute;diate, ainsi qu'&agrave; d'autres auteurs du LDP.
J'appr&eacute;cie fortement leur fa&ccedil;on de faire puisque des informations fausses
ou vieilles restent plus longtemps dans un livre que sur Internet.</P>
<P>Il n'y aucun doute que vous ayez fait un apport et je ne l'ai pas
mentionn&eacute;. Ne vous inqui&eacute;tez pas, c'&eacute;tait un accident. Je suis d&eacute;sol&eacute;.
Dites-le moi et je vous ajouterai &agrave; la prochaine version. </P>

</BODY>
</HTML>
