<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Le service de rappel, mini-HOWTO</TITLE>
</HEAD>
<BODY>
<H1>Le service de rappel, mini-HOWTO</H1>

<H2>Pawel Skonecki, <CODE>
<A HREF="mailto:stona@fizyka.umcs.lublin.pl">stona@fizyka.umcs.lublin.pl</A></CODE><BR>
Traduction fran&ccedil;aise : Sylvain Amrani <CODE>
<A HREF="mailto:traduc@amrani.com.fr">traduc@amrani.com.fr</A></CODE></H2>v1.1a, Juin 2000
<HR>
<EM>Ce document d&eacute;crit la mani&egrave;re de mettre en place un service de rappel en utilisant un syst&egrave;me Linux
et un modem. Je voudrais remercier Anna pour sa patience.</EM>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>

<H2><A NAME="ss1.1">1.1 R&eacute;actions</A>
</H2>

<P>Je serai attentif &agrave; toutes les r&eacute;actions concernant ce document. J'ai essay&eacute;
de rassembler les informations d'une fa&ccedil;on aussi compl&egrave;te que possible. Dites-moi si
vous trouvez des erreurs. Je serai reconnaissant envers les personnes qui m'enverront des
suggestions ou des corrections. Leurs contributions am&eacute;lioreront ce document.
Je ne serai pas ennuy&eacute; de r&eacute;pondre &agrave; vos questions, mais j'aimerais que vous lisiez
ce document dans son int&eacute;gralit&eacute; auparavant.</P>

<H2><A NAME="ss1.2">1.2 Publication</A>
</H2>

<P>Ce document peut &ecirc;tre publi&eacute; sous les conditions du Linux Documentation Project (Projet de Documentation Linux). Prenez contact avec l'auteur si vous ne parvenez pas &agrave; vous procurer cette licence. Il s'agit d'un "document libre".</P>

<H2><A NAME="s2">2. Proc&eacute;dure</A></H2>

<H2><A NAME="ss2.1">2.1 Le r&eacute;seau &agrave; la maison ?</A>
</H2>

<P>La plupart d'entre nous utilisent l'Internet au travail. En revanche, nous avons souvent
besoin du r&eacute;seau &agrave; la maison, ou &agrave; l'ext&eacute;rieur du bureau. Il est possible que le travail
effectu&eacute; &agrave; la maison revienne moins cher que celui fait au bureau. Je pense que la 
meilleure solution est d'installer un logiciel de rappel sur le serveur Linux.
Un service de rappel permet de faire rappeler le serveur pour que la connexion soit &agrave; la charge de la soci&eacute;t&eacute;.
Je vais essayer de pr&eacute;senter la mani&egrave;re dont cela fonctionne. Une personne, &agrave; qui l'on a donn&eacute; le droit,
appelle. L'&eacute;tat du modem du serveur Linux est modifi&eacute; une premi&egrave;re fois. Ensuite, du c&ocirc;t&eacute; de
l'utilisateur, le modem ayant raccroch&eacute; est r&eacute;-activ&eacute;. Dans le m&ecirc;me temps, le serveur Linux
appelle l'utilisateur. L'utilisateur s'identifie &agrave; nouveau. Nous obtenons alors une connexion
&agrave; la charge du serveur. L'utilisateur ne paie que l'initialisation de la connexion. La double
v&eacute;rification et des options suppl&eacute;mentaires dans la configuration du logiciel de rappel emp&ecirc;chent
que des ind&eacute;sirables ne chargent nos factures. Nous pouvons restreindre l'acc&egrave;s de la connexion
au r&eacute;seau d'entreprise seulement ou &agrave; l'Internet. Le service de rappel est tr&egrave;s souple. Dans la suite, je
vais essayer de vous pr&eacute;senter la configuration d'un service de rappel sur un serveur Linux et
de vous montrer comment configurer votre ordinateur pour reprendre la connexion.</P>

<H2><A NAME="ss2.2">2.2 Premiers pas avec les modems.</A>
</H2>

<P>Les administrateurs proc&egrave;dent &agrave; des choix diff&eacute;rents concernant les modems. Mais avant d'en
acheter un, vous devrez vous rappeler certaines r&egrave;gles&nbsp;:</P>
<P>
<UL>
<LI>N'achetez pas un Win-Modem (modem sp&eacute;cifique pour Windows). Ils ne fonctionnent pas sous Linux.
</LI>
<LI>Les modems externes travaillent plus vite que les modems internes.
</LI>
<LI>Un modem interne sur carte ISA est pr&eacute;f&eacute;rable &agrave; un modem sur carte PCI
(vous pourrez utiliser votre port PCI pour autre chose).
</LI>
<LI>N'utilisez pas un modem Plug&amp;Play. Si vous en avez un, d&eacute;sactivez l'option Plug&amp;Play
et configurez le modem pour un port s&eacute;rie libre (Cf. le Plug&amp;Play-HOWTO).
</LI>
</UL>
</P>

<P>Maintenant que nous avons le modem ad&eacute;quat, nous devons le configurer pour notre syst&egrave;me.
Nous devons v&eacute;rifier &agrave; quel port s&eacute;rie il est raccord&eacute;. Ensuite, nous devons cr&eacute;er un
lien symbolique entre ce port mat&eacute;riel et /dev/modem. Par exemple, si notre modem est
connect&eacute; au deuxi&egrave;me port s&eacute;rie, nous &eacute;crivons&nbsp;:</P>
<P>
<PRE>
ln -s /dev/cua1 /dev/modem 
</PRE>
</P>
<P>V&eacute;rifions :</P>
<P>
<PRE>
lrwxrwxrwx 1 root uucp 9 Sep 19 19:10 /dev/modem -> /dev/cua1
</PRE>
</P>
<P>Si notre modem est connect&eacute; &agrave; un port s&eacute;rie diff&eacute;rent, nous devons nous rappeler que&nbsp;:</P>
<P>
<PRE>
/dev/cua0 correspond &agrave; com1 

/dev/cua1 correspond &agrave; com2 

/dev/cua2 correspond &agrave; com3 

/dev/cua3 correspond &agrave; com4 
</PRE>
 </P>
<P>Et pour les nouveaux noyaux&nbsp;:</P>
<P>
<PRE>
/dev/ttyS0 correspond &agrave; com1 

/dev/ttyS1 correspond &agrave; com2 

/dev/ttyS2 correspond &agrave; com3 

/dev/ttyS3 correspond &agrave; com4
</PRE>
</P>
<P>Maintenant nous pouvons v&eacute;rifier notre configuration avec le programme minicom.</P>
<H2><A NAME="ss2.3">2.3 Appeler le serveur Linux</A>
</H2>

<P>La premi&egrave;re chose &agrave; faire pour rendre accessible notre service de rappel sous Linux
est de configurer les param&egrave;tres appropri&eacute;s dans le noyau. V&eacute;rifions que notre noyau
inclut le protocole PPP. Si vous n'avez pas le protocole PPP dans votre noyau ou
dans un module, vous devrez recompiler votre noyau et y ajouter PPP. Vous trouverez
plus d'informations dans le Kernel-HOWTO. Bien. Nous avons maintenant un noyau correct.
Nous devons &agrave; pr&eacute;sent configurer le logiciel pour notre syst&egrave;me. Le programme de rappel
fait partie de mgetty-sendfax et de PPP. Vous le trouverez tous dans votre distribution.
En raison du syst&egrave;me de rappel et de la double v&eacute;rification, nous devons cr&eacute;er un
utilisateur qui ex&eacute;cutera PPP c&ocirc;t&eacute; serveur&nbsp;:</P>
<P>
<PRE>
pppuser:klkIOM89mn65H:230:PPP Dialin:/home/pppuser:/etc/ppp/ppplogin
</PRE>
</P>
<P>Changez son mot de passe. Puis nous devons ajouter son mot de passe dans
le fichier <CODE>/etc/ppp/pap-secrets</CODE> (consultez la page de manuel de pppd)&nbsp;:</P>
<P>
<PRE>
pppuser * mot_de_passe_pour_pppuser *
</PRE>
</P>
<P>Cet utilisateur ne dispose pas d'un shell classique, mais d'un fichier <CODE>/etc/ppp/ppplogin</CODE>.
Nous devons le faire nous-m&ecirc;me. Par exemple, tapez <CODE>vi /etc/ppp/ppplogin</CODE> et entrez&nbsp;:</P>
<P>
<PRE>
#!/bin/sh 

exec /usr/sbin/pppd -detach 192.168.1.1:192.168.1.2
</PRE>
</P>
<P>o&ugrave; 192.168.1.1 est l'adresse de notre serveur et
192.168.1.2 est l'adresse que nous donnons &agrave; notre modem.
Nous donnons les droits d'ex&eacute;cution &agrave; ce fichier. Parce que nous utiliserons
le d&eacute;mon PPP, nous devons configurer ses options en &eacute;ditant le fichier
<CODE>/etc/ppp/options</CODE>&nbsp;:</P>
<P>
<PRE>
netmask 255.255.255.0 

proxyarp 

lock 

crtscts 

modem 
</PRE>
</P>
<P>Proxyarp est l'option la plus importante parce qu'elle permet d'aller
sur l'Internet par le modem du serveur. Les autres options
sont utilis&eacute;es pour contr&ocirc;ler votre modem. Votre utilisateur ne pourra
travailler que dans le r&eacute;seau local si vous retirez l'option proxyarp.
R&eacute;f&eacute;rez-vous au PPP-HOWTO et &agrave; la page de manuel de pppd pour plus d'informations.
Nous allons maintenant configurer notre modem. Notre serveur doit &ecirc;tre pr&ecirc;t
&agrave; recevoir une connexion apr&egrave;s son d&eacute;marrage. Nous &eacute;ditons le fichier
<CODE>/etc/inittab</CODE> et ajoutons, pour un modem sur le deuxi&egrave;me port s&eacute;rie&nbsp;:</P>
<P>
<PRE>
s1:2345:respawn:/sbin/mgetty ttyS1 -D /dev/ttyS1 vt100
</PRE>
</P>
<P>Avec un modem sur le premier port s&eacute;rie, ce serait&nbsp;:</P>
<P>
<PRE>
s0:2345:respawn:/sbin/mgetty ttyS0 -D /dev/ttyS0 vt100
</PRE>
</P>
<P>Entrons maintenant <CODE>init q</CODE>. Si nous n'avons pas trace d'erreur dans les logs,
nous pouvons poursuivre. Revenons dans le r&eacute;pertoire <CODE>/etc/ppp</CODE> et
cr&eacute;ons <CODE>options.ttyS1</CODE> (pour un modem sur com1 <CODE>options.ttyS0</CODE>)</P>
<P>
<PRE>
IP_locale: IP_distante
</PRE>
</P>
<P>pour notre r&eacute;seau, ce sera&nbsp;:</P>
<P>
<PRE>
192.168.1.1:192.168.1.2
</PRE>
</P>
<P>Nous avons fait d&eacute;j&agrave; beaucoup de travail. Maintenant, v&eacute;rifions le fichier
<CODE>/etc/mgetty+sendfax/login.config</CODE>. La ligne la plus importante est&nbsp;:</P>
<P>
<PRE>
/AutoPPP/ - a_ppp /usr/sbin/pppd auth -chap +pap login detach kdebug 7 debug
</PRE>
</P>
<P>Les autres lignes peuvent &ecirc;tre comment&eacute;es avec des <CODE>#</CODE>. </P>

<P>Nous devons donner les droits de super-utilisateur &agrave; l'ex&eacute;cution (suid) au d&eacute;mon ppp,
parce que l'utilisateur pppuser doit lancer pppd et rendre l'interface active.</P>
<P>
<PRE>
chmod u+s /usr/sbin/pppd 
</PRE>
</P>
<P>ce qui donne&nbsp;:</P>
<P>
<PRE>
-rwsr-xr-x 1 root root 106892 Jan 11 1999 /usr/sbin/pppd
</PRE>
</P>
<P>Je pense que c'est une bonne id&eacute;e d'ajouter &ccedil;a aux t&acirc;ches programm&eacute;es de cron,
parce que j'ai des probl&egrave;mes de changement des pr&eacute;f&eacute;rences de pppd apr&egrave;s un
red&eacute;marrage de mon serveur.
Notre serveur fonctionne comme un routeur. Nous devons activer l'IP forwarding en
ajoutant cette ligne au fichier <CODE>/etc/rc.d/rc.local</CODE>&nbsp;:</P>
<P>
<PRE>
echo "1" > /proc/sys/net/ipv4/ip_forward
</PRE>
</P>
<P>Si vous avez une distribution RedHat, vous pouvez faire cela avec
<CODE>/etc/sysconfig/network</CODE> en changeant
<CODE>FORWARD_IPV4=false</CODE> en <CODE>FORWARD_IPV4=true</CODE>.</P>

<P>Pour la v&eacute;rification quand nous appelons le serveur Linux, nous utilisons un script.
Si nous utilisons MS Windows, nous devons choisir l'option
<CODE>"Appeler terminal apr&egrave;s la connexion"</CODE>.
Nous nous connectons en tant qu'utilisateur pppuser, avec son mot de passe. J'esp&egrave;re que tout est OK.</P>

<H2><A NAME="ss2.4">2.4 Linux nous appelle.</A>
</H2>

<P>Nous pouvons d'ores et d&eacute;j&agrave; appeler notre serveur Linux. Maintenant, c'est &agrave; Linux de nous appeler.
Ce n'est pas tr&egrave;s compliqu&eacute;. Nous devons seulement &eacute;diter deux fichiers. Nous cr&eacute;ons le fichier
<CODE>/etc/mgetty+sendfax/callback.conf</CODE> que nous laissons vide.</P>

<P>Ensuite, nous devons conna&icirc;tre le num&eacute;ro de t&eacute;l&eacute;phone de nos utilisateurs.
Nous devons inscrire les num&eacute;ros qui pourront nous contacter. Nous devons pour cela
&eacute;diter le fichier <CODE>/etc/mgetty+sendfax/login.conf</CODE> et ajouter la ligne&nbsp;:</P>
<P>
<PRE>
call - - /usr/sbin/callback - S 123456 
</PRE>
</P>
<P>o&ugrave; call est un pseudo-utilisateur n&eacute;cessaire pour lancer la connexion. 
La ligne dans le fichier <CODE>/etc/mgetty+sendfax/login.conf</CODE> d&eacute;clenche le programme devant
appeler le num&eacute;ro fourni (dans cet exemple c'est 123456). La m&ecirc;me proc&eacute;dure est &agrave; suivre
pour les autres utilisateurs. Expliquons comment cela fonctionne. Nous appelons le
serveur. Il nous demande de nous authentifier. Si nous nous identifions comme le pseudo-utilisateur,
le serveur rappelle. Le script de notre ordinateur fait raccrocher le modem.
Nous attendons et la connexion est coup&eacute;e. Le programme de rappel est alors lanc&eacute; et nous
rappelle. Nous nous authentifions comme l'utilisateur pppuser avec son mot de passe.
La connexion est associ&eacute;e &agrave; l'interface ppp, et c'est tout. La configuration
des stations de travail est tr&egrave;s simple. Si vous avez MS Windows, vous devez installer une connexion
&agrave; distance pour votre num&eacute;ro. Dans les propri&eacute;t&eacute;s du modem, on trouve
"Propri&eacute;t&eacute;s---&gt;Connexion---&gt;Avanc&eacute;...---&gt;Param&egrave;tres suppl&eacute;mentaires", o&ugrave; nous mettons&nbsp;:</P>
<P>
<PRE>
&amp;c0s0=1 
</PRE>
</P>
<P>Fermons la fen&ecirc;tre et appelons. Nous nous authentifions conform&eacute;ment &agrave; ce qui a &eacute;t&eacute; dit pr&eacute;c&eacute;demment.
Si nous utilisons Linux, nous devons avoir recours aux scripts. Il est difficile de donner
un seul bon script pour Linux. Une bonne configuration de PPP est de premi&egrave;re importance pour
le syst&egrave;me. (Vous pouvez tout d'abord appeler sous un profil pppuser avec un script). Les
scripts ci-dessous ont &eacute;t&eacute; &eacute;crits par A. Gozdz. Je sugg&egrave;re de tout cataloguer. C'est juste
une suggestion, vous n'&ecirc;tes pas oblig&eacute; de d&eacute;marrer par des scripts &agrave; cet endroit. Des
informations d&eacute;taill&eacute;es concernant les scripts avec Linux peuvent &ecirc;tre trouv&eacute;es dans le
PPP-HOWTO.</P>

<P><B>CES SCRIPTS FONCTIONNENT CORRECTEMENT AVEC UNE SLACKWARE</B></P>

<P>Fichier de configuration pour le d&eacute;mon PPP (exemple pour un modem reli&eacute; au deuxi&egrave;me port s&eacute;rie)
<CODE>/etc/options</CODE></P>
<P>
<PRE>

lock

defaultroute 

noipdefault 

modem 

/dev/cua1 

33600 

crtscts 

debug 

passive 

asyncmap 0 
</PRE>
</P>
<P>et les scripts sp&eacute;cifiques&nbsp;:</P>
<P>
<UL>
<LI>le premier appel&eacute; /etc/ppp/ppp-call 

<PRE>
#!/bin/bash 

teksta="La connexion a &eacute;chou&eacute;"

tekstb="Vous allez probablement &ecirc;tre connect&eacute;" 

# /sbin/setserial /dev/cua1 spd_vhi 

killall -INT pppd 2>/dev/null 

rm -f /var/lock/LCK* /var/run/ppp*.pid 

(/usr/sbin/pppd -detach /dev/ttyS1 115200 \ 

connect "/usr/sbin/chat -v -f /etc/ppp/pppcallback" &amp;) || \ 

(echo $teksta; ls marsss >/dev/null; exit 1) 

echo $tekstb 

exit 0 
</PRE>

</LI>
<LI>le second fichier appel&eacute; /etc/ppp/pppcallback
 
<PRE>
TIMEOUT 60 

ABORT 'ERROR' 

ABORT 'BUSY' 

ABORT 'NO ANSWER' 

ABORT 'NO DIALTONE' 

ABORT '\nVOICE\r' 

ABORT '\nRINGING\r\n\r\nRINGING\r' 

'' AT&amp;FH0 &lt;p>'OK-+++\c-OK' 'AT&amp;C0S0=1' 

TIMEOUT 75 

OK ATDT123456 

CONNECT '' 

ogin:-ogin: ppp_pseudouser 

'\nNO CARRIER\r' '' 

TIMEOUT 180 

'\nRING\r' AT&amp;C1A 

CONNECT '' 

TIMEOUT 20 

ogin:-ogin: pppuser 

sword:-sword mot_de_passe_de_pppuser 
</PRE>

</LI>
<LI>Vous pouvez maintenant appeler par PPP :)
</LI>
</UL>
</P>

<P><B>CES SCRIPTS FONCTIONNENT CORRECTEMENT AVEC UNE RED HAT 6.x</B></P>
<P>
<UL>
<LI>/etc/ppp/options

<PRE>
lock 

defaultroute 

noipdefault 

modem 

33600 

crtscts 

debug 

passive 

asyncmap 0 
</PRE>

</LI>
<LI>/etc/ppp/pppcallback

<PRE>
TIMEOUT 5 

ABORT 'ERROR' 

ABORT 'BUSY' 

ABORT 'NO ANSWER' 

ABORT 'NO DIALTONE' 

ABORT '\nVOICE\r' 

ABORT '\nRINGING\r\n\r\nRINGING\r' 

'' AT&amp;FH0 'OK-+++\c-OK' 'AT&amp;C0S0=1' 

TIMEOUT 40 

OK ATDT5376443 CONNECT '' 

ogin:-ogin: ppp-pseudo-user 

'\nNO CARRIER\r' '' 

TIMEOUT 180 

'\nRING\r' AT&amp;C1A 

CONNECT '' 

TIMEOUT 20 

ogin:-ogin: pppuser 

sword:-sword mot_de_passe_de_pppuser 
</PRE>

</LI>
<LI>/usr/bin/ppp-call

<PRE>
#!/bin/bash 

teksta="La connexion a &eacute;chou&eacute;" 

tekstb="Vous allez probablement &ecirc;tre connect&eacute;"

# /sbin/setserial /dev/cua1 spd_vhi

killall -INT pppd 2>/dev/null 

rm -f /var/lock/LCK* /var/run/ppp*.pid 

(/usr/sbin/pppd -detach call ppp_call &amp;) || \ 

(echo $teksta; ls marsss >/dev/null; exit 1) 

echo $tekstb 

exit 0 
</PRE>

</LI>
<LI>Vous pouvez maintenant appeler par PPP :)
</LI>
</UL>
</P>

<P>Si vous avez M$ Windows, vous pouvez utiliser ce script pour vous connecter. Je ne
l'ai pas test&eacute; (j'utilise un terminal). Vous pouvez en savoir plus aupr&egrave;s d'Adrian Debkowski 
(
<A HREF="mailto:adrian@cr-media.pl">adrian@cr-media.pl</A>).</P>
<P>
<PRE>
proc main

delay 1

waitfor "ogin:"

transmit "call^M"

waitfor "RING"

transmit "ATA^M"

waitfor "CONNECT"

waitfor "ogin:"

transmit "pppuser^M"

waitfor "word:"

transmit "ppp^M"

endproc
</PRE>
</P>

<H2><A NAME="ss2.5">2.5 R&eacute;sum&eacute;</A>
</H2>

<P>La configuration d'un service de rappel n'est pas compliqu&eacute;e. La chose la plus importante
est une configuration correcte du serveur PPP sur Linux. Je ne connais pas de meilleur
moyen pour configurer un serveur d'acc&egrave;s. La configuration pr&eacute;sent&eacute;e ci-dessus est le
r&eacute;sultat de nombreux essais, mais cela peut &ecirc;tre fait d'une autre fa&ccedil;on. C'est pourquoi
je sugg&egrave;re de lire tous les documents concernant ce sujet, la page de manuel de pppd,
les NET4-HOWTO et PPP-HOWTO.</P>

</BODY>
</HTML>
