<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>

Guide pratique d'utilisation de BIND en environnement restreint

</title><link href="style.css" rel="stylesheet" type="text/css"><meta content="DocBook XSL Stylesheets V1.68.1" name="generator"><meta name="description" content="

Ce document d&eacute;crit l'installation du serveur de noms BIND&nbsp;9 dans un 
environnement d'ex&eacute;cution restreint en tant qu'utilisateur non root. 
Cette configuration offre une meilleure s&eacute;curit&eacute; et permet de limiter 
les effets potentiels d'une compromission. Ce document a &eacute;t&eacute; mis &agrave; jour 
pour la version&nbsp;9 de BIND&nbsp;; si vous utilisez toujours la 
version&nbsp;8 de BIND, r&eacute;f&eacute;rez-vous plut&ocirc;t au Guide pratique 
d'utilisation de BIND&nbsp;8 en environnement restreint.

"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article" lang="fr"><div class="titlepage"><div><div><h1 class="title"><a name="N10001"></a>

Guide pratique d'utilisation de BIND en environnement restreint

</h1></div><div><h3 class="subtitle"><i>

Adaptation fran&ccedil;aise du guide pratique <span class="foreignphrase"><em class="foreignphrase">Chroot-BIND
HOWTO</em></span>

</i></h3></div><div><div class="author"><h3 class="author"><span class="firstname">Scott</span> <span class="surname">Wunsch</span></h3><code class="email">&lt;<a href="mailto:scott CHEZ wunsch POINT org">scott CHEZ wunsch POINT org</a>&gt;</code></div></div><div><p class="othercredit"><span class="contrib">Adaptation fran&ccedil;aise</span>&nbsp;: <span class="firstname">Vincent</span> <span class="surname">Loupien</span></p></div><div><p class="othercredit"><span class="contrib">Relecture de la version fran&ccedil;aise</span>&nbsp;: <span class="firstname">Beno&icirc;t</span> <span class="surname">Rouits</span>, <span class="firstname">Jean-Philippe</span> <span class="surname">Gu&eacute;rard</span></p></div><div></div><div><p class="othercredit"><span class="contrib">Pr&eacute;paration de la publication de la v.f.</span>&nbsp;: <span class="firstname">Jean-Philippe</span> <span class="surname">Gu&eacute;rard</span></p></div><div><p class="releaseinfo">Version&nbsp;: 1.5.fr.1.0</p></div><div><p class="pubdate">20 juillet 2005</p></div><div><div class="revhistory"><table summary="Revision history" width="100%" border="1"><tr><th colspan="3" valign="top" align="left"><b>Historique des versions</b></th></tr><tr><td align="left">Version 1.5.fr.1.0</td><td align="left">2005-07-30</td><td align="left">VL, BR, JPG</td></tr><tr><td colspan="3" align="left">
       
           Version fran&ccedil;aise relue par Beno&icirc;t Rouits.
           
       </td></tr><tr><td align="left">Version 1.5.fr.0.9</td><td align="left">2004-06-28</td><td align="left">VL, JPG</td></tr><tr><td colspan="3" align="left">
       
           Premi&egrave;re version fran&ccedil;aise (non relue).
           
       </td></tr><tr><td align="left">Version 1.5</td><td align="left">2001-12-01</td><td align="left">SW</td></tr></table></div></div><div><div class="abstract"><p class="title"><b>R&eacute;sum&eacute;</b></p><p>

Ce document d&eacute;crit l'installation du serveur de noms BIND&nbsp;9 dans un 
environnement d'ex&eacute;cution restreint en tant qu'utilisateur non root. 
Cette configuration offre une meilleure s&eacute;curit&eacute; et permet de limiter 
les effets potentiels d'une compromission. Ce document a &eacute;t&eacute; mis &agrave; jour 
pour la version&nbsp;9 de BIND&nbsp;; si vous utilisez toujours la 
version&nbsp;8 de BIND, r&eacute;f&eacute;rez-vous plut&ocirc;t au &laquo;&nbsp;<span class="quote">Guide pratique 
d'utilisation de BIND&nbsp;8 en environnement restreint</span>&nbsp;&raquo;.

</p></div></div></div><hr></div><div class="toc"><p><b>Table des mati&egrave;res</b></p><dl><dt><span class="section"><a href="#N1006F">1. Introduction</a></span></dt><dd><dl><dt><span class="section"><a href="#N10077">1.1. Objet de ce document</a></span></dt><dt><span class="section"><a href="#N1008B">1.2. Pourquoi&nbsp;?</a></span></dt><dt><span class="section"><a href="#Ou">1.3. O&ugrave;&nbsp;?</a></span></dt><dt><span class="section"><a href="#N100C3">1.4. Comment&nbsp;?</a></span></dt><dt><span class="section"><a href="#N100CA">1.5. Mise en garde</a></span></dt></dl></dd><dt><span class="section"><a href="#N100D7">2. Pr&eacute;paration de l'environnement restreint</a></span></dt><dd><dl><dt><span class="section"><a href="#N100DA">2.1. Cr&eacute;ation d'un utilisateur</a></span></dt><dt><span class="section"><a href="#N10101">2.2. Arborescence de r&eacute;pertoires</a></span></dt><dt><span class="section"><a href="#N10117">2.3. Mise en place des donn&eacute;es de BIND</a></span></dt><dt><span class="section"><a href="#N10147">2.4. Fichiers de support syst&egrave;me</a></span></dt><dt><span class="section"><a href="#logging">2.5. Journalisation des &eacute;v&egrave;nements</a></span></dt><dt><span class="section"><a href="#perm">2.6. Resserrer les permissions</a></span></dt></dl></dd><dt><span class="section"><a href="#compiling">3. Compiler et installer votre beau BIND tout neuf</a></span></dt><dd><dl><dt><span class="section"><a href="#N10257">3.1. Compiler</a></span></dt></dl></dd><dt><span class="section"><a href="#installing">4. Installer votre beau BIND tout neuf</a></span></dt><dd><dl><dt><span class="section"><a href="#N10285">4.1. Installer les binaires</a></span></dt><dt><span class="section"><a href="#N1028E">4.2. Mise en place du script d'init</a></span></dt><dt><span class="section"><a href="#N102D6">4.3. Changement de configuration</a></span></dt></dl></dd><dt><span class="section"><a href="#N102F1">5. Fin</a></span></dt><dd><dl><dt><span class="section"><a href="#N102F4">5.1. Lancement de BIND</a></span></dt><dt><span class="section"><a href="#N102FE">5.2. Voil&agrave;&nbsp;!</a></span></dt></dl></dd><dt><span class="appendix"><a href="#N10303">A. 

Annexes

</a></span></dt><dd><dl><dt><span class="section"><a href="#upgrading">1. Mises &agrave; jour ult&eacute;rieures de BIND</a></span></dt><dt><span class="section"><a href="#thanks">2. Remerciements</a></span></dt><dt><span class="section"><a href="#legal">3. Politique de distribution de ce document</a></span></dt></dl></dd></dl></div><div class="section" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N1006F"></a>1.&nbsp;Introduction</h2></div></div></div><p>

Ce document est le guide pratique de BIND en environnement 
restreint&nbsp;; reportez-vous &agrave; la <a href="#Ou" title="1.3.&nbsp;O&ugrave;&nbsp;?">Section&nbsp;1.3, &laquo;&nbsp;O&ugrave;&nbsp;?&nbsp;&raquo;</a> pour trouver la 
version la plus r&eacute;cente de ce document. Nous supposerons que vous savez 
d&eacute;j&agrave; configurer et utiliser BIND (le serveur de Noms de Domaines 
Internet de Berkeley). Si ce n'est pas le cas, je vous recommande de 
commencer par lire le guide pratique du DNS (DNS HOWTO). Nous 
supposerons &eacute;galement que vous avez une connaissance suffisante de la 
compilation et de l'installation d'un logiciel sur un syst&egrave;me de type 
Unix.

</p><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10077"></a>1.1.&nbsp;Objet de ce document</h3></div></div></div><p>

Ce document pr&eacute;sente quelques pr&eacute;cautions de s&eacute;curit&eacute; suppl&eacute;mentaires 
applicables lors de l'installation de BIND. Il explique comment 
configurer BIND de sorte qu'il r&eacute;side dans un environnement restreint, 
ce qui signifie qu'il ne peut voir ou acc&eacute;der aux fichiers &agrave; l'ext&eacute;rieur 
de sa propre arborescence. Nous le configurerons &eacute;galement pour 
s'ex&eacute;cuter en tant qu'utilisateur non root.

</p><p>

Le principe d'un environnement restreint est assez simple. Lorsque vous 
ex&eacute;cutez BIND (ou tout autre processus) dans un environnement restreint 
(c'est-&agrave;-dire en utilisant pour le syst&egrave;me de fichier une racine 
diff&eacute;rente &mdash; d'o&ugrave; le nom de la commande utilis&eacute;e 
&laquo;&nbsp;<span class="quote"><span class="foreignphrase"><em class="foreignphrase">chroot</em></span></span>&nbsp;&raquo;, c'est-&agrave;-dire, en 
anglais, &laquo;&nbsp;<span class="quote">changer la racine</span>&nbsp;&raquo;), le processus ne peut tout 
simplement pas voir les autres parties du syst&egrave;me de fichiers (situ&eacute;es 
hors de son environnement). Vous avez probablement d&eacute;j&agrave; rencontr&eacute; un 
environnement restreint auparavant, si vous avez d&eacute;j&agrave; utilis&eacute; un client 
<span><strong class="command">ftp</strong></span> pour vous connecter &agrave; un serveur de fichier 
public.

</p><p>

&Eacute;tant donn&eacute; que le processus d'ex&eacute;cution en environnement restreint est 
beaucoup plus simple avec BIND&nbsp;9, j'ai commenc&eacute; &agrave; d&eacute;velopper 
l&eacute;g&egrave;rement ce document, pour y inclure des astuces plus g&eacute;n&eacute;rales sur la 
mani&egrave;re de s&eacute;curiser une installation BIND. N&eacute;anmoins, ce document n'est 
pas (et ne souhaite pas devenir) une r&eacute;f&eacute;rence compl&egrave;te pour la 
s&eacute;curisation de BIND. Faire uniquement ce qui est d&eacute;crit dans ce 
document ne suffit pas &agrave; s&eacute;curiser un serveur de nom&nbsp;!

</p></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N1008B"></a>1.2.&nbsp;Pourquoi&nbsp;?</h3></div></div></div><p>

Le principe de l'ex&eacute;cution de BIND en environnement restreint est de 
limiter le degr&eacute; d'acc&egrave;s dont pourrait b&eacute;n&eacute;ficier un individu 
malveillant en exploitant une des vuln&eacute;rabilit&eacute;s de BIND. C'est pour la 
m&ecirc;me raison que nous ex&eacute;cutons BIND en tant qu'utilisateur non root.

</p><p>

Ceci devrait &ecirc;tre consid&eacute;r&eacute; comme un suppl&eacute;ment aux pr&eacute;cautions normales 
de s&eacute;curit&eacute; (ex&eacute;cution de la derni&egrave;re version, utilisation des listes de 
contr&ocirc;le d'acc&egrave;s, et c&aelig;tera), et non comme une solution de remplacement 
&agrave; ces derni&egrave;res.

</p><p>

Si la s&eacute;curit&eacute; du DNS vous int&eacute;resse, quelques autres produits 
pourraient &eacute;galement vous int&eacute;resser. Compiler BIND avec <a href="http://www.immunix.org/stackguard.html" target="_top">StackGuard</a> peut 
&ecirc;tre une bonne id&eacute;e pour assurer une plus grande protection. Son 
utilisation est simple&nbsp;; elle &eacute;quivaut &agrave; utiliser un gcc standard. 
Il existe aussi une alternative s&eacute;curis&eacute;e &agrave; BIND, <a href="http://cr.yp.to/dnscache.html" target="_top">DNScache</a>, &eacute;crit par Dan 
Bernstein. Dan est l'auteur de qmail et DNScache semble en suivre la m&ecirc;me 
philosophie.

</p></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="Ou"></a>1.3.&nbsp;O&ugrave;&nbsp;?</h3></div></div></div><p>

La derni&egrave;re version fran&ccedil;aise de ce document est toujours disponible sur
le site du projet <a href="http://www.traduc.org" target="_top">Traduc.org</a>&nbsp;:
<a href="http://www.traduc.org/docs/howto/lecture/Chroot-BIND8-HOWTO.html" target="_top">http://www.traduc.org/docs/howto/lecture/Chroot-BIND8-HOWTO.html</a>.

</p><p>

La derni&egrave;re version originale de ce document est toujours disponible &agrave; 
partir du site Web des Utilisateurs de Linux et de logiciels libres de 
Regina, Sask.&nbsp;: <a href="http://www.losurs.org/docs/howto/Chroot-BIND.html" target="_top">http://www.losurs.org/docs/howto/Chroot-BIND.html</a>.

</p><p>

Il existe maintenant une traduction japonaise de ce document, maintenue 
par

<code class="email">&lt;<a href="mailto:nakano CHEZ apm POINT seikei POINT ac POINT jp">nakano CHEZ apm POINT seikei POINT ac POINT jp</a>&gt;</code>.

Elle est disponible &agrave; l'adresse <a href="http://www.linux.or.jp/JF/JFdocs/Chroot-BIND-HOWTO.html" target="_top">http://www.linux.or.jp/JF/JFdocs/Chroot-BIND-HOWTO.html</a>. BIND 
est disponible &agrave; l'adresse de l'<a href="http://www.isc.org/" target="_top">Internet Software Consortium</a> &agrave; 
l'adresse <a href="http://www.isc.org/bind.html" target="_top">http://www.isc.org/bind.html</a>. Au moment de la 
publication de ce document, la version courante de BIND&nbsp;9 est la 
version&nbsp;9.2.0. La version &nbsp;9 de BIND est sortie depuis 
longtemps et est d&eacute;j&agrave; largement employ&eacute;e en production. N&eacute;anmoins, 
nombre de traditionalistes pr&eacute;f&egrave;rent encore utiliser BIND&nbsp;8. Si 
c'est votre cas, reportez-vous &agrave; mon &laquo;&nbsp;<span class="quote">Guide pratique de 
l'utilisation de BIND&nbsp;8 en environnement restreint</span>&nbsp;&raquo; 
(disponible au m&ecirc;me endroit) qui vous expliquera comment l'ex&eacute;cuter en 
environnement restreint. Cependant, soyez conscient que BIND&nbsp;8 est 
plus difficilement ex&eacute;cutable en environnement restreint. Gardez &agrave; 
l'esprit qu'il existe des trous de s&eacute;curit&eacute; <span class="emphasis"><em>connus</em></span> 
sur toutes les versions de BIND. Assurez-vous que vous ex&eacute;cutez bien la 
derni&egrave;re version&nbsp;!

</p></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N100C3"></a>1.4.&nbsp;Comment&nbsp;?</h3></div></div></div><p>

J'ai &eacute;crit ce document en me basant sur mon exp&eacute;rience du param&eacute;trage de 
BIND dans un environnement restreint. Dans mon cas, j'avais d&eacute;j&agrave; un BIND 
en exploitation sous la forme d'un paquet fourni par de ma distribution 
Linux. Je suppose que beaucoup d'entre-vous &ecirc;tes dans la m&ecirc;me situation, 
que vous allez juste r&eacute;cup&eacute;rer et modifier les fichiers de configuration 
provenant de votre installation actuelle de BIND, puis d&eacute;sinstaller 
l'ancien paquet avant d'installer le nouveau. Ne d&eacute;sinstallez pas le 
paquet tout de suite&nbsp;; nous pourrions avoir besoin d'y r&eacute;cup&eacute;rer 
quelques fichiers.

</p><p>

Si vous n'&ecirc;tes pas dans ce cas, vous devriez n&eacute;anmoins &ecirc;tre capable de 
comprendre ce document. La seule diff&eacute;rence est que, lorsque je parle de 
copier un fichier existant, vous devrez d'abord le cr&eacute;er vous-m&ecirc;me. Le 
guide pratique du DNS pourra vous &ecirc;tre utile pour cela.

</p></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N100CA"></a>1.5.&nbsp;Mise en garde</h3></div></div></div><p>

Cette proc&eacute;dure a fonctionn&eacute; pour moi, sur mon syst&egrave;me. Vous pourriez 
avoir &agrave; la modifier. Ce n'est qu'une fa&ccedil;on d'aborder la 
question&nbsp;; il y a d'autres moyens d'arriver &agrave; la m&ecirc;me solution 
(cependant l'approche restera la m&ecirc;me). Il s'est juste trouv&eacute; que ma 
premi&egrave;re tentative a fonctionn&eacute;, et j'ai donc tout not&eacute;.

</p><p>

&Agrave; ce jour, mon exp&eacute;rience de BIND se limite &agrave; l'installation sur des 
serveurs Linux. Cependant, la plupart des instructions de ce document 
devraient &ecirc;tre facilement applicables &agrave; d'autres saveurs d'UNIX et 
j'essaierai d'indiquer les &eacute;ventuelles diff&eacute;rences dont j'aurais 
connaissance. J'ai &eacute;galement re&ccedil;u des suggestions de personnes utilisant 
d'autres distributions et d'autres plates-formes, et j'ai essay&eacute; 
d'incorporer leurs commentaires lorsque cela &eacute;tait possible.

</p><p>

Si vous utilisez Linux, vous devez &ecirc;tre s&ucirc;r d'utiliser un noyau&nbsp;2.4 
avant d'essayer ceci. Le param&egrave;tre <code class="literal">-u</code> (ex&eacute;cution par 
un utilisateur non root) requiert cette version du noyau.

</p></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N100D7"></a>2.&nbsp;Pr&eacute;paration de l'environnement restreint</h2></div></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N100DA"></a>2.1.&nbsp;Cr&eacute;ation d'un utilisateur</h3></div></div></div><p>

Comme cela est mentionn&eacute; dans l'introduction, il n'est pas conseill&eacute; de 
faire fonctionner BIND sous le compte root. Ainsi, avant de commencer, 
cr&eacute;ons un utilisateur sp&eacute;cifique pour BIND. Notez que vous ne devez 
jamais employer un utilisateur g&eacute;n&eacute;rique comme <code class="literal">nobody</code> 
pour cela. Ainsi, quelques distributions, comme SuSE et Mandrake Linux 
ont commenc&eacute; &agrave; fournir un utilisateur sp&eacute;cifique (g&eacute;n&eacute;ralement appel&eacute; 
<code class="literal">named</code>)&nbsp;; si vous le souhaitez, vous pouvez 
tout simplement adapter cet utilisateur &agrave; nos desseins. Ceci exige 
l'ajout d'une ligne comme celle qui suit dans 
<code class="filename">/etc/passwd</code>&nbsp;:

</p><pre class="screen">
named:x:200:200:Serveur de noms:/chroot/named:/bin/false
</pre><p>

Et d'une ligne de ce type dans <code class="filename">/etc/group</code>&nbsp;:

</p><pre class="screen">
named:x:200:
</pre><p>

Ceci cr&eacute;e pour BIND un utilisateur et un groupe appel&eacute;s 
<code class="literal">named</code>. Assurez-vous que l'UID et le GID (tous deux 
valant 200 dans cet exemple) sont uniques sur votre syst&egrave;me. 
L'interpr&eacute;teur de commande est mis &agrave; <code class="literal">/bin/false</code> car 
cet utilisateur n'aura jamais besoin de se connecter.

</p></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10101"></a>2.2.&nbsp;Arborescence de r&eacute;pertoires</h3></div></div></div><p>

Nous devons maintenant mettre en place l'arborescence de r&eacute;pertoires que 
nous allons utiliser pour l'environnement restreint d'ex&eacute;cution de BIND. 
Elle peut se situer n'importe o&ugrave; dans votre syst&egrave;me de fichiers&nbsp;; 
si vous &ecirc;tes vraiment parano&iuml;aque, vous pourrez m&ecirc;me la placer dans un 
volume s&eacute;par&eacute;. Je supposerai que vous allez employer <code class="filename">/chroot/named</code>. Commen&ccedil;ons en cr&eacute;ant 
l'arborescence de r&eacute;pertoires suivante&nbsp;:

</p><pre class="screen">
/chroot
  +-- named
       +-- dev
       +-- etc
       |    +-- namedb
       |         +-- slave
       +-- var
            +-- run
</pre><p>

Si vous utilisez la commande GNU <span><strong class="command">mkdir</strong></span> (tel que 
pr&eacute;sente sur les syst&egrave;mes Linux), vous pourrez cr&eacute;er l'arborescence de 
r&eacute;pertoires ainsi&nbsp;:

</p><pre class="screen">
# mkdir -p /chroot/named
# cd /chroot/named
# mkdir -p dev etc/namedb/slave var/run
</pre></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10117"></a>2.3.&nbsp;Mise en place des donn&eacute;es de BIND</h3></div></div></div><p>

Si vous avez d&eacute;j&agrave; fait une installation conventionnelle de BIND et si 
vous l'utilisez, votre fichier <code class="filename">named.conf</code> et vos 
fichiers de zones existent d&eacute;j&agrave;. Ces fichiers doivent &ecirc;tre d&eacute;plac&eacute;s (ou 
copi&eacute;s pour plus de s&ucirc;ret&eacute;) dans l'environnement restreint, de sorte que 
BIND puisse les atteindre. <code class="filename">named.conf</code> ira dans 
<code class="filename">/chroot/named/etc</code>, et les fichiers de zone pourront 
aller dans <code class="filename">/chroot/named/etc/namedb</code>. Par 
exemple&nbsp;:

</p><pre class="screen">
# cp -p /etc/named.conf /chroot/named/etc/
# cp -a /var/named/* /chroot/named/etc/namedb/
</pre><p>

BIND a normalement besoin d'&eacute;crire dans le r&eacute;pertoire 
<code class="filename">namedb</code>, mais pour renforcer la s&eacute;curit&eacute;, nous ne 
l'autoriserons pas &agrave; le faire. Si votre serveur de nom est esclave pour 
une zone quelconque, il aura besoin de mettre &agrave; jour ces fichiers de 
zones, ce qui veut dire nous devrons les enregistrer dans un r&eacute;pertoire 
s&eacute;par&eacute;, auquel BIND aura acc&egrave;s.

</p><pre class="screen">
# chown -R named:named /chroot/named/etc/namedb/slave
</pre><p>
Gardez &agrave; l'esprit que vous devrez d&eacute;placer toutes vos zones esclaves 
dans ce r&eacute;pertoire et que vous devez mettre &agrave; jour votre 
<code class="filename">named.conf</code> en cons&eacute;quence.

</p><p>

BIND aura aussi besoin d'&eacute;crire dans le r&eacute;pertoire 
<code class="filename">/var/run</code>, pour y mettre ses fichiers pid et ses 
fichiers de statistiques, donc permettons-lui de le faire&nbsp;:

</p><pre class="screen">
# chown named:named /chroot/named/var/run
</pre></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10147"></a>2.4.&nbsp;Fichiers de support syst&egrave;me</h3></div></div></div><p>

Lorsque BIND s'ex&eacute;cute dans l'environnement restreint, il ne peut plus 
<span class="emphasis"><em>du tout</em></span> acc&eacute;der aux fichiers situ&eacute;s hors de 
celui-ci. Cependant, il a besoin d'acc&eacute;der &agrave; quelques fichiers clefs, 
bien que leur nombre soit bien moindre que ce dont BIND&nbsp;8 avait 
besoin.

</p><p>

Un fichier dont BIND aura besoin &agrave; l'int&eacute;rieur de sa prison est le bon 
vieux <code class="filename">/dev/null</code>. Notez que la 
commande exacte n&eacute;cessaire pour cr&eacute;er ce fichier sp&eacute;cial peut varier de 
syst&egrave;me &agrave; syst&egrave;me&nbsp;; v&eacute;rifiez le script 
<code class="filename">/dev/MAKEDEV</code> pour vous en assurer. Quelques 
syst&egrave;mes peuvent &eacute;galement exiger <code class="filename">/dev/zero</code>, que 
nous pourrons cr&eacute;er de la m&ecirc;me fa&ccedil;on. Il a &eacute;t&eacute; mentionn&eacute; que les version 
pr&eacute;liminaires de BIND&nbsp;9.2.0 ont maintenant &eacute;galement besoin de 
<code class="filename">/dev/random</code>. Pour la plupart des syst&egrave;mes Linux, 
nous pourrons employer les commandes suivantes&nbsp;:

</p><pre class="screen">
# mknod /chroot/named/dev/null c 1 3
# mknod /chroot/named/dev/random c 1 8
# chmod 666 /chroot/named/dev/{null,random}
</pre><p>

Pour FreeBSD 4.3, ce sera&nbsp;:

</p><pre class="screen">
# mknod /chroot/named/dev/null c 2 2
# mknod /chroot/named/dev/random c 2 3
# chmod 666 /chroot/named/dev/{null,random}
</pre><p>

Vous aurez besoin de disposer d'un autre fichier dans le r&eacute;pertoire 
<code class="filename">/etc</code> de l'environnement restreint. Vous devrez 
copier <code class="filename">/etc/localtime</code> (nomm&eacute; 
<code class="filename">/usr/lib/zoneinfo/localtime</code> sur certains syst&egrave;mes), 
afin que BIND puisse enregistrer les &eacute;v&egrave;nements avec un horodatage 
correct. La commande suivante s'en chargera&nbsp;:

</p><pre class="screen">
# cp /etc/localtime /chroot/named/etc/
</pre></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="logging"></a>2.5.&nbsp;Journalisation des &eacute;v&egrave;nements</h3></div></div></div><p>

BIND a beau &ecirc;tre prisonnier de son environnement restreint, 
contrairement &agrave; un prisonnier ordinaire, il ne peut &eacute;crire son journal 
sur les murs de sa cellule <code class="literal">:-)</code> Normalement, BIND 
enregistre un journal des &eacute;v&egrave;nements gr&acirc;ce &agrave; 
<span class="application">syslogd</span>, le d&eacute;mon de journalisation syst&egrave;me. 
Cependant, ce type de journalisation est effectu&eacute; en envoyant les 
enregistrements d'&eacute;v&egrave;nements vers le connecteur (<span class="foreignphrase" lang="en"><em class="foreignphrase">socket</em></span>) sp&eacute;cial 
<code class="filename">/dev/log</code>. Puisqu'elle se trouve d&eacute;sormais &agrave; 
l'ext&eacute;rieur de l'environnement restreint, BIND ne peut plus l'employer. 
Heureusement, il existe quelques solutions pour contourner le probl&egrave;me.

</p><div class="section" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="N10191"></a>2.5.1.&nbsp;La solution id&eacute;ale</h4></div></div></div><p>

La solution id&eacute;ale de ce dilemme exige une version raisonnablement 
r&eacute;cente de <span class="application">syslogd</span> qui prenne en charge le 
param&egrave;tre <code class="option">-a</code> introduit par OpenBSD. Reportez-vous &agrave; la 
page de manuel de votre

<span class="citerefentry"><span class="refentrytitle">syslogd</span>(8)</span>

pour v&eacute;rifier si elle offre cette option. Si c'est la cas, la seule 
chose que vous ayez &agrave; faire est d'ajouter le param&egrave;tre 
&laquo;&nbsp;<span class="quote"><code class="literal">-a /chroot/named/dev/log</code></span>&nbsp;&raquo; &agrave; la ligne de 
commande utilis&eacute;e pour lancer <span class="application">syslogd</span>. Sur 
les syst&egrave;mes qui utilisent un init SysV complet (ce qui inclut la 
plupart des distributions Linux), vous pouvez faire cela en modifiant le 
fichier <code class="filename">/etc/rc.d/init.d/syslog</code>. Par exemple, sur 
mon syst&egrave;me Linux Red Hat, j'ai chang&eacute; la ligne

</p><pre class="screen">
daemon syslogd -m 0
</pre><p>

en

</p><pre class="screen">
daemon syslogd -m 0 -a /chroot/named/dev/log
</pre><p>

Il est int&eacute;ressant de noter qu'&agrave; partir de la Red Hat 7.2, Red Hat a 
apparemment rendu ce processus plus facile. Il y a maintenant un fichier 
appel&eacute; <code class="filename">/etc/sysconfig/syslog</code> dans lequel on peut 
d&eacute;finit des param&egrave;tres suppl&eacute;mentaires pour syslogd. Les syst&egrave;mes 
OpenLinux de Caldera utilisent un d&eacute;mon de lancement appel&eacute; 
<span class="application">ssd</span>, qui lit la configuration depuis 
<code class="filename">/etc/sysconfig/daemons/syslog</code>. Il vous suffit de 
modifier la ligne d'options pour qu'elle ressemble &agrave; ceci&nbsp;:

</p><pre class="screen">
OPTIONS_SYSLOGD="-m 0 -a /chroot/named/dev/log"
</pre><p>

De la m&ecirc;me fa&ccedil;on sur les syst&egrave;mes SuSE, il m'a &eacute;t&eacute; indiqu&eacute; que le 
meilleur endroit pour ajouter ce param&egrave;tre est le fichier 
<code class="filename">/etc/rc.config</code>. Changez la ligne

</p><pre class="screen">
SYSLOGD_paraMS=""
</pre><p>

en

</p><pre class="screen">
SYSLOGD_paraMS="-a /chroot/named/dev/log"
</pre><p>

devrait faire l'affaire. Enfin, le dernier mais non le moindre, 
pour FreeBSD 4.3, il suffit apparemment de modifier le fichier 
<code class="filename">rc.conf</code> et d'y ajouter&nbsp;:

</p><pre class="screen">
syslogd_flags="-s -l /chroot/named/dev/log"
</pre><p>

Le <code class="option">-s</code> est l&agrave; pour des raisons de s&eacute;curit&eacute;, et fait 
partie des param&egrave;tres par d&eacute;faut. Le <code class="option">-l</code> doit &ecirc;tre suivi 
d'un chemin local, dans lequel on souhaite placer une autre interface de 
journalisation. Une fois que vous avez compris comment faire cette 
modification sur votre syst&egrave;me, il vous suffira de red&eacute;marrer 
<span class="application">syslogd</span>, que cela soit en le tuant (avec un 
<span><strong class="command">kill</strong></span>) et en le relan&ccedil;ant (avec les param&egrave;tres 
suppl&eacute;mentaires) ou en employant le script d'init SysV qui le fera pour 
vous&nbsp;:

</p><pre class="screen">
# /etc/rc.d/init.d/syslog stop
# /etc/rc.d/init.d/syslog start
</pre><p>

Une fois red&eacute;marr&eacute;, vous devriez voir dans 
<code class="filename">/chroot/named/dev</code> une entr&eacute;e appel&eacute;e 
<code class="filename">log</code> qui ressemble &agrave; ceci&nbsp;:

</p><pre class="screen">
srw-rw-rw-   1 root     root            0 Mar 13 20:58 log
</pre></div><div class="section" lang="fr"><div class="titlepage"><div><div><h4 class="title"><a name="N10200"></a>2.5.2.&nbsp;L'autre solution</h4></div></div></div><p>

Si vous avez un ancien <span class="application">syslogd</span>, vous devrez 
trouver une autre fa&ccedil;on d'&eacute;crire dans le journal des &eacute;v&egrave;nements. Il 
existe quelques programmes pour cela, comme 
<span class="application">holelogd</span>, qui est con&ccedil;u pour agir comme un 
serveur mandataire en acceptant les entr&eacute;es d'&eacute;v&egrave;nements du BIND en 
environnement restreint pour les passer au v&eacute;ritable connecteur 
<code class="filename">/dev/log</code>. Vous pouvez aussi tout simplement 
configurer BIND pour journaliser les &eacute;v&egrave;nements dans un fichier au lieu 
de les passer &agrave; syslog. Reportez-vous &agrave; la documentation de BIND pour 
plus d'informations si vous choisissez d'utiliser cette m&eacute;thode.

</p></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="perm"></a>2.6.&nbsp;Resserrer les permissions</h3></div></div></div><p>

Tout d'abord, n'h&eacute;sitez &agrave; restreindre &agrave; l'utilisateur 
<code class="literal">root</code> l'acc&egrave;s &agrave; la totalit&eacute; du r&eacute;pertoire 
<code class="filename">/chroot</code>. Bien sur, tout le monde ne voudra pas 
faire cela, particuli&egrave;rement si cela indisposait d'autres logiciels 
install&eacute;s dans la m&ecirc;me arborescence.

</p><pre class="screen">
# chown root /chroot
# chmod 700 /chroot
</pre><p>

Vous pouvez aussi sans danger restreindre l'acc&egrave;s de
<code class="filename">/chroot/named</code> &agrave; l'utilisateur
<code class="literal">named</code>.

</p><pre class="screen">
# chown named:named /chroot/named
# chmod 700 /chroot/named
</pre><p>

Pour renforcer un peu plus la s&eacute;curit&eacute;, sur les syst&egrave;mes Linux utilisant 
le syst&egrave;me de fichier ext2, nous pouvons rendre certains fichiers et 
r&eacute;pertoires immuables, en utilisant l'utilitaire 
<code class="literal">chattr</code>.

</p><pre class="screen">
# cd /chroot/named
# chattr +i etc etc/localtime var
</pre><p>

De m&ecirc;me, sur FreeBSD 4.3, <span><strong class="command">chflags</strong></span> est l'outil &agrave; 
examiner pour rendre certains fichiers immuables. &Agrave; titre d'exemple, ce 
qui suit devrait rendre immuable le contenu du r&eacute;pertoire 
<code class="filename">/chroot/named/etc</code>&nbsp;:

</p><pre class="screen">
# chflags schg /chroot/named/etc/*(*).
</pre><p>

Il serait pratique de pouvoir faire la m&ecirc;me chose sur le r&eacute;pertoire 
<code class="filename">dev</code>, mais malheureusement cela emp&ecirc;cherait 
<span class="application">syslogd</span> de cr&eacute;er son connecteur 
<code class="filename">dev/log</code>. Vous pourrez aussi choisir de positionner 
le bit immuable sur d'autres fichiers de votre prison, comme par exemple 
vos fichiers de zone primaire, &agrave; condition qu'ils ne soient pas suppos&eacute;s 
changer.

</p></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="compiling"></a>3.&nbsp;Compiler et installer votre beau BIND tout neuf</h2></div></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10257"></a>3.1.&nbsp;Compiler</h3></div></div></div><p>

Compiler BIND&nbsp;9 pour l'utiliser dans un environnement restreint est 
une exp&eacute;rience plus plaisante que cela ne l'&eacute;tait avec BIND&nbsp;8. En 
fait, vous n'avez rien de sp&eacute;cial &agrave; faire&nbsp;; le classique 
<strong class="userinput"><code>./configure&nbsp;&amp;&amp;&nbsp;make</code></strong> suffira. 
Gardez &agrave; l'esprit que, sur des syst&egrave;mes Linux, si vous voulez activer la 
compatibilit&eacute; IPv6 de BIND (<code class="option">--enable-ipv6</code>), vous devrez 
disposer de versions correspondantes du noyau et de la biblioth&egrave;que 
glibc. Si vous avez un noyau 2.2, vous aurez besoin de la 
glibc&nbsp;2.1. Si vous avez un noyau 2.4, vous avez besoin de la 
glibc&nbsp;2.2. BIND est plut&ocirc;t pointilleux &agrave; ce propos.

</p></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="installing"></a>4.&nbsp;Installer votre beau BIND tout neuf</h2></div></div></div><p>

Vous devez aussi savoir que, si vous avez d&eacute;j&agrave; install&eacute; BIND, par 
exemple en utilisant un paquet RPM, vous devrez probablement le 
d&eacute;sinstaller avant d'installer votre nouvelle version. Sur un syst&egrave;me 
Red Hat, cela implique probablement de d&eacute;sinstaller les paquets 
<code class="literal">bind</code> et <code class="literal">bind-utils</code>, et peut-&ecirc;tre 
aussi <code class="literal">bind-devel</code> et 
<code class="literal">caching-nameserver</code>, si vous les avez.

</p><p>

Vous devriez sauvegarder une copie du script d'init (en g&eacute;n&eacute;ral 
<code class="literal">/etc/rc.d/init.d/named</code>), s'il y a en un, avant la 
d&eacute;sinstallation&nbsp;; ce sera utile plus tard.

</p><p>

Si vous r&eacute;alisez une mise &agrave; jour depuis une ancienne version de BIND, 
tel que BIND&nbsp;8, vous devriez lire le document de migration contenu 
dans le fichier <code class="filename">doc/misc/migration</code> du paquet source 
de BIND. Ce document ne traite pas du tout de la migration&nbsp;; il 
part simplement de l'hypoth&egrave;se que vous remplacez une installation 
existante et fonctionnelle de BIND&nbsp;9.

</p><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10285"></a>4.1.&nbsp;Installer les binaires</h3></div></div></div><p>

C'est la partie facile :-) Lancez juste <strong class="userinput"><code>make 
install</code></strong> et laissez-le tout faire pour vous. Et voil&agrave;, c'est 
aussi simple que cela.

</p></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N1028E"></a>4.2.&nbsp;Mise en place du script d'init</h3></div></div></div><p>

Si vous avez un script d'init provenant de votre distribution, le mieux 
serait probablement de simplement le modifier pour ex&eacute;cuter le nouveau 
binaire, avec les param&egrave;tres appropri&eacute;s. Les param&egrave;tres sont&hellip; 
<span class="emphasis"><em>(roulement de tambour s'il vous pla&icirc;t&hellip;)</em></span>

</p><div class="itemizedlist"><ul type="disc"><li><p>

<code class="option">-u named</code>, pour ex&eacute;cuter BIND avec l'utilisateur 
<code class="literal">named</code> , plut&ocirc;t que <code class="literal">root</code>.

</p></li><li><p>

<code class="option">-t /chroot/named</code>, pour que BIND s'ex&eacute;cute dans 
l'environnement restreint que nous avons mis en place.

</p></li><li><p>

<code class="option">-c /etc/named.conf</code>, pour que BIND trouve
sa configuration &agrave; l'int&eacute;rieur de la prison.

</p></li></ul></div><p>

Ce qui suit est le script d'init que j'utilise avec mon syst&egrave;me Red Hat 
6.0. Comme vous pouvez voir, il est presque identique &agrave; celui livr&eacute; par 
Red Hat. Je n'ai pas encore essay&eacute; la commande <span><strong class="command">rndc</strong></span>, 
mais je ne vois pas pour quelle raison elle ne fonctionnerait pas.

</p><pre class="programlisting">
#!/bin/sh
#
# named   Le r&ocirc;le de ce script est de d&eacute;marrer et d'arr&ecirc;ter
#         named (serveur DNS BIND).
#
# chkconfig: 345 55 45
# description: named (BIND) est le serveur de nom (DNS) \
# utilis&eacute; pour r&eacute;soudre les noms de domaines en adresses IP.
# probe: true

# Lecture de la biblioth&egrave;que de fonctions.
. /etc/rc.d/init.d/functions

# Lecture des param&egrave;tres r&eacute;seau.
. /etc/sysconfig/network

# V&eacute;rifie que le r&eacute;seau fonctionne.
[ ${NETWORKING} = "no" ] &amp;&amp; exit 0

[ -f /usr/local/sbin/named ] || exit 0

[ -f /chroot/named/etc/named.conf ] || exit 0

# En fonction de ce qui est appel&eacute;.
case "$1" in
  start)
	# D&eacute;marrer le d&eacute;mon.
        echo -n "D&eacute;marrage de named : "
        daemon /usr/local/sbin/named -u named -t /chroot/named \
                                     -c /etc/named.conf
        echo
        touch /var/lock/subsys/named
        ;;
  stop)
        # Arr&ecirc;ter le d&eacute;mon.
        echo -n "Arr&ecirc;t de named : "
        killproc named
        rm -f /var/lock/subsys/named
        echo
        ;;
  status)
        status named
        exit $?
        ;;
  restart)
        $0 stop
        $0 start
        exit $?
        ;;
  reload)
        /usr/local/sbin/rndc reload
        exit $?
        ;;
  probe)
        # named sait comment red&eacute;marrer intelligemment ;
        # nous ne voulons pas que linuxconf nous propose
        # de le red&eacute;marrer &agrave; chaque fois
        /usr/local/sbin/rndc reload &gt;/dev/null 2&gt;&amp;1 || echo start
        exit 0
        ;;

  *)
        echo "Utilisation: named {start|stop|status|restart|reload}"
        exit 1
esac

exit 0
</pre><p>

Comme pour syslogd, &agrave; partir de la version 7.2 de Red Hat, ce processus 
est devenu encore plus simple. Il existe maintenant un fichier nomm&eacute; 
<code class="filename">/etc/sysconfig/named</code> dans lequel il est possible 
d'ajouter des param&egrave;tres pour syslogd. Cependant, dans la distribution 
Red Hat&nbsp;7.2, la version par d&eacute;faut de 
<code class="filename">/etc/rc.d/init.d/named</code>, v&eacute;rifie l'existence de 
<code class="filename">/etc/named.conf</code> avant de lancer BIND. Vous devrez 
corriger ce chemin.

</p><p>

Sur les syst&egrave;mes OpenLinux de Caldera, vous avez juste besoin de 
modifier les variables d&eacute;finies au d&eacute;but et le script s'occupera 
apparemment du reste pour vous&nbsp;:

</p><pre class="screen">
NAME=named
DAEMON=/chroot/named/bin/$NAME
OPTIONS="-t /chroot/named -u named -g named"
</pre><p>

Et sous FreeBSD 4.3, vous pouvez &eacute;diter le fichier 
<code class="filename">rc.conf</code> et y ajouter les lignes suivantes&nbsp;:

</p><pre class="screen">
named_enable="YES"
named_program="chroot/named/bin/named"
named_flags="-u named -t /chroot/named -c /etc/namedb/named.conf"
</pre></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N102D6"></a>4.3.&nbsp;Changement de configuration</h3></div></div></div><p>

Vous devrez aussi ajouter ou modifier quelques options dans votre 
<code class="filename">named.conf</code> pour que vos divers r&eacute;pertoires soient 
correctement d&eacute;finis. En particulier, vous devrez ajouter (ou changer, 
si vous les avez d&eacute;j&agrave;) les directives suivantes dans la section 
<code class="literal">options</code>&nbsp;:

</p><pre class="screen">
directory "/etc/namedb";
pid-file "/var/run/named.pid";
statistics-file "/var/run/named.stats";
</pre><p>

Ce fichier &eacute;tant lu par le d&eacute;mon <span class="application">named</span>, tous 
les chemins sont relatifs &agrave; l'environnement restreint. Au jour de la 
r&eacute;daction de ce document, BIND&nbsp;9 ne permettait pas d'utiliser 
nombre des fichiers de statistiques et de vidage qu'il &eacute;tait possible 
d'utiliser avec la version pr&eacute;c&eacute;dente. Pr&eacute;sumons que les prochaines le 
pourront&nbsp;; si vous ex&eacute;cutez de telles configurations, vous devrez 
ajouter des entr&eacute;es additionnelles pour forcer BIND &agrave; &eacute;galement &eacute;crire 
ces fichiers dans le r&eacute;pertoire <code class="filename">/var/run</code>.

</p></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N102F1"></a>5.&nbsp;Fin</h2></div></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N102F4"></a>5.1.&nbsp;Lancement de BIND</h3></div></div></div><p>

Tout devrait &ecirc;tre configur&eacute; et vous devriez &ecirc;tre pr&ecirc;t &agrave; lancer BIND, 
dans cette nouvelle version plus s&ucirc;re. Si vous utilisez un script d'init 
de type Syst&egrave;me&nbsp;V, vous pourrez le lancer tout simplement en 
utilisant la commande&nbsp;:

</p><pre class="screen">
# /etc/rc.d/init.d/named start
</pre><p>

Avant de faire cela, assurez-vous d'avoir arr&ecirc;t&eacute; toutes les anciennes 
versions de BIND qui pourraient encore fonctionner.

</p></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N102FE"></a>5.2.&nbsp;Voil&agrave;&nbsp;!</h3></div></div></div><p>

Vous pouvez aller faire un petit somme maintenant ;-)

</p></div></div><div class="appendix" lang="fr"><h2 class="title" style="clear: both"><a name="N10303"></a>A.&nbsp;

Annexes

</h2><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="upgrading"></a>1.&nbsp;Mises &agrave; jour ult&eacute;rieures de BIND</h3></div></div></div><p>

Vous avez maintenant un BIND&nbsp;9.1.2 tout joliment cas&eacute; dans son 
environnement restreint et assez peaufin&eacute; &agrave; votre go&ucirc;t&hellip; et vous 
entendez parler de cette d&eacute;sagr&eacute;able rumeur disant que BIND&nbsp;9.1.3 est 
finalement sorti. Vous vous sentez donc oblig&eacute; de l'essayer sans 
attendre. Devrez-vous repasser enti&egrave;rement par ce long processus pour 
installer cette nouvelle version&nbsp;?

</p><p>

Pas du tout. En fait, vous aurez juste besoin de compiler le nouveau 
BIND et l'installer par dessus l'ancien. N'oubliez pas d'arr&ecirc;ter 
l'ancienne version et de red&eacute;marrer BIND, ou c'est l'ancienne version 
qui continuera &agrave; tourner&nbsp;!

</p></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="thanks"></a>2.&nbsp;Remerciements</h3></div></div></div><p>

Je voudrais remercier les personnes suivantes pour leur aide dans la 
cr&eacute;ation de ce guide pratique&nbsp;:

</p><div class="itemizedlist"><ul type="disc"><li><p>

Lonny Selinger

<code class="email">&lt;<a href="mailto:lonny CHEZ abyss POINT za POINT org">lonny CHEZ abyss POINT za POINT org</a>&gt;</code>

pour l'&eacute;valuation&raquo; de la premi&egrave;re version de ce guide pratique et pour 
s'&ecirc;tre assur&eacute; que je n'avais rien oubli&eacute;.

</p></li><li><p>

Chirik

<code class="email">&lt;<a href="mailto:chirik CHEZ CastleFur POINT COM">chirik CHEZ CastleFur POINT COM</a>&gt;</code>,

Dwayne Litzenberger

<code class="email">&lt;<a href="mailto:dlitz CHEZ dlitz POINT net">dlitz CHEZ dlitz POINT net</a>&gt;</code>,

Phil Bambridge

<code class="email">&lt;<a href="mailto:phil.b CHEZ cableinet POINT co POINT uk">phil.b CHEZ cableinet POINT co POINT uk</a>&gt;</code>,

Robert Cole

<code class="email">&lt;<a href="mailto:rcole CHEZ metrum TIRET datatape POINT com">rcole CHEZ metrum TIRET datatape POINT com</a>&gt;</code>,

Colin MacDonald

<code class="email">&lt;<a href="mailto:colinm CHEZ telus POINT net">colinm CHEZ telus POINT net</a>&gt;</code>,

et tous ceux qui ont mis le doigt sur des erreurs, des omissions et 
prodigu&eacute; d'autres conseils utiles pour rendre encore meilleur ce guide 
pratique.

</p></li><li><p>

Erik Wallin

<code class="email">&lt;<a href="mailto:erikw CHEZ sec POINT se">erikw CHEZ sec POINT se</a>&gt;</code>

et Brian Cervenka

<code class="email">&lt;<a href="mailto:brian CHEZ zerobelow POINT org">brian CHEZ zerobelow POINT org</a>&gt;</code>

pour avoir fourni de bonnes suggestions pour rendre encore plus s&ucirc;r 
l'environnement restreint.

</p></li><li><p>

Robert Dalton

<code class="email">&lt;<a href="mailto:support CHEZ accesswest POINT com">support CHEZ accesswest POINT com</a>&gt;</code>

pour avoir sugg&eacute;r&eacute; une paire d'exemples suppl&eacute;mentaires et m'avoir 
indiqu&eacute; que les BIND&nbsp;9.2.0 avaient besoin de 
<code class="filename">/dev/random</code>.

</p></li><li><p>

Eric McCormick

<code class="email">&lt;<a href="mailto:hostmaster CHEZ cybertime POINT net">hostmaster CHEZ cybertime POINT net</a>&gt;</code>

pour les informations sur FreeBSD 4.3.

</p></li><li><p>

Tan Zheng Da

<code class="email">&lt;<a href="mailto:tzd CHEZ pobox POINT com">tzd CHEZ pobox POINT com</a>&gt;</code>

pour les informations sur les changements survenus dans la version 7.2 
de la distribution Red Hat, qui ont rendu le processus un peu plus 
facile.

</p></li></ul></div><p>

Et le dernier mais certainement pas le moindre, je voudrais remercier
Nakano Takeo

<code class="email">&lt;<a href="mailto:nakano CHEZ apm POINT seikei POINT ac POINT jp">nakano CHEZ apm POINT seikei POINT ac POINT jp</a>&gt;</code>

pour avoir traduit en japonais ce guide pratique de BIND en
environnement restreint. Vous pouvez trouver sa traduction &agrave; l'adresse
<a href="http://www.linux.or.jp/JF/JFdocs/Chroot-BIND-HOWTO.html" target="_top">http://www.linux.or.jp/JF/JFdocs/Chroot-BIND-HOWTO.html</a>.

</p></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="legal"></a>3.&nbsp;Politique de distribution de ce document</h3></div></div></div><p>

Copyright &copy; Scott Wunsch, 2000-2001 pour la version originale.

</p><p>

Copyright &copy; 2004-2005 Vincent Loupien, Beno&icirc;t Rouits et 
Jean-Philippe Gu&eacute;rard pour la version fran&ccedil;aise.

</p><p>

Ce document peut &ecirc;tre distribu&eacute; selon les termes de la licence LDP tels 
que d&eacute;finis &agrave; l'adresse <a href="http://metalab.unc.edu/LDP/COPYRIGHT.html" target="_top">http://metalab.unc.edu/LDP/COPYRIGHT.html</a>.

</p><p>

Ce guide pratique est une documentation libre&nbsp;; vous pouvez le 
redistribuer ou le modifier conform&eacute;ment &agrave; la licence de LDP. Il est 
distribu&eacute; dans l'espoir qu'il sera utile, mais <span class="emphasis"><em>sans aucune 
garantie</em></span>&nbsp;; sans m&ecirc;me les garanties de 
commercialisation ou d'adaptation dans un but sp&eacute;cifique. Voir la 
licence de LDP pour plus de d&eacute;tails.

</p></div></div></div></body></html>