<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>GCC HOWTO pour Linux</TITLE>
</HEAD>
<BODY>
<H1>GCC HOWTO pour Linux</H1>

<H2>par Daniel Barlow <CODE>&lt;dan@detached.demon.co.uk&gt;</CODE></H2>v1.17, 28 f&eacute;vrier 1996
<HR>
<EM>(Adaptation fran&ccedil;aise par Eric Dumas <CODE>&lt;dumas@freenix.fr&gt;</CODE>, 8 Avril 1996).
Ce document pr&eacute;sente la mani&egrave;re de configurer le compilateur GNU C et les
biblioth&egrave;ques de d&eacute;veloppement sous Linux. Il donne un aper&ccedil;u de la compilation, de l'&eacute;dition de liens, de l'ex&eacute;cution et du d&eacute;bogage de programmes sous Linux. Bon nombre de passages de ce
document sont emprunt&eacute;s &agrave; la FAQ GCC r&eacute;dig&eacute;e par Mitch D'Souza's et au HowTo ELF. Ceci est la premi&egrave;re version publique (en d&eacute;pit du num&eacute;ro de version :
en fait, &ccedil;a vient de RCS). N'h&eacute;sitez pas &agrave; me joindre pour toute remarque.</EM>
<HR>
<H2><A NAME="s1">1. Pr&eacute;liminaires</A></H2>

<H2><A NAME="index.1"></A> <A NAME="index.0"></A> <A NAME="ss1.1">1.1 ELF et a.out</A>
  </H2>

<P> Le d&eacute;veloppement de Linux est actuellement dans une phase de transition.
En r&eacute;sum&eacute;, il existe deux formats de binaires que Linux reconna&icirc;t et
ex&eacute;cute, et cela d&eacute;pend de la mani&egrave;re dont votre syst&egrave;me est configur&eacute; :
vous pouvez avoir les deux, l'un ou l'autre. En lisant ce document,
vous pourrez savoir quels binaires votre syst&egrave;me est capable de g&eacute;rer.</P>
<P>
<A NAME="index.2"></A>  </P>
<P>Comment le savoir ? Utilisez la commande <CODE>file</CODE> (par exemple,
<CODE>file /bin/bash</CODE>). Pour un programme ELF, cette commande va
vous r&eacute;pondre quelque chose dans lequel se trouve le mot ELF. Dans le cas
d'un programme en a.out, il vous indiquera quelque chose comme
<CODE>Linux/i386</CODE>.</P>
<P>Les diff&eacute;rences entre ELF et a.out sont d&eacute;taill&eacute;es plus tard dans
ce document. ELF est le nouveau format et il est consid&eacute;r&eacute; comme
&eacute;tant meilleur.</P>

<H2><A NAME="index.3"></A> <A NAME="ss1.2">1.2 Du c&ocirc;t&eacute; du copyright</A>
 </H2>

<P>Le copyright et autres informations l&eacute;gales peuvent &ecirc;tre trouv&eacute;s &agrave; la 
<EM>fin</EM> de ce document, avec les avertissements conventionnels concernant
la mani&egrave;re de poser des questions sur Usenet pour &eacute;viter d'avoir &agrave; r&eacute;v&eacute;ler
votre ignorance du langage C en annon&ccedil;ant des bogues qui n'en sont pas, etc.</P>

<H2><A NAME="ss1.3">1.3 Typographie</A>
</H2>

<P> Si vous lisez ce document au format Postscript, dvi, ou HTML, vous
pouvez voir quelques diff&eacute;rence entre les styles d'&eacute;criture alors que les
gens qui consultent ce document au format texte pur ne verront aucune
diff&eacute;rence. En particulier, les noms de fichiers, le nom des commandes, 
les messages donn&eacute;s par les programmes et les codes sources seront 
&eacute;crits avec le style suivant : <CODE>style d'&eacute;criture</CODE>, alors que
les noms de variables entre autres choses seront en <EM>italique</EM>.</P>
<P>Vous aurez &eacute;galement un index. Avec les formats dvi ou postscript, les
chiffres dans l'index correspondent au num&eacute;ros de paragraphes.
Au format HTML, il s'agit d'une num&eacute;rotation s&eacute;quentielle pour que
vous puissiez cliquer dessus. Avec le format texte, ce ne sont que des
nombres. Il vous est donc conseill&eacute; de prendre un autre format que le 
format texte !</P>
<P>L'interpr&eacute;teur de commande (<EM>shell</EM>) utilis&eacute; dans les exemples 
sera la Bourne shell (plut&ocirc;t que le C-Shell). Les utilisateurs du
C-Shell utiliseront plut&ocirc;t :
<BLOCKQUOTE><CODE>
<PRE>
% setenv soif JD
</PRE>
</CODE></BLOCKQUOTE>

l&agrave; o&ugrave; j'ai &eacute;crit
<BLOCKQUOTE><CODE>
<PRE>
$ soif=JD; export soif
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si l'invite (<EM>prompt</EM> dans la langue de Shakespeare)
est  <CODE>#</CODE> plut&ocirc;t que <CODE>$</CODE>, la commande ne fonctionnera
que si elle est ex&eacute;cut&eacute;e au nom de Root. Bien sur, je d&eacute;cline 
toute responsabilit&eacute; de ce qui peut se produire sur votre syst&egrave;me
lors de l'ex&eacute;cution de ces exemples. Bonne chance <CODE>:-)</CODE></P>

<H2><A NAME="s2">2. O&ugrave; r&eacute;cup&eacute;rer de la documentation et les programmes ?</A></H2>

<H2><A NAME="ss2.1">2.1 Ce document</A>
</H2>

<P> Ce document fait partie de la s&eacute;rie des HOWTO pour Linux, et il est
donc disponible ainsi que ces coll&egrave;gues dans les r&eacute;pertoires HowTo pour 
Linux, comme sur 
<A HREF="http://sunsite.unc.edu/pub/linux/docs/HOWTO/">http://sunsite.unc.edu/pub/linux/docs/HOWTO/</A>.  La version HTML
peut &eacute;galement &ecirc;tre consult&eacute;e sur 
<A HREF="http://ftp.linux.org.uk/~barlow/howto/gcc-howto.html">http://ftp.linux.org.uk/~barlow/howto/gcc-howto.html</A>.</P>
<P>Note du traducteur : vous pouvez obtenir tous les HowTos en langue 
anglaise et fran&ccedil;aise sur <CODE>ftp.ibp.fr:/pub/linux</CODE>. Les versions
fran&ccedil;aises se trouvent dans le r&eacute;pertoire <CODE>/pub/linux/french/HOWTO</CODE>.</P>


<H2><A NAME="index.4"></A> <A NAME="ss2.2">2.2 Autres documentation</A>
 </H2>

<P> La documentation officielle pour gcc se trouve dans les sources
de la distribution (voir plus bas) sous la forme de fichiers texinfo et 
de fichiers <CODE>.info</CODE>. Si vous poss&eacute;dez une connexion rapide, un CD-ROM
ou une certaine patience, vous pouvez d&eacute;sarchiver la documentation et 
l'installer dans le r&eacute;pertoire <CODE>/usr/info</CODE>.  Sinon, vous
pouvez toujours les trouver sur 
<A HREF="ftp://tsx-11.mit.edu:/pub/linux/packages/GCC/">tsx-11</A>, mais
ce n'est pas n&eacute;cessairement toujours la derni&egrave;re version.</P>
<P>
<A NAME="index.5"></A>  </P>

<P> Il existe deux sources de documentation pour la libc. La libc GNU
est fournie avec des fichiers info qui d&eacute;crivent assez pr&eacute;cis&eacute;ment
la libc Linux sauf pour la partie des entr&eacute;es-sorties.  Vous pouvez &eacute;galement
trouver sur 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/">sunsite</A> des documents &eacute;crits
pour Linux ainsi que la description de certaines appels syst&egrave;mes
(section 2) et certaines fonctions de la libc (section 3).</P>
<P>Note du traducteur : un b&eacute;mol concernant cette partie... La libc
Linux n'est pas GNU et tend &agrave; &ecirc;tre relativement diff&eacute;rente sur certains
points.</P>

<H2><A NAME="index.6"></A> <A NAME="ss2.3">2.3 GCC </A>
 </H2>

<P> Il existe deux types de r&eacute;ponses</P>
<P>(a) La distribution officielle de GCC pour Linux peut 
toujours &ecirc;tre r&eacute;cup&eacute;r&eacute;e sous la forme de binaires (d&eacute;j&agrave; compil&eacute;e)
sur 
<A HREF="ftp://tsx-11.mit.edu:/pub/linux/packages/GCC/">ftp://tsx-11.mit.edu:/pub/linux/packages/GCC/</A>. Vous pouvez la 
trouver sur le miroir fran&ccedil;ais  
<A HREF="ftp://ftp.ibp.fr:/pub/linux/packages/GCC/">ftp://ftp.ibp.fr:/pub/linux/packages/GCC/</A>.
A l'heure o&ugrave; j'&eacute;cris ces lignes, la derni&egrave;re version est 
gcc 2.7.2 (<CODE>gcc-2.7.2.bin.tar.gz</CODE>).</P>
<P>(b) La derni&egrave;re distribution des sources de GCC de la <EM>Free Software
Foundation</EM> peut-&ecirc;tre r&eacute;cup&eacute;r&eacute;e sur
<A HREF="ftp://prep.ai.mit.edu/pub/gnu/">prep.ai.mit.edu</A> ou
<A HREF="ftp://ftp.ibp.fr/pub/gnu/">ftp.ibp.fr</A>.
Ce n'est pas toujours la m&ecirc;me version que celle pr&eacute;sent&eacute;e ci-dessus. 
Les mainteneurs de GCC pour Linux ont rendu la compilation de GCC plus
facile gr&acirc;ce &agrave; l'utilisation du script <CODE>configure</CODE> qui
effectue la configuration d'une mani&egrave;re automatique. 
Regardez dans 
<A HREF="ftp://tsx-11.mit.edu:/pub/linux/packages/GCC/">tsx-11</A> ou
<A HREF="ftp://ftp.ibp.fr:/pub/linux/packages/GCC/">ftp.ibp.fr</A>
pour r&eacute;cup&eacute;rer d'&eacute;ventuels patches.</P>

<P>Quelle que soit la complexit&eacute; de votre programme, vous aurez &eacute;galement
besoin de la <EM>libc</EM>.</P>

<H2><A NAME="index.7"></A> <A NAME="ss2.4">2.4 Les fichiers d'en-t&ecirc;te et la biblioth&egrave;que C</A>
 </H2>

<P>Ce que vous allez trouver dans ce paragraphe d&eacute;pend 
<UL>
<LI> de votre syst&egrave;me (ELF ou a.out) ;</LI>
<LI> du type de binaire que vous d&eacute;sirez g&eacute;n&eacute;rer.</LI>
</UL>

Si vous &ecirc;tes en train de mettre &agrave; jour votre libc 4 en libc 5,
vous devriez consulter le ELF HowTo qui se trouve au m&ecirc;me
endroit que ce document.</P>
<P>Les libc sont disponibles sur 
<A HREF="ftp://tsx-11.mit.edu:/pub/linux/packages/GCC/">tsx-11</A> ou
<A HREF="ftp://ftp.ibp.fr:/pub/linux/packages/GCC/">ftp.ibp.fr</A>. Voici une description
des fichiers situ&eacute;s dans ce r&eacute;pertoire :</P>
<P>
<DL>

<DT><B><CODE>libc-5.2.18.bin.tar.gz</CODE></B><DD><P>--- biblioth&egrave;ques dynamiques et statiques
ELF plus les fichiers d'en-t&ecirc;te pour la biblioth&egrave;que C et la biblioth&egrave;que
math&eacute;matique.</P>

<DT><B><CODE>libc-5.2.18.tar.gz</CODE></B><DD><P>--- Code source pour la biblioth&egrave;que ci-dessus.
Vous aurez &eacute;galement besoin du paquetage <CODE>.bin.</CODE> pour avoir les
fichiers d'en-t&ecirc;te. Si vous h&eacute;sitez entre compiler la biblioth&egrave;que C vous-m&ecirc;me
et utiliser les binaires, la bonne r&eacute;ponse est dans la majorit&eacute; des 
cas est d'utiliser les binaires. Toutefois, si vous d&eacute;sirer utiliser
NYS (NdT : NYS != NIS)  ou bien les mots de passe <EM>shadow</EM>,
vous devrez recompiler la libc par vous-m&ecirc;me.</P>

<DT><B><CODE>libc-4.7.5.bin.tar.gz</CODE></B><DD><P>--- biblioth&egrave;ques dynamiques et statiques 
a.out pour la version  4.7.5 de la libc.  Cette biblioth&egrave;que a 
&eacute;t&eacute; con&ccedil;ue pour pouvoir coexister avec le paquetage de la libc 5 d&eacute;crit
ci-dessus, mais c'est uniquement n&eacute;cessaire si vous d&eacute;sirez
utiliser ou d&eacute;velopper des programmes au format a.out.</P>
</DL>
</P>

<H2><A NAME="index.11"></A> <A NAME="index.10"></A> <A NAME="index.9"></A> <A NAME="index.8"></A> <A NAME="ss2.5">2.5 Outils associ&eacute;s (as, ld, ar, strings, etc.)</A>
    </H2>

<P>Ces outils se trouvent comme les biblioth&egrave;ques dans le r&eacute;pertoire
<A HREF="ftp://tsx-11.mit.edu:/pub/linux/packages/GCC/">tsx-11</A>, et
<A HREF="ftp://ftp.ibp.fr:/pub/linux/packages/GCC/">ftp.ibp.fr</A>.
La version actuelle est <CODE>binutils-2.6.0.2.bin.tar.gz</CODE>.</P>

<P> Il est utile de remarquer que ces outils ne sont disponibles
qu'au format ELF, que la libc actuelle est ELF et que la libc a.out
ne pose pas de probl&egrave;me lorsqu'elle est utilis&eacute;e avec la libc ELF.
Le d&eacute;veloppement de la libc est relativement rapide et &agrave; moins
que n'ayez de bonnes raisons pour utiliser le format a.out,
vous &ecirc;tes encourag&eacute;s &agrave; suivre le mouvement.</P>

<H2><A NAME="s3">3. Installation et configuration de GCC </A></H2>

<H2><A NAME="index.14"></A> <A NAME="index.13"></A> <A NAME="index.12"></A> <A NAME="ss3.1">3.1 Les versions de GCC</A>
   </H2>

<P> Vous pouvez savoir quelle est la version de GCC que vous poss&eacute;dez en
tapant <CODE>gcc -v</CODE> lors de l'invite. C'est &eacute;galement une bonne
technique pour savoir si votre configuration est ELF ou a.out.
Sur mon syst&egrave;me, cela donne ceci :
<BLOCKQUOTE><CODE>
<PRE>
$ gcc -v
Reading specs from /usr/lib/gcc-lib/i486-zorglub-linux/2.7.2/specs
gcc version 2.7.2
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P> Les mots-clefs &agrave; remarquer
<UL>
<LI> <CODE>i486</CODE>.  Cela vous indique que la version de gcc que vous utilisez 
a &eacute;t&eacute; compil&eacute;e pour &ecirc;tre utilis&eacute;e sur un processeur 486 --- mais vous pouvez
avoir un autre processeur comme un 386 ou un Pentium (586).
Tous ces processeurs peuvent ex&eacute;cuter le code compil&eacute; avec n'importe 
quel processeur. La seule diff&eacute;rence r&eacute;side dans le fait que le 
code 486 rajoute  un peu de code &agrave; certains endroits pour
aller plus vite sur un 486. Cela n'a pas d'effet n&eacute;faste c&ocirc;t&eacute;
performance sur un 386 mais cela rend les ex&eacute;cutables un peu plus
importants.
</LI>
<LI> <CODE>zorglub</CODE>.  Ce n'est pas r&eacute;ellement important, et il s'agit 
g&eacute;n&eacute;ralement d'un commentaire (comme <CODE>slackware</CODE> or <CODE>debian</CODE>) 
ou m&ecirc;me, cela peut-&ecirc;tre vide (lorsque vous avez comme nom
de r&eacute;pertoire  <CODE>i486-linux</CODE>).  Si vous construisez votre propre
gcc, vous pouvez fixer ce param&egrave;tre selon vos d&eacute;sirs, comme je l'ai fait.
<CODE>:-)</CODE>
</LI>
<LI> <CODE>linux</CODE>.  Cela peut &ecirc;tre &agrave; la place <CODE>linuxelf</CODE> ou
<CODE>linuxaout</CODE> et en fait, la signification varie en fonction de la
version que vous poss&eacute;dez.

<UL>
<LI> <CODE>linux</CODE> signifie ELF si la version est 2.7.0 ou sup&eacute;rieure, sinon,
c'est du a.out.
</LI>
<LI><CODE>linuxaout</CODE> signifie a.out.  Cela a &eacute;t&eacute; introduit comme
cible lorsque le format des binaires a chang&eacute; de a.out vers ELF
dans <B>Linux</B>. Normalement, vous ne verrez plus de 
<CODE>linuxaout</CODE> avec une version de gcc sup&eacute;rieure &agrave; 2.7.0.

<A NAME="index.15"></A>  </LI>
<LI><CODE>linuxelf</CODE> est d&eacute;pass&eacute;. Il s'agit g&eacute;n&eacute;ralement de gcc version
2.6.3 configur&eacute; pour g&eacute;n&eacute;rer des ex&eacute;cutables ELF. Notez que gcc 2.6.3
est connu pour g&eacute;n&eacute;rer de nombreuses erreurs lorsqu'il produit du code
ELF --- une mise &agrave; jour est tr&egrave;s fortement recommand&eacute;e.
</LI>
</UL>
</LI>
<LI> <CODE>2.7.2</CODE> est le num&eacute;ro de la version de GCC.</LI>
</UL>
</P>
<P>Donc, en r&eacute;sum&eacute;, nous poss&eacute;dons gcc 2.7.2 qui g&eacute;n&egrave;re du code ELF.  
<EM>Quelle surprise</EM> (NdT: En fran&ccedil;ais dans le texte) !</P>

<H2><A NAME="ss3.2">3.2 A quel endroit s'installe GCC ? </A>
</H2>

<P>Si vous avez install&eacute; gcc sans regarder, ou bien si vous l'avez eu
&agrave; partir d'une distribution, vous pouvez avoir envie de savoir
o&ugrave; il se trouve dans votre arborescence. Les mots clefs 
permettant cela sont</P>
<P>
<UL>
<LI> <CODE>/usr/lib/gcc-lib/</CODE><EM>machine-cible</EM><CODE>/</CODE><EM>version</EM><CODE>/</CODE> (et ses sous-r&eacute;pertoires) 
est g&eacute;n&eacute;ralement l'endroit o&ugrave; se trouve le plus souvent le compilateur.
Ceci inclut les ex&eacute;cutables qui r&eacute;alisent la compilation ainsi
que certaines biblioth&egrave;ques et quelques fichiers d'en-t&ecirc;te.
</LI>
<LI> <CODE>/usr/bin/gcc</CODE> est le lanceur du compilateur --- 
c'est en fait le programme que vous lancez.  Il peut &ecirc;tre utilis&eacute;
avec plusieurs versions de gcc lorsque vous poss&eacute;dez plusieurs r&eacute;pertoires
install&eacute;s (voir plus bas). Pour trouver la version par d&eacute;faut utilis&eacute;e, 
lancez <CODE>gcc -v</CODE>.  Pour forcer l'utilisation d'une autre
version, lancez <CODE>gcc -V </CODE><EM>version</EM>. Par exemple,

<BLOCKQUOTE><CODE>
<PRE>
# gcc -v
Reading specs from /usr/lib/gcc-lib/i486-zorglub-linux/2.7.2/specs
gcc version 2.7.2
# gcc -V 2.6.3 -v
Reading specs from /usr/lib/gcc-lib/i486-zorglub-linux/2.6.3/specs
gcc driver version 2.7.2 executing gcc version 2.6.3
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI> <CODE>/usr/</CODE><EM>machine-cible</EM><CODE>/(bin|lib|include)/</CODE>. 
Si vous avez install&eacute; plusieurs cibles possibles (par exemple a.out et elf, 
ou bien un compilateur crois&eacute;, les biblioth&egrave;ques, les binutils 
(<CODE>as</CODE>, <CODE>ld</CODE>, etc.) et les fichiers d'en-t&ecirc;te  pour 
les cibles diff&eacute;rente de celle par d&eacute;faut peuvent &ecirc;tre trouv&eacute;s &agrave; cet endroit.
M&ecirc;me si vous n'avez qu'une seule version de gcc install&eacute;e, vous devriez
toutefois trouver &agrave; cet endroit un certain nombre de fichiers. Si ce n'est pas
la cas, regardez dans <CODE>/usr/(bin|lib|include)</CODE>.
</LI>
<LI> <CODE>/lib/</CODE>, <CODE>/usr/lib</CODE> et autres sont les r&eacute;pertoires
pour les biblioth&egrave;ques pour le syst&egrave;me initial. Vous aurez &eacute;galement besoin
du programme <CODE>/lib/cpp</CODE> pour un grand nombre d'applications
(X l'utilise beaucoup) --- soit vous le copiez &agrave; partir de 
<CODE>/usr/lib/gcc-lib/</CODE><EM>machine-cible</EM><CODE>/</CODE><EM>version</EM><CODE>/</CODE>, soit vous faites  pointer un lien symbolique dessus.

<A NAME="index.16"></A>  </LI>
</UL>
</P>

<H2><A NAME="index.17"></A> <A NAME="ss3.3">3.3 O&ugrave; se trouvent les fichiers d'en-t&ecirc;te ?</A>
 </H2>

<P>Si l'on excepte les fichier fichiers d'en-t&ecirc;te que vous installez
dans le r&eacute;pertoire <CODE>/usr/local/include</CODE>,  il y a en fait
trois types de fichiers d'en-t&ecirc;te :</P>
<P>
<UL>
<LI> La grande majorit&eacute; des fichiers situ&eacute;s dans le r&eacute;pertoire
<CODE>/usr/include/</CODE> et dans ses sous-r&eacute;pertoires proviennent 
du paquetage de la libc dont s'occupe H.J. Lu. Je dis bien
la "grande  majorit&eacute;" car vous pouvez avoir &eacute;galement certains 
fichiers provenant d'autres sources (par exemple des 
biblioth&egrave;ques <CODE>curses</CODE> et <CODE>dbm</CODE>), ceci est d'autant plus vrai 
si vous poss&eacute;dez une distribution de la libc 
r&eacute;cente (o&ugrave; les biblioth&egrave;ques curses et dbm ne sont pas int&eacute;gr&eacute;es).

<A NAME="index.18"></A>  
<A NAME="index.19"></A>  
</LI>
<LI> Les r&eacute;pertoires <CODE>/usr/include/linux</CODE> 
et <CODE>/usr/include/asm</CODE> (pour les fichiers
<CODE>&lt;linux/*.h&gt;</CODE> et <CODE>&lt;asm/*.h&gt;</CODE>)
doivent &ecirc;tre des liens symboliques vers les r&eacute;pertoires
<CODE>linux/include/linux</CODE> et <CODE>linux/include/asm</CODE> situ&eacute;s dans
les sources du noyau. Vous devrez installer ces sources si vous d&eacute;sirez
pouvoir d&eacute;velopper : ces sources ne sont pas utilis&eacute;s uniquement
pour compiler le noyau.

Il est probable que vous ayez besoin de lancer la commande suivante
<CODE>make config</CODE> dans le r&eacute;pertoire des sources du noyau
apr&egrave;s les avoir install&eacute;s. Beaucoup de fichiers ont besoin
du fichier d'en-t&ecirc;te <CODE>&lt;linux/autoconf.h&gt;</CODE> 
qui n'existe pas sans cette commande. Il est &agrave; noter que dans 
certaines versions du noyau, le r&eacute;pertoire <CODE>asm</CODE> 
est en fait un lien symbolique qui n'est cr&eacute;&eacute; qu'avec l'ex&eacute;cution de
<CODE>make config</CODE>.

Donc, si vous installez les sources du noyau dans le r&eacute;pertoire
<CODE>/usr/src/linux</CODE>, il suffit de faire :
<BLOCKQUOTE><CODE>
<PRE>
$ cd /usr/src/linux
$ su
# make config
[repondez aux questions. A moins que vous ne recompiliez votre
noyau, les reponses importent peu]
# cd /usr/include
# ln -s ../src/linux/include/linux .
# ln -s ../src/linux/include/asm .
</PRE>
</CODE></BLOCKQUOTE>


<A NAME="index.20"></A>  
<A NAME="index.21"></A>  
<A NAME="index.22"></A>  
<A NAME="index.23"></A>  
<A NAME="index.24"></A>  

</LI>
<LI> Les fichiers tels que <CODE>&lt;float.h&gt;</CODE>, <CODE>&lt;limits.h&gt;</CODE>,
<CODE>&lt;varargs.h&gt;</CODE>, <CODE>&lt;stdarg.h&gt;</CODE> et
<CODE>&lt;stddef.h&gt;</CODE> changent en fonction de la version du compilateur, et
peuvent &ecirc;tre trouv&eacute;s dans le r&eacute;pertoire 
<CODE>/usr/lib/gcc-lib/i486-box-linux/2.7.2/include/</CODE> pour la version
<CODE>2.7.2</CODE>.
</LI>
</UL>
</P>

<H2><A NAME="ss3.4">3.4 Construire un compilateur crois&eacute;</A>
</H2>

<H3>Linux comme plate-forme de destination</H3>

<P> Nous supposons que vous avez r&eacute;cup&eacute;r&eacute; les sources de gcc, et normalement,
il vous suffit de suivre les instructions donn&eacute;es dans le fichier 
<CODE>INSTALL</CODE> situ&eacute; dans les sources de gcc. Ensuite, il suffit de lancer
<CODE>configure --target=i486-linux --host=XXX</CODE> sur une plateforme <CODE>XXX</CODE>,
puit un <CODE>make</CODE> devrait compiler gcc correctement. Il est &agrave; noter 
que vous aurez besoin des fichiers d'en-t&ecirc;te de Linux, ainsi que les sources
de l'assembleur et du l'&eacute;diteur de liens crois&eacute;s que vous pouvez trouver
sur 
<A HREF="ftp://tsx-11.mit.edu/pub/linux/packages/GCC/">ftp://tsx-11.mit.edu/pub/linux/packages/GCC/</A> ou
<A HREF="ftp://ftp.ibp.fr/pub/linux/GCC/">ftp://ftp.ibp.fr/pub/linux/GCC/</A>.</P>

<H3>Linux comme plate-forme origine et MSDOS comme destination</H3>

<P> Arggg.  Apparemment, cela est possible en utilisant
le paquetage « emx » ou l'extension « go ». Regardez 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/devel/msdos">ftp://sunsite.unc.edu/pub/Linux/devel/msdos</A> pour plus 
d'informations.</P>
<P>Je n'ai pas test&eacute; cela et je ne pense pas le faire !</P>

<H2><A NAME="s4">4. Portage et compilation</A></H2>

<H2><A NAME="index.25"></A> <A NAME="ss4.1">4.1 Symboles d&eacute;finis automatiquement</A>
 </H2>

<P>Vous pouvez trouver quels symboles votre version de gcc d&eacute;finit
automatiquement en le lan&ccedil;ant avec l'option <CODE>-v</CODE>.
Par exemple cela donne &ccedil;a chez moi :
<BLOCKQUOTE><CODE>
<PRE>
$ echo 'main(){printf("Bonjour !\n");}' | gcc -E -v -
Reading specs from /usr/lib/gcc-lib/i486-box-linux/2.7.2/specs
gcc version 2.7.2
 /usr/lib/gcc-lib/i486-box-linux/2.7.2/cpp -lang-c -v -undef
-D__GNUC__=2 -D__GNUC_MINOR__=7 -D__ELF__ -Dunix -Di386 -Dlinux
-D__ELF__ -D__unix__ -D__i386__ -D__linux__ -D__unix -D__i386
-D__linux -Asystem(unix) -Asystem(posix) -Acpu(i386)
-Amachine(i386) -D__i486__ -
</PRE>
</CODE></BLOCKQUOTE>

Si vous &eacute;crivez du code qui utilise des sp&eacute;cificit&eacute;s Linux, il
est souhaitable d'impl&eacute;menter le code non portable de la mani&egrave;re suivante 
<BLOCKQUOTE><CODE>
<PRE>
#ifdef __linux__
/* ... code linux ... */
#endif /* linux */
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Utilisez <CODE>__linux__</CODE> pour cela, et <EM>pas</EM> <CODE>linux</CODE>.
Bien que cette macro soit d&eacute;finie, ce n'est pas une sp&eacute;cification POSIX.</P>

<H2><A NAME="ss4.2">4.2 Options de compilation</A>
</H2>

<P> La documentation des options de compilation se trouve dans les 
pages <EM>info</EM> de gcc (sous Emacs, utilisez <CODE>C-h i</CODE> puis
s&eacute;lectionnez l'option `gcc').  Votre distribution peut ne pas 
avoir install&eacute; la documentation ou bien vous pouvez en avoir une
ancienne. Dans ce cas, la meilleure chose &agrave; faire est de r&eacute;cup&eacute;rer
les sources de gcc depuis 
<A HREF="ftp://prep.ai.mit.edu/pub/gnu">ftp://prep.ai.mit.edu/pub/gnu</A> ou
l'un des ses nombreux miroirs dont 
<A HREF="ftp://ftp.ibp.fr/pub/gnu">ftp://ftp.ibp.fr/pub/gnu</A>.</P>
<P>La page de manuel gcc (<CODE>gcc.1</CODE>) est en principe, compl&egrave;tement 
d&eacute;pass&eacute;e. Cela vous met en garde si vous d&eacute;sirez la consulter.</P>

<H3><A NAME="index.27"></A> <A NAME="index.26"></A> Options de compilation  </H3>

<P> gcc peut r&eacute;aliser un certain nombre d'optimisations sur le code g&eacute;n&eacute;r&eacute; 
en ajoutant l'option <CODE>-O</CODE><EM>n</EM> &agrave; la ligne de commandes, o&ugrave;
<EM>n</EM> est un chiffre. La valeur de <EM>n</EM>, et son effet exact, 
d&eacute;pend de la version de gcc, mais s'&eacute;chelonne normalement entre
0 (aucune optimisation) et 2 (un certain nombre) ou 3 (toutes les
optimisations possibles).</P>
<P>En interne, gcc interpr&egrave;te les options telles que <CODE>-f</CODE> et <CODE>-m</CODE>.  
Vous pouvez voir exactement ce qu'effectue le niveau sp&eacute;cifi&eacute; dans 
l'option <CODE>-O</CODE> en lan&ccedil;ant gcc avec l'option <CODE>-v</CODE> 
et l'option (non document&eacute;e)
<CODE>-Q</CODE>.  Par exemple, l'option <CODE>-O2</CODE>, effectue les op&eacute;rations
suivantes sur ma machine :
<BLOCKQUOTE><CODE>
<PRE>
enabled: -fdefer-pop -fcse-follow-jumps -fcse-skip-blocks
-fexpensive-optimizations
         -fthread-jumps -fpeephole -fforce-mem -ffunction-cse -finline
         -fcaller-saves -fpcc-struct-return -frerun-cse-after-loop
         -fcommon -fgnu-linker -m80387 -mhard-float -mno-soft-float
         -mno-386 -m486 -mieee-fp -mfp-ret-in-387
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Utiliser un niveau d'optimisation sup&eacute;rieur &agrave; celui que le compilateur 
supporte (par exemple <CODE>-O6</CODE>) aura le m&ecirc;me effet qu'utiliser le plus 
haut niveau g&eacute;r&eacute;. Distribuer du code o&ugrave; la compilation est configur&eacute;e de
cette mani&egrave;re est une tr&egrave;s mauvaise id&eacute;e -- si d'autres optimisations
sont incorpor&eacute;es dans de versions futures, vous (ou d'autres utilisateurs)
pouvez vous apercevoir que cela ne compile plus, ou bien que le code
g&eacute;n&eacute;r&eacute; ne fait pas les actions d&eacute;sir&eacute;es.</P>
<P>
<A NAME="index.28"></A>  
Les utilisateurs de gcc 2.7.0 &agrave; 2.7.2 devraient noter qu'il y a un
bogue dans l'option <CODE>-O2</CODE>. Plus pr&eacute;cis&eacute;ment, la 
<EM>strength reduction</EM> ne fonctionne pas.  Un patch a &eacute;t&eacute; 
impl&eacute;ment&eacute; pour r&eacute;soudre ce probl&egrave;me, mais vous devez alors 
recompiler gcc. Sinon, vous devrez toujours compiler avec l'option
<CODE>-fno-strength-reduce</CODE>.</P>


<H3>Sp&eacute;cification du processeur</H3>



<P> Il existe d'autres options <CODE>-m</CODE> qui ne sont pas positionn&eacute;es
lors de l'utilisation de <CODE>-O</CODE> mais qui sont n&eacute;anmoins utiles dans certains
cas. C'est le cas pour les options <CODE>-m386</CODE> et <CODE>-m486</CODE>, 
qui indiquent &agrave; gcc de g&eacute;n&eacute;rer un code plus ou moins optimis&eacute;
pour l'un ou l'autre type de processeur. Le code continuera &agrave; fonctionner
sur les deux processeurs. Bien que le code pour 486 soit plus important, il
ne ralentit pas l'ex&eacute;cution du programme sur 386.</P>
<P>Il n'existe pas actuellement de <CODE>-mpentium</CODE> ou <CODE>-m586</CODE>.  Linus 
a sugg&eacute;r&eacute; l'utilisation des options 
<CODE>-m486 -malign-loops=2 -malign-jumps=2 -malign-functions=2</CODE>,
pour exploiter les optimisations du 486 tout en perdant de la place
due aux probl&egrave;mes d'alignements (dont le Pentium n'a que faire). 
Michael Meissner (de Cygnus) nous dit :</P>
<P>
<BLOCKQUOTE>
« Mon avis est que l'option <CODE> -mno-strength-reduce </CODE> permet 
d'obtenir un code plus rapide sur un x86 (nota : je ne parle pas
du bogue <EM>strength reduction</EM>, qui est un autre probl&egrave;me). 
Cela s'explique en raison du peu de registres dont disposent ces processeurs
(et la m&eacute;thode de GCC qui consiste &agrave; grouper les registres dans l'ordre 
inverse au lieu d'utiliser d'autres registres n'arrange rien).
La <EM>strength reduction</EM> consiste en fait &agrave; rajouter 
des registres pour remplacer les multiplications par des additions.
Je suspecte &eacute;galement <CODE> -fcaller-saves</CODE> de ne pas arranger la 
situation. »
</BLOCKQUOTE>
</P>
<P>
<BLOCKQUOTE>
Une autre id&eacute;e est que <CODE>-fomit-frame-pointer</CODE> n'est pas obligatoirement
une bonne id&eacute;e.  
D'un c&ocirc;t&eacute;, cela peut signifier qu'un autre registre est disponible
pour une allocation. D'un autre c&ocirc;t&eacute;, vue la mani&egrave;re dont
les processeurs x86 codent leur jeu d'instruction, cela peut signifier
que la pile des adresses relatives prend plus de place que 
les adresses de fen&ecirc;tres relatives, ce qui signifie en clair 
que moins de cache est disponible pour l'ex&eacute;cution du processus.
Il faut pr&eacute;ciser que l'option <CODE>-fomit-frame-pointer</CODE>, signifie
que le compilateur doit constamment ajuster le pointeur de pile apr&egrave;s les
appels, alors qu'avec une fen&ecirc;tre, il peut laisser plusieurs appels 
dans la pile.
</BLOCKQUOTE>
</P>
<P>Le mot final sur le sujet provient de Linus :</P>
<P>
<BLOCKQUOTE>
Remarquez que si vous voulez des performances maximales, ne me croyez
pas : testez ! Il existe tellement d'options de gcc, et il est possible que
cela ne soit une r&eacute;elle optimisation que pour vous.
</BLOCKQUOTE>
</P>

<H3><A NAME="index.33"></A> <A NAME="index.32"></A> <A NAME="index.31"></A> <A NAME="index.30"></A> <A NAME="index.29"></A> <CODE>Internal compiler error: cc1 got fatal signal 11</CODE>     </H3>

<P> Signal 11 correspond au signal SIGSEGV, ou bien <EM>segmentation 
violation</EM>. Normalement, cela signifie que le programme s'est m&eacute;lang&eacute;
les pointeurs et a essay&eacute; d'&eacute;crire l&agrave; o&ugrave; il n'en a pas le droit. Donc, cela
pourrait &ecirc;tre un bug de gcc.</P>
<P>Toutefois, gcc est un logiciel assez test&eacute; et assez remarquable de ce c&ocirc;t&eacute;.
Il utilise un grand nombre de structures de donn&eacute;es complexes, et un
nombre impressionnant de pointeurs. En r&eacute;sum&eacute;, c'est le plus pointilleux
des testeurs de m&eacute;moire existants. Si vous <EM>n'arrivez pas &agrave; reproduire le 
bogue</EM> 
--- si cela ne s'arr&ecirc;te pas au m&ecirc;me endroit lorsque vous retentez la 
compilation --- c'est plut&ocirc;t un probl&egrave;me avec votre machine (processeur,
m&eacute;moire, carte m&egrave;re ou bien cache). <B>N'annoncez pas</B> la d&eacute;couverte
d'un nouveau bogue si votre ordinateur traverse tous les tests du BIOS,
ou s'il fonctionne correctement sous Windows ou autre : ces tests
ne valent rien. Il en va de m&ecirc;me si le noyau s'arr&ecirc;te lors du
`<CODE>make zImage</CODE>' !  `<CODE>make zImage</CODE>'
doit compiler plus de 200 fichiers, et il en faut bien moins pour arriver
&agrave; faire &eacute;chouer une compilation.</P>

<P> Si vous arrivez &agrave; reproduire le bogue et (mieux encore) &agrave; &eacute;crire un
petit programme qui permet de mettre en &eacute;vidence cette erreur, alors
vous pouvez envoyer le code soit &agrave; la FSF, soit dans la liste linux-gcc.
Consultez la documentation de gcc pour plus de d&eacute;tails concernant les
informations n&eacute;cessaires.</P>

<H2><A NAME="ss4.3">4.3 Portabilit&eacute;</A>
</H2>

<P> Cette phrase a &eacute;t&eacute; dite un jour : si quelque chose n'a pas &eacute;t&eacute;
port&eacute; vers Linux alors ce n'est pas important de l'avoir :-).</P>
<P>Plus s&eacute;rieusement, en g&eacute;n&eacute;ral seules quelques modifications mineures sont
n&eacute;cessaires car Linux r&eacute;pond &agrave; 100% aux sp&eacute;cifications POSIX.
Il est g&eacute;n&eacute;ralement sympathique d'envoyer &agrave; l'auteur du programme
les modifications effectu&eacute;es pour que le programme fonctionne sur Linux, pour
que lors d'une future version, un `make' suffise pour g&eacute;n&eacute;rer l'ex&eacute;cutable.</P>

<H3>Sp&eacute;cificit&eacute;s BSD (notamment <CODE>bsd_ioctl</CODE>, <CODE>daemon</CODE> et<CODE>&lt;sgtty.h&gt;</CODE>)</H3>

<P> Vous pouvez compiler votre programme avec l'option
<CODE>-I/usr/include/bsd</CODE> et faire l'&eacute;dition de liens avec <CODE>-lbsd</CODE> 
(en ajoutant <CODE>-I/usr/include/bsd</CODE> &agrave; la ligne <CODE>CFLAGS</CODE>
et <CODE>-lbsd</CODE> &agrave; la ligne <CODE>LDFLAGS</CODE> dans votre fichier
<CODE>Makefile</CODE>). Il est &eacute;galement n&eacute;cessaire de ne <B>pas</B>
ajouter <CODE>-D__USE_BSD_SIGNAL</CODE> si vous voulez 
que les signaux BSD fonctionnent car vous les avez inclus automatiquement
avec la ligne
<CODE>-I/usr/include/bsd</CODE> et en incluant le fichier d'en-t&ecirc;te
<CODE>&lt;signal.h&gt;</CODE>.</P>

<H3><A NAME="index.38"></A> <A NAME="index.37"></A> <A NAME="index.36"></A> <A NAME="index.35"></A> <A NAME="index.34"></A> Signaux <EM>manquants</EM> (<CODE>SIGBUS</CODE>, <CODE>SIGEMT</CODE>, <CODE>SIGIOT</CODE>, <CODE>SIGTRAP</CODE>, <CODE>SIGSYS</CODE>, etc.)     </H3>

<P> Linux respecte les sp&eacute;cifications POSIX. Ces signaux n'en font
pas partie (cf. ISO/IEC 9945-1:1990 - IEEE Std 1003.1-1990, paragraphe
B.3.3.1.1) :</P>
<P>
<BLOCKQUOTE>
« Les signaux SIGBUS, SIGEMT, SIGIOT, SIGTRAP, et SIGSYS ont &eacute;t&eacute; omis 
de la norme POSIX.1 car leur comportement est d&eacute;pendant de l'impl&eacute;mentation
et donc ne peut &ecirc;tre r&eacute;pertori&eacute; d'une mani&egrave;re satisfaisante.
Certaines impl&eacute;mentations peuvent fournir ces signaux mais doivent
documenter leur effet »
</BLOCKQUOTE>
</P>

<P>La mani&egrave;re la plus &eacute;l&eacute;gante de r&eacute;gler ce probl&egrave;me est de
red&eacute;finir ces signaux &agrave; <CODE>SIGUNUSED</CODE>.  La mani&egrave;re <EM>normale</EM> de 
proc&eacute;der est d'entourer le code avec les <CODE>#ifdef</CODE> appropri&eacute;s :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#ifdef SIGSYS
/* ... code utilisant les signaux non posix  .... */
#endif
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3><A NAME="index.39"></A> Code K &amp; R </H3>

<P> GCC est un compilateur ANSI, or il existe beaucoup de code
qui ne soit pas ANSI. </P>
<P>Il n'y a pas grand chose &agrave; faire, sauf rajouter l'option
<CODE>-traditional</CODE> lors de la compilation. Il effectue certaines 
v&eacute;rifications suppl&eacute;mentaires. Consultez les pages info gcc.</P>
<P>Notez que l'option <CODE>-traditional</CODE> a pour unique effet de changer la forme
du langage accept&eacute; par gcc. Par exemple, elle active l'option
<CODE>-fwritable-strings</CODE>, qui d&eacute;place toutes les cha&icirc;nes de caract&egrave;res
vers l'espace de donn&eacute;es (depuis l'espace de texte, o&ugrave; elle ne 
peuvent pas &ecirc;tre modifi&eacute;es). Ceci augmente la taille de la m&eacute;moire 
occup&eacute;e par le programme.</P>

<H3><A NAME="index.41"></A> <A NAME="index.40"></A> Les symboles du pr&eacute;processeur produisent un conflit avecles prototypes du code  </H3>

<P> Un des probl&egrave;mes fr&eacute;quents se produit lorsque certaines fonctions
standards sont d&eacute;finies comme macros dans les fichiers d'en-t&ecirc;te
de Linux et le pr&eacute;processeur refusera de traiter 
des prototypes identiques. Par exemple, cela peut arriver
avec <CODE>atoi()</CODE> et <CODE>atol()</CODE>.</P>

<H3><A NAME="index.42"></A> <CODE>sprintf()</CODE> </H3>

<P> Parfois, soyez prudent lorsque vous effectuez un portage &agrave; partir
des sources de programmes fonctionnant sous SunOs, surtout avec 
la fonction <CODE>sprintf(string, fmt, ...)</CODE> car elle renvoie 
un pointeur sur la cha&icirc;ne de caract&egrave;res alors que Linux (suivant la norme ANSI)
retourne le nombre de caract&egrave;res recopi&eacute;s dans la cha&icirc;ne de caract&egrave;res.</P>


<H3><A NAME="index.49"></A> <A NAME="index.48"></A> <A NAME="index.47"></A> <A NAME="index.46"></A> <A NAME="index.45"></A> <A NAME="index.44"></A> <A NAME="index.43"></A> <CODE>fcntl</CODE> et ses copains.  O&ugrave; se trouve la d&eacute;finition de <CODE>FD_*</CODE> et compagnie ?       </H3>

<P> Dans <CODE>&lt;sys/time.h&gt;</CODE>.  Si vous utilisez
<CODE>fcntl</CODE> vous voudrez probablement inclure 
<CODE>&lt;unistd.h&gt;</CODE> &eacute;galement, pour avoir le prototype de la fonction.</P>
<P>D'une mani&egrave;re g&eacute;n&eacute;rale, la page de manuel pour une fonction
donne la liste des fichiers d'en-t&ecirc;te &agrave; inclure.</P>

<H3><A NAME="index.50"></A> Le timeout de <CODE>select()</CODE>. Les programmescommencent dans un &eacute;tat d'attente active </H3>

<P> A une certaine &eacute;poque, le param&egrave;tre timeout de la fonction 
<CODE>select()</CODE> &eacute;tait utilis&eacute; en lecture seule.  C'est pourquoi la page
de manuel comporte une mise en garde :</P>
<P>
<BLOCKQUOTE>
select() devrait retourner normalement le temps &eacute;coul&eacute; depuis le
timeout initial, s'il s'est d&eacute;clench&eacute;, en modifiant la valeur point&eacute;e par
le param&egrave;tre <CODE>time</CODE>. Cela sera peut-&ecirc;tre impl&eacute;ment&eacute; dans les
versions ult&eacute;rieures du syst&egrave;me. Donc, il n'est pas vraiment prudent de 
supposer que les donn&eacute;es point&eacute;es ne seront pas modifi&eacute;es lors de l'appel
&agrave; select().
</BLOCKQUOTE>
</P>
<P>Mais tout arrive avec le temps ! Lors d'un retour de 
<CODE>select()</CODE>, l'argument <CODE>timeout</CODE> recevra le
temps &eacute;coul&eacute; depuis la derni&egrave;re r&eacute;ception de donn&eacute;es. Si aucune
donn&eacute;e n'est arriv&eacute;e, la valeur sera nulle, et les futurs
appels &agrave; cette fonction utilisant le m&ecirc;me <CODE>timeout</CODE>
auront pour r&eacute;sultat un retour imm&eacute;diat.</P>
<P>Pour r&eacute;soudre le probl&egrave;me, il suffit de mettre la valeur <CODE>timeout</CODE>
dans la structure &agrave; chaque appel de <CODE>select()</CODE>.  
Le code initial &eacute;tait 
<BLOCKQUOTE><CODE>
<PRE>
      struct timeval timeout;
      timeout.tv_sec = 1; 
      timeout.tv_usec = 0;
      while (some_condition)
            select(n,readfds,writefds,exceptfds,&amp;timeout); 
</PRE>
</CODE></BLOCKQUOTE>

et doit devenir :
<BLOCKQUOTE><CODE>
<PRE>
      struct timeval timeout;
      while (some_condition) 
      {
            timeout.tv_sec = 1; 
            timeout.tv_usec = 0;
            select(n,readfds,writefds,exceptfds,&amp;timeout);
      }
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Certaines versions de Mosaic &eacute;taient connues &agrave; une certaine &eacute;poque
pour avoir ce probl&egrave;me. </P>
<P>La vitesse de rotation du globe terrestre &eacute;tait inversement
proportionnelle &agrave; la vitesse de transfert des donn&eacute;es !</P>

<H3><A NAME="index.52"></A> <A NAME="index.51"></A> Appels syst&egrave;mes interrompus  </H3>

<H3>Symptomes :</H3>

<P>Lorsqu'un processus est arr&ecirc;t&eacute; avec un Ctrl-Z et relanc&eacute; - ou bien
lorsqu'un autre signal est d&eacute;clench&eacute; dans une situation diff&eacute;rente : 
par exemple avec un Ctrl-C, la terminaison d'un processus, etc, on
dit qu'il y a « interruption d'un appel syst&egrave;me » , ou bien
« write : erreur inconnue » ou des trucs de ce genre.</P>

<H3>Probl&egrave;mes :</H3>

<P>Les syst&egrave;mes POSIX v&eacute;rifient les signaux plus souvent que 
d'autres Unix plus anciens. Linux peux lancer les gestionnaires
de signaux :
<UL>
<LI> d'une mani&egrave;re asynchrone (sur un top d'horloge)</LI>
<LI> lors d'un retour de n'importe quel appel syst&egrave;me</LI>
<LI> pendant l'ex&eacute;cution des appels syst&egrave;mes suivants :
<CODE>select()</CODE>, <CODE>pause()</CODE>, <CODE>connect()</CODE>,
<CODE>accept()</CODE>, <CODE>read()</CODE> sur des terminaux, des sockets, des pipes 
ou des fichiers situ&eacute;s dans <CODE>/proc</CODE>, <CODE>write()</CODE> sur des
terminaux, des sockets, des pipes ou des imprimantes, <CODE>open()</CODE> 
sur des FIFOs, des lignes PTYs ou s&eacute;ries,
<CODE>ioctl()</CODE> sur des terminaux, <CODE>fcntl()</CODE> avec la commande
<CODE>F_SETLKW</CODE>, <CODE>wait4()</CODE>, <CODE>syslog()</CODE>, et toute op&eacute;ration
d'ordre TCP ou NFS.  </LI>
</UL>
</P>
<P>Sur d'autres syst&egrave;mes d'exploitation, il est possible que vous
ayez &agrave; inclure dans cette cat&eacute;gorie les appels syst&egrave;mes suivants :
<CODE>creat()</CODE>, <CODE>close()</CODE>, <CODE>getmsg()</CODE>, <CODE>putmsg()</CODE>,
<CODE>msgrcv()</CODE>, <CODE>msgsnd()</CODE>, <CODE>recv()</CODE>, <CODE>send()</CODE>,
<CODE>wait()</CODE>, <CODE>waitpid()</CODE>, <CODE>wait3()</CODE>, <CODE>tcdrain()</CODE>,
<CODE>sigpause()</CODE>, <CODE>semop()</CODE>.</P>


<P>Si un signal (que le programme d&eacute;sire traiter) est lanc&eacute; pendant
l'ex&eacute;cution d'un appel syst&egrave;me, le gestionnaire est lanc&eacute;. Lorsque
le gestionnaire du signal se termine, l'appel syst&egrave;me d&eacute;tecte qu'il a &eacute;t&eacute;
interrompu et se termine avec la valeur -1 et <CODE>errno = EINTR</CODE>. 
Le programme n'est pas forc&eacute;ment au courant de ce qui s'est pass&eacute; et
donc s'arr&ecirc;te.</P>
<P>Vous pouvez choisir deux solutions pour r&eacute;soudre ce probl&egrave;me.</P>
<P>(1)Dans tout gestionnaire de signaux que vous mettez en place, ajoutez
l'option <CODE>SA_RESTART</CODE> au niveau de <EM>sigaction</EM>. Par exemple, 
modifiez
<BLOCKQUOTE><CODE>
<PRE>
  signal (signal_id, mon_gestionnaire_de_signaux);
</PRE>
</CODE></BLOCKQUOTE>

en
<BLOCKQUOTE><CODE>
<PRE>
  signal (signal_id, mon_gestionnaire_de_signaux);
  { 
        struct sigaction sa;
        sigaction (signal_id, (struct sigaction *)0, &amp;sa);
#ifdef SA_RESTART
        sa.sa_flags |= SA_RESTART;
#endif
#ifdef SA_INTERRUPT
        sa.sa_flags &amp;= ~ SA_INTERRUPT;
#endif
        sigaction (signal_id, &amp;sa, (struct sigaction *)0);
  }
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Notez que lors de certains appels syst&egrave;mes vous
devrez souvent regarder si <CODE>errno</CODE> n'a pas &eacute;t&eacute; positionn&eacute;e &agrave; 
<CODE>EINTR</CODE> par vous m&ecirc;me comme avec <CODE>read()</CODE>, <CODE>write()</CODE>,
<CODE>ioctl()</CODE>, <CODE>select()</CODE>, <CODE>pause()</CODE> et <CODE>connect()</CODE>. </P>
<P>(2) A la recherche de <CODE>EINTR</CODE> :</P>
<P>Voici deux exemples avec <CODE>read()</CODE> et <CODE>ioctl()</CODE>,</P>
<P>Voici le code original utilisant <CODE>read()</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
int result;
while (len > 0) 
{ 
  result = read(fd,buffer,len);
  if (result &lt; 0) 
        break;
  buffer += result; 
  len -= result;
}
</PRE>
</CODE></BLOCKQUOTE>

et le nouveau code </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
int result;
while (len > 0) 
{ 
  result = read(fd,buffer,len);
  if (result &lt; 0) 
  { 
        if (errno != EINTR) 
                break; 
  }
  else 
  { 
        buffer += result; 
        len -= result; 
  }
}
</PRE>
</CODE></BLOCKQUOTE>

Voici un code utilisant  <CODE>ioctl()</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
int result;
result = ioctl(fd,cmd,addr);
</PRE>
</CODE></BLOCKQUOTE>

et cela devient
<BLOCKQUOTE><CODE>
<PRE>
int result;
do 
{ 
   result = ioctl(fd,cmd,addr); 
}
while ((result == -1) &amp;&amp; (errno == EINTR));
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Il faut remarquer que dans certaines versions d'Unix de type BSD 
on a l'habitude de relancer l'appel syst&egrave;me. Pour r&eacute;cup&eacute;rer les interruptions
d'appels syst&egrave;mes, vous devez utiliser les options 
<CODE>SV_INTERRUPT</CODE> ou <CODE>SA_INTERRUPT</CODE>.</P>

<H3><A NAME="index.56"></A> <A NAME="index.55"></A> <A NAME="index.54"></A> <A NAME="index.53"></A> Les cha&icirc;nes et leurs acc&egrave;s en &eacute;critures (ou les programmes qui provoquent des« segmentation fault » d'une mani&egrave;re al&eacute;atoire)    </H3>

<P> GCC a une vue optimiste en ce qui concerne ses utilisateurs, en 
croyant qu'ils respectent le fait qu'une cha&icirc;ne dite constante l'est
r&eacute;ellement. Donc, il les range  dans la zone <EM>texte(code)</EM> du 
programme, o&ugrave; elles peuvent &ecirc;tre charg&eacute;es puis d&eacute;charg&eacute;es 
&agrave; partir de l'image binaire de l'ex&eacute;cutable situ&eacute;e sur disque (ce qui &eacute;vite
d'occuper de l'espace disque). Donc, toute tentative d'&eacute;criture dans 
cette cha&icirc;ne provoque un « segmentation
fault ».</P>
<P>Cela peut poser certains probl&egrave;mes avec d'anciens codes, par exemple
ceux qui utilisent la fonction <CODE>mktemp()</CODE> avec une cha&icirc;ne constante
comme argument.  <CODE>mktemp()</CODE> essaye d'&eacute;crire dans la cha&icirc;ne pass&eacute;e
en argument.</P>
<P>Pour r&eacute;soudre ce probl&egrave;me, 
<OL>
<LI>compilez avec l'option <CODE>-fwritable-strings</CODE> pour indiquer
&agrave; gcc de mettre les cha&icirc;nes constantes dans l'espace de donn&eacute;es</LI>
<LI> r&eacute;&eacute;crire les diff&eacute;rentes parties du code pour allouer 
une cha&icirc;ne non constante puis effectuer un strcpy des donn&eacute;es
dedans avant d'effectuer l'appel.</LI>
</OL>
</P>

<H3><A NAME="index.57"></A> Pourquoi l'appel &agrave; <CODE>execl()</CODE> &eacute;choue ? </H3>

<P> Tout simplement parce que vous l'utilisez mal. Le premier argument
d'<CODE>execl</CODE> est le programme que vous d&eacute;sirez ex&eacute;cuter. Le second et ainsi
de suite sont en fait le &eacute;l&eacute;ments du tableau <CODE>argv</CODE> que vous appelez.
Souvenez-vous que <CODE>argv[0]</CODE> est traditionnellement fix&eacute; m&ecirc;me si
un programme est lanc&eacute; sans argument. Vous devriez donc &eacute;crire :
<BLOCKQUOTE><CODE>
<PRE>
execl("/bin/ls","ls",NULL);
</PRE>
</CODE></BLOCKQUOTE>

et pas 
<BLOCKQUOTE><CODE>
<PRE>
execl("/bin/ls", NULL);
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P> Lancer le programme sans argument est consid&eacute;r&eacute; comme &eacute;tant une
demande d'affichage des biblioth&egrave;ques dynamiques associ&eacute;es au programme,
si vous utilisez le format a.out. ELF fonctionne d'une mani&egrave;re diff&eacute;rente.</P>

<P>(Si vous d&eacute;sirez ces informations, il existe des outils plus simples;
consultez la section sur le chargement dynamique, ou la page de manuel
de <CODE>ldd</CODE>).</P>


<H2><A NAME="s5">5. D&eacute;boguer et optimiser</A></H2>

<H2><A NAME="index.58"></A> <A NAME="ss5.1">5.1 Etude pr&eacute;ventive du code (lint)</A>
 </H2>

<P> Il n'existe pas de lint qui soit r&eacute;ellement utilisable, tout simplement
parce que la grande majorit&eacute; des d&eacute;veloppeurs sont satisfaits des messages
d'avertissement de gcc. Il est probable que l'option la plus utile est
l'option <CODE>-Wall</CODE> --- qui a pour effet d'afficher tous les
avertissements possibles.</P>
<P>Il existe une version du domaine public du programme lint
que vous pouvez trouver &agrave; l'adresse suivante : 
<A HREF="ftp://larch.lcs.mit.edu/pub/Larch/lclint">ftp://larch.lcs.mit.edu/pub/Larch/lclint</A>.  Je ne sais pas
ce qu'elle vaut.</P>

<H2><A NAME="index.59"></A> <A NAME="ss5.2">5.2 D&eacute;boguer</A>
 </H2>

<H3><A NAME="index.62"></A> <A NAME="index.61"></A> <A NAME="index.60"></A> Comment rendre d&eacute;bogable un programme ?   </H3>

<P> Vous devez compiler et effectuer l'&eacute;dition de liens avec l'option
<CODE>-g</CODE>, et sans l'option <CODE>-fomit-frame-pointer</CODE>.  
En fait, vous ne devez compiler que les modules que 
vous avez besoin de d&eacute;boguer.</P>

<P> Si vous poss&eacute;dez un syst&egrave;me a.out, les biblioth&egrave;ques dynamiques sont
compil&eacute;es avec l'option <CODE>-fomit-frame-pointer</CODE>,
que gcc ne peut pas g&eacute;rer. Lorsque vous compilez avec l'option 
<CODE>-g</CODE>, alors par d&eacute;faut vous effectuez une &eacute;dition de liens statique, ce
qui permet de r&eacute;soudre le probl&egrave;me.</P>

<P> Si l'&eacute;diteur de liens &eacute;choue avec un message disant qu'il n'arrive
pas &agrave; trouver la biblioth&egrave;que libg.a, c'est que vous ne poss&eacute;dez pas
la biblioth&egrave;que <CODE>/usr/lib/libg.a</CODE>, qui est la biblioth&egrave;que C standard
permettant le d&eacute;bogage. Cette biblioth&egrave;que est fournie dans 
le paquetage des binaires de la libc., ou (dans les nouvelles versions)
vous aurez besoin de r&eacute;cup&eacute;rer le source et de le compiler vous-m&ecirc;me.
Vous n'avez pas r&eacute;ellement besoin de cela en fait, vous pouvez faire
un lien logique vers <CODE>/usr/lib/libc.a</CODE></P>

<H3><A NAME="index.63"></A> Comment r&eacute;duire la taille des ex&eacute;cutables ? </H3>

<P> Bon nombre de produits GNU sont fournis pour compiler avec l'option
<CODE>-g</CODE>, ce qui g&eacute;n&egrave;re des ex&eacute;cutables d'une taille tr&egrave;s importante (et 
souvent l'&eacute;dition de liens s'effectue d'une mani&egrave;re statique).
Ce n'est pas une id&eacute;e lumineuse...</P>

<P> Si le programme poss&egrave;de le script <CODE>configure</CODE> g&eacute;n&eacute;r&eacute; par
autoconf, vous pouvez modifier les options de d&eacute;bogage en 
effectuant un
<CODE>./configure CFLAGS=</CODE> ou <CODE>./configure CFLAGS=-O2</CODE>.  Sinon,
vous pouvez aller modifier le Makefile. Bien s&ucirc;r, si vous utilisez le format
ELF, l'&eacute;dition de liens sera effectu&eacute;e de mani&egrave;re dynamique m&ecirc;me avec l'option
<CODE>-g</CODE>. Dans ce cas, vous pouvez effectuer un strip sur l'ex&eacute;cutable.</P>

<H3><A NAME="index.64"></A> Programmes disponibles </H3>

<P> Beaucoup de gens utilisent <B>gdb</B>, que vous pouvez r&eacute;cup&eacute;rer 
sur le site 
<A HREF="ftp://prep.ai.mit.edu/pub/gnu">prep.ai.mit.edu</A>, 
sous une forme binaire sur 
<A HREF="ftp://tsx-11.mit.edu/pub/linux/packages/GCC">tsx-11</A> ou
sur sunsite.  <B>xxgdb</B> est une surcouche X de gdb (c.a.d. que vous
avez besoin de gdb pour utiliser xxgdb). Les sources peuvent &ecirc;tre r&eacute;cup&eacute;r&eacute;s
sur 
<A HREF="ftp://ftp.x.org/contrib/xxgdb-1.08.tar.gz">ftp://ftp.x.org/contrib/xxgdb-1.08.tar.gz</A></P>
<P>Il existe &eacute;galement le d&eacute;bogueur <B>UPS</B> qui a &eacute;t&eacute; port&eacute; par Rick Sladkey. 
Il fonctionne sous X &eacute;galement, mais &agrave; la diff&eacute;rence d'xxgdb, ce n'est
qu'une surcouche X pour un d&eacute;bogueur en mode en texte. Il poss&egrave;de 
certaines caract&eacute;ristiques tr&egrave;s int&eacute;ressantes et si vous utilisez beaucoup
ce genre d'outils, vous l'essayerez s&ucirc;rement. Les patches ainsi que 
des versions pr&eacute;compil&eacute;es pour Linux peuvent &ecirc;tre trouv&eacute;es sur 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/devel/debuggers/">ftp://sunsite.unc.edu/pub/Linux/devel/debuggers/</A>, et les sources
peuvent &ecirc;tre r&eacute;cup&eacute;r&eacute;s sur 
<A HREF="ftp://ftp.x.org/contrib/ups-2.45.2.tar.Z">ftp://ftp.x.org/contrib/ups-2.45.2.tar.Z</A>.</P>
<P>Un autre outil que vous pouvez trouver utile pour d&eacute;boguer est
« <B>strace</B> » , qui affiche les appels syst&egrave;mes que le processus
lance. Il poss&egrave;de d'autres caract&eacute;ristiques telles que donner les chemins
d'acc&egrave;s o&ugrave; ont &eacute;t&eacute; compil&eacute;s les binaires, donner les temps
pass&eacute;s dans chacun des appels syst&egrave;mes, et il vous permet &eacute;galement de
conna&icirc;tre les r&eacute;sultats des appels. La derni&egrave;re version de strace 
(actuellement la version 3.0.8) peut &ecirc;tre trouv&eacute;e sur 
<A HREF="ftp://ftp.std.com/pub/jrs/">ftp://ftp.std.com/pub/jrs/</A>.</P>

<H3>Programmes en t&acirc;che de fond (d&eacute;mon) </H3>

<P> Les d&eacute;mons lancent typiquement un <CODE>fork()</CODE> d&egrave;s leur lancement et
terminent donc le p&egrave;re. Cela fait une session de d&eacute;boguage tr&egrave;s courte.</P>

<P> La mani&egrave;re la plus simple de r&eacute;soudre ce probl&egrave;me est de poser
un point d'arr&ecirc;t sur <CODE>fork</CODE>, et
lorsque le programme s'arr&ecirc;te, forcer le retour &agrave; 0.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
(gdb) list 
1       #include &lt;stdio.h>
2
3       main()
4       {
5         if(fork()==0) printf("child\n");
6         else printf("parent\n");
7       }
(gdb) break fork
Breakpoint 1 at 0x80003b8
(gdb) run
Starting program: /home/dan/src/hello/./fork 
Breakpoint 1 at 0x400177c4

Breakpoint 1, 0x400177c4 in fork ()
(gdb) return 0
Make selected stack frame return now? (y or n) y
#0  0x80004a8 in main ()
    at fork.c:5
5         if(fork()==0) printf("child\n");
(gdb) next
Single stepping until exit from function fork, 
which has no line number information.
child
7       }
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Fichiers core</H3>

<P> Lorsque Linux se lance, il n'est g&eacute;n&eacute;ralement pas configur&eacute;
pour produire des fichiers core. Si vous les voulez vous devez utiliser
votre shell pour &ccedil;a en faisant sous csh (ou tcsh) :
<BLOCKQUOTE><CODE>
<PRE>
% limit core unlimited
</PRE>
</CODE></BLOCKQUOTE>

avec sh, bash, zsh, pdksh, utilisez
<BLOCKQUOTE><CODE>
<PRE>
$ ulimit -c unlimited
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>Si vous voulez pousser le vice &agrave; nommer votre fichier core (par exemple
si vous utilisez un d&eacute;bogueur bogu&eacute;... ce qui est un comble) 
vous pouvez simplement modifier
le noyau. Editez les fichiers <CODE>fs/binfmt_aout.c</CODE> et
<CODE>fs/binfmt_elf.c</CODE> (dans les nouveaux noyaux, vous devrez 
chercher ailleurs) :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        memcpy(corefile,"core.",5);
#if 0
        memcpy(corefile+5,current->comm,sizeof(current->comm));
#else
        corefile[4] = '\0';
#endif
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>et changez les <CODE>0</CODE> par des <CODE>1</CODE>.</P>

<H2><A NAME="ss5.3">5.3 Caract&eacute;ristiques du programme</A>
</H2>

<P>Il est possible d'examiner un peu le programme pour 
savoir quels sont les appels de fonctions qui sont effectu&eacute;s le 
plus souvent ou bien qui prennent du temps. C'est une bonne mani&egrave;re
d'optimiser le code en d&eacute;terminant l&agrave; o&ugrave; l'on passe le plus de temps.
Vous devez compiler tous les objets avec l'option <CODE>-p</CODE>, 
et pour mettre en forme la sortie &eacute;cran, vous aurez besoin du
programme <CODE>gprof</CODE> (situ&eacute; dans les <CODE>binutils</CODE>).  
Consultez les pages de manuel <CODE>gprof</CODE> pour plus de d&eacute;tails.</P>

<H2><A NAME="s6">6. Edition de liens</A></H2>

<P> Entre les deux formats de binaires incompatibles, 
biblioth&egrave;ques statiques et dynamiques, on peut comparer l'op&eacute;ration
d'&eacute;dition de lien en fait &agrave; un jeu ou l'on se demanderait qu'est-ce 
qui se passe lorsque je lance le programme ? Cette section n'est
pas vraiment simple...</P>

<P> Pour dissiper la confusion qui r&egrave;gne, nous allons nous baser sur
ce qui se passe lors d'ex&eacute;cution d'un programme, avec le chargement
dynamique. Vous verrez &eacute;galement la description de l'&eacute;dition
de liens dynamiques, mais plus tard. Cette section est
d&eacute;di&eacute;e &agrave; l'&eacute;dition de liens qui intervient &agrave; la fin de la compilation.</P>

<H2><A NAME="ss6.1">6.1 Biblioth&egrave;ques partag&eacute;es contre biblioth&egrave;ques statiques</A>
</H2>

<P> La derni&egrave;re phase de construction d'un programme est de r&eacute;aliser
l'&eacute;dition de liens, ce qui consiste &agrave; assembler tous les morceaux 
du programme et de chercher ceux qui sont manquants. Bien &eacute;videment,
beaucoup de programmes r&eacute;alisent les m&ecirc;mes op&eacute;rations comme 
ouvrir des fichiers par exemple, et ces pi&egrave;ces qui r&eacute;alisent ce genre
d'op&eacute;rations sont fournies sous la forme de biblioth&egrave;ques. Sous Linux,
ces biblioth&egrave;ques peuvent &ecirc;tre trouv&eacute;es dans les r&eacute;pertoires 
<CODE>/lib</CODE> et<CODE>/usr/lib/</CODE> entre autres.</P>
<P>
<A NAME="index.65"></A>  
<A NAME="index.66"></A>  </P>
<P>Lorsque vous utilisez une biblioth&egrave;que statique, l'&eacute;diteur de liens
cherche le code dont votre programme a besoin et en effectue
une copie dans le programme physique g&eacute;n&eacute;r&eacute;. Pour les biblioth&egrave;ques
partag&eacute;es, c'est le contraire : l'&eacute;diteur de liens laisse du code
qui lors du lancement du programme chargera automatiquement la 
biblioth&egrave;que. Il est &eacute;vident que ces biblioth&egrave;ques permettent
d'obtenir un ex&eacute;cutable plus petit; elles permettent &eacute;galement
d'utiliser moins de m&eacute;moire et moins de place disque. Linux
effectue par d&eacute;faut une &eacute;dition de liens dynamique s'il peut trouver
les biblioth&egrave;ques de ce type sinon, il effectue une &eacute;dition de liens
statique. Si vous obtenez des binaires statiques alors que vous les 
voulez dynamiques v&eacute;rifiez que les biblioth&egrave;ques existent 
(<CODE>*.sa</CODE> pour le format a.out, et <CODE>*.so</CODE> pour le format ELF) et 
que vous poss&eacute;dez les droits suffisants pour y acc&eacute;der (lecture).</P>
<P>Sous Linux, les biblioth&egrave;ques statiques ont pour nom <CODE>libnom.a</CODE>, 
alors que les biblioth&egrave;ques dynamiques sont appel&eacute;es 
<CODE>libnnom.so.x.y.z</CODE> o&ugrave; <CODE>x.y.z</CODE> repr&eacute;sente le num&eacute;ro de 
version. Les biblioth&egrave;ques dynamiques ont souvent des liens logiques qui
pointent dessus, et qui sont tr&egrave;s importants. Normalement, les biblioth&egrave;ques
standards sont livr&eacute;es sous la double forme dynamique
et statique.</P>
<P>Vous pouvez savoir de quelles biblioth&egrave;ques dynamiques un programme a besoin
en utilisant la commande <CODE>ldd</CODE> (<EM>List Dynamic Dependencies</EM>)
<BLOCKQUOTE><CODE>
<PRE>
$ ldd /usr/bin/lynx
        libncurses.so.1 => /usr/lib/libncurses.so.1.9.6
        libc.so.5 => /lib/libc.so.5.2.18
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Cela indique sur mon syst&egrave;me que l'outil <CODE>lynx</CODE> (outil WWW) 
a besoin des biblioth&egrave;ques dynamiques <CODE>libc.so.5</CODE> (la biblioth&egrave;que C)
et de <CODE>libncurses.so.1</CODE> (n&eacute;cessaire pour le contr&ocirc;le du terminal). 
Si un programme ne poss&egrave;de pas de d&eacute;pendances, <CODE>ldd</CODE> indiquera
`<EM>statically linked</EM>' (&eacute;dition de liens statique).</P>

<H2><A NAME="index.69"></A> <A NAME="index.68"></A> <A NAME="index.67"></A> <A NAME="ss6.2">6.2 A la recherche des fonctions... ou dans quelle biblioth&egrave;que se trouve la fonction <CODE>sin()</CODE> ?')</A>
   </H2>

<P> <CODE>nm </CODE><EM>nomdebiblioth&egrave;que</EM> vous donne tous les symboles r&eacute;f&eacute;renc&eacute;s dans
la biblioth&egrave;que. Cela fonctionne que cela soit du code statique ou dynamique.
Supposez que vous vouliez savoir o&ugrave; se trouve d&eacute;finie la fonction
<CODE>tcgetattr()</CODE> :
<BLOCKQUOTE><CODE>
<PRE>
$ nm libncurses.so.1 |grep tcget
         U tcgetattr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La lettre <CODE>U</CODE> vous indique que c'est ind&eacute;fini (<EM>Undefined</EM>)
--- cela indique que la biblioth&egrave;que ncurses l'utilise mais ne la d&eacute;finit pas.
Vous pouvez &eacute;galement faire :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ nm libc.so.5 | grep tcget
00010fe8 T __tcgetattr
00010fe8 W tcgetattr
00068718 T tcgetpgrp
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La lettre `<CODE>W</CODE>' indique que le symbole est d&eacute;fini mais de telle
mani&egrave;re qu'il peut &ecirc;tre surcharg&eacute; par une autre d&eacute;finition de la fonction
dans une autre biblioth&egrave;que (W pour <EM>weak</EM> : faible).
Une d&eacute;finition normale est marqu&eacute;e par la lettre `<CODE>T</CODE>' 
(comme pour <CODE>tcgetpgrp</CODE>).</P>
<P>
<A NAME="index.70"></A>  </P>
<P>La r&eacute;ponse &agrave; la question situ&eacute;e dans le titre est 
<CODE>libm.(so|a)</CODE>.  Toutes les fonctions d&eacute;finies dans le fichier
d'en-t&ecirc;te <CODE>&lt;math.h&gt;</CODE> sont impl&eacute;ment&eacute;es dans la
biblioth&egrave;que math&eacute;matique donc vous devrez effectuer l'&eacute;dition de liens
gr&acirc;ce &agrave; <CODE>-lm</CODE>.</P>


<H2><A NAME="ss6.3">6.3 Trouver les fichiers</A>
</H2>


<P>Supposons que vous ayez le message d'erreur suivant de la part
de l'&eacute;diteur de liens :</P>
<P><CODE>ld: Output file requires shared library `libfoo.so.1`</CODE></P>

<P> La strat&eacute;gie de recherche de fichiers de ld ou de ses copains
diff&egrave;re de la version utilis&eacute;e, mais vous pouvez &ecirc;tre s&ucirc;r 
que les fichiers situ&eacute;s dans le r&eacute;pertoire <CODE>/usr/lib</CODE> 
seront trouv&eacute;s. Si vous d&eacute;sirez que des fichiers situ&eacute;s &agrave; un endroit
diff&eacute;rent soient trouv&eacute;s, il est pr&eacute;f&eacute;rable d'ajouter l'option
<CODE>-L</CODE> &agrave; gcc ou ld.</P>

<P> Si cela ne vous aide pas clairement, v&eacute;rifiez que vous avez le bon
fichier &agrave; l'endroit sp&eacute;cifi&eacute;. Pour un syst&egrave;me a.out,
effectuer l'&eacute;dition de liens avec <CODE>-ltruc</CODE> implique que ld recherche
les biblioth&egrave;ques  <CODE>libtruc.sa</CODE> (biblioth&egrave;ques partag&eacute;es), et si elle
n'existe pas, il recherche <CODE>libtruc.a</CODE> (statique).  Pour le format
ELF, il cherche <CODE>libtruc.so</CODE> puis <CODE>libtruc.a</CODE>.  
<CODE>libtruc.so</CODE> est g&eacute;n&eacute;ralement un lien symbolique vers
<CODE>libtruc.so.x</CODE>.</P>

<H2><A NAME="ss6.4">6.4 Compiler votre propre biblioth&egrave;que</A>
</H2>

<H3>Num&eacute;ro de la version</H3>

<P> Comme tout programme, les biblioth&egrave;ques ont tendance &agrave; avoir quelques
bogues qui sont corrig&eacute;s au fur et &agrave; mesure. De nouvelles 
fonctionnalit&eacute;s sont ajout&eacute;es et qui peuvent changer l'effet
de celles qui existent ou bien certaines anciennes peuvent &ecirc;tres supprim&eacute;es.
Cela peut &ecirc;tre un probl&egrave;me pour les programmes qui les utilisent.</P>
<P>Donc, nous introduisons la notion de num&eacute;ro de version. Nous
r&eacute;pertorions les modifications effectu&eacute;es dans la biblioth&egrave;ques
comme &eacute;tant soit mineures soit majeures. Cela signifie qu'une 
modification mineure ne peut pas modifier le fonctionnement d'un
programme (en bref, il continue &agrave; fonctionner comme avant). Vous pouvez
identifier le num&eacute;ro de la version de la biblioth&egrave;que en regardant
son nom (en fait c'est un mensonge pour les biblioth&egrave;ques ELF... mais
continuez &agrave; faire comme si !) : <CODE>libtruc.so.1.2</CODE> a pour version
majeure 1 et mineure 2.  Le num&eacute;ro de version mineur peut &ecirc;tre
plus ou moins &eacute;lev&eacute; --- la biblioth&egrave;que C met un num&eacute;ro de patch,
ce qui produit un nom tel que <CODE>libc.so.5.2.18</CODE>, et c'est &eacute;galement
courant d'y trouver des lettres ou des blancs soulign&eacute;s ou tout
autre caract&egrave;re ASCII affichable.</P>
<P>Une des principales diff&eacute;rences entre les formats ELF et a.out
se trouve dans la mani&egrave;re de construire la biblioth&egrave;que partag&eacute;e.
Nous traiterons les biblioth&egrave;ques partag&eacute;es en premier car c'est plus
simple.</P>

<H3><A NAME="index.71"></A> ELF, qu'est-ce que c'est ? </H3>

<P> ELF (<EM>Executable and Linking Format</EM>) est format de binaire
initialement con&ccedil;u et d&eacute;velopp&eacute; par USL (<EM>UNIX System Laboratories</EM>)
et utilis&eacute; dans les syst&egrave;mes Solaris et System R4. En raison de sa
facilit&eacute; d'utilisation par rapport &agrave; l'ancien format dit a.out qu'utilisait
Linux, les d&eacute;veloppeurs de GCC et de la biblioth&egrave;que C ont d&eacute;cid&eacute; 
l'ann&eacute;e derni&egrave;re de basculer tout le syst&egrave;me sous le format ELF. ELF
est d&eacute;sormais le format binaire standard sous Linux.</P>

<H3>ELF, le retour !</H3>

<P> Ce paragraphe provient du groupe '/news-archives/comp.sys.sun.misc'.</P>
<P>
<BLOCKQUOTE>
ELF (<EM>Executable Linking Format</EM>) est le « nouveau et plus
performant » format de fichier introduit dans SVR4. ELF est beaucoup
plus puissant que le sacro-saint format COFF, dans le sens o&ugrave; il
est extensible. ELF voit un fichier objet comme une longue
liste de sections (plut&ocirc;t qu'un tableau de taille fixe 
d'&eacute;l&eacute;ments). Ces sections, &agrave; la diff&eacute;rence de COFF ne se trouvent
pas &agrave; un endroit constant et ne sont pas dans un ordre
particulier, etc. Les utilisateurs peuvent ajouter une nouvelle
section &agrave; ces fichiers objets s'il d&eacute;sirent y mettre de nouvelles
donn&eacute;es. ELS poss&egrave;de un format de d&eacute;bogage plus puissant
appel&eacute; DWARF (<EM>Debugging With Attribute Record Format</EM>) - 
par encore enti&egrave;rement g&eacute;r&eacute; par Linux (mais on y travaille !). 
Une liste cha&icirc;n&eacute;e de « DWARF DIEs » (ou <EM>Debugging Information 
Entries</EM> - NdT... le lecteur aura s&ucirc;rement not&eacute; le jeu de mot
assez noir : dwarf = nain; dies = morts) forment la section <EM>.debug</EM>
dans ELF. Au lieu d'avoir une liste de petits enregistrements  d'information
de taille fixes, les DWARF DIEs contiennent chacun une longue liste
complexe d'attributs et sont &eacute;crits sous la forme d'un arbre de donn&eacute;es.
Les DIEs peuvent contenir une plus grande quantit&eacute; d'information
que la section <EM>.debug</EM> du format COFF ne le pouvait (un peu comme
les graphes d'h&eacute;ritages du C++).
</BLOCKQUOTE>

<BLOCKQUOTE>
Les fichiers ELF sont accessibles gr&acirc;ce &agrave; la biblioth&egrave;que d'acc&egrave;s 
de SVR4 (Solaris 2.0 peut-&ecirc;tre ?), qui fournit une interface simple
et rapide aux parties les plus complexes d'ELF. Une des aubaines que
permet la biblioth&egrave;que d'acc&egrave;s ELF est que vous n'avez jamais besoin
de conna&icirc;tre les m&eacute;andres du format ELF. Pour acc&eacute;der &agrave; un fichier Unix,
on utilise un Elf *, retourn&eacute; par un appel &agrave; elf_open(). Ensuite,
vous effectuez des appels &agrave; elf_foobar() pour obtenir les diff&eacute;rents
composants au lieu d'avoir &agrave; triturer le fichier physique 
sur le disque (chose que beaucoup d'utilisateurs de COFF ont fait...).
</BLOCKQUOTE>
</P>
<P>Les arguments pour ou contre ELF, et les probl&egrave;mes li&eacute;s
&agrave; la mise &agrave; jour d'un syst&egrave;me a.out vers un syst&egrave;me ELF sont d&eacute;crits 
dans le ELF-HOWTO et je ne veux pas effectuer de copier coller ici
(NdT: ce HowTo est &eacute;galement traduit en fran&ccedil;ais).
Ce HowTo se trouve au m&ecirc;me endroit que les autres.</P>

<H3>Les biblioth&egrave;que partag&eacute;es ELF</H3>

<P> Pour construire <CODE>libtruc.so</CODE> comme une biblioth&egrave;que dynamique,
il suffit de suivre les &eacute;tapes suivantes :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gcc -fPIC -c *.c
$ gcc -shared -Wl,-soname,libtruc.so.1 -o libtruc.so.1.0 *.o
$ ln -s libtruc.so.1.0 libtruc.so.1
$ ln -s libtruc.so.1 libtruc.so
$ LD_LIBRARY_PATH=`pwd`:$LD_LIBRARY_PATH ; export LD_LIBRARY_PATH
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Cela va g&eacute;n&eacute;rer une biblioth&egrave;que partag&eacute;e appel&eacute;e <CODE>libtruc.so.1.0</CODE>, 
les liens appropri&eacute;s pour ld (<CODE>libtruc.so</CODE>) et 
le chargeur dynamique (<CODE>libtruc.so.1</CODE>) pour le trouver. 
Pour tester, nous ajoutons le r&eacute;pertoire actuel &agrave; la 
variable d'environnement <CODE>LD_LIBRARY_PATH</CODE>.</P>
<P>
<A NAME="index.72"></A>  </P>
<P>Lorsque vous &ecirc;tes satisfait et que la biblioth&egrave;que fonctionne, vous
n'avez plus qu'&agrave; la d&eacute;placer dans le r&eacute;pertoire par exemple, 
<CODE>/usr/local/lib</CODE>, et de recr&eacute;er les liens appropri&eacute;s. Le lien
de <CODE>libtruc.so.1</CODE> sur <CODE>libtruc.so.1.0</CODE> est enregistr&eacute; par 
<CODE>ldconfig</CODE>, qui sur bon nombre de syst&egrave;mes est lanc&eacute; lors 
du processus d'amor&ccedil;age. Le lien <CODE>libfoo.so</CODE> doit &ecirc;tre mis &agrave; jour
&agrave; la main. Si vous faites attention lors de la mise &agrave; jour de la
biblioth&egrave;que la chose la plus simple &agrave; r&eacute;aliser est de cr&eacute;er le lien
<CODE>libfoo.so -> libfoo.so.1</CODE>, pour que ldconfig conserve les liens
actuels. Si vous ne faites pas cela, vous aurez des probl&egrave;mes plus
tard. Ne me dites pas que l'on ne vous a pas pr&eacute;venu !</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ /bin/su
# cp libtruc.so.1.0 /usr/local/lib
# /sbin/ldconfig
# ( cd /usr/local/lib ; ln -s libtruc.so.1 libtruc.so )
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3><A NAME="index.74"></A> <A NAME="index.73"></A> Les num&eacute;ros de version, les noms et les liens  </H3>

<P> Chaque biblioth&egrave;que poss&egrave;de un nom propre (<EM>soname</EM>).  
Lorsque l'&eacute;diteur de liens en trouve un qui correspond &agrave; un nom
cherch&eacute;, il enregistre le nom de la biblioth&egrave;que dans le code binaire
au lieu d'y mettre le nom du fichier de la biblioth&egrave;que. Lors de
l'ex&eacute;cution, le chargeur dynamique va alors chercher un fichier ayant
pour nom le nom propre de la biblioth&egrave;que, et pas le nom du fichier
de la biblioth&egrave;que. Par exemple, une biblioth&egrave;que ayant pour nom
<CODE>libtruc.so</CODE> peut avoir comme nom propre <CODE>libbar.so</CODE>, et tous
les programmes li&eacute;s avec vont alors chercher <CODE>libbar.so</CODE> 
lors de leur ex&eacute;cution.</P>

<P>Cela semble &ecirc;tre une nuance un peu pointilleuse mais c'est la clef
de la compr&eacute;hension de la coexistence de plusieurs versions
diff&eacute;rentes de la m&ecirc;me biblioth&egrave;que sur le m&ecirc;me syst&egrave;me.
On a pour habitude sous Linux d'appeler une biblioth&egrave;que 
<CODE>libtruc.so.1.2</CODE> par exemple, et de lui donner comme
nom propre <CODE>libtruc.so.1</CODE>.  Si cette biblioth&egrave;que est rajout&eacute;e
dans un r&eacute;pertoire standard (par exemple dans <CODE>/usr/lib</CODE>), 
le programme <CODE>ldconfig</CODE> va cr&eacute;er un lien symbolique
entre <CODE>libtruc.so.1 -> libtruc.so.1.2</CODE> pour que l'image
appropri&eacute;e soit trouv&eacute;e lors de l'ex&eacute;cution. Vous aurez &eacute;galement besoin
d'un lien symbolique  <CODE>libtruc.so -> libtruc.so.1</CODE> pour que ld
trouve le nom propre lors de l'&eacute;dition de liens.</P>
<P> Donc, lorsque vous corrigez des erreurs dans la biblioth&egrave;que ou
bien lorsque vous ajoutez de nouvelles fonctions (en fait, pour
toute modification qui n'affecte pas l'ex&eacute;cution des programmes d&eacute;j&agrave;
existants), vous reconstruisez la biblioth&egrave;que, conservez le nom propre
tel qu'il &eacute;tait et changez le nom du fichier. Lorsque vous effectuez des 
modifications que peuvent modifier le d&eacute;roulement des programmes
existants, vous pouvez tout simplement incr&eacute;menter le nombre situ&eacute; 
dans le nom propre --- dans ce cas, appelez la nouvelle version de la
biblioth&egrave;que <CODE>libtruc.so.2.0</CODE>, et donnez-lui comme nom propre
<CODE>libtruc.so.2</CODE>.  Maintenant, faites pointer le lien de 
<CODE>libfoo.so</CODE> vers la nouvelle version et tout est bien dans
le meilleur des mondes !</P>
<P>Il est utile de remarquer que vous n'&ecirc;tes pas oblig&eacute; de nommer 
les biblioth&egrave;ques de cette mani&egrave;re, mais c'est une bonne convention.
Elf vous donne une certaine libert&eacute; pour nommer des biblioth&egrave;ques
tant et si bien que cela peut perturber certains utilisateurs, mais cela
ne veut pas dire que vous &ecirc;tes oblig&eacute; de le faire.</P>
<P>R&eacute;sum&eacute; : supposons que choisissiez d'adopter la m&eacute;thode traditionnelle
avec les mises &agrave; jour majeures qui peuvent ne pas &ecirc;tre compatibles
avec les versions pr&eacute;c&eacute;dentes et les mises &agrave; jour mineures qui ne posent
pas ce probl&egrave;me. Il suffit de cr&eacute;er la biblioth&egrave;que de cette mani&egrave;re :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
gcc -shared -Wl,-soname,libtruc.so.majeur -o libtruc.so.majeur.mineur
</PRE>
</CODE></BLOCKQUOTE>

et tout devrait &ecirc;tre parfait !</P>

<H3>a.out.  Le bon vieux format </H3>

<P> La facilit&eacute; de construire des biblioth&egrave;que partag&eacute;es est la 
raison principale de passer &agrave; ELF. Ceci dit, il est toujours possible
de cr&eacute;er des biblioth&egrave;ques dynamiques au format a.out. R&eacute;cup&eacute;rez 
le fichier archive 
<A HREF="ftp://tsx-11.mit.edu/pub/linux/packages/GCC/src/tools-2.17.tar.gz">ftp://tsx-11.mit.edu/pub/linux/packages/GCC/src/tools-2.17.tar.gz</A>
et lisez les 20 pages de documentation que vous trouverez dedans
apr&egrave;s l'avoir d&eacute;sarchiv&eacute;. Je n'aime pas avoir l'air d'&ecirc;tre aussi
partisan, mais il est clair que je n'ai jamais aim&eacute; ce format :-).</P>

<H3><A NAME="index.76"></A> <A NAME="index.75"></A> ZMAGIC contre QMAGIC  </H3>

<P> QMAGIC est le format des ex&eacute;cutables qui ressemble un peu aux vieux
binaires a.out (&eacute;galement connu comme ZMAGIC), mais qui laisse
la premi&egrave;re page libre. Cela permet plus facilement de r&eacute;cup&eacute;rer
les adresses non affect&eacute;es (comme NULL) dans l'intervalle
0-4096 (NdT : Linux utilise des pages de 4Ko).</P>
<P>Les &eacute;diteurs de liens d&eacute;suets ne g&egrave;rent que le format ZMAGIC, ceux
un peu moins rustiques g&egrave;rent les deux, et les plus r&eacute;cents uniquement
le QMAGIC. Cela importe peu car le noyau g&egrave;re les deux types.</P>
<P>La commande <CODE>file</CODE> est capable d'identifier si un programme est
de type QMAGIC.</P>

<H3>Gestion des fichiers</H3>

<P>Une biblioth&egrave;que dynamique a.out (DLL) est compos&eacute;e de 
deux fichiers et d'un lien symbolique. Supposons que l'on
utilise la biblioth&egrave;que <EM>truc</EM>, les fichiers seraient
les suivants : <CODE>libtruc.sa</CODE> et <CODE>libtruc.so.1.2</CODE>; et le 
lien symbolique aurait pour nom <CODE>libtruc.so.1</CODE> et pointerait
sur le dernier des fichiers. Mais &agrave; quoi servent-ils ?</P>
<P>Lors de la compilation, <CODE>ld</CODE> cherche <CODE>libtruc.sa</CODE>.  
C'est le fichier de description de la biblioth&egrave;que : il contient
toutes les donn&eacute;es export&eacute;es et les pointeurs vers les fonctions
n&eacute;cessaires pour l'&eacute;dition de liens.</P>
<P>Lors de l'ex&eacute;cution, le chargeur dynamique cherche <CODE>libtruc.so.1</CODE>.
C'est un lien symbolique plut&ocirc;t qu'un r&eacute;el fichier pour que les
biblioth&egrave;ques puissent &ecirc;tre mise &agrave; jour sans avoir &agrave; casser les
applications qui utilisent la biblioth&egrave;que. Apr&egrave;s la mise &agrave; jour, 
disons que l'on est pass&eacute; &agrave; la version <CODE>libfoo.so.1.3</CODE>,
le lancement de ldconfig va positionner le lien. Comme 
cette op&eacute;ration est atomique, aucune application fonctionnant 
n'aura de probl&egrave;me.</P>
<P>Les biblioth&egrave;ques DLL (Je sais que c'est une tautologie... mais pardon !) 
semblent &ecirc;tre tr&egrave;s souvent plus importantes que leur &eacute;quivalent
statique. En fait, c'est qu'elles r&eacute;servent de la place pour les
extensions ult&eacute;rieures sous la simple forme de trous qui sont
fait de telle mani&egrave;re qu'ils n'occupent pas de place disque (NdT : 
un peu comme les fichiers <CODE>core</CODE>). Toutefois, un
simple appel &agrave; <CODE>cp</CODE> ou &agrave; <CODE>makehole</CODE> les remplira...
Vous pouvez effectuer une op&eacute;ration de <CODE>strip</CODE> apr&egrave;s la construction
de la biblioth&egrave;que, comme les adresses sont &agrave; des endroits fixes.
<B>Ne faites pas la m&ecirc;me op&eacute;ration avec les biblioth&egrave;ques ELF !</B></P>

<H3>« libc-lite » ?</H3>

<P> Une « libc-lite » (contraction de <EM>libc</EM> et <EM>little</EM>)
est une version &eacute;pur&eacute;e et r&eacute;duite de la biblioth&egrave;que 
libc construite de telle mani&egrave;re qu'elle puisse tenir sur 
une disquette avec un certain nombre d'outil Unix.
Elle n'inclut pas curses, dbm, termcap, ... 
Si votre <CODE>/lib/libc.so.4</CODE> est li&eacute;e avec une biblioth&egrave;que de ce genre
il est tr&egrave;s fortement conseill&eacute; de la remplacer avec une version compl&egrave;te.</P>

<H3>Edition de liens : probl&egrave;me courants </H3>

<P> Envoyez-les moi ! </P>
<P>
<DL>

<DT><B> Des programmes statiques lorsque vous les voulez
partag&eacute;s</B><DD><P>
<A NAME="index.77"></A>  
<A NAME="index.78"></A>  </P>
<P>V&eacute;rifiez que vous avez les bons liens pour que <CODE>ld</CODE> puisse
trouver les biblioth&egrave;ques partag&eacute;es. Pour ELF cela veut dire que
<CODE>libtruc.so</CODE> est un lien symbolique sur son image,
pour a.out un fichier <CODE>libtruc.sa</CODE>.  Beaucoup de personnes
ont eu ce probl&egrave;me apr&egrave;s &ecirc;tre pass&eacute;s des outils ELF 2.5 &agrave; 2.6 
(<CODE>binutils</CODE>) --- la derni&egrave;re version effectue une recherche
plus intelligente pour les biblioth&egrave;ques dynamiques et donc ils 
n'avaient pas cr&eacute;&eacute; tous les liens symboliques n&eacute;cessaires.
Cette caract&eacute;ristique avait &eacute;t&eacute; supprim&eacute;e pour des raisons de compatibilit&eacute;
avec d'autres architectures et parce qu'assez souvent cela ne marchait
pas bien. En bref, cela posait plus de probl&egrave;mes qu'autre chose.</P>

<DT><B> Le programme `mkimage' n'arrive pas &agrave; trouver libgcc</B><DD><P>
<A NAME="index.79"></A>  </P>
<P>Comme <CODE>libc.so.4.5.x</CODE> et suivantes, libgcc n'est pas une 
biblioth&egrave;que partag&eacute;e. Vous devez remplacer les `<CODE>-lgcc</CODE>' 
sur la ligne de commande par 
<CODE>`gcc -print-libgcc-file-name`</CODE> (entre quotes)</P>
<P>Egalement, d&eacute;truisez tous les fichiers situ&eacute;s dans <CODE>/usr/lib/libgcc*</CODE>.
C'est important.</P>

<DT><B> Le message <CODE>__NEEDS_SHRLIB_libc_4 multiply defined</CODE></B><DD><P>Sont une cons&eacute;quence du m&ecirc;me probl&egrave;me.</P>

<DT><B> Le message ``Assertion failure'' appara&icirc;t lorsque vous reconstruisez une
DLL</B><DD><P>Ce message &eacute;nigmatique signifie qu'un &eacute;l&eacute;ment de votre table <EM>jump</EM>
a d&eacute;pass&eacute; la table car trop peu de place &eacute;tait r&eacute;serv&eacute;e dans le fichier 
<CODE>jump.vars</CODE> file.  Vous pouvez trouver le(s) coupable(s) en lan&ccedil;ant 
la commande <CODE>getsize</CODE> fournie dans le paquetage tools-2.17.tar.gz. 
La seule solution est de passer &agrave; une nouvelle version majeure,
m&ecirc;me si elle sera incompatible avec les pr&eacute;c&eacute;dentes.</P>

<DT><B> <CODE>ld: output file needs shared library libc.so.4</CODE> </B><DD><P>Cela arrive lorsque vous effectuez l'&eacute;dition de liens avec des biblioth&egrave;ques
diff&eacute;rentes de la libc (comme les biblioth&egrave;ques X) et que vous utilisez
l'option <CODE>-g</CODE> sans utiliser l'option <CODE>-static</CODE>.</P>
<P>Les fichiers <CODE>.sa</CODE> pour les biblioth&egrave;ques dynamiques ont un symbole
non r&eacute;solu <CODE>_NEEDS_SHRLIB_libc_4</CODE> qui est d&eacute;fini dans 
<CODE>libc.sa</CODE>.  Or, lorsque vous utilisez <CODE>-g</CODE> vous faites l'&eacute;dition
de liens avec <CODE>libg.a</CODE> ou <CODE>libc.a</CODE> et donc ce symbole n'est jamais 
d&eacute;fini.</P>
<P>Donc, pour r&eacute;soudre le probl&egrave;me, ajoutez l'option <CODE>-static</CODE> 
lorsque vous compilez avec l'option <CODE>-g</CODE>, ou n'utilisez pas
<CODE>-g</CODE> lors de l'&eacute;dition de liens !</P>
</DL>
</P>


<H2><A NAME="s7">7. Chargement dynamique</A></H2>

<P> <EM>Ce paragraphe est en fait un peu court : il sera
&eacute;tendu dans une version ult&eacute;rieure d&egrave;s que j'aurai r&eacute;cup&eacute;r&eacute; le 
HowTo ELF</EM></P>

<H2><A NAME="ss7.1">7.1 Concepts</A>
</H2>

<P> Linux poss&egrave;de des biblioth&egrave;ques dynamiques, comme on vous le 
r&eacute;p&egrave;te depuis le d&eacute;but de ce document ! Or, il existe un syst&egrave;me
pour reporter le travail d'association des noms des symboles et de
leur adresse dans la biblioth&egrave;que, qui est normalement effectu&eacute; lors de 
l'&eacute;dition de liens en l'effectuant lors du chargement du programme.</P>

<H2><A NAME="ss7.2">7.2 Messages d'erreur</A>
</H2>

<P> Envoyez moi vos erreurs !  Je n'en fait pas grand chose sauf les ins&eacute;rer 
dans ce paragraphe...</P>
<P>
<DL>

<DT><B> <CODE>can't load library: /lib/libxxx.so, Incompatible version</CODE></B><DD><P>(seulement a.out) Cela signifie que vous n'avez pas la version correcte
de la biblioth&egrave;que (num&eacute;ro dit majeur). Non, il n'est pas possible
d'effectuer un lien symbolique sur la biblioth&egrave;que que vous poss&eacute;dez : si 
vous avez de la chance, vous obtiendrez un <EM>segmentation fault</EM>.  
R&eacute;cup&eacute;rez la nouvelle version.  Un message un peu &eacute;quivalent existe
&eacute;galement sur les syst&egrave;mes ELF :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ftp: can't load library 'libreadline.so.2'
</PRE>
</CODE></BLOCKQUOTE>
</P>


<DT><B><CODE>warning using incompatible library version xxx</CODE></B><DD><P>(seulement a.out) Vous avez un num&eacute;ro de version de biblioth&egrave;que (mineur)
inf&eacute;rieur &agrave; la version avec laquelle a &eacute;t&eacute; compil&eacute; le programme.
Le programme fonctionnera s&ucirc;rement. Une mise &agrave; jour est toutefois
conseill&eacute;e.</P>

</DL>
</P>

<H2><A NAME="index.81"></A> <A NAME="index.80"></A> <A NAME="ss7.3">7.3 Contr&ocirc;ler l'op&eacute;ration de chargement dynamique</A>
  </H2>

<P> Il existe certaines variables d'environnements que le chargeur dynamique
utilise. Beaucoup sont exploit&eacute;es par le programme <CODE>ldd</CODE> lorsqu'il
s'agit de particularit&eacute;s de l'environnement de l'utilisateur, ce qui
peuvent &ecirc;tre positionn&eacute;es pour lancer ldd avec des options
particuli&egrave;res. Voici une description des diff&eacute;rentes variables d'environnement
que vous pouvez rencontrer :</P>
<P>
<UL>
<LI> <CODE>LD_BIND_NOW</CODE> --- normalement, les fonctions ne sont 
pas cherch&eacute;es dans les biblioth&egrave;ques avant leur appel. En positionnant 
cette option, vous v&eacute;rifiez que toutes les fonctions employ&eacute;es dans
votre programmes se trouvent bien dans la biblioth&egrave;que lors de son 
chargement, ce qui ralentit le lancement du programme. C'est utile lorsque
vous voulez tester que l'&eacute;dition de liens s'est parfaitement d&eacute;roul&eacute;e
et que tous les symboles sont bien associ&eacute;s.
</LI>
<LI> <CODE>LD_PRELOAD</CODE> peut &ecirc;tre d&eacute;fini avec un nom de fichier
qui contient des fonctions surchargeant des fonctions d&eacute;j&agrave; existantes.
Par exemple, si vous testez une strat&eacute;gie d'allocation m&eacute;moire,
et que vous voulez remplacer le malloc de la biblioth&egrave;que C par le 
v&ocirc;tre situ&eacute; dans un module ayant pour nom <CODE>malloc.o</CODE>, il vous suffit
de faire :
<BLOCKQUOTE><CODE>
<PRE>
$ export LD_PRELOAD=malloc.o
$ test_mon_malloc
</PRE>
</CODE></BLOCKQUOTE>


<CODE>LD_ELF_PRELOAD</CODE> et <CODE>LD_AOUT_PRELOAD</CODE> sont similaires, mais 
leur utilisation est sp&eacute;cifique au type de binaire utilis&eacute;. Si
<CODE>LD_</CODE><EM>TypeBinaire</EM><CODE>_PRELOAD</CODE> et <CODE>LD_PRELOAD</CODE> sont positionn&eacute;s,
celui correspondant le mieux &agrave; la machine est utilis&eacute;.
</LI>
<LI> <CODE>LD_LIBRARY_PATH</CODE> contient une liste de r&eacute;pertoires contenant
les biblioth&egrave;ques dynamiques. Cela n'affecte pas l'&eacute;dition de liens :
cela n'a qu'un effet lors de l'ex&eacute;cution. Il faut noter qu'elle est
d&eacute;sactiv&eacute;e pour des programmes qui s'ex&eacute;cutent avec un setuid ou un setgid.  
Enfin, <CODE>LD_ELF_LIBRARY_PATH</CODE> et 
<CODE>LD_AOUT_LIBRARY_PATH</CODE> peuvent &ecirc;tre utilis&eacute;s pour orienter le mode de
compilation du binaire.  <CODE>LD_LIBRARY_PATH</CODE>
ne devrait pas &ecirc;tre n&eacute;cessaire en principe : ajoutez les r&eacute;pertoires dans le
fichier <CODE>/etc/ld.so.conf/</CODE> et relancez ldconfig.
</LI>
<LI> <CODE>LD_NOWARN</CODE> s'applique au format a.out uniquement.  Lorsqu'elle
est positionn&eacute;e (c.a.d si elle existe par exemple avec
<CODE>LD_NOWARN=true; export LD_NOWARN</CODE>) cela arr&ecirc;te le chargeur du programme
m&ecirc;me sur des avertissements insignifiants (tels que des messages 
d'incompatibilit&eacute;s de num&eacute;ros mineurs de version).
</LI>
<LI> <CODE>LD_WARN</CODE> s'applique &agrave; ELF uniquement.  Lorsqu'elle est 
positionn&eacute;e, on transforme le message habituellement fatal <EM>Can't find 
library</EM> en un avertissement. Ce n'est pas positionn&eacute; par d&eacute;faut mais
c'est important pour un programme comme ldd.
</LI>
<LI> <CODE>LD_TRACE_LOADED_OBJECTS</CODE> s'applique &agrave; ELF uniquement, et
permet de simuler l'ex&eacute;cution des programmes comme s'ils l'&eacute;taient 
par <CODE>ldd</CODE> :

<BLOCKQUOTE><CODE>
<PRE>
$ LD_TRACE_LOADED_OBJECTS=true /usr/bin/lynx
        libncurses.so.1 => /usr/lib/libncurses.so.1.9.6
        libc.so.5 => /lib/libc.so.5.2.18
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>

<H2><A NAME="index.83"></A> <A NAME="index.82"></A> <A NAME="ss7.4">7.4 Ecrire des programmes en utilisant le chargement dynamique</A>
  </H2>

<P> Cela ressemble &eacute;norm&eacute;ment au syst&egrave;me de chargement dynamique
utilis&eacute; sous Solaris 2.x. Ce syst&egrave;me est d&eacute;crit d'une 
mani&egrave;re pr&eacute;cise dans le document expliquant la programmation 
avec ELF &eacute;crit par H J Lu et dans la page de manuel
<CODE>dlopen(3)</CODE>, qui se trouve dans le paquetage ld.so. 
Voici un exemple simple : pensez &agrave; faire l'&eacute;dition de liens avec 
<CODE>-ldl</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#include &lt;dlfcn.h>
#include &lt;stdio.h>

main()
{
  void *libc;
  void (*printf_call)();

  if(libc=dlopen("/lib/libc.so.5",RTLD_LAZY))
  {
    printf_call = dlsym(libc,"printf");
    (*printf_call)("Bonjour ! Ha ben ca marche pil poil sous Linux !\n");
  }

}
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="s8">8. Contacter les d&eacute;veloppeurs</A></H2>

<H2><A NAME="index.84"></A> <A NAME="ss8.1">8.1 Annoncer des bogues</A>
 </H2>

<P> Commencez par mettre en doute le probl&egrave;me. Est-ce sp&eacute;cifique &agrave; 
Linux ou bien cela arrive avec gcc mais sur d'autres plates-formes ?
Est-ce sp&eacute;cifique &agrave; la version du noyau ? A la version de la biblioth&egrave;que C ?
Est-ce que ce probl&egrave;me dispara&icirc;t lorsque vous effectuez une &eacute;dition de liens
statique ? Pouvez-vous produire un code tr&egrave;s court mettant en &eacute;vidence
le probl&egrave;me ?</P>
<P>Apr&egrave;s avoir r&eacute;pondu apr&egrave;s ces quelques questions, vous saurez
quel programme est &agrave; l'origine du probl&egrave;me. Pour un probl&egrave;me direct avec
GCC, le mieux est de consulter le fichier d'information livr&eacute; avec : la
proc&eacute;dure pour rapporter un bogue y est d&eacute;taill&eacute;. Pour un probl&egrave;me avec
ld.so, la biblioth&egrave;que C ou math&eacute;matique, envoyez un courrier &eacute;lectronique
&agrave; <CODE>linux-gcc@vger.rutgers.edu</CODE>.  Si possible, donnez un court
exemple mettant en &eacute;vidence le probl&egrave;me ainsi qu'une courte description
indiquant ce que le programme aurait normalement d&ucirc; faire, et ce qu'il fait
en r&eacute;alit&eacute;.</P>

<H2><A NAME="ss8.2">8.2 Participer au d&eacute;veloppement</A>
</H2>

<P> Si vous d&eacute;sirez participer au d&eacute;veloppement de GCC ou de la 
biblioth&egrave;que C, la premi&egrave;re chose &agrave; faire est de rejoindre
la liste de diffusion <CODE>linux-gcc@vger.rutgers.edu</CODE>.  Si vous d&eacute;sirez
uniquement savoir de quoi &ccedil;a parle, il existe des archives &agrave;
l'adresse 
<A HREF="http://homer.ncm.com/linux-gcc/">http://homer.ncm.com/linux-gcc/</A>.  Tout d&eacute;pend de ce que vous
d&eacute;sirez faire ou apporter &agrave; ce projet !</P>

<H2><A NAME="s9">9. Divers</A></H2>

<H2><A NAME="ss9.1">9.1 Ce document</A>
</H2>

<P> Ce HowTo est bas&eacute; sur la FAQ de Mitchum DSouza's. Bon nombre
des informations en proviennent. D'une mani&egrave;re g&eacute;n&eacute;rale, 
il est fr&eacute;quent de dire une phrase du genre « je n'ai pas tout test&eacute; et 
donc ne me bl&acirc;mez pas si vous cassez votre disque, votre syst&egrave;me
ou si vous rompez avec votre &eacute;pouse ».</P>
<P>Le nom des contributeurs &agrave; ce document sont donn&eacute;s par ordre alphab&eacute;tique :
Andrew Tefft,
Axel Boldt,
Bill Metzenthen,
Bruce Evans,
Bruno Haible,
Daniel Barlow,
Daniel Quinlan,
David Engel,
Dirk Hohndel,
Eric Youngdale,
Fergus Henderson,
H.J. Lu,
Jens Schweikhardt,
Kai Petzke,
Michael Meissner,
Mitchum DSouza,
Olaf Flebbe,
Paul Gortmaker,
Rik Faith,
Steven S. Dick,
Tuomas J Lukka,
et bien s&ucirc;r Linus Torvalds, sans qui ce genre d'exercice aurait &eacute;t&eacute; 
difficile, voir impossible :-)</P>
<P>Ne soyez pas offens&eacute; si votre nom n'appara&icirc;t pas dans la liste et que 
vous ayez contribu&eacute; &agrave; ce document (sous la forme d'un HowTo ou d'une FAQ).
Envoyez-moi un courrier &eacute;lectronique et j'effectuerai la correction.</P>

<H2><A NAME="ss9.2">9.2 Traduction</A>
</H2>

<P> A l'heure ou j'&eacute;cris ces lignes, je ne connais pas de traduction
de ce document. Si vous en r&eacute;alisez une, s'il vous pla&icirc;t dites-le moi.
Je suis disponible pour toute aide concernant l'explication du texte,
je serai tr&egrave;s content d'y r&eacute;pondre.</P>
<P>Note du traducteur : <B>Cocorico !</B> La version fran&ccedil;aise est
la premi&egrave;re traduction de ce document. </P>

<H2><A NAME="ss9.3">9.3 Contacts</A>
</H2>


<P>Tout contact est le bienvenu. Envoyez-moi un courrier &eacute;lectronique
&agrave; l'adresse suivante : 
<A HREF="mailto:dan@detached.demon.co.uk">dan@detached.demon.co.uk</A>.  Ma clef publique PGP (ID 5F263625) est
disponible sur mes 
<A HREF="http://ftp.linux.org.uk/~barlow/">pages WWW</A>, Si vous souhaitez rendre confidentiel certains messages.</P>

<H2><A NAME="ss9.4">9.4 Copyright</A>
</H2>

<P> Toutes les remarques appartiennent &agrave; leurs auteurs respectifs.</P>
<P>Ce document est copyright&eacute; (C) 1996 Daniel Barlow 
<CODE>&lt;dan@detached.demon.co.uk&gt;</CODE>. Il peut &ecirc;tre reproduit et 
distribu&eacute; en partie ou enti&egrave;rement, sur tout support physique ou &eacute;lectronique,
du moment o&ugrave; ce copyright se trouve sur toute les copies. La redistribution
commerciale est autoris&eacute;e et encourag&eacute;e. Toutefois l'auteur de ce document
doit &ecirc;tre mis au courant de ce genre de distributions.</P>
<P>Toute traduction, adaptation, ou bien tout travail incorporant tout
document HowTo Linux doit poss&eacute;der ce copyright. De cette mani&egrave;re, vous
ne pouvez pas imposer de restriction &agrave; la distribution de ce document.
Des exceptions peuvent &ecirc;tre &eacute;ventuellement accord&eacute;es sous certaines
conditions : contactez le coordinateur des HowTo's Linux &agrave; l'adresse 
donn&eacute;e ci-dessous.</P>
<P>En r&eacute;sum&eacute;, nous souhaitons voir diffuser l'information de la mani&egrave;re
la plus large qui soit. Toutefois, nous souhaitons garder la 
ma&icirc;trise de ces documents et nous aimerions &ecirc;tre consult&eacute;s avant toute
diffusion des HowTo's.</P>
<P>Si vous avez des questions, vous pouvez contacter Greg Hankins, le
coordinateur des HowTo Linux HOWTO &agrave; l'adresse &eacute;lectronique suivante :
<CODE>gregh@sunsite.unc.edu</CODE> </P>

<H2><A NAME="s10">10. Index</A></H2>

<P>Les entr&eacute;es de cet index sont tri&eacute;es dans l'ordre alphab&eacute;tique.</P>
<P>
<UL>
<LI> <CODE>-fwritable-strings</CODE> 
<A HREF="#index.39">39</A>, 
<A HREF="#index.56">56</A> </LI>
<LI> /lib/cpp 
<A HREF="#index.16">16</A> </LI>
<LI> a.out 
<A HREF="#index.1">1</A> </LI>
<LI> <CODE>ar</CODE> 
<A HREF="#index.10">10</A> </LI>
<LI> <CODE>as</CODE> 
<A HREF="#index.8">8</A> </LI>
<LI> &lt;asm/*.h&gt; 
<A HREF="#index.19">19</A> </LI>
<LI> <CODE>atoi()</CODE> 
<A HREF="#index.40">40</A> </LI>
<LI> <CODE>atol()</CODE> 
<A HREF="#index.41">41</A> </LI>
<LI> ex&eacute;cutables trop gros 
<A HREF="#index.63">63</A>, 
<A HREF="#index.65">65</A>, 
<A HREF="#index.77">77</A> </LI>
<LI> chewing gum 
<A HREF="#index.3">3</A> </LI>
<LI> <CODE>cos()</CODE> 
<A HREF="#index.68">68</A> </LI>
<LI> deboguer 
<A HREF="#index.59">59</A> </LI>
<LI> divers 
<A HREF="#index.72">72</A> </LI>
<LI> <CODE>dlopen()</CODE> 
<A HREF="#index.82">82</A> </LI>
<LI> <CODE>dlsym()</CODE> 
<A HREF="#index.83">83</A> </LI>
<LI> documentation 
<A HREF="#index.4">4</A> </LI>
<LI> EINTR 
<A HREF="#index.52">52</A> </LI>
<LI> elf 
<A HREF="#index.0">0</A>, 
<A HREF="#index.71">71</A> </LI>
<LI> <CODE>execl()</CODE> 
<A HREF="#index.57">57</A> </LI>
<LI> <CODE>fcntl</CODE> 
<A HREF="#index.47">47</A> </LI>
<LI> <CODE>FD_CLR</CODE> 
<A HREF="#index.44">44</A> </LI>
<LI> <CODE>FD_ISSET</CODE> 
<A HREF="#index.45">45</A> </LI>
<LI> <CODE>FD_SET</CODE> 
<A HREF="#index.43">43</A> </LI>
<LI> <CODE>FD_ZERO</CODE> 
<A HREF="#index.46">46</A> </LI>
<LI> <CODE>fichier</CODE> 
<A HREF="#index.2">2</A> </LI>
<LI> &lt;float.h&gt; 
<A HREF="#index.20">20</A> </LI>
<LI> gcc 
<A HREF="#index.6">6</A> </LI>
<LI> <CODE>gcc -fomit-frame-pointer</CODE> 
<A HREF="#index.61">61</A> </LI>
<LI> <CODE>gcc -g</CODE> 
<A HREF="#index.60">60</A> </LI>
<LI> gcc -v 
<A HREF="#index.14">14</A> </LI>
<LI> gcc, bogues 
<A HREF="#index.15">15</A>, 
<A HREF="#index.28">28</A>, 
<A HREF="#index.29">29</A>, 
<A HREF="#index.84">84</A> </LI>
<LI> gcc, options de compilation 
<A HREF="#index.13">13</A>, 
<A HREF="#index.25">25</A>, 
<A HREF="#index.26">26</A> </LI>
<LI> gdb 
<A HREF="#index.64">64</A> </LI>
<LI> fichiers d'en-t&ecirc;te 
<A HREF="#index.17">17</A> </LI>
<LI> appels syst&egrave;mes interrompus 
<A HREF="#index.51">51</A> </LI>
<LI> <CODE>ld</CODE> 
<A HREF="#index.9">9</A> </LI>
<LI> <CODE>LD_*</CODE> : variables d'environnement 
<A HREF="#index.80">80</A> </LI>
<LI> ldd 
<A HREF="#index.81">81</A> </LI>
<LI> libc 
<A HREF="#index.7">7</A> </LI>
<LI> <CODE>libg.a</CODE> 
<A HREF="#index.62">62</A> </LI>
<LI> libgcc 
<A HREF="#index.79">79</A> </LI>
<LI> &lt;limits.h&gt; 
<A HREF="#index.21">21</A> </LI>
<LI> lint 
<A HREF="#index.58">58</A> </LI>
<LI> &lt;linux/*.h&gt; 
<A HREF="#index.18">18</A> </LI>
<LI> <CODE>&lt;math.h&gt;</CODE> 
<A HREF="#index.70">70</A> </LI>
<LI> maths 
<A HREF="#index.69">69</A> </LI>
<LI> <CODE>mktemp()</CODE> 
<A HREF="#index.55">55</A> </LI>
<LI> num&eacute;ro de version 
<A HREF="#index.12">12</A>, 
<A HREF="#index.74">74</A> </LI>
<LI> optimisation 
<A HREF="#index.27">27</A> </LI>
<LI> pages de manuel 
<A HREF="#index.5">5</A> </LI>
<LI> QMAGIC 
<A HREF="#index.76">76</A> </LI>
<LI> segmentation fault 
<A HREF="#index.30">30</A>, 
<A HREF="#index.54">54</A> </LI>
<LI> segmentation fault, in GCC 
<A HREF="#index.33">33</A> </LI>
<LI> select() 
<A HREF="#index.50">50</A> </LI>
<LI> <CODE>SIGBUS</CODE> 
<A HREF="#index.34">34</A> </LI>
<LI> <CODE>SIGEMT</CODE> 
<A HREF="#index.35">35</A> </LI>
<LI> <CODE>SIGIOT</CODE> 
<A HREF="#index.36">36</A> </LI>
<LI> SIGSEGV 
<A HREF="#index.31">31</A>, 
<A HREF="#index.53">53</A> </LI>
<LI> SIGSEGV, in gcc 
<A HREF="#index.32">32</A> </LI>
<LI> <CODE>SIGSYS</CODE> 
<A HREF="#index.38">38</A> </LI>
<LI> <CODE>SIGTRAP</CODE> 
<A HREF="#index.37">37</A> </LI>
<LI> <CODE>sin()</CODE> 
<A HREF="#index.67">67</A> </LI>
<LI> soname 
<A HREF="#index.73">73</A> </LI>
<LI> <CODE>sprintf()</CODE> 
<A HREF="#index.42">42</A> </LI>
<LI> binaires link&eacute;s statiquement 
<A HREF="#index.66">66</A>, 
<A HREF="#index.78">78</A> </LI>
<LI> &lt;stdarg.h&gt; 
<A HREF="#index.23">23</A> </LI>
<LI> &lt;stddef.h&gt; 
<A HREF="#index.24">24</A> </LI>
<LI> <CODE>strings</CODE> 
<A HREF="#index.11">11</A> </LI>
<LI> <CODE>&lt;sys/time.h&gt;</CODE> 
<A HREF="#index.48">48</A> </LI>
<LI> <CODE>&lt;unistd.h&gt;</CODE> 
<A HREF="#index.49">49</A> </LI>
<LI> &lt;varargs.h&gt; 
<A HREF="#index.22">22</A> </LI>
<LI> ZMAGIC 
<A HREF="#index.75">75</A> </LI>
</UL>
</P>

</BODY>
</HTML>
