<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Mini Howto Mail vers News</TITLE>
</HEAD>
<BODY>
<H1>Mini Howto Mail vers News</H1>

<H2>Robert Hart, InterWeft IT Consultants Melbourne, Australie,
<CODE>iweft@ipax.com.au</CODE><BR>
Traduit par Olivier Tharan, <CODE>tharan@int-evry.fr</CODE></H2>v1.0, 4 novembre 1996
<HR>
<EM>Ce document d&eacute;crit comment configurer votre logiciel de News et
mail2news.pl pour relier des listes de distribution aux groupes de news
locaux. </EM>
<HR>
<H2><A NAME="s1">1. Copyright et autres choses</A></H2>


<P>Le copyright de ce document est retenu par l'auteur. Il donne la
permission de distribuer ce document par des moyens &eacute;lectroniques et sur
des CDs, &agrave; condition qu'il soit gard&eacute; enti&egrave;rement dans son format
d'origine. Il donne aussi la permission d'imprimer une copie de ce
document pour usage personnel.</P>
<P>La publication de ce document en partie ou en entier sans la permission du
propri&eacute;taire du copyright de toute mani&egrave;re autre qu'indiqu&eacute;e ci-dessus
est interdite.</P>
<P>Ce document est directement support&eacute; par InterWeft IT Consultants
(Melbourne, Australie).</P>
<P>La derni&egrave;re version de ce document est disponible sur le site WWW
d'InterWeft chez InterWeft IT Consultants, 
<A HREF="http://203.29.72.65/">http://203.29.72.65/</A>.</P>

<H2><A NAME="s2">2. Introduction</A></H2>


<P>La plupart des sites sur Internet sont toujours en train de chercher des
moyens d'am&eacute;liorer l'utilisation de la bande passante limit&eacute;e dont ils
disposent sur leur lien &agrave; Internet.</P>
<P>Supposons que plus d'un utilisateur s'abonne &agrave; la m&ecirc;me liste de
distribution, et il y aura duplication de trafic. S'il y a un certain
nombre de telles duplications, ou si le trafic sur les listes est
important, la consommation de bande passante s'accro&icirc;t.</P>
<P>En abonnant le site &agrave; une liste (si c'est permis par le propri&eacute;taire de la
liste), et en <EM>routant</EM> le courrier &eacute;lectronique vers le serveur de
news local, il est possible de rendre les listes de distribution
accessibles &agrave; tous les utilisateurs du site ou, en utilisant les principes
de s&eacute;curit&eacute; d'<CODE>innd</CODE>, de limiter l'acc&egrave;s &agrave; certains utilisateurs.</P>
<P>Un tel abonnement de groupe (surtout s'il y a quelques listes &agrave; grand
trafic) peut g&eacute;n&eacute;rer des &eacute;conomies d'utilisation de bande passante
importantes.</P>
<P>La lecture des listes &agrave; travers un lecteur de news offre aussi aux
utilisateurs l'avantage du threading (NdT : cr&eacute;er des enfilades), qui
n'est pas disponible dans de nombreux programmes de mail, et aussi
l'avantage de lib&eacute;rer leur bo&icirc;te aux lettres pour du courrier peut-&ecirc;tre
plus urgent ou plus personnel. </P>
<P>Ce mini Howto d&eacute;crit la mise en place du script <CODE>mail2news.pl</CODE> pour
r&eacute;aliser ceci.</P>

<H2><A NAME="ss2.1">2.1 O&ugrave; trouver <CODE>mail2news.pl</CODE></A>
</H2>


<P>L'auteur n'a pas pu trouver <CODE>mail2news.pl</CODE> sur le CPAN (le r&eacute;seau
complet d'archives Perl), mais il a pu passer devant sans le voir. Il est
cependant sur <CODE>sunsite.unc.edu</CODE> (quelque part) et aussi sur
<CODE>ftp.redhat.com</CODE>.</P>
<P>Comme ce script Perl n'est pas tr&egrave;s long, vous le trouverez &agrave; la fin de ce
Howto.</P>

<H2><A NAME="s3">3. Vue d'ensemble du syst&egrave;me</A></H2>


<P>Il est probablement plus facile de comprendre le fonctionnement de ce
syst&egrave;me en suivant un message &agrave; partir de la liste de distribution vers le
groupe de news, puis d'un message post&eacute; sur le groupe de news local (rout&eacute;
vers la liste de distribution) et en regardant comment ils sont trait&eacute;s.</P>

<H2><A NAME="ss3.1">3.1 Le courrier venant de la liste de distribution</A>
</H2>


<P>Le courrier de la liste de distribution est envoy&eacute; &agrave; toutes les adresses
mail abonn&eacute;es. Un alias de mail sp&eacute;cial est abonn&eacute; &agrave; la liste de
distribution en question et tout le trafic &agrave; destination et en
provenance de la liste est ainsi envoy&eacute; par le serveur de liste &agrave; cette
adresse.</P>
<P>Quand le courrier de la liste de distribution arrive sur la machine
locale, l'alias de mail envoie le message entrant dans <CODE>mail2news.pl</CODE>.
L'alias de mail sp&eacute;cifie aussi le groupe de news (local) de destination.</P>
<P>Le script <CODE>mail2news.pl</CODE> traite le message, en appliquant de nouvelles
en-t&ecirc;tes et utilise ensuite <CODE>rnews</CODE> ou <CODE>inews</CODE> pour poster le
message dans le groupe de news.</P>

<H2><A NAME="ss3.2">3.2 Messages post&eacute;s dans le groupe de news local</A>
</H2>


<P>Le groupe de news local est install&eacute; en tant que groupe mod&eacute;r&eacute;, puisque
ceci nous permet de b&eacute;n&eacute;ficier des possibilit&eacute;s de courrier &eacute;lectronique
d'<CODE>innd</CODE>. Tout message post&eacute; dans un groupe mod&eacute;r&eacute; n'est pas transmis
automatiquement au groupe. &Agrave; la place, les messages sont envoy&eacute;s par
<EM>email</EM> au mod&eacute;rateur du groupe. </P>
<P>En d&eacute;clarant le mod&eacute;rateur du groupe de news local comme &eacute;tant l'adresse
de la liste de distribution, tous les messages post&eacute;s sur le groupe de
news local seront envoy&eacute;s par <EM>email</EM> &agrave; la liste de distribution par
<CODE>innd</CODE> et n'appara&icirc;tront qu'une fois qu'ils auront &eacute;t&eacute; re&ccedil;us par
<CODE>mail2news.pl</CODE> qui ajoute la ligne <EM>approved</EM> n&eacute;cessaire aux
messages pour qu'<CODE>innd</CODE> accepte de les poster dans le groupe de news. </P>

<H2><A NAME="s4">4. Configurer <CODE>mail2news</CODE></A></H2>


<P>Placez le script <CODE>mail2news.pl</CODE> dans un endroit convenable. Je pr&eacute;f&egrave;re
<CODE>/usr/local/scripts</CODE>, mais l'endroit d&eacute;pend de vous.</P>
<P>Vous devrez &eacute;diter le script comme suit :</P>
<P>
<UL>
<LI> au d&eacute;but du script, assurez-vous que vous pointez vers le binaire
Perl local

<HR>
<PRE>
#!/usr/bin/perl
# pointe vers l'endroit courant de Perl
</PRE>
<HR>

</LI>
<LI> j'ai eu des probl&egrave;mes avec les trois lignes suivantes. Les mettre
en commentaire ne pose pas de probl&egrave;mes.

<HR>
<PRE>
( $version  ) = $] =~ /(\d+\.\d+).*\nPatch level/;
die "$program: demande au moins la version 3 de Perl\n"
       if $version &lt; 3;
</PRE>
<HR>

</LI>
<LI> &eacute;ditez les lignes suivantes pour pointer vers le programme qui
poste (j'utilise <CODE>rnews</CODE>) et vers votre machine de news :

<HR>
<PRE>
# $inews = "/usr/bin/inews";
# $iopts = "-h -o \"passerelle mail2news\"";
$inews = "/usr/bin/rnews";
$iopts = "";
$postinghost = "votre.serveur.de.news";   # pointe vers votre serveur de news
</PRE>
<HR>

 </LI>
<LI> assurez-vous que le script est ex&eacute;cutable (mode 755).
</LI>
</UL>
</P>

<H2><A NAME="s5">5. Mettre en place les alias de mail</A></H2>


<P>&Eacute;ditez <CODE>/etc/aliases</CODE> pour cr&eacute;er des entr&eacute;es pour les listes de
distribution que vous voulez envoyer vers les news. Chaque entr&eacute;e doit
&ecirc;tre de la forme :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;adresse email abonn&eacute;e &agrave; la liste>: \
          "| /usr/local/scripts/mail2news.pl &lt;nom du groupe de news local>"
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si par exemple l'adresse de mail &agrave; laquelle il faut envoyer le courrier de
la liste (l'adresse <EM>email</EM> abonn&eacute;e) est <CODE>liste_site</CODE> et le groupe
de news local dans lequel il faut poster le courrier s'appelle
<CODE>groupe.site.local</CODE>, l'alias sera</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# adresse d'abonnement de groupe pour machin@une.certaine.liste
liste_site: "|/usr/local/scripts/mail2news.pl groupe.site.local"
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Cr&eacute;ez une entr&eacute;e pour chaque liste de distribution que vous devez router
vers votre serveur de news local et lancez ensuite <CODE>newaliases</CODE>.</P>

<H2><A NAME="s6">6. Configurer les groupes de news et le serveur de news (<CODE>innd</CODE>)</A></H2>


<P>En utilisant <CODE>ctlinnd</CODE>, cr&eacute;ez les groupes de news sur votre serveur de
news. Rappelez-vous qu'ils doivent &ecirc;tre locaux, donc nommez-les de fa&ccedil;on
distincte avec un pr&eacute;fixe de fa&ccedil;on &agrave; les exclure de votre distribution de
news (dans le fichier <CODE>newsfeeds</CODE>).</P>
<P>Vous devez aussi dire &agrave; <CODE>innd</CODE> que le groupe est mod&eacute;r&eacute; (en utilisant
<CODE>ctlinnd</CODE>). Rappelez-vous que <CODE>innd</CODE> est tr&egrave;s sensible aux
propri&eacute;taires et permissions de fichiers, vous devez agir &agrave; ce niveau avec
<CODE>innd</CODE> en tant qu'utilisateur <EM>news</EM>. Vous indiquez un groupe mod&eacute;r&eacute;
en donnant le param&egrave;tre <CODE>m</CODE> &agrave; la commande <CODE>newgroup</CODE>.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ctlinnd newgroup &lt;nom du nouveau groupe> m &lt;administrateur>
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Le <CODE>m</CODE> indique &agrave; <CODE>innd</CODE> que le groupe est mod&eacute;r&eacute;.</P>
<P>&Eacute;ditez votre fichier <CODE>newsfeeds</CODE> pour vous assurer que ces groupes
locaux ne sont pas distribu&eacute;s (sauf si vous voulez sp&eacute;cifiquement que &ccedil;a
se passe ainsi).</P>
<P>Par exemple, si votre liste de distribution s'appelle
<CODE>groupe.site.local</CODE>, vous ajouterez sans doute <CODE>!local*</CODE> dans le
second champ des sites que vous distribuez (ou dont vous recevez les news)
dans votre fichier <CODE>newsfeeds</CODE>.</P>
<P>Maintenant, de fa&ccedil;on &agrave; vous assurer que les messages des utilisateurs sont
envoy&eacute;s sur la liste automatiquement par <CODE>innd</CODE>, &eacute;ditez
<CODE>/etc/news/moderators</CODE> (ou <CODE>/usr/local/news/moderators</CODE>)
pour ajouter une ligne qui d&eacute;clare l'adresse de la liste de distribution
comme mod&eacute;rateur.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
groupe.site.local:liste@un.site.de.liste
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="s7">7. Abonner l'alias <CODE>mail2news</CODE> &agrave; la liste de distribution</A></H2>


<P>Vous devez maintenant abonner l'alias de mail &agrave; la liste de distribution.
V&eacute;rifiez avec l'information de la liste de distribution comment s'abonner.
Certaines listes de distribution vous permettent d'abonner une adresse
<EM>email</EM> diff&eacute;rente de celle d'o&ugrave; vient l'abonnement (elles v&eacute;rifient
la confirmation avec l'adresse &agrave; abonner avant d'abonner r&eacute;ellement cette
adresse).</P>
<P>D'autres listes de distribution ne permettent pas ceci. Vous devrez donc
<EM>forger</EM> une demande d'abonnement. Il y a plusieurs fa&ccedil;ons de faire
ceci. L'une des plus simples est d'utiliser Netscape Mail configur&eacute; (de
mani&egrave;re temporaire) avec l'adresse avec laquelle la liste de distribution
doit envoyer le courrier.</P>
<P>Apr&egrave;s l'abonnement, vous devriez voir un message de bienvenue de la part
du serveur de listes dans votre serveur de news. Dans ce cas, tout s'est
bien pass&eacute; et vous pouvez maintenant tester l'autre sens en postant un
message de news dans votre nouvelle liste.</P>
<P>Le message <EM>ne devrait pas</EM> appara&icirc;tre imm&eacute;diatement dans le groupe de
news. Il devrait &ecirc;tre envoy&eacute; par courrier &eacute;lectronique et re&ccedil;u &agrave; nouveau
et post&eacute; dans le groupe de news.</P>
<P>Si cela fonctionne, vous avez r&eacute;ussi &agrave; router la liste vers les news.</P>

<H2><A NAME="s8">8. Si &ccedil;a ne fonctionne pas...</A></H2>


<P>Si &ccedil;a ne marche pas, vous devez retrouver la trace des messages pour voir
exactement o&ugrave; &ccedil;a s'arr&ecirc;te de fonctionner. Des outils utiles &agrave; ce niveau
sont les logs de mail et de news.</P>
<P>Robert Hart
Melbourne, Victoria, Australie, octobre 1996</P>

<H2><A NAME="s9">9. Le script <CODE>mail2news.pl</CODE></A></H2>


<P>
<HR>
<PRE>
#!/usr/bin/perl

($program = $0) =~ s%.*/%%;

#( $version  ) = $] =~ /(\d+\.\d+).*\nPatch level/;
#die "$program: demande au moins la version 3 de Perl\n"
#        if $version &lt; 3;

# $inews = "/usr/bin/inews";
# $iopts = "-h -o \"passerelle mail2news\"";
$inews = "/usr/bin/rnews";
$iopts = "";
$postinghost = "votre.serveur.de.news";

if ($#ARGV &lt; 0) {
    # $newsgroup = "test";
    # nous attendons la ligne newsgroup dans le corps
} elsif ($#ARGV == 0) {
    $newsgroup = $ARGV[0];
} else {
    die "usage: $program [groupe de news]\n";
}

# si jamais inews fait un core dump ou quelque chose insense
$SIG{'PIPE'} = "plumber";
sub plumber { die "$program: \"$inews\" est mort trop tot !\n"; }

open (INEWS, "| $inews $iopts") ||
    die "$program: ne peut pas lancer $inews\n";

# boucle qui prend les en-tetes
while (&lt;STDIN>) {
   last if /^$/;

   # transforme la vraie ligne from: dans le vieux style
   s/^From:\s+(.*) &lt;(.*)>/From: $2 ($1)/;

   s/Message-Id/Message-ID/;

   # transforme la ligne from_ en en-tete de chemin ;
   # fonctionne aussi en local
   s/^From\s+(\S+)@(\S+).*/Path: $2!$1/
     || s/^From\s+(\S+)[^@]*$/Path: $1\n/;

   print INEWS
#       if /^(Date|From|Subject|Path|Newsgroups|Organization|Message-ID):/i;
   if /^(Date|From|Subject|Path|Newsgroups|Message-ID):/i;
   $saw_subject |= ( $+ eq 'Subject' );

   $saw_msgid |= ( $+ eq 'Message-ID' );

#   $saw_newsgroup |= ( $+ eq 'Newsgroups' );
}

warn "$program: n'attendait pas le groupe dans les en-tetes et les arguments\n"
    if $newsgroup &amp;&amp; $saw_newsgroup;

die "$program: n'a pas obtenu le groupe des en-tetes ni des arguments\n"
    unless $newsgroup || $saw_newsgroup;

$approved = $newsgroup;
$approved =~ s/\./'-'/eg;

($sec,$min,$hour,$mday,$mon,$year)=localtime(time);
$madeupid = "\&lt;$year$mon$mday.$hour$min$sec.$$\@kepler.hedland.edu.au\>";

printf INEWS "Newsgroups: %s\n", $newsgroup if $newsgroup;
printf INEWS "Approved: %s\@kepler.hedland.edu.au\n", $approved;
print  INEWS "Subject: Untitled\n" unless $saw_subject;
printf INEWS "Message-ID: %s\n", $madeupid unless $saw_msgid;
printf INEWS "NNTP-Posting-Host: %s\n", $postinghost;
print  INEWS "Organisation: (mail2news gateway)\n";
print  INEWS "\n";

print INEWS while &lt;STDIN>;   # avale le reste du message

close INEWS;
exit $?;
</PRE>
<HR>
</P>

</BODY>
</HTML>
