<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Linux MP3 HOWTO</TITLE>
</HEAD>
<BODY>
<H1>Linux MP3 HOWTO</H1>

<H2>Phil Kerr 
<A HREF="mailto:phil@plus24.com">phil@plus24.com</A>, traduction Fr&eacute;d&eacute;ric Bothamy
     
<A HREF="mailto:fbothamy@mail.dotcom.fr">fbothamy@mail.dotcom.fr</A></H2>v1.61, 16 D&eacute;cembre 2001, traduction Décembre 2001
<HR>
<EM>Ce document d&eacute;crit le mat&eacute;riel, les logiciels et les proc&eacute;dures &agrave; suivre pour
cr&eacute;er, &eacute;couter et diffuser des fichiers son <EM>MP3</EM> sous Linux.</EM>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>

<P>Ce document d&eacute;crit le mat&eacute;riel, les logiciels et les proc&eacute;dures &agrave; suivre pour
cr&eacute;er, &eacute;couter et diffuser des fichiers son <EM>MP3</EM> sous Linux. Il recouvre&nbsp;:</P>
<P>
<UL>
<LI>L'encodage de MP3 en direct ou depuis une source ext&eacute;rieure</LI>
<LI>L'encodage de MP3 depuis un CD audio</LI>
<LI>La diffusion de MP3 sur un r&eacute;seau</LI>
<LI>L'&eacute;coute des MP3</LI>
<LI>L'enregistrement de flux de MP3</LI>
<LI>Le mixage de MP3</LI>
<LI>L'&eacute;dition des informations ID3</LI>
</UL>
</P>

<H2><A NAME="s2">2. Copyright</A></H2>

<P>Ce HOWTO est &copy; Phil Kerr, 1999, 2000.</P>

<P>Ce document est distribu&eacute; sous les termes de la GNU Free Documentation License.
Vous devriez en avoir re&ccedil;u une copie l'accompagnant. Dans le cas contraire, elle est disponible depuis 
<A HREF="http://www.fsf.org/licenses/fdl.html">http://www.fsf.org/licenses/fdl.html</A>.</P>

<H2><A NAME="s3">3. O&ugrave; trouver ce document</A></H2>

<P>La derni&egrave;re version officielle de ce document se trouve sur le site du Linux
Documentation Project 
<A HREF="http://www.linuxdoc.org/">http://www.linuxdoc.org/</A>. Le site web de ce
HOWTO est 
<A HREF="http://www.mp3-howto.com/">http://www.mp3-howto.com/</A>.</P>

<H2><A NAME="ss3.1">3.1 Traductions</A>
</H2>

<P>Ce document a &eacute;t&eacute; traduit dans les langues suivantes&nbsp;:</P>
<P><EM>Notez bien que les traductions peuvent &ecirc;tre plus anciennes que la version
originale, dans la mesure o&ugrave; traduire prend du temps.</EM></P>
<P><EM>Cor&eacute;en</EM></P>
<P>
<A HREF="http://kldp.org/HOWTO/MP3-HOWTO">http://kldp.org/HOWTO/MP3-HOWTO</A> par Lee, So-min
&lt;animator@nownuri.net&gt;</P>
<P><EM>Fran&ccedil;ais</EM></P>
<P>
<A HREF="http://www.freenix.org/unix/linux/HOWTO/MP3-HOWTO.html">http://www.freenix.org/unix/linux/HOWTO/MP3-HOWTO.html</A> par Fr&eacute;d&eacute;ric
Bothamy &lt;fbothamy@mail.dotcom.fr&gt;</P>
<P><EM>Hongrois</EM></P>
<P>
<A HREF="http://free.netlap.hu/howto/MP3-HOGYAN.html">http://free.netlap.hu/howto/MP3-HOGYAN.html</A> par Andras Timar
&lt;atimar@itp.hu&gt;</P>
<P><EM>Italien</EM></P>
<P>
<A HREF="ftp://ftp.pluto.linux.it/pub/pluto/ildp/HOWTO/MP3-HOWTO">ftp://ftp.pluto.linux.it/pub/pluto/ildp/HOWTO/MP3-HOWTO</A> par
Mariani Dario &lt;darkpand@uni.net&gt;</P>
<P><EM>Espagnol</EM></P>
<P>
<A HREF="http://www.insflug.org/documentos/MP3-Como">http://www.insflug.org/documentos/MP3-Como</A> par Arielo
&lt;larocka@yahoo.com&gt;</P>
<P><EM>Hollandais</EM></P>
<P>
<A HREF="http://nl.linux.org/doc/HOWTO/MP3-HOWTO-NL.html">http://nl.linux.org/doc/HOWTO/MP3-HOWTO-NL.html</A> par Reggy Ekkebus
&lt;reggy@zeelandnet.nl&gt;</P>
<P><EM>Japonais</EM></P>
<P>
<A HREF="http://www.linux.or.jp/JF/JFdocs/MP3-HOWTO.html">http://www.linux.or.jp/JF/JFdocs/MP3-HOWTO.html</A> par Saito Kan
&lt;can-s@geocities.co.jp&gt;</P>
<P><EM>Slov&egrave;ne</EM></P>
<P>
<A HREF="http://www.lugos.si/delo/slo/HOWTO-sl/MP3-HOWTO-sl.html">http://www.lugos.si/delo/slo/HOWTO-sl/MP3-HOWTO-sl.html</A> par
Jernej Kovacic &lt;jkovacic@email.si&gt;</P>
<P>Merci beaucoup &agrave; tous ces traducteurs. Si vous voulez traduire ce HOWTO dans
une autre langue, merci d'envoyer un e-mail &agrave; l'auteur (NdT&nbsp;: en anglais), en
pr&eacute;cisant l'URL o&ugrave; se trouvera la traduction.</P>

<H2><A NAME="s4">4. Remerciements</A></H2>

<P>Lors de l'&eacute;criture de ce document, je me suis largement inspir&eacute; du
<EM>Sound-HOWTO</EM> de Jeff Tranter et du <EM>Sound-Playing-HOWTO</EM> de Yoo
C. Chung.</P>
<P>Merci &eacute;galement aux autres auteurs de HOWTO, au travail desquels je me r&eacute;f&egrave;re&nbsp;:
<UL>
<LI><EM>Linux System Administrators Guide</EM> de Lars Wirzenius</LI>
<LI><EM>Linux Network Administrators Guide</EM> d'Olaf Kirch</LI>
<LI><EM>Multi Disk System Tuning HOWTO</EM> de Stein Gjoen</LI>
</UL>
</P>
<P>Un grand merci &eacute;galement pour tous ceux qui m'ont envoy&eacute; des commentaires ou
signal&eacute; des erreurs.</P>

<H2><A NAME="s5">5. D&eacute;n&eacute;gation</A></H2>

<P>Vous utilisez les informations contenues dans ce document &agrave; vos
propres risques. Nous d&eacute;clinons toute responsabilit&eacute; quant &agrave; son
contenu.  L'utilisation des concepts, des exemples ou de tout autre
contenu se fait enti&egrave;rement &agrave; vos propres risques.</P>
<P>Tous les droits sont d&eacute;tenus par leurs propri&eacute;taires respectifs, sauf
mention contraire explicite. L'utilisation d'un terme dans ce document
ne constitue pas une limitation &agrave; sa validit&eacute; en tant que marque.</P>
<P>Le fait de citer un produit ou une marque particuli&egrave;re ne constitue
pas une adh&eacute;sion.</P>
<P>Il est fortement conseill&eacute; d'effectuer une sauvegarde de votre syst&egrave;me
avant une installation importante ainsi qu'&agrave; intervalles r&eacute;guliers.</P>

<H2><A NAME="s6">6. Mat&eacute;riel n&eacute;cessaire et influence sur les performances</A></H2>

<P>Le traitement de son num&eacute;rique est une t&acirc;che qui demande beaucoup de
ressources, notamment en termes de puissance de calcul et
d'entr&eacute;es/sorties. Je recommande fortement une machine de type Pentium au
minimum.</P>
<P>Si vous voulez produire des MP3 &agrave; partir d'une source analogique &agrave; partir de
l'entr&eacute;e ligne ou d'un microphone, une carte son PCI donnera les meilleurs
r&eacute;sultats. La diff&eacute;rence de performance entre les E/S d'une carte ISA et celles
d'une carte PCI est importante (environ 132&nbsp;Mbps pour du PCI, d'apr&egrave;s
le <EM>PCI-HOWTO</EM>). Naturellement, meilleur est le rapport signal/bruit de la carte,
meilleur est le MP3 encod&eacute;. J'ai utilis&eacute; une Soundblaster PCI128 et je suis
r&eacute;cemment pass&eacute; &agrave; une Soundblaster Live Value&nbsp;; les deux cartes ont
de bonnes performances, mais la Live a un rapport signal/bruit sensiblement meilleur, assez
bon pour un usage semi-professionnel. Souvenez-vous de la vieille maxime du traitement de
donn&eacute;es&nbsp;: si vous partez de d&eacute;chets, vous obtiendrez des d&eacute;chets.</P>
<P>Creative propose un pilote en version b&ecirc;ta pour la Soundblaster Live!, qui
peut &ecirc;tre t&eacute;l&eacute;charg&eacute; depuis 
<A HREF="http://developer.soundblaster.com/linux/">http://developer.soundblaster.com/linux/</A>.</P>
<P>Lorsque vous enregistrez du son directement sur un disque dur (enregistrement
d2d, direct-to-disk), les performances du disque et de son interface sont
primordiales. Si vous utilisez un syst&egrave;me bas&eacute; sur de l'IDE, le mode 4 ou
l'UDMA sont pr&eacute;f&eacute;rables, dans la mesure o&ugrave; ils ont un d&eacute;bit
suffisant pour assurer l'integrit&eacute; des donn&eacute;es transf&eacute;r&eacute;es.</P>
<P>La solution id&eacute;ale reste un syst&egrave;me &agrave; base de SCSI, dont les disques et les
interfaces ont un bien meilleur d&eacute;bit, de 5&nbsp;Mo/s pour le SCSI-1 &agrave;
80&nbsp;Mo/s pour le SCSI ultra-wide. L'IDE peut aller jusqu'&agrave; des vitesses
variant de 8,3&nbsp;Mo/s &agrave; 66&nbsp;Mo/s pour l'Ultra DMA mode 4, mais il s'agit de
cr&ecirc;tes, les d&eacute;bits moyens seront plus faibles. Si vous pouvez trouver ou vous
offrir un disque SCSI AV, allez-y. Les disques AV ont des t&ecirc;tes de
lecture/&eacute;criture optimis&eacute;es pour les transferts continus de donn&eacute;es; les autres
disques SCSI et IDE ne peuvent normalement soutenir un transfert de donn&eacute;es
car leurs t&ecirc;tes chauffent trop&nbsp;!</P>
<P>Naturellement, un disque &eacute;quip&eacute; de cache donnera des r&eacute;sultats plus homog&egrave;nes,
vu que le cache peut servir de tampon lorsque les t&ecirc;tes se d&eacute;placent ou ne
peuvent pas soutenir le d&eacute;bit.</P>
<P>Si votre disque n'est pas &agrave; la hauteur, vos enregistrements seront parsem&eacute;s de
coupures et d'erreurs lorsque le disque n'arrivera pas &agrave; enregistrer le
signal. Si vous enregistrez des &eacute;v&eacute;nements uniques, comme des concerts,
investissez dans un bon syst&egrave;me disque SCSI.</P>
<P>Une charge syst&egrave;me &eacute;lev&eacute;e peut aussi causer des coupures dans des
enregistrements d2d. Des t&acirc;ches de fond peuvent momentan&eacute;ment occuper le
syst&egrave;me. Il vaut mieux r&eacute;duire les services au minimum vital, particuli&egrave;rement
les services r&eacute;seau. Pour plus d'informations &agrave; propos des services r&eacute;seau et
des scripts de d&eacute;marrage, reportez-vous au <EM>SAG</EM> et au <EM>NAG</EM>.</P>
<P>La pagination de la m&eacute;moire virtuelle peut aussi provoquer des erreurs, donc
mettez le plus de m&eacute;moire physique possible. Je recommande au moins
32&nbsp;Mo, mais vous pouvez avoir besoin de plus.</P>
<P>Pour ceux qui veulent tirer le maximum de leur syst&egrave;me, optimiser le noyau ne
fera probablement pas de mal.</P>
<P>Pour la diffusion de MP3 sur le r&eacute;seau, meilleure est la carte r&eacute;seau, meilleure
sera le d&eacute;bit, naturellement une interface 100&nbsp;Mb donnera un meilleur d&eacute;bit qu'une interface
10&nbsp;Mb.</P>
<P>Alors que le mat&eacute;riel ci-dessus vous donnera un syst&egrave;me acceptable pour encoder
des donn&eacute;es sonores, ne n&eacute;gligez pas l'emploi de mat&eacute;riel plus ancien et moins
performant si c'est tout ce &agrave; quoi vous avez acc&egrave;s.</P>
<P>La configuration d'un syst&egrave;me bas de gamme pour donner de bons r&eacute;sultats sera
un d&eacute;fi int&eacute;ressant pour un administrateur syst&egrave;me, et le r&eacute;sultat sera
probablement une machine Linux plus heureuse.</P>
<P>Un autre point important est la connectique audio. Des c&atilde;bles et des connecteurs bon
march&eacute; et de mauvaise qualit&eacute; donneront un enregistrement de mauvaise
qualit&eacute;. Si votre carte le permet, utilisez des connecteurs phono (RCA). Des
contacts plaqu&eacute;s or aideront aussi &agrave; obtenir un son de bonne qualit&eacute;. Enfin,
s&eacute;parez bien les c&acirc;bles audio des c&acirc;bles transmettant d'autres donn&eacute;es pour
&eacute;viter les risques d'interf&eacute;rences.</P>
<P>Mais n'oubliez pas, une fortune d&eacute;pens&eacute;e en c&acirc;bles sera perdue si le reste du
syst&egrave;me n'est pas optimis&eacute;.</P>
<P>Pour encoder des MP3 depuis un CD-ROM, la vitesse et le type du lecteur
d&eacute;terminent le temps n&eacute;cessaire &agrave; l'extraction des informations. Un lecteur
simple vitesse est probablement trop lent sauf pour les plus patients.</P>
<P>Votre lecteur de CD-ROM doit &ecirc;tre connect&eacute; &agrave; votre carte son, ou bien au moyen
du connecteur interne, ou bien en branchant la sortie casque du lecteur sur
l'entr&eacute;e ligne de la carte son. Bien entendu, vous ne pourrez pas &eacute;couter de
MP3 via la sortie casque du lecteur&nbsp;!</P>
<P>Pour des informations d&eacute;taill&eacute;es sur la configuration des cartes son, lisez le
<EM>Sound-HOWTO</EM>.</P>

<H2><A NAME="logiciels"></A> <A NAME="s7">7. Logiciels n&eacute;cessaires </A></H2>

<P>La conversion du son en MP3 se fait normalement en deux &eacute;tapes. D'abord, le
son est enregistr&eacute; au format WAV, puis le WAV est converti en MP3. Certains
utilitaires accompliront les deux transformations en une seule fois. Le
support du son que vous voulez encoder, CD ou enregistrement direct,
d&eacute;terminera les logiciels n&eacute;cessaires &agrave; la production du fichier WAV.</P>
<P>Si vous voulez enregistrer depuis une source audio ext&eacute;rieure, vous aurez
besoin d'un programme pour lire les donn&eacute;es sur l'entr&eacute;e de votre carte son et
les sauvegarder au format WAV. Voici quelques logiciels utiles. La plupart des
commentaires proviennent des sites web des applications en question.</P>

<H2><A NAME="ss7.1">7.1 Extracteurs de CD et enregistreurs WAV</A>
</H2>

<P>Pour enregistrer des donn&eacute;es analogiques via l'entr&eacute;e ligne&nbsp;:</P>
<P><EM>Wavrec</EM></P>
<P>Wavrec fait partie du paquetage Wavplay, qui peut &ecirc;tre t&eacute;l&eacute;charg&eacute; sur&nbsp;:</P>
<P>
<A HREF="ftp://metalab.unc.edu/pub/Linux/apps/sound/players/">ftp://metalab.unc.edu/pub/Linux/apps/sound/players/</A></P>
<P>Pour convertir des CD audio au format WAV (extraction de CD)&nbsp;:</P>
<P><EM>CDDA2WAV</EM></P>
<P>
<A HREF="http://metalab.unc.edu/pub/Linux/apps/sound/cdrom/">http://metalab.unc.edu/pub/Linux/apps/sound/cdrom/</A></P>
<P><EM>Cdparanoia</EM></P>
<P>Cdparanoia est un outil d'extraction de compact disc audio num&eacute;rique (CDDA,
Compact Disc Digital Audio), parfois appel&eacute; "ripper". L'application est
construite au-dessus de la biblioth&egrave;que Paranoia qui effectue le vrai
travail (les sources de Paranoia sont fournies avec la distribution
source de cdparanoia). Tout comme cdda2wav, cdparanoia lit directement
les donn&eacute;es enregistr&eacute;es sur le CD, sans passer par un quelconque format
analogique, et &eacute;crit les donn&eacute;es dans un fichier ou dans un tube, au
format WAV, AIFC ou PCM lin&eacute;aire 16&nbsp;bits brut. Par rapport &agrave; cdda2wav, il
est beaucoup plus lent, mais il donne les meilleurs r&eacute;sultats possibles,
m&ecirc;me avec des CD ray&eacute;s ou difficiles &agrave; lire.</P>
<P>
<A HREF="http://www.xiph.org/paranoia/index.html">http://www.xiph.org/paranoia/index.html</A></P>
<P><EM>RipEnc</EM></P>
<P>RipEnc est un script en Bourne shell qui sert de frontal &agrave; cdparanoia,
cdda2wav, tosha et bladeenc, 8hz-mp3, l3enc. Il utilise le protocole CDDB
pour trouver le nom des morceaux au fur et &agrave; mesure de leur
extraction. Une option permettant de les nommer manuellement est aussi
disponible. Vous pouvez extraire la totalit&eacute; du CD ou choisir certains
morceaux. Les marques ID3 sont &eacute;galement support&eacute;es.</P>
<P>
<A HREF="http://www.asde.com/~mjparme/index.htm">http://www.asde.com/~mjparme/index.htm</A></P>

<P><EM>Cd2mp3</EM></P>
<P>cd2mp3 est un logiciel gratuit, con&ccedil;u pour g&eacute;rer 2 autres programmes
cdda2wav (qui extrait les pistes du CD) et lame (qui encode les MP3).</P>
<P>
<A HREF="http://sertaozinho.org/cd2mp3/index.html">http://sertaozinho.org/cd2mp3/index.html</A></P>
<P><EM>RipperX</EM></P>
<P>RipperX est un programme en GTK pour extraire les CD audio et encoder les
MP3. Il peut utiliser cdparanoia, bladeenc, lame, XingMp3enc, 8hz-mp3 et
l'encodeur ISO&nbsp;v2. Il supporte &eacute;galement CDDB et les marques ID3.</P>
<P>
<A HREF="http://www.digitallabyrinth.com/linux/ripperX/">http://www.digitallabyrinth.com/linux/ripperX/</A></P>
<P><EM>Grip</EM></P>
<P>Grip est un lecteur et extracteur de CD et encodeur MP3 utilisant GTK. Il
poss&egrave;de nativement les capacit&eacute;s d'extraction de cdparanoia, mais il peut
&eacute;galement utiliser des extracteurs ext&eacute;rieurs comme cdda2wav. Il fournit
aussi un frontal automatique pour les encodeurs MP3 et vous permet de prendre un CD
et de transformer facilement son contenu en MP3. Le protocole CDDB est
support&eacute;, ce qui permet de r&eacute;cup&eacute;rer les informations concernant le
disque depuis des serveurs de bases de donn&eacute;es. Grip fonctionne avec
DigitalDJ pour fournir une version num&eacute;rique coh&eacute;rente de votre
collection de CD.</P>
<P>
<A HREF="http://www.nostatic.org/grip/">http://www.nostatic.org/grip/</A></P>

<H2><A NAME="ss7.2">7.2 Encodeurs</A>
</H2>

<P>Vous en aurez besoin pour convertir vos fichiers WAV au format MP3&nbsp;:</P>
<P><EM>Blade's MP3 Encoder</EM></P>
<P>BladeEnc est un encodeur MP3 gratuit. Il est construit autour des m&ecirc;mes
routines de compression ISO que mpegEnc, donc vous pouvez vous attendre &agrave;
un r&eacute;sultat &agrave; peu pr&egrave;s &eacute;quivalent, voire meilleur. Les principales
diff&eacute;rences sont l'apparence et la vitesse. BladeEnc ne dispose pas d'une
belle interface utilisateur comme mpegEnc, mais il est plus de trois fois
plus rapide, et il dispose de plusieurs frontaux graphiques.</P>
<P>
<A HREF="http://bladeenc.cjb.net">http://bladeenc.cjb.net</A></P>
<P><EM>Lame</EM></P>
<P>Dans la tradition des noms GNU, LAME signifie <EM>LAME Ain't an MP3 Encoder</EM>
(NdT&nbsp;: LAME n'est pas un encodeur MP3). D'ailleurs, LAME <EM>n'est pas</EM>
un encodeur MP3. Il s'agit d'un patch applicable aux sources de
d&eacute;monstration dist10 de l'ISO, sous licence GPL. LAME est totalement
incapable de produire un flux MP3. En fait, il ne peut m&ecirc;me pas &ecirc;tre
compil&eacute; seul. Vous aurez besoin des sources ISO pour le faire
fonctionner. Ces sources sont &eacute;galement disponibles gratuitement, mais
tout usage commercial (y compris la distribution d'un encodeur gratuit)
n&eacute;cessite l'accord de FhG (Fraunhofer Gesellschaft, Allemagne).</P>
<P>
<A HREF="http://www.sulaco.org/mp3/">http://www.sulaco.org/mp3/</A></P>
<P><EM>Gogo</EM></P>
<P>Il s'agit d'un encodeur MP3 extr&ecirc;mement rapide pour x86, d&eacute;riv&eacute; de la version
3.29&nbsp;b&ecirc;ta de LAME et optimis&eacute; par PEN@MarineCat, Keiichi SAKAI, URURI,
kei et shigeo. Pour le compiler, vous aurez besoin de NASM, disponible &agrave;
l'adresse 
<A HREF="http://www.web-sites.co.uk/nasm/">http://www.web-sites.co.uk/nasm/</A>.</P>
<P>
<A HREF="http://homepage1.nifty.com/herumi/gogo_e.html">http://homepage1.nifty.com/herumi/gogo_e.html</A></P>


<H2><A NAME="ss7.3">7.3 Lecteurs</A>
</H2>

<P>Pour lire les MP3, il vout faut bien s&ucirc;r un lecteur&nbsp;:</P>
<P><EM>Xmms (anciennement X11Amp)</EM></P>
<P>Ce lecteur dispose de la plupart des fonctionnalit&eacute;s de Winamp (disponible
sous Windows&nbsp;95/98/NT), en plus de quelques fonctionnalit&eacute;s propres &agrave; la
version Linux.</P>
<P>
<A HREF="http://www.xmms.org">http://www.xmms.org</A></P>
<P><EM>Xaudio</EM></P>
<P>Xaudio est une application multi-plate-formes tr&egrave;s rapide et tr&egrave;s robuste
permettant la lecture de son num&eacute;rique, orient&eacute;e plus particuli&egrave;rement
vers le d&eacute;codage de flux audio MPEG (MP1, MP2, MP3).</P>
<P>
<A HREF="http://www.xaudio.com">http://www.xaudio.com</A></P>
<P><EM>AlsaPlayer</EM></P>
<P>AlsaPlayer est un nouveau type de lecteur PCM. Il est fortement multi-thread&eacute;
et essaye de tirer le maximum des biblioth&egrave;ques et des pilotes ALSA. Il
dispose de quelques fonctionnalit&eacute;s tr&egrave;s int&eacute;ressantes, uniques parmi les
lecteurs Linux/Unix. Le but est de cr&eacute;er un canevas modulaire pour l'utilisation de toute
sorte de m&eacute;dias, principalement orient&eacute; vers la lecture de son PCM.
<EM>Contr&ocirc;le total de la vitesse (pitch), vers l'avant *et* l'arri&egrave;re. Le premier
lecteur sous Linux, et le seul sous GPL, &agrave; faire &ccedil;a&nbsp;! Les MP3 et les CD peuvent
&ecirc;tre &eacute;cout&eacute;s &agrave; vitesse variable :-)</EM></P>
<P>
<A HREF="http://www.alsa-project.org/~andy/">http://www.alsa-project.org/~andy/</A></P>

<P><EM>mpg123</EM></P>
<P>Qu'est-ce que mpg123&nbsp;? Il s'agit d'un lecteur audio MPEG pour Unix, rapide,
libre et portable. Il supporte les couches 1, 2 et 3 (les fameux MP3) des
flux MPEG&nbsp;1.0/2.0, et il a &eacute;t&eacute; test&eacute; avec succ&egrave;s sur de nombreuses
plate-formes, y compris Linux, FreeBSD, NetBSD, SunOS, Solaris, IRIX et
HP-UX. Pour une lecture de qualit&eacute; CD (44&nbsp;kHz, 16&nbsp;bits, st&eacute;r&eacute;o), un
Pentium (ou un 486 rapide), une SPARCstation&nbsp;10, un DEC Alpha ou un
processeur similaire est n&eacute;cessaire. Une lecture mono et/ou de qualit&eacute;
r&eacute;duite (22&nbsp;kHz ou 11&nbsp;kHz) est possible m&ecirc;me sur un 486 plus lent.</P>
<P>
<A HREF="http://dorifer.heim3.tu-clausthal.de/~olli/mpg123/">http://dorifer.heim3.tu-clausthal.de/~olli/mpg123/</A></P>

<P><EM>FreeAmp</EM></P>
<P>FreeAmp est un lecteur audio extensible et multi-plate-formes. Il dispose
d'une version optimis&eacute;e du d&eacute;codeur MPEG Xing, sous GPL, qui en fait un
des lecteurs les plus rapides et donne l'un des meilleurs rendus
sonores. FreeAmp dispose des fonctionnalit&eacute;s les plus courantes
auxquelles les utilisateurs sont habitu&eacute;s et d'un interface propre et
facile &agrave; utiliser.</P>
<P>
<A HREF="http://www.freeamp.org/">http://www.freeamp.org/</A></P>

<H2><A NAME="ss7.4">7.4 Serveurs de diffusion</A>
</H2>

<P>Les serveurs de diffusion vous permettent de diffuser des MP3 &agrave; travers un
r&eacute;seau, qu'il s'agisse de votre r&eacute;seau local ou d'Internet.</P>
<P><EM>Icecast</EM></P>
<P>Icecast est un syst&egrave;me de diffusion de flux audio MPEG couche 3, con&ccedil;u par
l'&eacute;quipe de linuxpower.org. Icecast est fourni avec iceplay et
icedir. Iceplay permet de g&eacute;rer la liste des morceaux &agrave; jouer et
d'envoyer les fichiers pr&eacute;-encod&eacute;es &agrave; votre serveur Icecast.</P>
<P>
<A HREF="http://www.icecast.org/">http://www.icecast.org/</A></P>
<P><EM>Fluid</EM></P>
<P>Le serveur de flux Fluid est un programme permettant de diffuser des flux
multim&eacute;dia sur un r&eacute;seau. Sous sa forme actuelle, il utilise le format
MP3.</P>
<P>
<A HREF="http://www.subside.com/fluid/">http://www.subside.com/fluid/</A> (ancien site)</P>
<P>
<A HREF="http://fluid.sourceforge.net/">http://fluid.sourceforge.net/</A> (nouveau site)</P>
<P><EM>Litestream</EM></P>
<P>Litestream est un syst&egrave;me Open Source tr&egrave;s &eacute;chelonnable de diffusion
de MP3 pour Unix.</P>
<P>
<A HREF="http://www.litestream.net/">http://www.litestream.net/</A></P>
<P><EM>Apache::MP3</EM></P>
<P>C'est un module de diffusion de MP3 utilisant le serveur Web Apache.</P>
<P>Ce module utilise une arborescence de r&eacute;pertoires contenant des fichiers MP3 et la
pr&eacute;sente comme une biblioth&egrave;ques de chansons &agrave; explorer sur le web.</P>
<P>[Disponible sur le site de CPAN]</P>

<H2><A NAME="ss7.5">7.5 Mixage</A>
</H2>


<P><EM>LiveIce</EM></P>
<P>LiveIce est le client source d'Icecast, qui encode un flux MP3 pour le
diffuser au fur et &agrave; mesure de sa cr&eacute;ation. Contrairement &agrave; des clients
comme Shout ou IceDJ, il permet la diffusion en direct, et pas seulement
depuis des MP3 enregistr&eacute;s au pr&eacute;alable.</P>
<P>LiveIce est fourni avec Icecast, des versions r&eacute;centes et de la documentation
se trouvent sur le site suivant&nbsp;:</P>
<P>
<A HREF="http://star.arm.ac.uk/~spm/software/liveice.html">http://star.arm.ac.uk/~spm/software/liveice.html</A></P>
<P><EM>eMixer</EM></P>
<P>eMixer est un frontal facile d'utilisation &agrave; mpg123 qui permet de jouer et de
mixer deux flux MP3 ensemble. La capacit&eacute; de mixer deux flux permet
d'utiliser eMixer comme 'cross-fader'  et donne &agrave; l'utilisateur les m&ecirc;mes
possibilit&eacute;s qu'&agrave; un DJ. eMixer est &eacute;galement bien adapt&eacute;
&agrave; un environnement "temps r&eacute;el", comme une soir&eacute;e dansante.
eMixer est b&acirc;ti autour du m&ecirc;me code de mixage de MP3 que le mixeur de LiveIce.</P>
<P>
<A HREF="http://emixer.linuxave.net/">http://emixer.linuxave.net/</A></P>
<P><EM>GDAM</EM></P>
<P>GDAM est un logiciel temps r&eacute;el num&eacute;rique de mixage DJ. Plusieurs fichiers MP3 peuvent
&ecirc;tre jou&eacute;s et mix&eacute;s simultan&eacute;ment. Des effets peuvent &ecirc;tre ajout&eacute;s,
chang&eacute;s et r&eacute;arrang&eacute;s dynamiquement.  GDAM propose une architecture
client-serveur&nbsp;; toute la partie son est produite par le serveur qui re&ccedil;oit des
instructions des clients. Les autres fonctionnalit&eacute;s incluent des plugins pour des effets
audio et des composants interface, des fonctions de cache et de boucle, du s&eacute;quen&ccedil;age,
de la correspondance de rythme assist&eacute;e, un visualiseur de fr&eacute;quences/calculateur de
rythme, une gestion de file en continue (pas de pause entre les chansons d'une liste), un syst&egrave;me
d'aide en ligne, un clone de mpg123 tournant sur un serveur gdam, une interface flexible en ligne de
commande pour un contr&ocirc;le direct du serveur, l'enregistrement d'un mixage entier ou de tout point
dans le flux vers le cache/disque/encodeur mp3, le support de plusieurs p&eacute;riph&eacute;riques son
et le support du contr&ocirc;le mat&eacute;riel midi.</P>
<P>
<A HREF="http://gdam.org/">http://gdam.org/</A> </P>
<P>URL alternative&nbsp;:</P>
<P>
<A HREF="http://gdam.sourceforge.net">http://gdam.sourceforge.net</A></P>

<H2><A NAME="ss7.6">7.6 &Eacute;diteurs ID3</A>
</H2>


<P><EM>id3ed</EM></P>
<P>id3ed est un &eacute;diteur de marques ID3 pour les fichiers MP3. Vous pouvez positionner des marques
interactivement ou &agrave; partir de la ligne de commande ou une combinaison des deux. id3ed peut
positionner le genre par le nom ou par le num&eacute;ro associ&eacute;. Vous pouvez &eacute;galement
enlever ou visualiser les marques.</P>
<P>
<A HREF="http://www.azstarnet.com/~donut/programs/id3ed.html">http://www.azstarnet.com/~donut/programs/id3ed.html</A></P>
<P><EM>mp3info</EM></P>
<P>MP3info est un petit outil pour lire ou &eacute;crire les marques ID3 des MP3. Des versions console (ligne de
commande et interactive par ncurses) et graphique utilisant GTK sont incluses.</P>
<P>
<A HREF="http://metalab.unc.edu/mp3info/">http://metalab.unc.edu/mp3info/</A></P>

<H2><A NAME="ss7.7">7.7 Enregistreurs de flux</A>
</H2>


<P><EM>Streamripper</EM></P>
<P>Streamripper enregistre les flux shoutcast. Si le flux contient des informations sur la piste (meta data),
streamripper cr&eacute;e un fichier s&eacute;par&eacute; pour chaque piste.</P>
<P>
<A HREF="http://streamripper.sourceforge.net/">http://streamripper.sourceforge.net/</A></P>
<P><EM>Wget</EM></P>
<P>GNU Wget est un utilitaire r&eacute;seau librement disponible pour r&eacute;cup&eacute;rer des fichiers sur
l'Internet utilisant HTTP et FTP, les deux protocoles les plus largement utilis&eacute;s. Il fonctionne
non interactivement, ce qui lui permet donc de travailler en t&acirc;che de fond, apr&egrave;s que
l'utilisateur se soit d&eacute;connect&eacute;.</P>
<P><EM>Wget est beaucoup plus qu'un simple enregistreur de flux&nbsp;!</EM></P>
<P>
<A HREF="ftp://ftp.gnu.org/gnu/wget/">ftp://ftp.gnu.org/gnu/wget/</A> </P>

<H2><A NAME="ss7.8">7.8 Divers</A>
</H2>

<P><EM>Normalisation du volume</EM></P>
<P><EM>Wavnorm</EM></P>
<P>Si vous avez encod&eacute; un flux audio enregistr&eacute; en direct ou si vous &ecirc;tes parti
d'un vieux CD, il se peut que le volume sonore varie. Pour changer le
volume sonore de vos MP3, vous devrez les normaliser au moyen de
wavnorm.</P>
<P>
<A HREF="http://www.zog.net.au/computers/wavnorm/">http://www.zog.net.au/computers/wavnorm/</A></P>

<P><EM>SOX</EM></P>
<P>Sox est un utilitaire de conversion sonore tr&egrave;s pratique dont je recommande
l'utilisation. Vous en aurez besoin pour utiliser wavnorm.</P>
<P>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/convert/">ftp://sunsite.unc.edu/pub/Linux/apps/sound/convert/</A></P>

<P>Vous pourrez &eacute;galement avoir besoin d'un programme de mixage&nbsp;; Xmixer
fonctionne bien, et il est inclus dans la plupart des distributions
Linux.</P>

<H2><A NAME="s8">8. Configuration du syst&egrave;me</A></H2>

<P>Cette section d&eacute;crit les bases de la configuration de Linux en vue de
l'enregistrement de son depuis une source analogique ou un CD audio.</P>
<P>J'ai pris comme base mon syst&egrave;me Intel sous Red Hat, mais cette section
devrait &ecirc;tre raisonnablement ind&eacute;pendante de la distribution utilis&eacute;e.
Si ce HOWTO vous est utile avec d'autres types de mat&eacute;riel, merci de me contacter.</P>
<P>Naturellement, une carte son en &eacute;tat de marche est un pr&eacute;-requis
raisonnable. Pour cela, je vous invite &agrave; lire l'excellent <EM>Linux Sound
HOWTO</EM> de Jeff Tranter et le <EM>Linux Sound Playing HOWTO</EM> de Yoo
C. Chung. Ces deux HOWTO d&eacute;crivent l'art et la mani&egrave;re de configurer le son
sous Linux beaucoup mieux que je ne saurais le faire.</P>

<H2><A NAME="ss8.1">8.1 Configuration pour la capture d'une source analogique</A>
</H2>

<P>Pour commencer, configurez votre &eacute;quipement audio. Il existe de multiples
fa&ccedil;ons d'amener le son jusqu'&agrave; votre machine Linux. Voici les plus
communes&nbsp;:</P>
<P>Sortie ligne vers entr&eacute;e ligne. La plupart des appareils audio ont une sortie
ligne. Le niveau ligne est un standard pr&eacute;cisant la tension et l'intensit&eacute; du
courant &eacute;mis par l'appareil. Si je me souviens bien, la tension est de 500&nbsp;mV
pour les &eacute;quipements domestiques et semi-pro et 750&nbsp;mV pour les &eacute;quipements
pro. Je suppose que la plupart des cartes son utilisent le standard &agrave; 500&nbsp;mV,
mais certaines cartes pro r&eacute;centes peuvent utiliser l'autre. La diff&eacute;rence ne
devrait pas &ecirc;tre trop importante si vous n'enregistrez pas &agrave; un volume tr&egrave;s
important.</P>
<P>La sortie ligne est g&eacute;n&eacute;ralement utilis&eacute;e pour connecter des &eacute;quipements hi-fi
&agrave; un amplificateur, donc les tuners radio et les platines cassette, CD, DAT,
Mini-Disc et autres devraient pouvoir se brancher sans probl&egrave;me. Les platines
disques peuvent &ecirc;tre plus emb&ecirc;tantes&nbsp;; voir ci-dessous pour en savoir plus.</P>
<P>Vous pouvez aussi capturer du son depuis un magn&eacute;toscope. La plupart des
magn&eacute;toscopes ont une sortie ligne, ou vous pouvez obtenir un signal au niveau
ligne depuis une prise p&eacute;ritel si votre magn&eacute;toscope en est &eacute;quip&eacute;.</P>
<P>Sortie d'amplificateur vers entr&eacute;e ligne, sortie ligne vers entr&eacute;e cassette
sur l'amplificateur. Essentiellement, vous remplacez la platine cassette
reli&eacute;e &agrave; votre ampli hi-fi par votre syst&egrave;me Linux. Le lien entre la sortie
ligne et l'entr&eacute;e de l'ampli permet de contr&ocirc;ler le niveau de
l'enregistrement.</P>
<P>Micro sur entr&eacute;e micro. La tension g&eacute;n&eacute;r&eacute;e par un microphone est beaucoup plus
faible que le niveau ligne. Si vous branchez votre micro sur votre entr&eacute;e
ligne, vous n'enregistrerez probablement jamais rien.</P>
<P><EM>Attention</EM>, l'inverse, brancher la sortie ligne d'un appareil sur l'entr&eacute;e
micro, peut endommager votre carte son&nbsp;!</P>
<P>Platine disques sur entr&eacute;e micro.</P>
<P>Merci &agrave; Mark Tranchant pour ce qui suit&nbsp;:</P>
<P><EM>La sortie d'une platine disque se fait &agrave; un niveau tr&egrave;s bas. Cependant,
vous ne pouvez pas brancher la platine &agrave; une entr&eacute;e micro et esp&eacute;rer de
bons r&eacute;sultats. La sortie n&eacute;cessite une &eacute;galisation, car les basses sont
att&eacute;nu&eacute;es et les aigus amplifi&eacute;s pour tirer le maximum de l'aiguille de
la platine. Cette &eacute;galisation est d&eacute;finie tr&egrave;s pr&eacute;cis&eacute;ment&nbsp;; il s'agit
de l'&eacute;galisation RIAA. Vous *devez* passer la sortie de la platine &agrave;
travers un pr&eacute;ampli d&eacute;di&eacute;, puis vers une entr&eacute;e ligne.</EM></P>
<P>Les claviers et synth&eacute;s doivent &ecirc;tre branch&eacute;s sur l'entr&eacute;e ligne, et les
guitares sur l'entr&eacute;e ligne via une bo&icirc;te de direct (DI box, utilis&eacute;e pour
convertir le signal au niveau ligne).</P>
<P>Avant de brancher quoi que ce soit sur votre carte son, assurez-vous que le
volume est regl&eacute; au minimum et que les &eacute;ventuels micros ne sont pas allum&eacute;s et
tourn&eacute;s vers les haut-parleurs.</P>

<H2><A NAME="ss8.2">8.2 Configuration pour l'extraction de son depuis un CD</A>
</H2>

<P>Configurer votre syst&egrave;me Linux pour extraire le son d'un CD avec votre lecteur
de CD-ROM est relativement simple.</P>
<P>Si vous pouvez &eacute;couter un CD audio avec votre lecteur branch&eacute; sur votre carte
son, il y a des chances que vous puissiez l'enregistrer.</P>

<H2><A NAME="ss8.3">8.3 Configuration additionnelle</A>
</H2>

<P>Connectez-vous normalement &agrave; votre syst&egrave;me, puis utilisez un programme de
mixage pour regler des niveaux d'enregistrement assez forts pour avoir un son
d&eacute;cent, mais pas trop pour &eacute;viter la distorsion. Normalement, j'&eacute;value &ccedil;a &agrave;
l'oreille&nbsp;; apr&egrave;s quelques temps, vous conna&icirc;trez le meilleur niveau pour
votre syst&egrave;me.</P>
<P>Je recommande ou bien d'arr&ecirc;ter tous les services non indispensables, ou bien
de passer en mode utilisateur seul, en particulier si vous enregistrez depuis
une source ext&eacute;rieure. Cela assure que seuls un nombre minimum de services
fonctionnent, et donc que les erreurs d'enregistrement sont r&eacute;duites au
minimum.</P>
<P>J'ai r&eacute;serv&eacute; un disque SCSI &agrave; l'enregistrement du son. J'y ferai r&eacute;f&eacute;rence
comme <CODE>/mp3</CODE>. J'ai fait cela principalement pour le gain de performances
apport&eacute; par un disque SCSI. De plus, enregistrer sur un disque s&eacute;par&eacute;, dont
vous savez que la t&ecirc;te ne va pas tout &agrave; coup se d&eacute;placer &agrave; l'autre bout du
disque pendant que vous &ecirc;tes en train d'enregistrer, est une Bonne Chose. :-)</P>
<P>Pour les d&eacute;tails de la configuration d'un syst&egrave;me Linux avec plusieurs
disques, la lecture du <EM>Multi-Disk-HOWTO</EM> de Stein Gjoen peut &ecirc;tre utile.</P>

<H2><A NAME="s9">9. Encodage depuis une source audio</A></H2>

<P>Premi&egrave;rement, assurez-vous que vous avez suffisamment de place sur votre
disque dur. Pour un enregistrement de qualit&eacute; CD (44,1&nbsp;kHz, 16&nbsp;bits, st&eacute;r&eacute;o),
une minute prend pr&egrave;s de 10&nbsp;Mo (5&nbsp;Mo par canal).</P>
<P>En g&eacute;n&eacute;ral, j'enregistre avec une qualit&eacute; DAT, 48&nbsp;kHz, 16&nbsp;bits, st&eacute;r&eacute;o.</P>
<P>Avec wavrec, j'utilise la syntaxe suivante:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/local/bin/wavrec -t 60 -s 48000 -S /mp3/temp.wav
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La premi&egrave;re partie est le chemin d'acc&egrave;s explicite de wavrec. Le <CODE>-t 60</CODE>
pr&eacute;cise la dur&eacute;e de l'enregistrement en secondes. L'option <CODE>-s 48000</CODE> donne
la fr&eacute;quence d'&eacute;chantillonnage en bits/s (la fr&eacute;quence du DAT est 48000, celle
du CD, 44100). La derni&egrave;re option indique le fichier de sortie.</P>
<P>Pour voir la liste compl&egrave;te des options, lancez <CODE>wavrec -help</CODE> ou lisez le
manuel.</P>
<P>Ceci va produire un fichier WAV. Ensuite, vous allez devoir l'encoder au
format MP3. Utilisez bladeenc avec la ligne de commande suivante&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/local/bin/bladeenc &lt;em/[fichier source] [fichier destination]/ -br 256000
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>L'option <CODE>-br</CODE> pr&eacute;cise la fr&eacute;quence. En l'occurrence, je l'ai regl&eacute;e au
maximum&nbsp;: 256&nbsp;kbits/s. Le chemin d'acc&egrave;s de <CODE>bladeenc</CODE> peut aussi &ecirc;tre
diff&eacute;rent sur votre syst&egrave;me de celui de mon exemple.</P>
<P>Pour voir la liste des options, lancez <CODE>bladeenc -help</CODE>. En fait, il s'agit
d'une option invalide, mais cela va afficher la liste des options.</P>
<P>Vous pourriez aussi utiliser Lame (ou Gogo, qui en est d&eacute;riv&eacute;), avec la ligne
de commande suivante&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/local/bin/lame &lt;em/[fichier source] [fichier destination]/ -b 256
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="s10">10. Encodage depuis un lecteur de CD-ROM</A></H2>

<P>De la m&ecirc;me fa&ccedil;on, l'encodage depuis un CD se d&eacute;roule en deux &eacute;tapes. Tout
d'abord, les donn&eacute;es extraites du CD sont enregistr&eacute;es au format WAV, puis
le fichier WAV est converti en MP3. Il existe deux types d'encodeurs, en
ligne de commande ou sous X. Ils r&eacute;alisent le m&ecirc;me travail, mais ceux qui
utilisent X sont plus faciles &agrave; utiliser et plus beaux.</P>
<P>L&agrave; encore, v&eacute;rifiez que vous avez suffisamment de place sur votre disque dur.</P>

<H2><A NAME="ss10.1">10.1 Encodage en ligne de commande</A>
</H2>

<P>J'ai &eacute;crit un petit script Perl pour extraire et encoder des pistes d'un CD.</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
#!/usr/bin/perl

if ($ARGV[0] ne "") {

$count = 1;

do {
 
$cdcap = system("cdparanoia", $count, "/mp3/cdda.wav");
$track = "$ARGV[1]/track".$count.".mp3";
$enc = system("bladeenc  /mp3/cdda.wav $track -br 256000");
$count++;

}
until $count > $ARGV[0];
exit;
}

else {
print "Usage cdriper [nombre de pistes] [r&eacute;pertoire cible]\n\n";
}
</PRE>
<HR>
</CODE></BLOCKQUOTE>

Notez que ce script est tr&egrave;s rudimentaire et ignore compl&egrave;tement les
perfectionnements tels que la v&eacute;rification d'erreur ou l'utilisation de
CDDB. Am&eacute;liorez-le tant que vous voudrez :-)</P>
<P>La ligne int&eacute;ressante est</P>
<P>
<HR>
<PRE>
$cdcap = system("cdparanoia", $count, "/mp3/cdda.wav");
</PRE>
<HR>
</P>
<P>Cette ligne appelle l'extracteur de CD audio, cdparanoia, qui convertit les
donn&eacute;es brutes extraites d'un CD en fichier WAV.</P>
<P>J'utilise cdparanoia, mais vous pourriez aussi bien utiliser cdda2wav. Dans ce
cas, cette ligne devient&nbsp;:</P>
<P>
<HR>
<PRE>
$cdcap = system("cdda2wav", $count, "/mp3/cdda.wav");
</PRE>
<HR>
</P>
<P>Les options sont <CODE>$count</CODE> (le nombre de pistes &agrave; extraire), puis le chemin
d'acc&egrave;s des fichiers WAV produits. Dans mon exemple, il s'agit de mon disque
r&eacute;serv&eacute; aux MP3.</P>
<P>Les fichiers WAV sont ensuite convertis en MP3 avec Bladeenc.</P>
<P>J'ai &eacute;crit ce script pour extraire tout un CD sans devoir extraire et encoder
chaque piste s&eacute;par&eacute;ment, et sans utiliser le traitement par lots de
cdparanoia, qui extrait tout le disque, ce qui peut occuper jusqu'&agrave; 600&nbsp;Mo.</P>
<P>Si vous pr&eacute;ferez utiliser Lame ou Gogo, remplacez la ligne 
<HR>
<PRE>
$enc = system("bladeenc  /mp3/cdda.wav $track -br 256000");
</PRE>
<HR>

par
<HR>
<PRE>
$enc = system("lame  /mp3/cdda.wav $track -b 256");
</PRE>
<HR>

ou
<HR>
<PRE>
$enc = system("gogo  /mp3/cdda.wav $track -b 256");
</PRE>
<HR>
</P>
<P>Voici une liste des options disponibles pour chacun de ces encodeurs&nbsp;:</P>
<P>Bladeenc
<HR>
<PRE>
BladeEnc 0.91    (c) Tord Jansson          Homepage: http://bladeenc.mp3.no
===============================================================================
BladeEnc is free software, distributed under the Lesser General Public License.
See the file COPYING, BladeEnc's homepage or www.fsf.org for more details.

Usage: bladeenc [options globales] entr&eacute;e1 [sortie1 [options]] entr&eacute;e2 ...

Options g&eacute;n&eacute;rales :
  -[kbit], -br [kbit]  D&eacute;bit du flux MP3 en kbit/s. La valeur par d&eacute;faut est
                       128 (64 pour une sortie mono)
  -crc                 Inclure un code de v&eacute;rification dans le fichier MP3
  -delete, -del        Effacer le fichier WAV apr&egrave;s un encodage r&eacute;ussi
  -private, -p         Positionner le drapeau priv&eacute; du fichier MP3
  -copyright, -c       Positionner le drapeau copyright du fichier MP3
  -copy                Enlever le drapeau original du fichier MP3
  -mono, -dm           Produire un MP3 mono &agrave; partir des deux canaux combin&eacute;s
  -leftmono, -lm       Produire un MP3 mono &agrave; partir du canal de gauche
  -rightmono, -rm      Produire un MP3 mono &agrave; partir du canal de droite
  -swap                Intervertir les canaux st&eacute;r&eacute;o de droite et de gauche
  -rawfreq=[freq]      Fr&eacute;quence du flux brut (RAW). La valeur par d&eacute;faut 
                       est 44100
  -rawbits=[bits]      Nombre de bits d'&eacute;chantillonage pour chaque canal du
                       flux brut. La valeur par d&eacute;faut est 16
  -rawmono             Les flux bruts sont mono, pas st&eacute;r&eacute;o
  -rawstereo           Les flux bruts sont st&eacute;r&eacute;o (valeur par d&eacute;faut)
  -rawsigned           Les flux bruts sont sign&eacute;s (valeur par d&eacute;faut)
  -rawunsigned         Les flux bruts ne sont pas sign&eacute;s
  -rawbyteorder=[order]Ordre des bits du flux brut : LITTLE ou BIG.
  -rawchannels=[1/2]   Nombre de canaux pour les flux bruts. M&ecirc;me effet que
                       -rawmono ou -rawstereo, respectivement.

Options uniquement globales :
  -quit, -q            Quitte sans attendre l'appui sur une touche une fois 
                       l'encodage termin&eacute;
  -outdir=[dir]        Sauve les MP3 dans le r&eacute;pertoire sp&eacute;cifi&eacute;
  -quiet               D&eacute;sactive les sorties &agrave; l'&eacute;cran
  -nocfg               Ignore le fichier de configuration
  -prio=[prio]         Priorit&eacute; de BladeEnc. Les valeurs possibles sont
                       HIGHEST, HIGHER, NORMAL, LOWER, LOWEST(d&eacute;faut) et IDLE
  -refresh=[rate]      Fr&eacute;quence de mise &agrave; jour de l'indicateur de
                       progression. 1=rapide, 2=valeur par d&eacute;faut
  -progress=[0-8]      Quel indicateur de progression utiliser. 0=aucun,
                       1=d&eacute;faut.

Les fichiers d'entr&eacute;e et de sortie peuvent &ecirc;tre remplac&eacute;s par STDIN et STDOUT,
respectivement.
</PRE>
<HR>
</P>
<P>Lame
<HR>
<PRE>
LAME version 3.50 (www.sulaco.org/mp3) 
GPSYCHO: GPL psycho-acoustic model version 0.74. 

USAGE   :  lame [options] &lt;entr&eacute;e> [sortie]

&lt;entr&eacute;e> et/ou &lt;sortie> peuvent &ecirc;tre "-", c'est &agrave; dire stdin/stdout.

OPTIONS :
    -m mode         (s)t&eacute;r&eacute;o, (j)oint, (f)orce ou (m)ono (par d&eacute;faut j)
                    force = force ms_stereo sur toutes les voix. Plus rapide et 
                    utilise les seuils de masquage sp&eacute;ciaux Mid &amp; Side
    -b &lt;bitrate>    positionne le d&eacute;bit du flux, par d&eacute;faut 128 kbps
                    (pour les VBR, il s'agit du d&eacute;bit minimum autoris&eacute;)
    -s sfreq        fr&eacute;quence d'&eacute;chantillonage du fichier d'entr&eacute;e (en kHz) - par d&eacute;faut 44.1
  --resample sfreq  fr&eacute;quence d'&eacute;chantillonage du fichier de sortie (en kHz) - par d&eacute;faut, celle de l'entr&eacute;e sfreq
  --mp3input        le fichier d'entr&eacute;e est un fichier MP3
  --voice           mode exp&eacute;rimental 'voice'

    -v              utilise un d&eacute;bit variable (VBR)
    -V n            param&egrave;tre de quali&eacute; pour le VBR. Par d&eacute;faut n=4
                    0=meilleur qualit&eacute;, fichiers plus gros. 9=plus petits fichiers
    -t              d&eacute;sactive la marque d'information VBR Xing
    --nohist        d&eacute;sactive l'affichage de l'histogramme VBR

    -h              utilise (peut-&ecirc;tre) les am&eacute;liorations de qualit&eacute;
    -f              mode rapide (basse qualit&eacute;)
    -k              d&eacute;sactive l'extinction sfb=21
    -d              permet diff&eacute;rents types de blocs pour les canaux
  --athonly         utilise seulement l'ATH pour le masquage

    -r              l'entr&eacute;e est du pcm brut
    -x              force l'inversion des bits de l'entr&eacute;e
    -a              r&eacute;duit le flux de st&eacute;r&eacute;o vers mono pour en encodage mono
    -e emp          post-correction n/5/c  (obsol&egrave;te)
    -p              protection d'erreur.  Ajoute un code d'erreur 16 bits &agrave; chaque s&eacute;quence.
                    (le code d'erreur est calcul&eacute; correctement)
    -c              ajoute la marque de copyright
    -o              ajoute la marque non original
    -S              n'affiche pas d'indicateur de progression, ni d'histogramme VBR

  Sp&eacute;cifier l'une des options suivantes ajoutera les marques ID3
     --tt &lt;title>     titre le la chanson (maximum 30 caract&egrave;res)
     --ta &lt;artist>    artiste qui a fait la chanson (maximum 30 caract&egrave;res)
     --tl &lt;album>     album d'o&ugrave; provient la chanson (maximum 30 caract&egrave;ress)
     --ty &lt;year>      ann&eacute;e au cours de laquelle la chanson a &eacute;t&eacute; faite (maximum 4 caract&egrave;res)
     --tc &lt;comment>   information suppl&eacute;mentaires (maximum 30 caract&egrave;ress)


MPEG1 samplerates(kHz): 32 44.1 48 
bitrates(kbs): 32 48 56 64 80 96 112 128 160 192 224 256 320 

MPEG2 samplerates(kHz): 16 22.05 24 
bitrates(kbs): 8 16 24 32 40 48 56 64 80 96 112 128 144 160
</PRE>
<HR>
</P>
<P>Gogo
<HR>
<PRE>
GOGO-no-coda ver. 2.24 (Feb 12 2000)
Copyright (C) 1999 PEN@MarineCat and shigeo
          Special thanks to Keiichi SAKAI, URURI, Noisyu and Kei
This is based on LAME3.29beta and distributed under the LGPL
usage
gogo inputPCM [outputPCM] [options]

 inputPCM est le fichier d'entr&eacute;e wav
Si input.wav est `stdin', alors l'entr&eacute;e est stdin
outputPCM est le fichier de sortie mp3 (facultatif)

Options
-b  kbps     d&eacute;bit [kpbs]
-br bps      d&eacute;bit [ bps]
-silent      ne pas afficher d'indicateur de progression
-off         optimisation {3dn,mmx,kni(sse),e3dn}
-v {0,..,9}  VBR [0:haute qualit&eacute; 9:haute compression]
             Il n'est conseill&eacute; d'utiliser cette option avec l'option -b
que pour une entr&eacute;e PCM brut
-offset bytes saute la taille de l'en-t&ecirc;te
  -8bit      PCM 8~bits [par d&eacute;faut PCM 16~bits]
  -mono      PCM mono [par d&eacute;faut PCM st&eacute;r&eacute;o]
  -bswap     &eacute;change les bits de poids faible et fort pour le PCM 16~bits
  -s kHz     fr&eacute;quence du PCM [par d&eacute;faut 44.1kHz]
-nopsy       d&eacute;sactive les psycho-acoustiques
-m  {s,m,j}  format de sortie s:st&eacute;r&eacute;o, m:mono, j:j-st&eacute;r&eacute;o
-d  kHz      change la fr&eacute;quence d'&eacute;chantillonage pour le MP3 produit
-emh {n,c,5} post-correction
-lpf {on,off} filtre 16~kHz [par d&eacute;faut utilis&eacute; si &lt;= 128~kbps&nbsp;; non utilis&eacute; si >= 160kbps]
-test        mode test de performance
-delete      supprime le fichier d'entr&eacute;e apr&egrave;s l'encodage
</PRE>
<HR>
</P>

<H3>RipEnc</H3>

<P>RipEnc effectue la m&ecirc;me t&acirc;che que le code ci-dessus, mais est &eacute;crit en
shell et est plus facile &agrave; utiliser :-)</P>
<P>Voici &agrave; quoi il ressemble&nbsp;:</P>
<P>
<HR>
<PRE>
RipEnc version 0.7, Copyright (C) 1999  Michael J. Parmeley
&lt;mjparme@asde.com>, RipEnc comes with ABSOLUTELY NO WARRANTY


Il n'y a actuellement PAS de processus d'encodage en t&acirc;che de fond
Votre fichier encode.log fait 982607 octets.

&lt;Entrer 'd' pour les d&eacute;tails, 'v' pour voir le fichier journal d'encodage ou
'del' pour supprimer le fichier journal>


1) Changer le r&eacute;pertoire de travail.............[/megajukebox/tmp]
2) Choisir l'encodeur...........................[lame]
3) Choisir l'extracteur.........................[cdparanoia]
4) Choisir l'outil de marquage ID3..............[aucun]
5) Basculer entre le nommage manuel ou par CDDB.[manuel]
6) Positionner la variable XMCD_LIBDIR pour CDA.[/var/X11R6/lib/xmcd]
7) Positionner la convention de nommage pr&eacute;f&eacute;r&eacute;e[artist-name_of_song.mp3]
8) Extraire le CD en entier&nbsp;?...................[non]
9) Positionner l'option petit disque dur&nbsp;?......[non]
10) Veuillez s&eacute;lectionner votre Cd-Rom..........[/dev/cdrom]
11) Positionner le d&eacute;bit des MP3 encod&eacute;s........[256]
12) Lister les fichiers du r&eacute;pertoire de travail
13) D&eacute;marrer
14) A propos
15) Sortir
?
</PRE>
<HR>
</P>

<H3>CD2MP3</H3>


<P>Cd2mp3 est un encodeur CDDA vers MP3 en un seul passage. Il convertit une piste audio en MP3 sans
produire de fichier interm&eacute;diaire.</P>
<P>Voici &agrave; quoi il ressemble en fonctionnement&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ cd2mp3 options ALL
Using language: 1 - English.
Translator: Gustavo Sverzut Barbieri(k-s) &lt;gsbarbieri@hotmail.com>

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% Cd2Mp3 1.0 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Author: Gustavo Sverzut Barbieri (k-s) &lt;gsbarbieri@hotmail.com.br>
*** device: -D/dev/cdrom        type: -Icooked_ioctl
*** audio device: /dev/dsp
*** preset: tape
*** copyright: Yes
*** author: 
*** album: 

recording: '1' as 'track-1.mp3' (wait)
        Ok! (recorded)
recording: '2' as 'track-2.mp3' (wait)
</PRE>
<HR>
</P>

<P>Vous pouvez bien sur lui fournir des options sur la ligne de commande dont voici la liste&nbsp;:</P>
<P>
<HR>
<PRE>
dj@megajukebox]$ cd2mp3 --help

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% Cd2Mp3 1.0 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Author: Gustavo Sverzut Barbieri (k-s) &lt;gsbarbieri@hotmail.com.br>
Usage:
  cd2mp3 options &lt;track_number>="&lt;track name>" ... &lt;track_number>="&lt;track name>"or:  cd2mp3 options ALL  (to record all tracks)
or: cd2mp3 options LIST=&lt;reclist_path>  (to read pairs: &lt;track_number>="&lt;track name>" from a file)
ou: cd2mp3 options PLAY=&lt;track_number> VOL=[0..100] (only plays the track)

Options:
  DEV=&lt;cdrom_device> (default: /dev/cdrom)
  DEV_TYPE=[generic_scsi|cooked_ioctl] (default: cooked_ioctl)
  AUDIO_DEV=&lt;audio_device>  (default:/dev/dsp)
  LANGUAGE=&lt;language_number> (LANGUAGE=help to see supported languages)
  COPYRIGHT=[YES|NO]
  PRESET=[phone|voice|fm|tape|hifi|cd|studio] (PRESET=help will give more info)
  ALBUM="&lt;album's title>"
  AUTHOR="&lt;author's name>"
</PRE>
<HR>
</P>

<H2><A NAME="ss10.2">10.2 Encoder en mode graphique</A>
</H2>


<P>Les encodeurs en mode graphique offrent toutes les fonctionnalit&eacute;s de ceux
en mode console, mais englobe le tout dans une interface agr&eacute;able et facile
&agrave; utiliser. Grip et RippperX sont semblables d'utilisation, tous deux permettent
de choisir une, plusieurs ou toutes les pistes d'un CD et de les convertir. Ils
offrent aussi le support CDDB qui vous permet de r&eacute;cup&eacute;rer les informations
sur l'album et les pistes &agrave; partir d'un serveur. Ceci vous &eacute;vite d'avoir
&agrave; les saisir &agrave; la main.</P>

<H2><A NAME="ss10.3">10.3 Performance des encodeurs</A>
</H2>

<P>Dans la section sur l'encodage, j'ai mentionn&eacute; 3 encodeurs diff&eacute;rents&nbsp;: bladeenc,
lame et gogo. La principale diff&eacute;rence se situe dans leur performance en encodage (bien
qu'il y ait aussi des diff&eacute;rences dans les options disponibles list&eacute;es auparavant).</P>
<P>Prenons un petit exemple&nbsp;: j'ai extrait une piste d'un CD, puis l'ai encod&eacute; avec chaque encodeur. Tous
les encodeurs ont &eacute;t&eacute; ex&eacute;cut&eacute; dans les m&ecirc;me conditions syst&egrave;me
et ont tous produit des MP3 st&eacute;r&eacute;o.</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ ls -l cdda.wav 
-rw-rw-r--   1 dj       dj       59823164 Feb 10 00:56 cdda.wav

[dj@megajukebox]$ bladeenc cdda.wav -br 256

BladeEnc 0.91    (c) Tord Jansson          Homepage: http://bladeenc.mp3.no
===============================================================================
BladeEnc is free software, distributed under the Lesser General Public License.
See the file COPYING, BladeEnc's homepage or www.fsf.org for more details.

Files to encode: 1

Encoding:  ../test.wav
Input:     44.1 kHz, 16 bit, stereo.
Output:    128 kBit, stereo.

Completed. Encoding time: 00:05:58 (0.78X)                                   

All operations completed. Total encoding time: 00:05:58

--------------------------------------------------------------------------------

[dj@megajukebox]$ lame cdda.wav -b 256
LAME version 3.50 (www.sulaco.org/mp3) 
GPSYCHO: GPL psycho-acoustic model version 0.74. 
Encoding ../test.wav to ../test.wav.mp3
Encoding as 44.1 kHz 128 kbps j-stereo MPEG1 LayerIII file
    Frame          |  CPU/estimated  |  time/estimated | play/CPU |   ETA
 10756/ 10756(100%)| 0:02:28/ 0:02:28| 0:02:29/ 0:02:29|    1.9074| 0:00:00 

--------------------------------------------------------------------------------

[dj@megajukebox]$ gogo cdda.wav -m s -b 256
GOGO-no-coda ver. 2.24 (Feb 12 2000)
Copyright (C) 1999 PEN@MarineCat and shigeo
          Special thanks to Keiichi SAKAI, URURI, Noisyu and Kei
MPEG 1, layer 3 stereo
inp sampling-freq=44.1kHz out sampling-freq=44.1kHz bitrate=256kbps
inp sampling-freq=44.1kHz out sampling-freq=44.1kHz bitrate=128kbps
input  file `../test.wav'
output file `../test.mp3'
{  10751/  10755} 100.0% (  2.94x)  re:[00:00:00.03] to:[00:01:35.42]
End of encoding
time=  95.430sec
</PRE>
<HR>
</P>
<P>Il semble que gogo ait un algorithme mieux optimis&eacute; pour l'encodage que bladeenc ou lame.</P>

<H2><A NAME="s11">11. Diffusion de MP3 sur un r&eacute;seau</A></H2>

<P>Un serveur de diffusion de MP3 vous permet d'envoyer des fichiers MP3 sur un r&eacute;seau
bas&eacute; sur TCP. Ceci peut &ecirc;tre l'Internet ou un r&eacute;seau local / intranet.</P>
<P>Le principe de connexion est tr&egrave;s semblable &agrave; celui d'un serveur web, les fichiers
sont diffus&eacute;s quand un client (le lecteur de MP3) se connecte sur le serveur.</P>

<H2><A NAME="ss11.1">11.1 Icecast</A>
</H2>


<P>Apr&egrave;s avoir t&eacute;l&eacute;charg&eacute; et d&eacute;compress&eacute; l'archive, un bon coup d'oeil
dans le r&eacute;pertoire doc/ est une bonne chose, le manuel HTML est tr&egrave;s utile et complet.</P>
<P>Si vous avez t&eacute;l&eacute;charg&eacute; le code source, suivez les instructions pour la compilation
relative &agrave; votre syst&egrave;me.</P>
<P>Icecast ne marchera correctement que si vous sp&eacute;cifiez correctement le nom du server dans le fichier
de configuration icecast.conf qui est situ&eacute; dans le r&eacute;pertoire etc. Il doit correspondre
exactement au nom de machine r&eacute;solu par son adresse IP.</P>
<P>Si vous voyez les lignes suivantes lors du d&eacute;marrage du serveur Icecast, c'est qu'il y a un probl&egrave;me&nbsp;:
<HR>
<PRE>
-> [05/Jan/2000:17:21:04] WARNING: Resolving the server name [your.server.name] does not work!
</PRE>
<HR>
</P>
<P>Editez le fichier icecast.conf situ&eacute; dans le r&eacute;pertoire etc, localisez la ligne contenant
l'entr&eacute;e "server_name" et entrez les nom de votre serveur. En cas de doute, vous pouvez utiliser
la commande <EM>hostname</EM> ou afficher le fichier /etc/hosts.</P>
<P>Un fois les modifications n&eacute;cessaires faites, il vous faudra soit copier le fichier de configuration
dans le r&eacute;pertoire bin, soit d&eacute;marrer icecast avec l'option -c et sp&eacute;cifier l'emplacement
du fichier ainsi&nbsp;:
<HR>
<PRE>
[dj@megajukebox bin]$ ./icecast -c ../etc/icecast.conf
</PRE>
<HR>
</P>
<P>Si tout est configur&eacute; correctement, vous devriez voir quelque chose comme&nbsp;:
<HR>
<PRE>
[dj@megajukebox bin]$ ./icecast -c ../etc/icecast.conf -d /home/dj/mp3/icecast/  
Icecast Version 1.3.0 Starting...
Icecast comes with NO WARRANTY, to the extent permitted by law.
You may redistribute copies of Icecast under the terms of the
GNU General Public License.
For more information about these matters, see the file named COPYING.

[05/Jan/2000:18:36:30] Icecast Version 1.3.0 Starting..
[05/Jan/2000:18:36:30] Using stdin as icecast operator console
[05/Jan/2000:18:36:30] Tailing file to icecast operator console
[05/Jan/2000:18:36:30] Server started...
[05/Jan/2000:18:36:30] Listening on port 8000...
[05/Jan/2000:18:36:30] Using [megajukebox] as servername...
[05/Jan/2000:18:36:30] Max values: 1000 clients, 1000 clients per source, 10 sources, 5 admins
-> [05/Jan/2000:18:36:30] [Bandwidth: 0.000000MB/s] [Sources: 0] [Clients: 0] [Admins: 1] [Uptime: 0 seconds]
</PRE>
<HR>
 </P>
<P>L'option -d positionne le r&eacute;pertoire pour les fichiers journaux et les mod&egrave;les.</P>
<P>Voici ci-dessous la liste des options de la ligne de commande&nbsp;:</P>
<P>
<HR>
<PRE>
        -c [filename] 

Utilise le fichier comme un fichier de configuration. Veuillez noter que tout
param&egrave;tre pass&eacute; sur la ligne de commande est prioritaire sur le
contenu de ce fichier. Notez &eacute;galement que le fichier icecast.conf contenu
dans le r&eacute;pertoire courant est automatiquement lu quand vous sp&eacute;cifiez
cette option, ainsi tout param&egrave;tre du fichier icecast.conf non sp&eacute;cifi&eacute;
dans le nouveau fichier de configuration sera utilis&eacute; par le serveur.

        -P [port] 

Port utilis&eacute; par toutes les connexions des clients, de la source audio et
d'administration. Il est positionn&eacute; &agrave; 8000 par d&eacute;faut.

        -m [max clients] 

Nombre maximum de connexions clientes autoris&eacute;es. Quand ce nombre est atteint, toute
connexion cliente sera refus&eacute;e avec un message~: 'HTTP/1.0 504 Server Full' 

        -p [encoder password] 

Cette options positionne le mot de passe que l'encodeur doit utiliser pour pouvoir envoyer
le flux vers le serveur. Notez que si vous compilez le serveur avec le support de crypt(),
cet argument doit &ecirc;tre une cha&icirc;ne encrypt&eacute;e.

        -b 

Cette option permet au serveur icecast d'&ecirc;tre lanc&eacute; en t&acirc;che de fond (i.e. processus d&eacute;mon).
Pour pouvoir utiliser les commandes d'administration, vous devrez alors vous
connecter au serveur comme administrateur, en utilisant un client telnet ou &eacute;quivalent.

        -d [directory] 

Rend tous les fichiers journaux cr&eacute;&eacute;s par icecast et tous les mod&egrave;les que icecast
utilise relatifs &agrave; ce r&eacute;pertoire.
</PRE>
<HR>
</P>
<P>Voici ainsi comment d&eacute;marrer le serveur, mais vous devez aussi connecter une source MP3
au serveur.</P>
<P>Vous avez le choix entre deux applications pour envoyer des donn&eacute;es MP3 au serveur, Shout et LiveIce.</P>

<H3>Shout</H3>

<P>Shout envoie au serveur icecast une liste de MP3 &agrave; diffuser et est inclus avec icecast.</P>
<P>Vous cr&eacute;ez la liste des fichiers MP3 avec la commande suivante&nbsp;:
<HR>
<PRE>
find [r&eacute;pertoire MP3] -name '*.mp3' -print > playlist
</PRE>
<HR>
</P>
<P>Au niveau le plus simple, pour d&eacute;marrer le service shout, ex&eacute;cutez la commande suivante&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox bin]# ./shout megajukebox -P hackme -p playlist
</PRE>
<HR>
</P>
<P>L'option -P sp&eacute;cifi&eacute; le mot de passe n&eacute;cessaire pour ajouter un point de montage &agrave;
icecast, celui-ci est positionn&eacute; &agrave; <EM>hackme</EM>..... Je vous sugg&egrave;re fortement
de le changer, sinon quelqu'un le fera &agrave; votre place :-) L'option -p d&eacute;finit l'emplacement
du fichier de liste.
Voici ci-dessous une liste de toutes les options de la ligne de commande&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox bin]# ./shout
Usage: shout &lt;host> [options] [[-b &lt;bitrate] file.mp3]...
Options:
        -B &lt;directory>  - Utiliser le r&eacute;pertoire pour tous les fichiers de shout
        -C &lt;file>       - Utiliser le fichier comme fichier de configuration
        -D &lt;dj_file>    - Ex&eacute;cuter cette commande avant chaque chanson (system())
        -P &lt;password>   - Utiliser le mot de passe sp&eacute;cifi&eacute;
        -S              - Afficher les param&egrave;tres et sort
        -V              - Utiliser un affichage verbeux
        -X &lt;desc>       - Utiliser la description sp&eacute;cifi&eacute;e
        -a              - Activer la correction automatique du d&eacute;bit (transfert)
        -b &lt;bitrate>    - D&eacute;marrer en utilisant le d&eacute;bit sp&eacute;cifi&eacute;
        -d              - Activer le dj
        -e &lt;port>       - Se connecter sur le serveur au port sp&eacute;cifi&eacute;
        -f              - Ne pas envoyer les fichiers qui ne correspondent pas au d&eacute;bit sp&eacute;cifi&eacute;
        -g &lt;genre>      - Utiliser un genre sp&eacute;cifique
        -h              - Afficher l'aide
        -i              - Utiliser les anciens en-t&ecirc;tes icy
        -k              - Ne pas tronquer la liste interne (continuer)
        -l              - Envoyer sans fin (en boucle)
        -m &lt;mount>      - Utiliser le point de montage sp&eacute;cifique
        -n &lt;name>       - Utiliser le nom sp&eacute;cifique
        -o              - D&eacute;sactive l'auto-d&eacute;tection du d&eacute;bit
        -p &lt;playlist>   - Utilise le fichier sp&eacute;cifi&eacute; comme liste de MP3
        -r              - Lecture al&eacute;atoire de la liste
        -s              - (Secret) Ne pas envoyer les meta data au serveur
        -u &lt;url>        - Utilise l'URL spcifi&eacute;
        -v              - Affiche la version
        -x              - Ne pas mettre &agrave; jour le fichier cur (&eacute;conomise le processeur)
        -z              - Passer en t&acirc;che de fond (mode d&eacute;mon)
        -t              - Autoriser la diffusion des titres
</PRE>
<HR>
</P>

<H3>LiveIce</H3>


<P>LiveIce peut fonctionner dans 2 modes, il peut passer une liste de MP3 &agrave; Icecast ou il peut
passer directement de l'audio en direct de la carte son.</P>
<P>Apr&egrave;s avoir d&eacute;compress&eacute; l'archive et lu le fichier README concernant la construction
du paquet, assurez-vous que vous disposez du programme mpg123 car LiveIce en a besoin.</P>
<P>Il y a deux fa&ccedil;ons de configurer LiveIce&nbsp;: en &eacute;ditant le fichier de configuration avec vi/emacs
ou en utilisant l'outil de configuration bas&eacute; sur Tk, ce qui est une fa&ccedil;on tr&egrave;s agr&eacute;able
de l'&eacute;diter :-)</P>
<P>Le meilleur endroit o&ugrave; sont d&eacute;crits les d&eacute;tails internes du fichier de configuration liveice.cfg
est la page de LiveIce o&ugrave; Scott couvre l'ensemble des options.</P>
<P>Ceci est une copie de mon fichier de configuration avec LiveIce positionn&eacute; en mode mixer (diffusion
&agrave; partir d'une liste de MP3).</P>
<P>NOTE&nbsp;: j'ai ajout&eacute; des commentaires au fichier, donc, si vous voulez faire du copier-coller, assurez-vous
que les commentaires ne d&eacute;bordent pas sur une nouvelle ligne ou sinon LiveIce ne fonctionnera pas :-)</P>
<P>
<HR>
<PRE>
# Fichier de configuration liveice
# G&eacute;n&eacute;r&eacute; automatiquement

SERVER megajukebox              # Le nom de votre serveur * DOIT ETRE LE NOM DE RESOLUTION DU SERVEUR *
PORT 8000                       # Le port que le serveur Icecast &eacute;coute

NAME Megajukebox                # Des informations concernant le nom de votre serveur qui seront envoy&eacute;es
                                # aux lecteurs de MP3 et au serveurs de r&eacute;pertoires.
                                # Par exemple,  'Sarah FM' ou 'ThisTown: Loud and Heavy Jazz - Internet Radio 24/7' 

GENRE Live                      # Des informations concernant le genre. Par exemple 'Talk' ou 'Dance'

DESCRIPTION                     # Des informations concernant la station. Par exemple 'The best for reggae in the North'

URL http://megajukebox:8000     # L'URL et le port du serveur

PUBLIC 0                        # Positionner &agrave; 1 si vous voulez que Icecast annonce votre station et ses d&eacute;tails
                                # sur un serveur de r&eacute;pertoires, sinon laisser &agrave; 0

XAUDIOCAST_LOGIN                # Peut &ecirc;tre soit ICY_LOGIN ou X_AUDIOCAST_LOGIN.  X_AUDIOCAST est pr&eacute;f&eacute;rable.

MOUNTPOINT /techno              # Positionne le point de montage du flux pour Icecast. A n'utiliser que si l'option X_AUDIOCAST est utilis&eacute;e
                                # sinon laisser la valeur par d&eacute;faut icy_0 

PASSWORD hackme                 # Mot de passe de l'administrateur Icecast

SAMPLE_RATE 44100               # La fr&eacute;quence du flux
STEREO                          # Peut &ecirc;tre MONO ou STEREO

NO_SOUNDCARD                    # Voir ci-dessous

HALF_DUPLEX                     # Positionne la carte son en mode duplex. Peut &ecirc;tre HALF_DUPLEX ou FULL_DUPLEX
USE_GOGO                        # Positionne l'encodeur &agrave; utiliser. Consulter le fichier README pour la liste compl&egrave;te.
BITRATE 128000                  # Positionne le d&eacute;bit du flux (voir ci dessous)
VBR_QUALITY 1                   # Positionne la qualit&eacute; du d&eacute;bit variable (VBR)

MIXER                           # Voir ci dessous

PLAYLIST /megajukebox/playlist  # Emplacement de la liste de MP3 (voir les d&eacute;tails sur la commande find plus loin dans ce chapitre)

TRACK_LOGFILE track.log         # Nom et emplacement du fichier o&ugrave; envoyer la liste des MP3 diffus&eacute;s
</PRE>
<HR>
</P>
<P>Une fois que vous avez votre fichier de configuration, vous pouvez d&eacute;marrer LiveIce ainsi&nbsp;:
<HR>
<PRE>
[dj@megajukebox liveice]$ ./liveice
/megajukebox/playlist
1
opening connection to megajukebox 8000
Attempting to Contact Server
connection successful: forking process
opening pipe!...
writing password
Setting up Interface
Soundcard Reopened For Encoding
Input Format: 16Bit 44100Hz Stereo
Output Format: 256000 Bps Mpeg Audio
IceCast Server: megajukebox:8000
Mountpoint: /techno
Name: megajukebox - this and that radio - broadcasting 24/7
Genre: Techno
Url: http://megajukebox.com
Description: a load of digital noise -> but i know you like it :)

 Press '+' to Finish
adding /megajukebox/demotunes/track_1.mp3
adding /megajukebox/demotunes/track_2.mp3
adding /megajukebox/demotunes/track_3.mp3
adding /megajukebox/demotunes/track_4.mp3
/megajukebox/demotunes/track_4.mp3
Adding New Channel 1
Adding New Channel 2
Channel 1 selecting 
 /megajukebox/demotunes/track_1.mp3
Channel 2 selecting 
 /megajukebox/demotunes/track_1.mp3
Playing track_1.mp3
searching for Id3v2
searching for Id3v1
copying the data
fixing the nulls
adding the url
closing input file
Using log track.log
</PRE>
<HR>
</P>
<P>La derni&egrave;re ligne est un indicateur de cr&ecirc;tes.</P>
<P>Il y a plusieurs touches de contr&ocirc;le pour le mode mixer&nbsp;:
<HR>
<PRE>
Action                                        Touche Canal 1  Touche Canal 2
~~~~~~                                        ~~~~~~~~~~~~~~  ~~~~~~~~~~~~~~
S&eacute;lectionne la piste suivante sur le canal    1               a
S&eacute;lectionne la piste pr&eacute;c&eacute;dente sur le canal  q               z
D&eacute;marre/Arr&egrave;te le canal                       2               s
R&eacute;initialise le canal                         w               x
Augmente le volume sur le canal               3               d
Diminue le volume sur le canal                e               c
Augmente la vitesse sur le canal              4               f
Diminue la vitesse sur le canal               r               v
Mode Sticky Activ&eacute;/Al&eacute;atoire/D&eacute;sactiv&eacute;        5               g
Pr&eacute;visualisation du canal                     t               b
Piste al&eacute;atoire                               u               m
</PRE>
<HR>
</P>
<P>Le fichier de configuration liveice.cfg est pr&eacute;vu pour le mode mixer. Pour
utiliser LiveIce en mode audio, changez la ligne relative &agrave; MIXER en NOMIXER
et changez la ligne NO_SOUNDCARD en SOUNDCARD et red&eacute;marrez LiveIce.</P>
<P>Tout oubli de positionner les options correctement am&egrave;nera &agrave; des avertissements
int&eacute;ressants ;-)
<HR>
<PRE>
   946:Error: Line In mode *and* no soundcard??????? Eeejit!
</PRE>
<HR>
</P>
<P>Une fois que tout est positionn&eacute; correctement et que vous avez plac&eacute; la source externe, vous
devriez &ecirc;tre capable de diffuser de la musique =:-)</P>
<P>
<HR>
<PRE>
[dj@megajukebox liveice]$ ./liveice
/megajukebox/playlist
0
Initialising Soundcard
16Bit 22050Hz Stereo Full Duplex 
opening connection to megajukebox 8000
Attempting to Contact Server
connection successful: forking process
opening pipe!...
writing password
Setting up Interface
Soundcard Reopened For Encoding
Input Format: 16Bit 22050Hz Stereo
Output Format: 32000 Bps Mpeg Audio
IceCast Server: megajukebox:8000
Mountpoint: /daves_band_live_at_the_club
Name: megajukebox - Dave and the Dynamite - Live at the Roxy  
Genre: Live/Rock
Url: http://megajukebox
Description: megajukebox::Louder than a frog in a trashcan..... and almost as musical

 Press '+' to Finish
Lvl: L:   8704 R:  11776 
</PRE>
<HR>
</P>
<P>La derni&egrave;re ligne est un indicateur de niveau du signal, si le signal est trop fort,
vous obtiendrez un avertissement *clip*. Si tel est le cas, r&eacute;duisez le gain
de la source en entr&eacute;e.</P>
<P>Ceux d'entre vous dot&eacute;s d'une vue per&ccedil;ante ont pu remarquer que dans le fichier de
configuration liveice.cfg, les premi&egrave;re lignes comment&eacute;es indiquent que le fichier
a &eacute;t&eacute; g&eacute;n&eacute;r&eacute; automatiquement. Si vous utilisez l'interface en Tk
liveiceconfigure.tk et que vous avez fait des changements &agrave; la main au fichier d'origine,
vous les perdrez quand vous sauverez. Utilisez soit uniquement l'interface ou apprenez vi/emacs :-)</P>

<H2><A NAME="ss11.2">11.2 Fluid</A>
</H2>

<P>Apr&egrave;s avoir d&eacute;compress&eacute; l'archive, placez vous dans le r&eacute;pertoire et n'oubliez
pas de lire le fichier README :-)</P>
<P>Fluid poss&egrave;de trois modes principaux de fonctionnement&nbsp;: la transmission, le relai et le transfert.
Je ne vais d&eacute;tailler ici que la transmission.</P>
<P>Les fichiers de configuration associ&eacute;s &agrave; la transmission sont situ&eacute;s dans config/MP3TX.cfg.
Pour tester le server, lancez-le avec les options suivantes, &agrave; ce moment-l&agrave;, les valeurs des param&egrave;tres  par
d&eacute;faut devraient &ecirc;tres correctes&nbsp;:</P>
<P>
<HR>
<PRE>
java Fluid TX
</PRE>
<HR>
</P>
<P>Naturellement vous devez avoir Java d'install&eacute; auparavant sous une forme ou une autre. Vous pouvez
utiliser le portage de Blackdown du JDK disponible &agrave; partir de 
<A HREF="http://www.blackdown.org">http://www.blackdown.org</A>
ou Keffe si vous utilisez Redhat.</P>
<P>Fluid est livr&eacute; avec quelques fichiers MP3 de test, donc si tout fonctionne, vous devriez voir
quelque chose de similaire &agrave; ceci (j'ai lanc&eacute; le serveur en utilisant Kaffe pour cette
exemple, vous pouvez avoir &agrave; le lancer en utilisant java)&nbsp;:
<HR>
<PRE>
[dj@megajukebox Fluid-Beta2J]$ kaffe Fluid tx
------- Fluid Streaming Server Beta 2 ------- 
This program is ShareWare(tm) and it will not 
be crippled in any way because of it. However 
if you do like the program and will use it    
commercial purposes, we ask of you to contact 
us at the address below for pricing info:     
                                              
 Eldean AB                  E-mail:           
 Sjoangsvagen 7             fluid@subside.com 
 S-192 72 Sollentuna                          
 SWEDEN                                       
                                              
   Fluid is Copyright Subside (C) 1998        
       written by Lars Samuelsson             
         http://www.subside.com               
--------------------------------------------- 

* Transmission mode *
Reading config from: config/MP3TX.cfg
Reading playlist: playlist.m3u
Server started on port: 2711
Accepting administrator login on port: 2710
P| Dr. Nick - Hello Everybody
</PRE>
<HR>

Si vous arrivez jusque l&agrave;, il semble que tout fonctionne, mais je suis certain que vous pr&eacute;f&eacute;reriez
diffuser plus que de simples fichiers de tests&nbsp;!</P>
<P>Vous devez cr&eacute;er une liste de MP3 que vous d&eacute;sirez diffuser. Il s'agit d'une liste fixe
que les utilisateurs ne pourront pas modifier ou faire de requ&ecirc;tes pr&eacute;cises. Cette liste est
nomm&eacute;e playlist.m3u et est situ&eacute;e par d&eacute;faut dans le r&eacute;pertoire racine.</P>
<P>Pour cr&eacute;er une liste de tous les fichiers MP3 d'un r&eacute;pertoire particulier (ou d'un disque),
utilisez la commande suivante&nbsp;:
<HR>
<PRE>
find [MP3 directory] -name "*.mp3" -print > playlist.m3u
</PRE>
<HR>

Par d&eacute;faut, le serveur utilise le port 2711, qui est celui sur lequel se connectent les programmes clients.
Si vous d&eacute;sirez le changer, ceci peut &ecirc;tre fait dans le fichier de configuration.</P>
<P>Le serveur peut &ecirc;tre administr&eacute; &agrave; distance en invoquant ainsi un telnet sur le port
d'administration, par d&eacute;faut le port 2710&nbsp;:
<HR>
<PRE>
[dj@megajukebox Fluid-Beta2J]$ telnet localhost 2710
Trying 127.0.0.1..megajukebox
Connected to localhost.localdomain.
Escape character is '^]'.
jaguar
You are connected to the -Fluid- Streaming Server
Type "help" for a command reference
help
The following commands are available:
 help conn curr exit
curr
Information about the currently broadcasted song:
Title:   Beer Talk
Artist:  Homer Simpson
Album:   The Simpsons
Year:    1996
Comment: Borrowed this as an example
Genre:   Comedy
</PRE>
<HR>

La r&eacute;f&eacute;rence &agrave; "jaguar" est le mot de passe par d&eacute;faut. Il n'y a pas
d'indication de demande du mot de passe, donc n'attendez pas &agrave; en avoir une&nbsp;! Je vous conseille de
changer le mot de passe positionn&eacute; par d&eacute;faut sinon vous vous exposez &agrave; une intrusion&nbsp;!
Ceci peut &ecirc;tre chang&eacute; dans le fichier de configuration qui ressemble &agrave; ceci&nbsp;:
<HR>
<PRE>
[dj@megajukebox config]$ cat MP3TX.cfg 
2711
2710
5
4096
32
1000
jaguar
playlist.m3u
current.txt

# --- Les lignes sont ---
# 1. num&eacute;ro du port (que le serveur utilise)
# 2. num&eacute;ro du port (pour administrer le serveur &agrave; distance)
# 3. Nombre de connexions (que le serveur peut accepter)
# 4  Taille des paquets lors des lectures/envois (en octets)
# 5. D&eacute;bit des MP3 en ko/s (tous les MP3 doivent avoir le m&ecirc;me d&eacute;bit)
# 6. D&eacute;lai entre les chansons (en millisecondes)
# 7. Mot de passe pour l'administration &agrave; distance
# 8. Nom de la liste (liste au format .m3u)
# 9. Nom du fichier dans lequel &eacute;crire les informations de la chanson (&agrave; partir des marques ID3)
</PRE>
<HR>
 
Dire que la liste doit &ecirc;tre au format m3u veut dire qu'elle doit &ecirc;tre dans le m&ecirc;me format que celui
produit par la commande find cit&eacute;e auparavant.</P>

<H3>Mise &agrave; jour pour la version RC1 de Fluid</H3>


<P>Fluid a &eacute;t&eacute; mis &agrave; jour et a &eacute;t&eacute; diffus&eacute; sous licence GPL (Vas-y Lars&nbsp;!)</P>
<P>Voici les principales diff&eacute;rences&nbsp;:</P>
<P>
<UL>
<LI>Un nouveau format pour le fichier fluid.config</LI>
<LI>Un ouveau port par d&eacute;faut 4711</LI>
<LI>Une nouvelle m&eacute;thode pour d&eacute;marrer et arr&ecirc;ter le programme. Fluid utilise maintenant
les scripts <EM>fluid.start</EM> et <EM>fluid.stop</EM></LI>
<LI>Le code source est maintenant inclus dans le paquet. Super&nbsp;!</LI>
</UL>
</P>

<H2><A NAME="ss11.3">11.3 Litestream</A>
</H2>


<P>Litestream est semblable &agrave; Icecast dans son fonctionnement. Le syst&egrave;me est compos&eacute;
d'un serveur de diffusion et d'une source.</P>
<P>Pour d&eacute;marrer le serveur de diffusion, ex&eacute;cutez la commande avec le format suivant&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ litestream &lt;source port> &lt;stream host> &lt;stream port> &lt;max listeners> &lt;log ident> [&lt;yp host> &lt;yp port>]
</PRE>
<HR>
</P>
<P>Les options sont les suivantes&nbsp;:</P>
<P><EM>source port</EM> C'est le num&eacute;ro du port auquel vous connectez la source 'audio'.</P>
<P><EM>stream host</EM> Il s'agit de l'adresse IP ou nom complet (FQDN) de votre serveur. Vous pouvez la
d&eacute;terminer avec la commande hostname pour le nom de domaine ou par un cat /etc/hosts pour l'adresse IP.</P>
<P><EM>stream port</EM> C'est le num&eacute;ro du port auquel les clients doivent se connecter.</P>
<P><EM>max listeners</EM> Il s'agit du nombre maximum de clients pouvant se connecter &agrave; votre serveur.</P>
<P><EM>log ident</EM> Les messages d'information seront &eacute;crits dans le fichier /var/log/messages. 
&lt;log ident&gt; est une cha&icirc;ne de caract&egrave;re utilis&eacute;e pour identifier le serveur Litestream.</P>

<P>Par exemple, si vous utilisez la cha&icirc;ne ident 'Litestream', les messages du serveur dans le fichier
/var/log/messages seront semblables &agrave;&nbsp;:</P>
<P>
<HR>
<PRE>
Sep 18 19:32:20 linux Litestream[1901]: stream.c:555: main: 'server started'
</PRE>
<HR>
</P>
<P><EM>yp host &amp; yp port</EM> Ces 2 options sp&eacute;cifient l'h&ocirc;te et le port d'un serveur yp (ou NIS) utilis&eacute;
pour annoncer votre serveur aux serveurs de r&eacute;pertoires.</P>
<P>Voici un exemple&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ litestream 5000 megajukebox 5555 1000 LitestreamServer 
</PRE>
<HR>
</P>
<P>Cette partie est pour le syst&egrave;me serveur. Une fois d&eacute;marr&eacute;, il attend
qu'une source audio lui soit connect&eacute;e, ce qui se fait avec la commande source.</P>
<P>Le format est tel que&nbsp;:</P>
<P>
<HR>
<PRE>
source &lt;ip or hostname> &lt;port> &lt;name> &lt;genre> &lt;url> &lt;irc> &lt;icq> &lt;aim> &lt;public? (0, 1)> &lt;reported bitrate (16, 18, 56, 128, etc.)> &lt;playlist.txt> &lt;log ident>
</PRE>
<HR>
 </P>
<P>Voici ci-dessous la liste des options pour la commande source&nbsp;:</P>

<P><EM>ip or hostname</EM> est le nom d'h&ocirc;te ou l'adresse IP de l'ordinateur faisant touner
le serveur Litestream.</P>
<P><EM>port</EM> est le port sur lequel le serveur Litestream attend une source de diffusion.</P>
<P><EM>name</EM> est le nom de votre flux.</P>
<P><EM>genre</EM> est le genre de votre flux.</P>
<P><EM>url</EM> est l'URL de la page web de votre flux.</P>
<P><EM>irc</EM> est le channel IRC de votre flux.</P>
<P><EM>icq</EM> est votre identifiant ICQ.</P>
<P><EM>aim</EM> est votre identifiant AIM.</P>
<P><EM>public</EM> est positionn&eacute; &agrave; 0 ou &agrave; 1. 0 pour priv&eacute;, 1 pour publique.</P>
<P><EM>reported bitrate</EM> est le d&eacute;bit du flux qui sera indiqu&eacute; au serveur YP. Ceci ne
refl&egrave;te pas n&eacute;cessairement le d&eacute;bit r&eacute;el de votre flux.</P>
<P><EM>playlist.txt</EM> est le nom du fichier contenant la liste de MP3.</P>
<P><EM>log ident</EM> est l'identifiant syslog qui pr&eacute;c&egrave;dera chaque message d'information
g&eacute;n&eacute;r&eacute; par la source de diffusion Litestream.</P>
<P>Voici un exemple de la commande Litestream pr&eacute;sent&eacute;e ci-dessus&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ source megakukebox 5000 'Megajukebox  The best jukebox ever' Various  http://www.megajukebox.com \#megajukebox 0 N/A 1 128 /jukebox/playlist LitestreamSource
</PRE>
<HR>
</P>

<H2><A NAME="ss11.4">11.4 Apache::MP3 Module</A>
</H2>


<P>Le module Apache::MP3 permet au serveur Apache de diffuser des MP3. Il n'offre pas le m&ecirc;me niveau de
fonctionnalit&eacute;s que les serveurs Fluid, Litestream et Icecast.</P>
<P>Ce module d&eacute;pend des modules MP3::Info et mod_perl, lesquels sont tous deux disponibles sur le site du CPAN.</P>
<P>Apr&egrave;s avoir r&eacute;cup&eacute;r&eacute; les fichiers n&eacute;cessaires, lire le fichier
README vous aidera certainement&nbsp;!</P>
<P>Tout d'abord, compilez le module, puis faites les changements au fichier de configuration d'Apache
(ces changements devront &ecirc;tre faits soit dans le fichier httpd.conf ou dans le fichier srm.conf).</P>
<P>Vous devez &eacute;galement cr&eacute;er les r&eacute;pertoires pour les ic&ocirc;nes et une arborescence
de r&eacute;pertoire pour les MP3.</P>
<P>La section 6 du fichier README d&eacute;taille l'&eacute;dition (ou la cr&eacute;ation)
d'un fichier de configuration Perl. Ceci est n&eacute;cessaire pour pr&eacute;charger
le module MP3::Info sans lequel il peut faire planter le serveur Apache.</P>
<P>Dans le fichier httpd.conf, cr&eacute;ez une entr&eacute;e comme ceci&nbsp;:
<HR>
<PRE>
 Perlrequire /etc/httpd/conf/startup.perl
</PRE>
<HR>
</P>
<P>Modifiez la r&eacute;f&eacute;rence /etc/httpd/conf pour pointer sur l'endroit o&ugrave; sont stock&eacute;s
les fichiers de configuration Apache sur votre syst&egrave;me.</P>
<P>Cr&eacute;ez maintenant le fichier startup.perl &agrave; l'emplacement
sp&eacute;cifi&eacute; ci-dessus. Vous devriez avoir au minimum les lignes suivantes (vous
devriez ici aussi ajuster l'emplacement du programme perl selon la
configuration de votre syst&egrave;me).</P>
<P>
<HR>
<PRE>
[dj@megajukebox conf]$ cat /etc/httpd/conf/startup.perl

#!/usr/bin/perl

use MP3::Info();
</PRE>
<HR>
</P>
<P>Red&eacute;marrez ensuite le serveur Apache et positionnez votre navigateur web vers l'un
de vos nouveaux r&eacute;pertoires de MP3 :-)</P>
<P>Vous pourrez obtenir plus de documentation sur le module Apache::MP3 en ex&eacute;cutant la ligne
suivante sur la ligne de commande&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox conf]$ perldoc Apache::MP3
</PRE>
<HR>
</P>

<H2><A NAME="ss11.5">11.5 Outrepasser un pare-feu</A>
</H2>

<P>Une grande quantit&eacute; de soci&eacute;t&eacute;s et d'administrations utilisent des syst&egrave;mes pare-feux
pour emp&ecirc;cher les utilisateurs de se connecter sur des serveurs distants sur certains ports.</P>
<P>Une fa&ccedil;on d'outrepasser ceci est d'ex&eacute;cuter votre serveur de MP3 en utilisant le port 80.
Il ne sera plus possible alors d'avoir un serveur web sur la m&ecirc;me URL ou la m&ecirc;me adresse IP.</P>
<P>En lan&ccedil;ant Icecast en mode 'Outrepasser le pare-feu', vous devrez alors lancer shout en
utilisant l'option positionnant le port &agrave; 80, ainsi&nbsp;:</P>

<P>
<HR>
<PRE>
[dj@megajukebox bin]$ ./shout megajukebox -e 80 -P hackme -p ../playlist 
</PRE>
<HR>
</P>

<H2><A NAME="ss11.6">11.6 Consid&eacute;rations de bande passante</A>
</H2>

<P>Diffuser de l'audio peut consommer des quantit&eacute;s importantes de bande passante si le d&eacute;bit des
serveurs de MP3 est trop &eacute;lev&eacute;.</P>
<P>Consid&eacute;rons, par exemple, ce sc&eacute;nario. Une liaison T1 poss&egrave;de une capacit&eacute; d'environ
1,55&nbsp;Mo/s. Si vous diffusez vos MP3 en 128&nbsp;kb/s st&eacute;r&eacute;o, chaque lecteur connect&eacute; utilisera
256&nbsp;kb/s, ainsi 6 utilisateurs seulement pourront se connecter &agrave; votre serveur MP3 en m&ecirc;me temps sans
probl&egrave;me. Et &agrave; ce d&eacute;bit, vous n'aurez gu&egrave;re d'utilisateurs se connectant par modem&nbsp;!</P>
<P>Vous devez donc prendre une d&eacute;cision concernant non seulement le d&eacute;bit auquel votre serveur est connect&eacute;
&agrave; l'Internet, mais aussi celui auquel vos utilisateurs seront connect&eacute;s. 24&nbsp;kb/s st&eacute;r&eacute;o semble
donner une qualit&eacute; de signal raisonnable auquel m&ecirc;me les utilisateurs poss&eacute;dant un modem 56K pourront se connecter et
qui autorise environ 32 connexions simultan&eacute;es par la liaison T1 &eacute;voqu&eacute;e plus haut.</P>

<P>Si votre serveur tourne sur un intranet, les probl&egrave;mes de bande passante peuvent encore &ecirc;tre
&agrave; consid&eacute;rer, sp&eacute;cialement si votre r&eacute;seau fonctionne en 10&nbsp;Mb/s.</P>
<P>Mais n'oubliez surtout pas de pr&eacute;venir votre FAI ou votre administrateur syst&egrave;me que
vous allez faire de la diffusion, sinon vous pourriez avoir une mauvaise surprise. Certains FAI peuvent
vous faire payer la bande passante au-del&agrave; d'une certaine limite et les administrateurs syst&egrave;mes
aiment bien savoir pourquoi leur r&eacute;seau ralentit :-)</P>

<H2><A NAME="ss11.7">11.7 Probl&egrave;mes de copyright</A>
</H2>


<P>Je pense qu'il est sens&eacute; de supposer que les compagnies de disques n'aimeraient pas que vous fassiez
de la diffusion audio sans leur permission ou sans paiement d'aucune sorte&nbsp;! Alors, qu'avez-vous le droit de diffuser&nbsp;?</P>
<P>Il s'agit d'une partie dans laquelle vous devez &ecirc;tre conscient des ramifications l&eacute;gales car c'est vous
qui serez l&eacute;galement responsable.</P>
<P>Voici deux liens, l'un de l'Electronic Frontier Foundation (EFF) qui milite pour r&eacute;duire les restrictions
concernant la technologie. L'autre lien est celui de la Recording Industry Association of America (RIAA),
qui cherche &agrave; prot&eacute;ger les droits des artistes contre le piratage.</P>
<P>Je vous sugg&egrave;re fortement de visiter ces deux sites, ainsi que d'autres plus sp&eacute;cifiques &agrave;
votre localisation physique.</P>
<P>
<A HREF="http://www.eff.org/cafe/">http://www.eff.org/cafe/</A></P>
<P>
<A HREF="http://www.riaa.com/weblic/weblic.htm">http://www.riaa.com/weblic/weblic.htm</A></P>

<P>NdT&nbsp;: on peut citer en France le site de la SACEM 
<A HREF="http://www.sacem.org">http://www.sacem.org</A> pour la protection des droits
d'auteurs des artistes et celui de l'AFUL 
<A HREF="http://www.aful.org">http://www.aful.org</A> pour la d&eacute;fense des libert&eacute;s
des citoyens par rapport aux nouvelle technologies (en plus de promouvoir les logiciels libres).</P>

<H2><A NAME="s12">12. Ecouter des MP3</A></H2>

<P>Maintenant, vous devriez (on l'esp&egrave;re du moins) avoir quelques fichiers MP3 pr&ecirc;ts &agrave; lire
et vous devriez avoir le choix de lire les fichiers ou les flux de MP3.</P>

<H2><A NAME="ss12.1">12.1 Lire &agrave; partir de fichiers</A>
</H2>


<P>Lire &agrave; partir d'un fichier est &agrave; peu de chose pr&egrave;s identique avec tous les lecteurs.
La seule diff&eacute;rence importante est que certains sont bas&eacute;s sur la ligne
de commande et d'autres sur une interface graphique.</P>
<P>Lire un fichier MP3 demande g&eacute;n&eacute;ralement de fournir en param&egrave;tre le nom du fichier, comme ceci&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ mpg123 /mp3_files/SampleFile.mp3

ou

[dj@megajukebox]$ xaudio /mp3_files/SampleFile.mp3
</PRE>
<HR>
</P>
<P>Si vous d&eacute;sirez jouer une s&eacute;rie de fichiers, passez-les tous dans une liste&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ alsaplayer /mp3_files/SampleFile1.mp3 /mp3_files/SampleFile2.mp3
</PRE>
<HR>
</P>
<P>Pour lire toutes les chansons d'un r&eacute;pertoire, il suffit de passer les fichiers par le caract&egrave;re
g&eacute;n&eacute;rique ainsi&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ xmms /mp3_files/*.mp3
</PRE>
<HR>
</P>
<P>Lire un flux de fichier MP3 est relativement simple, remplacez simplement le nom du fichier
par l'URL du flux et son num&eacute;ro du port&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ mpg123 http://localhost:8000

ou

[dj@megajukebox]$ freeamp http://megajukebox:2711
</PRE>
<HR>
</P>

<H2><A NAME="ss12.2">12.2 Capturer des flux MP3</A>
</H2>

<P>Un flux provenant d'un serveur MP3 peut &ecirc;tre captur&eacute; et sauv&eacute; localement en utilisant
le programme suivant&nbsp;:</P>

<H3>Streamripper</H3>


<P>Pour capturer un flux MP3 en utilisant Streamripper, ex&eacute;cutez la commande suivante&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ streamripper -h megajukebox -p 8000 
Press CTRL-C to stop
name: Megajukebox 
reponse: 200
genre: Megajukebox 
url: http://www.megajukebox.com/
bitrate: 128
This stream contains no meta data, ripping as one large ass track
1st track ripped
socket error: : Success
</PRE>
<HR>
</P>
<P>Voici une liste des options disponibles.</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ streamripper 
Usage: streamripper -h &lt;host> -p &lt;port> [-d dir]
Options:
        -h &lt;host>      - N&eacute;cessaire~: Nom de l'h&ocirc;te
        -p &lt;port>      - N&eacute;cessaire~: Num&eacute;ro de port de l'h&ocirc;te, habituellement 8000
        -d &lt;dir>       - Optionnel~: Le r&eacute;pertoire de destination
        -l &lt;logfile>   - Optionnel~: Envoie tout vers le fichier journal &lt;logfile>
        -v             - Optionnel~: Mode verbeux
        -c             - Optionnel~: Ne pas afficher le compteur de status
        -q             - Optionnel~: Mode discret, ne pas cr&eacute;er les fichiers MP3
        -s             - Optionnel~: Envoyer le flux vers la sortie standard stdout pour mpg123
        -n             - Optionnel~: Attendre la prochaine piste avant &eacute;criture
        -o             - Optionnel~: Cr&eacute;er un r&eacute;pertoire avec le nom du flux en sortie
</PRE>
<HR>
</P>

<H3>wget</H3>

<P>Pour sauver un flux en utilisant wget&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox]$ wget http://megajukebox:8000 -O download01.mp3
--13:41:41--  http://megajukebox:8000/
           => `download01.mp3'
Connecting to megajukebox:8000... connected!
HTTP request sent, awaiting response... 200 OK
Length: unspecified [audio/mpeg]

    0K -> .......... .......... .......... .......... ..........
   50K -> .......... .......... .......... .......... ..........
  100K -> .......... .......... .......... .......... ..........
  150K -> .......... .......... .......... .......... ..........
  200K -> .......... .......... .......... .......... ..........
  250K -> .......... .......... .......... .......... ..........
  300K -> .......... .......... .......... .......... ..........
  350K -> .......... .......... .......... .......... ..........
  400K -> .......... .......... .......... .......... ..........
  450K -> .......... .......... .......... .......... ..........
  500K -> .......... .......... .......... .......... ..........
</PRE>
<HR>
</P>

<H2><A NAME="ss12.3">12.3 Mixage</A>
</H2>



<H3>eMixer</H3>


<P>eMixer vous donne la possiblit&eacute; de mixer des MP3 de fa&ccedil;on semblable &agrave; une table
de mixage de DJ. Les nouvelles versions supportent 2 cartes sons si bien que vous pouvez &eacute;mettre
votre mixage sur une carte et g&eacute;rer ou poser des marques sur la piste suivante sur l'autre carte.</P>
<P>Comme &agrave; l'habitude, une fois que vous avez d&eacute;compress&eacute; l'archive, lisez le fichier
README pour savoir comment installer le programme.</P>
<P>Vous aurez besoin de cr&eacute;er une liste de fichiers MP3, ce que vous pouvez faire avec la commande
find cit&eacute;e dans la section Diffusion de MP3 sur un r&eacute;seau.</P>
<P>Vous devrez avoir install&eacute; auparavant le programme mpg123 avant de pouvoir lancer eMixer.</P>
<P>Voici les touches de contr&ocirc;les (tir&eacute;es du fichier README)&nbsp;:</P>
<P>
<HR>
<PRE>
TOUCHES DE CONTROLES
"up, down"              parcourt la liste
"page up, page down"    parcourt la liste &eacute;cran par &eacute;cran
"enter"                 d&eacute;marre/arr&egrave;te la lecture de la piste
"tab"                   change le canal
"}","]"                 bascule entre les contr&ocirc;les/fen&ecirc;tres de volume et de vitesse
"space"                 red&eacute;marre la piste active
"left, right"           contr&ocirc;le l'att&eacute;nuateur
"insert"                diminue le volume/la vitesse sur le canal un
"home"                  augmente le volume/la vitesse sur le canal un
"delete"                diminue le volume/la vitesse sur le canal deux
"end"                   augmente le volume/la vitesse sur le canal deux
"&lt; , / , >"             position ajust&eacute;e &agrave; droite, au centre, &agrave; gauche de l'att&eacute;nuateur
" + , = "   (NOUVEAU)   bascule entre les att&eacute;nuateurs
" q "                   d&eacute;marre/arr&egrave;te le canal un
" w "                   d&eacute;marre/arr&egrave;te le canal deux
" p "                   bascule entre les modes d'&eacute;coute - simple, boucle, continue, al&eacute;atoire
" a "                   arr&egrave;te tous les canaux
" f "                   menu fichier
" u "                   menu utilitaire
" h "                   menu aide
" ~, ` "                annule l'ouverture du menu
" s "                   active la lecture SIM
                        (la lecture SIM d&eacute;marre la m&ecirc;me piste sur les deux canaux en m&ecirc;me temps) 
</PRE>
<HR>
</P>


<H3>GDAM</H3>

<P>GDAM est un mixer graphique avec un large &eacute;ventail d'effets int&eacute;gr&eacute; et temps r&eacute;els.</P>

<H2><A NAME="s13">13. Edition des marques ID3</A></H2>


<P>Les marques ID3 sont des champs d'information sur la chanson contenus dans les donn&eacute;es du fichier MP3
tels que le nom de l'artiste, l'album d'o&ugrave; provient la chanson, etc.
Des &eacute;diteurs vous permettent d'afficher et d'&eacute;diter ces informations.</P>


<H2><A NAME="ss13.1">13.1 id3ed</A>
</H2>


<P>
<HR>
<PRE>
[dj@megajukebox]$ id3ed 
id3ed v1.10 - mpeg layer 3 file information editor
Usage: id3ed [-s songname] [-n artist] [-a album] [-y year] [-c comment]
             [-k tracknum] [-g genre] [-q] [-SNAYCKG] [-l/-L] [-r]
             [-i] &lt;mp3files> [-v]

  -q                    Pas d'interface en ligne ; positionne seulement les marques sp&eacute;cifi&eacute;s sur
                        la ligne de commande. Utilis&eacute;e deux fois, cette option supprime tous les messages
                        except&eacute; les erreurs.
  -SNAYCKG              Affiche une invite pour &eacute;diter seulement la marque sp&eacute;cifique.
                        Les autres marques peuvent toujours &ecirc;tre &eacute;dit&eacute;es avec les options -[snaycg].
  -l/-L                 Affiche la liste des genres
  -r                    Supprime les marques ID3 des fichiers
  -i                    Affiche les marques ID3 sans les modifier
  -v                    Affiche la version et la licence du programme
</PRE>
<HR>
</P>

<P>
<HR>
<PRE>
[dj@megajukebox MyBand]$ id3ed track01.mp3 

File track01.mp3: (tag v1.1)
songname[max:30]: Our Kick Ass Demo
artist[max:30]: Us       
album[max:30]: White Album
year[max:4]: 1999
comment[max:28]: Will be a classic some day!
tracknum[max:3]: 1
genre[0-255/name]: 5     
</PRE>
<HR>
</P>
<P>Si nous voulons maintenant afficher les informations ID3 de la piste, nous lan&ccedil;ons id3ed avec l'option -i ainsi&nbsp;:</P>
<P>
<HR>
<PRE>
[dj@megajukebox MyBand]$ id3ed -i track01.mp3 
track01.mp3: (tag v1.1)
songname: Our Kick Ass Demo
artist: Us
album: White Album
year: 1999
comment: Will be a classic some day!
tracknum: 1
genre: Funk(5)
</PRE>
<HR>
</P>

<H2><A NAME="ss13.2">13.2 mp3info</A>
</H2>

<P>MP3info travaille de fa&ccedil;on similaire &agrave; id3ed, voici un extrait du manual&nbsp;:</P>
<P>
<HR>
<PRE>
SYNOPSIS
       mp3info [ -option &lt; value > ] filename[s]...

DESCRIPTION
       Il s'agit d'un petit outil pour r&eacute;cup&eacute;rer et positionner les informations des MP3.

OPTIONS
       -T     Ne PAS r&eacute;cup&eacute;rer les marques ID3. A utiliser pour les m&eacute;dias d'acc&egrave;s lents
              car les marques sont situ&eacute;es &agrave; la toute fin du fichier MP3

       -s &lt;0/1>
              Afficher les informations. Vraiment obsol&egrave;te, car cette option devrait toujours
              &ecirc;tre activ&eacute;e. Par d&eacute;faut &agrave; 1.

       -f &lt;format>
              Format de la cha&icirc;ne de caract&egrave;res affich&eacute;e. Voir le fichier README pour plus de d&eacute;tails.

       -F &lt;Formatnumber>
              Format pr&eacute;d&eacute;fini pour la cha&icirc;ne de caract&egrave;re affich&eacute;e. Essayez l'option.

       -w     Ecrire les marques ID3 &agrave; la fin du fichier.

       -W     Supprimer les marques ID3. Est prioritaire sur toutes les options concernant les marques ID3 et
              positionne l'option -s &agrave; d&eacute;sactiv&eacute;e. Pour &agrave; la fois supprimer les
              marques ID3 et afficher les informations, utilisez -W -s 1

       -n &lt;name>
              Positionne le titre de la chanson. Induit l'option -w. Cette option devrait &ecirc;tre supprim&eacute;e sous peu,
              utilisez plut&ocirc;t l'option -t &agrave; la place.

       -t &lt;name>
              Positionne le titre de la chanson. Alias de l'option -n. Induit l'option -w.

       -a &lt;artist>
              Positionne le nom de l'artiste. Induit l'option -w.

       -l &lt;album>
              Positionne le nom de l'album. Induit l'option -w.

       -y &lt;year>
              Positionne l'ann&eacute;e de publication. Induit l'option -w.

       -c &lt;comment>
              Positionne le commentaire. Induit l'option -w.

       -g &lt;genre>
              Positionne le num&eacute;ro du genre. Induit l'option -w.

       -G &lt;genrename>
              Positionne le genre par son nom. Induit l'option -w.
</PRE>
<HR>
</P>



<H2><A NAME="ss13.3">13.3 Codes des genres ID3</A>
</H2>

<P>ID3 utilise un code pour r&eacute;f&eacute;rencer les genres de musique, voici une liste des codes extraite de 
<A HREF="http://www.id3.org/id3v2-00.txt">http://www.id3.org/id3v2-00.txt</A>.</P>
<P>
<HR>
<PRE>
Les genres suivants sont d&eacute;finis dans la norme ID3v1&nbsp;:

      0.Blues
      1.Classic Rock
      2.Country
      3.Dance
      4.Disco
      5.Funk
      6.Grunge
      7.Hip-Hop
      8.Jazz
      9.Metal
     10.New Age
     11.Oldies
     12.Other
     13.Pop
     14.R&amp;B
     15.Rap
     16.Reggae
     17.Rock
     18.Techno
     19.Industrial
     20.Alternative
     21.Ska
     22.Death Metal
     23.Pranks
     24.Soundtrack
     25.Euro-Techno
     26.Ambient
     27.Trip-Hop
     28.Vocal
     29.Jazz+Funk
     30.Fusion
     31.Trance
     32.Classical
     33.Instrumental
     34.Acid
     35.House
     36.Game
     37.Sound Clip
     38.Gospel
     39.Noise
     40.AlternRock
     41.Bass
     42.Soul
     43.Punk
     44.Space
     45.Meditative
     46.Instrumental Pop
     47.Instrumental Rock
     48.Ethnic
     49.Gothic
     50.Darkwave
     51.Techno-Industrial
     52.Electronic
     53.Pop-Folk
     54.Eurodance
     55.Dream
     56.Southern Rock
     57.Comedy
     58.Cult
     59.Gangsta
     60.Top 40
     61.Christian Rap
     62.Pop/Funk
     63.Jungle
     64.Native American
     65.Cabaret
     66.New Wave
     67.Psychadelic
     68.Rave
     69.Showtunes
     70.Trailer
     71.Lo-Fi
     72.Tribal
     73.Acid Punk
     74.Acid Jazz
     75.Polka
     76.Retro
     77.Musical
     78.Rock &amp; Roll
     79.Hard Rock
     
   LEs genres suivants sont des extensions de Winamp&nbsp;:
     
     80.Folk
     81.Folk-Rock
     82.National Folk
     83.Swing
     84.Fast Fusion
     85.Bebob
     86.Latin
     87.Revival
     88.Celtic
     89.Bluegrass
     90.Avantgarde
     91.Gothic Rock
     92.Progressive Rock
     93.Psychedelic Rock
     94.Symphonic Rock
     95.Slow Rock
     96.Big Band
     97.Chorus
     98.Easy Listening
     99.Acoustic
    100.Humour
    101.Speech
    102.Chanson
    103.Opera
    104.Chamber Music
    105.Sonata
    106.Symphony
    107.Booty Bass
    108.Primus
    109.Porn Groove
    110.Satire
    111.Slow Jam
    112.Club
    113.Tango
    114.Samba
    115.Folklore
    116.Ballad
    117.Power Ballad
    118.Rhythmic Soul
    119.Freestyle
    120.Duet
    121.Punk Rock
    122.Drum Solo
    123.A capella
    124.Euro-House
    125.Dance Hall
</PRE>
<HR>
</P>

<H2><A NAME="s14">14. Conversion MP3 vers Minidisc.</A></H2>

<P><EM>Par Afra &lt;afra@prongs.org&gt; </EM></P>
<P>Pour enregistrer des MP3 &agrave; partir de Linux vers votre Minidisc, il existe
deux m&eacute;thodes&nbsp;: analogique et num&eacute;rique. Chaque m&eacute;thode d&eacute;pend du
type de carte son dont vous disposez sur votre syst&egrave;me Linux. La principale diff&eacute;rence
entre les enregisrements analogiques et num&eacute;riques tient dans la qualit&eacute; sonore que
vous atteindrez pendant l'enregistement.
Avec un enregistement analogique, il est possible que vous entendiez des bruits
statiques ou flous, bien que la plupart des cartes analogiques tentent de minimiser
ces effets. N'allez pas croire que, parce que vos n'avez qu'une carte son analogique, vous
&ecirc;tes condamn&eacute;, parce que ce n'est pas le cas. C'est juste qu'il vous faudra passer un peu
de temps &agrave; essayer de minimiser les bruits ind&eacute;sirables en ajustant les param&egrave;tres
du mixeur.</P>
<P>Aucun logiciel sp&eacute;cifique n'est n&eacute;cessaire, un simple lecteur de MP3 suffit pour
votre syst&egrave;me Linux. Fondamentalement, les deux m&eacute;thodes n&eacute;cessitent
une connexion entre la sortie de votre carte son et l'entr&eacute;e de votre Minidisc.</P>

<H2><A NAME="ss14.1">14.1 Enregistrement analogique</A>
</H2>

<P>Si votre carte son ne dispose pas d'une sortie "Digital Out", vous pouvez
vouloir utiliser l'enregistrement analogique.</P>
<P>Pour enregistrer un fichier MP3 de votre syst&egrave;me Linux vers votre Minidic,
connectez un cordon de la sortie de votre carte son Line Out vers l'entr&eacute;e de
votre Minidisc Line In. Positionnez votre Minidisc en mode enregistrement comme vous
le feriez habituellement et lisez le fichier MP3. Vous devriez noter que les niveaux
d'enregistrements du Minidisc augmentent. Apr&egrave;s la lecture, il est
possible que vous notiez un petit ou un grand volume de bruit statique d&ucirc; &agrave; votre
carte son.</P>
<P>Pour r&eacute;duire le bruit statique pendant l'enregistrement, gardez les niveaux
d'enregistrement et de volume dans la zone des -3&nbsp;dB &agrave; 0&nbsp;dB. Pour att&eacute;nuer le
bruit, vous pouvez essayer de positionner votre Minidisc en mode d'enregitrement, mais sans lire
le fichier MP3. Vous devriez encore entendre le bruit et pouvez alors jouer sur les effets
du mixeur pour le r&eacute;duire.</P>

<H2><A NAME="ss14.2">14.2 Enregistement num&eacute;rique</A>
</H2>

<P>Vous obtiendrez un son de meilleur qualit&eacute; avec un enregistrement
num&eacute;rique. Connectez votre cable optique (si vous devez en acheter
un, la taille du Minidisc et celle du port de la carte sont importantes,
il s'agit souvent de 3,5&nbsp;mm, mais v&eacute;rifiez les manuels utilisateurs
de la carte son et du Minidisc) &agrave; la sortie Digital Out de la carte
son.</P>
<P>                                       
Le cable devrait alors clignoter &agrave; l'autre bout, ce qui est un bon signe.
Connectez maintenant l'extr&eacute;mit&eacute; clignotante &agrave; l'entr&eacute;e Digital
Input de votre Minidisc. Positionnez votre Minidisc en mode enregistrement et lisez
le fichier MP3 sur votre ordinateur.</P>

<H2><A NAME="ss14.3">14.3 Liste de MP3</A>
</H2>

<P>C'est un probl&egrave;me lorsque vous lisez une liste de MP3&nbsp;: comment
votre Minidisc saura-t-il quand positionner une marque automatique
quand une piste passe &agrave; une autre (c'est-&agrave;-dire changer de num&eacute;ro
de piste automatiquement)&nbsp;? La solution est ce fichier MP3 que vous pouvez
r&eacute;cup&eacute;r&eacute; de 
<A HREF="http://www.prongs.org/minidisc/2sec.zip">http://www.prongs.org/minidisc/2sec.zip</A>. </P>
<P>Vous pouvez utiliser ce fichier qui est un fichier MP3 contenant 2 secondes
de silence, en l'ins&eacute;rant avant chaque fichier MP3 de votre liste,
ainsi le Minidisc saura comment faire le marquage automatique.</P>

<H2><A NAME="s15">15. Retours et commentaires</A></H2>

<P>De nouveaux mat&eacute;riels et logiciels sortent sans cesse. Si vous utilisez des
versions plus r&eacute;centes du mat&eacute;riel et/ou des logiciels d&eacute;crits dans ce HOWTO,
ou si vous pouvez ajouter quoi que ce soit, envoyez-moi vos informations &agrave;
<A HREF="mailto:phil@plus24.com">phil@plus24.com</A> pour que
je les rajoute &agrave; la prochaine version.</P>
<P>Bons MP3&nbsp;!</P>
</BODY>
</HTML>
