<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>UMSDOS HOW-TO</TITLE>
</HEAD>
<BODY>
<H1>UMSDOS HOW-TO</H1>

<H2>Jacques Gelinas, <CODE>jacques@solucorp.qc.ca</CODE></H2>v1.1, 13 November 1995
<HR>
<EM><EM>Umsdos</EM> est un syst&egrave;me de fichiers pour <EM>Linux</EM>. Il propose
une alternative au syst&egrave;me de fichiers <EM>EXT2</EM>. Son principal
but est de parvenir &agrave; une coexistence simplifi&eacute;e avec
les donn&eacute;es <EM>MS-DOS</EM> en partageant la m&ecirc;me partition.
Ce document explique tout d'abord comment utiliser <EM>Umsdos</EM> dans
diff&eacute;rentes configurations, puis son fonctionnement. Il se
termine par quelques informations qui devraient vous permettre de
d&eacute;cider si c'est un bon choix pour vous (cf. Pourquoi
UMSDOS &agrave; la fin de ce document).
Adaptation fran&ccedil;aise r&eacute;alis&eacute;e par Guillaume
Deschamps (Guillaume.Deschamps@enst-bretagne.fr)
Version de l'adaptation : v0.1b</EM>
<HR>
<H2><A NAME="s1">1. <EM>Umsdos</EM> : Pr&eacute;sentation</A></H2>



<H2><A NAME="ss1.1">1.1 Historique</A>
</H2>


<P>Le projet <EM>Umsdos</EM> a commenc&eacute; en 1992, et a
&eacute;t&eacute; disponible sur le r&eacute;seau sous forme de patch
en janvier 1994. Il a &eacute;t&eacute; inclus dans la distribution
standard du noyau en juillet, &agrave; partir de la version 1.1.36.</P>
<P><EM>Umsdos</EM> a &eacute;t&eacute; au d&eacute;part adopt&eacute; dans la
distribution <EM>Slackware</EM> avant m&ecirc;me d'&ecirc;tre inclus dans le
noyau officiel.</P>
<P><EM>Umsdos</EM> a commenc&eacute; &agrave; &ecirc;tre
am&eacute;lior&eacute; &agrave; partir de la version 1.1.60 du
noyau. Ses performances ont consid&eacute;rablement augment&eacute;, surtout
en ce qui concerne l'&eacute;criture. Il est de nouveau stable depuis
la version 1.1.70 (&agrave; peu pr&egrave;s).</P>
<P>Un bug majeur a &eacute;t&eacute; corrig&eacute; dans <EM>Linux</EM>
1.2.2. Ce bug causait des torts aux utilisateurs depuis le d&eacute;but
(certains fichiers &eacute;taient renomm&eacute;s sans avertissement, donnant
l'impression qu'ils avaient &eacute;t&eacute; effac&eacute;s). Attention ! La
<EM>Slackware</EM> 2.2 contient toujours la version 1.2.1 du noyau, donc
elle a ce bug.</P>

<H2><A NAME="ss1.2">1.2 Disponibilit&eacute;</A>
</H2>


<P>Il est disponible sous forme de patch pour les noyaus 1.0.x, et est
inclus dans le noyau 1.2. Il peut &ecirc;tre compil&eacute; avec le noyau ou
charg&eacute; comme un module. Cependant si vous d&eacute;cidez pour l'instant
d'utiliser <EM>Umsdos</EM> comme un module, il vous faudra aussi utiliser
le systeme de fichiers <EM>MS-DOS</EM> en tant que module. Cela vient d'une
limitation du syst&egrave;me de gestion des modules (certains symboles ne
sont export&eacute;s que lorsque les drivers sont eux-m&ecirc;mes des modules).</P>

<H2><A NAME="ss1.3">1.3 Distributions le supportant</A>
</H2>


<P>Dans l'&eacute;tat actuel des choses, seule la distribution <EM>Slackware</EM>
semble le supporter. Mais j'ai s&ucirc;rement tort donc n'h&eacute;sitez pas &agrave;
m'envoyer des corrections &agrave; ce sujet. (NdT : en anglais !)</P>

<H2><A NAME="ss1.4">1.4 Site d'accueil</A>
</H2>


<P>Le site d'accueil pour <EM>Umsdos</EM> est sunsite.unc.edu. Allez faire un
tour du c&ocirc;t&eacute; du r&eacute;pertoire
<CODE>/pub/Linux/system/Filesystems/umsdos</CODE>. </P>

<H2><A NAME="ss1.5">1.5 Documentation technique</A>
</H2>


<P>Il existe beaucoup de documentation sur la structure interne
de <EM>Umsdos</EM>, disponible &agrave; la fois aux formats
<CODE>HTML</CODE> et texte au m&ecirc;me endroit que les utilitaires.</P>
<P>Pour ce que j'en sais, la version <CODE>HTML</CODE> n'est pas disponible sur
WWW. Vous devez la t&eacute;l&eacute;charger, puis la "untarer" et finalement la
lire localement.</P>

<H2><A NAME="ss1.6">1.6 L'auteur</A>
</H2>


<P>Jacques Gelinas jacques@solucorp.qc.ca</P>

<H2><A NAME="s2">2. <EM>Umsdos</EM> comme partition principale</A></H2>



<H2><A NAME="ss2.1">2.1 Le concept pseudo-racine</A>
</H2>


<P>Avec <EM>Umsdos</EM>, <EM>Linux</EM> peut &ecirc;tre install&eacute; sur une partition
<EM>DOS</EM> standard. <EM>Linux</EM> est alors install&eacute; comme le second (ou
troisi&egrave;me) syst&egrave;me d'exploitation sur la partition. Pour &eacute;viter toute collision dans
les noms (il existe peut-&ecirc;tre d&eacute;j&agrave; un r&eacute;pertoire bin ou tmp sur le
lecteur C:), <EM>Umsdos</EM> a recours &agrave; une astuce : la pseudo-racine.</P>
<P>Tous les fichiers <EM>Linux</EM> sont install&eacute;s dans un sous-r&eacute;pertoire
<EM>DOS</EM> appel&eacute; <CODE>Linux</CODE>, g&eacute;n&eacute;ralement <CODE>C:\\LINUX</CODE>. La structure
normale des r&eacute;pertoires <EM>Linux/Unix</EM> se trouve l&agrave;. Vous
obtenez donc :</P>
<P>
<UL>
<LI> 
<PRE>
C:\LINUX\BIN
</PRE>
</LI>
<LI> 
<PRE>
C:\LINUX\ETC
</PRE>
</LI>
<LI> 
<PRE>
C:\LINUX\LIB
</PRE>
</LI>
<LI> 
<PRE>
C:\LINUX\ROOT
</PRE>
</LI>
<LI> 
<PRE>
C:\LINUX\SBIN
</PRE>
</LI>
<LI> 
<PRE>
C:\LINUX\TMP
</PRE>
</LI>
<LI> 
<PRE>
C:\LINUX\USR
</PRE>
</LI>
<LI> 
<PRE>
C:\LINUX\VAR
</PRE>
</LI>
</UL>
</P>
<P>Quand <EM>Umsdos</EM> d&eacute;marre, il cherche le r&eacute;pertoire <CODE>linux</CODE> puis
<CODE>/linux/etc</CODE>. S'il existe, il active le mode pseudo-racine.</P>
<P>Le mode pseudo-racine s'occupe principalement de rediriger le
repertoire racine vers <CODE>C:\\LINUX</CODE>, ce qui donne comme r&eacute;sultat un
r&eacute;pertoire <EM>Unix</EM> classique :</P>
<P>
<UL>
<LI>
<PRE>
/bin
</PRE>
</LI>
<LI>
<PRE>
/etc
</PRE>
</LI>
<LI>
<PRE>
/lib
</PRE>
</LI>
<LI>
<PRE>
/root
</PRE>
</LI>
<LI>
<PRE>
/sbin
</PRE>
</LI>
<LI>
<PRE>
/tmp
</PRE>
</LI>
<LI>
<PRE>
/usr
</PRE>
</LI>
<LI>
<PRE>
/var
</PRE>
</LI>
</UL>
</P>
<P>Il ajoute de plus &agrave; cette liste un nouveau r&eacute;pertoire appel&eacute;
<CODE>DOS</CODE>, qui est virtuel.</P>

<H2><A NAME="ss2.2">2.2 Ce qu'il faut savoir &agrave; propos du mode pseudo-racine</A>
</H2>

<P>
<UL>
<LI> Ce mode peut seulement &ecirc;tre activ&eacute; au moment du
d&eacute;marrage. Il n'y a aucun moyen de l'activer en utilisant
la commande mount.</LI>
<LI> Le m&eacute;canisme est juste de donner une vue diff&eacute;rente
d'un syst&egrave;me de fichiers <EM>Umsdos</EM> normal. Cela signifie
qu'une partition principale peut &ecirc;tre mont&eacute;e tout &agrave;
fait normalement. Il n'y aura pas d'effet pseudo-racine.

Par exemple, si vous d&eacute;marrez sous Linux avec une
disquette de maintenance et que vous montez votre
partition principale normale dans <CODE>/mnt</CODE>, vous
trouverez tous vos r&eacute;pertoires linux dans
<CODE>/mnt/linux/bin, /mnt/linux/etc</CODE> et ainsi de suite.</LI>
</UL>
</P>

<H2><A NAME="s3">3. Diff&eacute;rentes remarques au sujet du fonctionnement de <EM>Umsdos</EM></A></H2>



<H2><A NAME="ss3.1">3.1 Option de mount</A>
</H2>


<P>Vous pouvez utiliser les m&ecirc;mes options pour mount que pour le
syst&egrave;me de fichiers MS-DOS. L'utilisation de l'option <CODE>conv=</CODE> est
discutable sur un
syst&egrave;me <EM>Umsdos</EM>. Je propose de l'&eacute;viter. Les options que vous
aurez g&eacute;n&eacute;ralement &agrave; prendre en compte sont :</P>
<P>
<UL>
<LI>uid=</LI>
<LI>gid=</LI>
<LI>umask=</LI>
</UL>
</P>
<P>Il faut juste vous souvenir que <EM>Umsdos</EM> traite les r&eacute;pertoires
non promus de la m&ecirc;me fa&ccedil;on que <EM>MS-DOS</EM>. Les options
ci-dessus vont donc s'appliquer globalement &agrave; tous les r&eacute;pertoires
non promus. <EM>uid</EM> configure le propri&eacute;taire par d&eacute;faut,
<EM>gid</EM> le groupe par d&eacute;faut et <EM>umask</EM> les permissions par
d&eacute;faut sur les fichiers.</P>

<H2><A NAME="ss3.2">3.2 Comment d&eacute;terminer les valeurs par d&eacute;faut pour la partition principale</A>
</H2>


<P>umssetup a &eacute;t&eacute; cr&eacute;&eacute;e pour
d&eacute;terminer au
lancement le
propri&eacute;taire par d&eacute;faut de la partition principale. Pour les autres
partitions <EM>Umsdos</EM>, il est possible d'utiliser soit les options de
mount soit umssetup. La mani&egrave;re classique pour r&eacute;gler ce probl&egrave;me
pour les partitions non principales est de stocker les options de mount
dans /etc/fstab. Voici un exemple.
Mettez ceci dans /etc/rc.d/rc.S :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
                /sbin/umssetup -u jack -g group -m 0755 /
        
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss3.3">3.3 Swapper ou ne pas swapper</A>
</H2>


<P>L'utilisation d'un fichier de swap se r&eacute;v&egrave;le souvent plus lente que celle
d'une partition de swap. Cette solution est cependant bien plus
flexible. Vous pouvez configurer un fichier de swap dans une partition
<EM>Umsdos</EM> de la m&ecirc;me fa&ccedil;on que dans tout autre syst&egrave;me de
fichiers <EM>Linux</EM>. Par exemple, pour configurer un fichier de swap de 8
Mo dans le r&eacute;pertoire racine :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
                dd if=/dev/zero bs=1024k count=8 of=/swap
                mkswap /swap 8192
                sync
                swapon /swap
        
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Une fois cela fait, vous pouvez ajouter la ligne suivante dans
/etc/fstab :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
                /swap   swap    swap    default         
        
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Et le fichier de swap sera activ&eacute; &agrave; chaque d&eacute;marrage. (Il y a
g&eacute;n&eacute;ralement la commande "swapon -a" dans <CODE>/etc/rc.d/rc.S</CODE>.)</P>

<H2><A NAME="s4">4. Comment d&eacute;marrer un syst&egrave;me <EM>Umsdos</EM></A></H2>



<H2><A NAME="ss4.1">4.1 Loadlin</A>
</H2>


<P>Le paquetage lodlin15.tgz, disponible sur sunsite.unc.edu dans
<CODE>/pub/Linux/system/Bootutils</CODE>, est particuli&egrave;rement bien
adapt&eacute; au d&eacute;marrage d'un syst&egrave;me <EM>Umsdos</EM>. En g&eacute;n&eacute;ral, tout ce
que vous avez besoin de faire est</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        Boot DOS
        C:>loadlinx zimage root=D:
        
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>o&ugrave; zimage est une image normale du noyau (compress&eacute;e), tout
simplement copi&eacute;e quelque part sur le lecteur <EM>DOS</EM>. <CODE>D:</CODE> est le
lecteur <EM>DOS</EM> o&ugrave; vous avez install&eacute; <EM>Linux</EM>.</P>

<H2><A NAME="ss4.2">4.2 A partir d'une disquette</A>
</H2>


<P>D&eacute;marrer un syst&egrave;me <EM>Umsdos</EM> &agrave; partir d'une disquette se fait de
la m&ecirc;me mani&egrave;re que pour un syst&egrave;me <EM>Ext2</EM>. Vous avez besoin
d'une image zImage de votre noyau proprement initialis&eacute;e pour
localiser votre partition principale <EM>Umsdos</EM>. Pour ce faire, on
utilise g&eacute;n&eacute;ralement la commande <CODE>rdev</CODE>. La s&eacute;quence suivante
initialise un fichier zImage et le met sur une disquette :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        rdev zImage /dev/hda1
        rdev -R zImage 0
        dd if=zImage bs=8192 of=/dev/fd0
        
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si vous trouvez cela d&eacute;routant, formattez une disquette syst&egrave;me DOS et
copiez les fichiers suivants dessus :</P>
<P>
<UL>
<LI>loadlin.exe</LI>
<LI>loadlinx.exe</LI>
<LI>zimage</LI>
</UL>
</P>
<P>puis configurez le fichier autoexec.bat comme suit :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        loadlinx zimage rw root=C:
        
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss4.3">4.3 LILO</A>
</H2>


<P>LILO, le chargeur (boot-loader) officiel de <EM>Linux</EM> peut aussi &ecirc;tre
utilis&eacute; pour d&eacute;marrer un syst&egrave;me <EM>Umsdos</EM>. Cependant je n'ai
jamais essay&eacute;, mais &ccedil;a devrait marcher depuis la version
1.1.60. Merci de m'envoyer un e-mail (NdT : toujours en anglais !) si vous avez
fait l'exp&eacute;rience.</P>

<H2><A NAME="ss4.4">4.4 Comment d&eacute;fragmenter une partition <EM>Umsdos</EM></A>
</H2>


<P>Tout simplement en utilisant n'importe lequel des outils <EM>DOS</EM>
classiques. Les fichiers produits par <EM>Umsdos</EM> n'ont rien de
particulier. Et <EM>Umsdos</EM> n'attend rien de particulier (composition
ou s&eacute;quence des points d'entr&eacute;e des r&eacute;pertoires, etc.) du syst&egrave;me de fichier sur
lequel il travaille.</P>
<P>Pour ce que j'en sais, il n'existe pas d'outil sous <EM>Linux</EM> pour faire
&ccedil;a. </P>

<H2><A NAME="ss4.5">4.5 Astuces avanc&eacute;es</A>
</H2>


<P><EM>Umsdos</EM> repose sur <CODE>--linux-.---</CODE> qui repose lui-m&ecirc;me sur le 
r&eacute;pertoire <EM>DOS</EM>. Certains voudront peut-&ecirc;tre faire quelques 
exp&eacute;riences. L'utilitaire <CODE>udosctl</CODE> (dans le paquetage 
umsdos_progs, qui contient <CODE>umssync</CODE> et <CODE>umssetup</CODE>) permet de
faire des op&eacute;rations sur les r&eacute;pertoires (effacer, voir le contenu),
et ceci ind&eacute;pendamment sur le r&eacute;pertoire <CODE>--linux-.---</CODE> ou sur le
r&eacute;pertoire <EM>DOS</EM>.</P>

<H2><A NAME="s5">5. Principe de base</A></H2>



<H2><A NAME="ss5.1">5.1 Introduction</A>
</H2>


<P><EM>Umsdos</EM> fait directement correspondre aux fichiers <EM>Linux</EM> des
fichiers <EM>MS-DOS</EM>. C'est une transposition un pour un, et le contenu
des fichiers n'est pas alt&eacute;r&eacute; du tout. <EM>Umsdos</EM> travaille
seulement sur les noms de fichiers, et r&eacute;serve un traitement
particulier aux fichiers sp&eacute;ciaux (par exemple les liens ou les
fichiers p&eacute;riph&eacute;riques).</P>
<P>Pour chaque r&eacute;pertoire, il y a un fichier appel&eacute; <CODE>--linux-.---</CODE>.</P>

<H2><A NAME="ss5.2">5.2 <EM>Umsdos</EM> peut remplacer le syst&egrave;me de fichiers <EM>MS-DOS</EM></A>
</H2>


<P><EM>Umsdos</EM> peut &ecirc;tre vu comme un surensemble plus g&eacute;n&eacute;ral du
syst&egrave;me de fichiers <EM>MS-DOS</EM> de linux. En fait cette
capacit&eacute;/flexibilit&eacute; est la source de beaucoup de confusions au
sujet de <EM>Umsdos</EM>. Je vais vous expliquer pourquoi. Essayez de
monter une disquette <EM>DOS</EM> qui vient juste d'&ecirc;tre formatt&eacute;e de la
mani&egrave;re suivante :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        mount -t umsdos /dev/fd0 /mnt
        
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Puis fa&icirc;tes ceci :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        ls / >/mnt/LONGFILENAME
        ls -l /mnt
        
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Et vous obtiendrez le r&eacute;sultat suivant :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        -rwxr-xr-x   1 root     root          302 Apr 14 23:25 longfile
        
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Jusqu'ici, le syst&egrave;me de fichiers n'a pas l'air de faire grand chose
de plus (en fait m&ecirc;me rien) que le syst&egrave;me de fichiers <EM>MS-DOS</EM>
normal de <EM>Linux</EM>.</P>
<P><EM>???</EM></P>

<H2><A NAME="ss5.3">5.3 Promouvoir un r&eacute;pertoire</A>
</H2>


<P>Jusqu'ici &ccedil;a n'est pas tr&egrave;s impressionant. Mais il y a une astuce. A
moins d'avoir &eacute;t&eacute; promu, un r&eacute;pertoire <EM>DOS</EM> sera trait&eacute; par
<EM>Umsdos</EM> de la m&ecirc;me fa&ccedil;on que par <EM>MS-DOS</EM>. <EM>Umsdos</EM>
utilise un fichier sp&eacute;cial dans chaque sous-r&eacute;pertoire pour
effectuer la transposition entre les possibilit&eacute;s &eacute;tendues (noms de
fichiers longs, propri&eacute;t&eacute;, etc.) de <EM>Umsdos</EM> et les limitations
inh&eacute;rentes au syst&egrave;me de fichiers <EM>DOS</EM>. Ce fichier est invisible
aux utilisateurs de <EM>Umsdos</EM>, mais il devient visible si vous
d&eacute;marrez sous <EM>DOS</EM>. Pour &eacute;viter de mettre inutilement le
d&eacute;sordre dans la partition <EM>DOS</EM> avec ces fichiers
(<CODE>--linux-.---</CODE>), ils sont maintenant optionnels. S'ils sont
absents, <EM>Umsdos</EM> se comporte comme <EM>MS-DOS</EM>.</P>
<P>Quand un r&eacute;pertoire est promu, toutes les op&eacute;rations effectu&eacute;es par
la suite tiendront compte de toutes les possibilit&eacute;s normalement
accessibles aux utilisateurs d'<EM>Unix</EM> et de <EM>Linux</EM>. Tous les
sous-r&eacute;pertoires cr&eacute;es ensuite seront promus sans autre intervention
de votre part.</P>
<P>Cette caract&eacute;ristique vous permet d'organiser logiquement votre
partition <EM>DOS</EM> entre votre hi&eacute;rarchie <EM>DOS</EM> et votre
hi&eacute;rarchie <EM>Linux</EM>. Il est important de comprendre que les
fichiers <CODE>--linux-.---</CODE> prennent de la place (en g&eacute;n&eacute;ral 2 Ko par
r&eacute;pertoire). Comme <EM>DOS</EM> utilise de gros clusters (par exemple de
16 Ko pour une partition de 500 Mo), &eacute;viter de mettre des fichiers
<CODE>--linux-.---</CODE> partout peut vous faire gagner pas mal de place.</P>

<H2><A NAME="ss5.4">5.4 Comment promouvoir /sbin/umssync</A>
</H2>


<P>Un r&eacute;pertoire peut &ecirc;tre promu &agrave; n'importe quel moment en utilisant
<CODE>/sbin/umssync</CODE>. Lorsqu'un r&eacute;pertoire est promu, il se passe
les choses suivantes :</P>
<P>
<UL>
<LI>Cr&eacute;ation d'un fichier <CODE>--linux-.---</CODE>.</LI>
<LI>Une relation un pour un est &eacute;tablie entre le fichier
<CODE>--linux-.---</CODE> et le contenu actuel du r&eacute;pertoire.</LI>
</UL>
</P>
<P>La commande <CODE>/sbin/umssync</CODE> est utilis&eacute;e pour la maintenance des fichiers
<CODE>--linux-.---</CODE> existants. Elle ne le cr&eacute;e pas &agrave; partir de rien &agrave;
chaque fois. Elle modifie simplement ce qui a chang&eacute; (par exemple les
fichiers nouvellement cr&eacute;es lors d'une session <EM>DOS</EM>). Elle retire
aussi de ce fichier les fichiers qui n'existent plus dans le
r&eacute;pertoire <EM>DOS</EM>. C'est pourquoi <CODE>umssync</CODE> porte ce nom, car
elle synchronise les fichiers <EM>--linux-.---</EM> avec le r&eacute;pertoire
<EM>DOS</EM> sous-jacent.</P>

<H2><A NAME="ss5.5">5.5 Utiliser <CODE>/sbin/umssync</CODE> au d&eacute;marrage</A>
</H2>


<P>C'est une bonne id&eacute;e de mettre un appel &agrave; <CODE>/sbin/umssync</CODE> &agrave;
la fin du fichier /etc/rc.d/rc.S (si ce n'est d&eacute;j&agrave; fait...). La
commande suivante marche sur la plupart des syst&egrave;mes :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        /sbin/umssync -r99 -c -i+ /
        
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>L'option <CODE>-c</CODE> emp&ecirc;che <CODE>umssync</CODE> de promouvoir les
r&eacute;pertoires. Cette commande va donc seulement mettre &agrave; jour les
fichiers <CODE>--linux-.---</CODE> existants.</P>
<P>Cette commande est utile si vous d&eacute;sirez acc&eacute;der au r&eacute;pertoire
<EM>Linux</EM> pendant une session <EM>DOS</EM>. <EM>Linux</EM> n'a pas de moyen
efficace de dire qu'un r&eacute;pertoire a &eacute;t&eacute; modifi&eacute; par <EM>DOS</EM>, donc
<EM>Umsdos</EM> ne peut pas lancer lui-m&ecirc;me la commande <EM>umssync</EM>
n&eacute;cessaire. </P>

<H2><A NAME="ss5.6">5.6 Comment d&eacute;-promouvoir</A>
</H2>


<P>Effacez le fichier <CODE>--linux-.---</CODE> en utilisant <EM>DOS</EM>.</P>

<H2><A NAME="ss5.7">5.7 A propos des fichiers cr&eacute;&eacute;s lors d'une session <EM>DOS</EM></A>
</H2>


<P>A moins que vous n'utilisiez <CODE>umssync</CODE> sur un r&eacute;pertoire dans
lequel des fichiers ont &eacute;t&eacute; ajout&eacute;s ou effac&eacute;s par <EM>DOS</EM>, vous
allez remarquer certains des probl&egrave;mes suivants :</P>
<P>
<UL>
<LI>Le syst&egrave;me ne va pas planter, et cela ne va pas
causer de probl&egrave;mes majeurs, juste quelques
d&eacute;rangements. </LI>
<LI>Fichiers cr&eacute;&eacute;s par <EM>DOS</EM>.
<UL>
<LI>Ils seront invisibles pour <EM>Linux</EM>.</LI>
<LI>Quand vous voudrez creer un fichier avec le
m&ecirc;me nom, vous obtiendrez un message d&eacute;rreur
vous disant que ce fichier existe d&eacute;j&agrave;.</LI>
<LI>Plus de confusion que de r&eacute;&eacute;ls probl&egrave;mes,
donc. En tout cas cela ne cause aucun dommage
au syst&egrave;me de fichiers.</LI>
</UL>
</LI>
<LI>Les fichiers effac&eacute;s par <EM>DOS</EM> ne causeront aucun
probl&egrave;me. <EM>Umsdos</EM> remarquera leur absence &agrave; la
premi&egrave;re tentative d'acc&egrave;s, et vous d&eacute;livrera un
message (qui sera g&eacute;ne'ralement &eacute;crit dans
<CODE>/var/adm/syslog</CODE>). </LI>
</UL>
</P>

<H2><A NAME="s6">6. (D&eacute;s-)Installation et quelques astuces</A></H2>


<P>L'installation de <EM>Umsdos</EM> n'est pas vraiment diff&eacute;rente de celle
d'un syst&egrave;me <EM>Linux</EM> ordinaire (<EM>bas&eacute; sur Ext2</EM>).</P>
<P>Il y a tout de m&ecirc;me deux diff&eacute;rences principales.</P>

<H2><A NAME="ss6.1">6.1 La pseudo-racine <CODE>/mnt/linux</CODE></A>
</H2>


<P>Les &eacute;tapes normales lors de l'installation sont :</P>
<P>
<OL>
<LI>Cr&eacute;er une partition avec fdisk et la formatter.</LI>
<LI>La monter sur /mnt relativement &agrave; notre disque
principal d'installation.</LI>
<LI>Copier tous les paquetages dans <CODE>/mnt</CODE>.</LI>
</OL>
</P>
<P>Avec <EM>Umsdos</EM> l'&eacute;tape 1 n'est pas n&eacute;cessaire (n'&eacute;tait-ce pas le
but de <EM>Umsdos</EM> de ne pas avoir &agrave; reformatter ?).</P>
<P>Il est possible d'installer un syst&egrave;me <EM>Umsdos</EM> juste en copiant
tous les paquetages dans <CODE>/mnt</CODE>. Cela marchera
certainement. Mais cela va aussi creer tout un tas de
sous-r&eacute;pertoires dans votre r&eacute;pertoire racine <EM>DOS</EM> (C:), et vous
n'allez pas aimer &ccedil;a. C'est la raison pour laquelle toute
installation de <EM>Umsdos</EM> utilise la pseudo-racine. Et c'est la
diff&eacute;rence majeure entre une installation normale (<EM>Ext2</EM>) et
celle de <EM>Umsdos</EM> : tous les fichiers sont copi&eacute;s dans
<CODE>/mnt/linux</CODE>.</P>

<H2><A NAME="ss6.2">6.2 Pr&eacute;parer le r&eacute;pertoire <CODE>/mnt/linux</CODE></A>
</H2>


<P><CODE>/mnt/linux</CODE> n'est pas un r&eacute;pertoire ordinaire. Il doit &ecirc;tre
promu pour pouvoir manipuler correctement les noms de fichiers
longs de <EM>Linux</EM> et les fichiers sp&eacute;ciaux (liens,
fichiers p&eacute;riph&eacute;riques). Les &eacute;tapes n&eacute;cessaires pour configurer <CODE>/mnt/linux</CODE>
sont :</P>
<P>
<OL>
<LI><CODE>mkdir /mnt/linux</CODE></LI>
<LI><CODE>umssync /mnt/linux</CODE></LI>
</OL>
</P>
<P>Et c'est tout !</P>

<H2><A NAME="ss6.3">6.3 V&eacute;rifier que <CODE>/mnt/linux</CODE> est correctement configur&eacute;</A>
</H2>


<P>M&ecirc;me si la configuration de <CODE>/mnt/linux</CODE> est plut&ocirc;t simple,
il y a un certain nombre de paquetages qui ne marchent pas. Comment
est-ce possible ?</P>
<P>Le probl&egrave;me d'installation le plus important vient d'un programme
<CODE>umssync</CODE> incompatible. <EM>Umsdos</EM> a &eacute;t&eacute; mis &agrave; jour dans linux
1.1.88 (je ne me rappelle plus exactement du num&eacute;ro) et un bug a
&eacute;t&eacute; d&eacute;couvert dans <CODE>umssync</CODE>. Pour &eacute;viter toute confusion
dans la communaut&eacute; <EM>Linux</EM>, il a &eacute;t&eacute; d&eacute;cid&eacute; de monter le
niveau de compatibilit&eacute; n&eacute;cessaire pour tous les utilitaires
<EM>Umsdos</EM>. Les anciennes versions de ces utilitaires ont &eacute;t&eacute;
purement et simplement rejet&eacute;es.</P>
<P>Apparemment beaucoup de distributions n'ont pas mis &agrave; jour
l'utilitaire <CODE>umssync</CODE> sur leur disque d'installation.</P>
<P>Il existe encore pas mal de distributions de ce style en
circulation. Le r&eacute;sultat est que le r&eacute;pertoire <CODE>/mnt/linux</CODE>
n'est pas promu du tout et va tronquer tous les noms de fichiers
trop longs, et aussi rejeter tous les fichiers sp&eacute;ciaux.</P>
<P>Il est possible de faire un test tr&egrave;s t&ocirc;t pendant l'installation
pour voir si quelque chose s'est mal pass&eacute;. Gr&acirc;ce au m&eacute;canisme de
pseudo-console de <EM>Linux</EM>, vous pouvez le faire sans quitter le
programme d'installation. Suivez les instructions suivantes :</P>
<P>
<OL>
<LI>Appuyez sur <CODE>Alt-F2</CODE> (Appuyez sur la touche
<CODE>Alt</CODE> et en m&ecirc;me temps sur la touche <CODE>F2</CODE>).</LI>
<LI>Logguez-vous sous root.</LI>
<LI><CODE>cd /mnt/linux</CODE>

Si cela ne marche pas, vous &ecirc;tes en train d'essayer
trop t&ocirc;t. Un bon moment pour faire ce test est
d'attendre la fin de la s&eacute;lection des paquetages.
</LI>
<LI><CODE>>TOTO</CODE></LI>
<LI><CODE>ls -l</CODE>

Un fichier vide du nom de <CODE>TOTO</CODE> (en majuscules)
doit appara&icirc;tre. Si vous le voyez en minuscules,
quelque chose s'est mal pass&eacute;. Essayez de recommencer
&agrave; l'&eacute;tape du <CODE>umssync</CODE>. Vous pouvez utiliser
<CODE>umssync</CODE> autant de fois que vous voulez sans probl&egrave;mes.

<CODE>umssync .</CODE>

S'il n'y a pas de message d'erreur, refaites le test
pour <CODE>TOTO</CODE>. Si <CODE>TOTO</CODE> apparait bien, alors tout
va pour le mieux. Cette installation avait quelque
chose de bizarre mais vous avez r&eacute;ussi quand
m&ecirc;me. Continuez. 
                </LI>
<LI>Appuyez sur <CODE>Alt-F1</CODE> pour revenir &agrave; l'&eacute;cran
d'installation.</LI>
</OL>
</P>
<P>Si le test n'a pas march&eacute;, la meilleure solution est de prendre une
disquette d'installation plus r&eacute;cente. Il est g&eacute;n&eacute;ralement possible
de r&eacute;soudre ce probl&egrave;me en installant une version plus
r&eacute;cente de <CODE>umssync</CODE>. Ce n'est pas difficile mais cela n&eacute;cessite
un syst&egrave;me <EM>Linux</EM> en &eacute;tat de marche. Vous avez juste &agrave; monter
le lecteur de disquette et &agrave; remplacer la version caduque de
<CODE>umssync</CODE> par une nouvelle.</P>

<H2><A NAME="ss6.4">6.4 Oops releasing pseudo root ...</A>
</H2>


<P>La plupart des installations qui ne marchent pas le font en donnant ce
message &eacute;trange. Ce n'est pas un bug dans <EM>Umsdos</EM> bien que ce
message puisse para&icirc;tre vraiment bizarre. Voici les causes connues :</P>
<P>
<UL>
<LI>La plus commune
<P>L'installation de la <EM>Slackware</EM> essaye de configurer un fichier de
swap tr&egrave;s t&ocirc;t lors de l'installation. Pour ce faire, elle vous
demande de s&eacute;lectionner une partition (lecteur <EM>DOS</EM>), puis elle la
monte et cr&eacute;e pour finir le fichier de swap.</P>
<P>Lors de l'installation d'un syst&egrave;me <EM>Slackware</EM>, vous devez
configurer la partition cible avant de commencer &agrave; installer autre chose. Cela monte
normalement la partition <EM>DOS</EM> sur <CODE>/mnt</CODE>, cr&eacute;e le
r&eacute;pertoire <CODE>/mnt/linux</CODE> et lance <CODE>umssync</CODE> dessus.</P>
<P>C'est de l&agrave; que viennent la plupart des probl&egrave;mes. Un grand nombre
d'utilisateurs sautent l'&eacute;tape "configuration de la partition cible"
et passent directement au reste de l'installation. Comme <CODE>/mnt</CODE>
est d&eacute;j&agrave; mont&eacute;, cette erreur n'est pas remarqu&eacute;e.
Cela signifie que <CODE>/mnt/linux</CODE> n'a pas &eacute;t&eacute; correctement cr&eacute;e
(non promu). Donc tous les fichiers dont le nom est trop long,
ainsi que tous les fichiers sp&eacute;ciaux (liens, fichiers p&eacute;riph&eacute;riques) ne peuvent pas
&ecirc;tre cr&eacute;es correctement.</P>
</LI>
<LI>Utilitaire <CODE>umssync</CODE> non valide
<P><CODE>/mnt/linux</CODE> a &eacute;t&eacute; mal configur&eacute;, g&eacute;n&eacute;ralement &agrave; cause
de l'utilitaire <CODE>umssync</CODE> non valide sur la disquette d'installation.</P>
</LI>
<LI>Vieux bug de <EM>Umsdos</EM>
<P>Il y avait un bug dans <EM>Umsdos</EM> avant <EM>Linux 1.2.2</EM>. Le mode
pseudo-racine ne s'activait pas correctement si le fichier
<CODE>/etc/init</CODE> n'&eacute;tait pas pr&eacute;sent. <CODE>init</CODE> se trouve
maintenant dans <CODE>/sbin</CODE>. Vous pouvez r&eacute;soudre ce probl&egrave;me en
vous procurant un noyau plus r&eacute;cent. C'est d'autant plus recommand&eacute;
qu'un nouveau bug a &eacute;t&eacute; d&eacute;tect&eacute; et corrig&eacute; dans la version 1.2.2.</P>
<P>Si vous n'avez pas de version plus r&eacute;cente, faites ceci :</P>
<P>
<OL>
<LI>D&eacute;marrez &agrave; partir de la disquette d'installation.</LI>
<LI>Logguez-vous sous root.</LI>
<LI><CODE>mount -t umsdos /dev/hdXX /mnt</CODE>

o&ucirc; <CODE>/dev/hdXX</CODE> est votre partition <EM>DOS</EM>.</LI>
<LI><CODE>cd /mnt/linux/etc</CODE></LI>
<LI><CODE>ln -s ../sbin/init init</CODE></LI>
<LI><CODE>cd /</CODE></LI>
<LI><CODE>Ctrl-Alt-Del</CODE></LI>
<LI>D&eacute;marrez normalement sous <EM>Umsdos</EM>.</LI>
</OL>
</P>
</LI>
</UL>
</P>
<P>Malheureusement, les deux premiers probl&egrave;mes d'installation donnent
une installation compl&egrave;tement inutilisable. Il va falloir
d&eacute;sinstaller puis r&eacute;installer <EM>Umsdos</EM>.</P>

<H2><A NAME="ss6.5">6.5 Comment d&eacute;sinstaller un syst&egrave;me <EM>Umsdos</EM></A>
</H2>


<P>Il y a quelque chose de pratique avec <EM>Umsdos</EM> et son m&eacute;canisme de
pseudo-racine, c'est que vous pouvez le d&eacute;sinstaller sans douleur. Il
suffit de d&eacute;marrer sous <EM>DOS</EM> et d'effacer r&eacute;cursivement tous les
r&eacute;pertoires <CODE>linux</CODE>. C'est tout. <EM>Umsdos</EM> n'a pas besoin de
drivers particuliers dans le fichier config.sys, et il ne cr&eacute;e rien
de sp&eacute;cial en dehors du r&eacute;pertoire <CODE>linux</CODE>.</P>

<H2><A NAME="ss6.6">6.6 D&eacute;placer un syst&egrave;me <EM>Umsdos</EM> vers un autre lecteur <EM>DOS</EM></A>
</H2>


<P>Cela peut &ecirc;tre fait &agrave; partir de <EM>Linux</EM> ou du <EM>DOS</EM>. Il suffit
juste de copier r&eacute;cursivement les r&eacute;pertoires <CODE>linux</CODE> d'un
lecteur vers l'autre. Ensuite il faudra modifier le m&eacute;canisme de
d&eacute;marrage (g&eacute;n&eacute;ralement avec la commande loadlin) et le fichier
<CODE>/etc/fstab</CODE>. </P>
<P><EM>Umsdos</EM> peut &ecirc;tre install&eacute; sur n'importe quel lecteur
<EM>DOS</EM>. Il n'est pas obligatoire de l'installer sur le lecteur
<CODE>C:</CODE>, ni m&ecirc;me sur le premier disque dur. Cela ne change rien.</P>
<P>En fait, vous pouvez m&ecirc;me d&eacute;cider d'avoir plusieurs installations de
<EM>Umsdos</EM> sur diff&eacute;rents lecteurs pour faire des tests.</P>

<H2><A NAME="ss6.7">6.7 Installer 50 syst&egrave;mes <EM>Umsdos</EM>.</A>
</H2>


<P>Pourquoi ne pas installer tout un tas de syst&egrave;mes <EM>Linux</EM> en un
rien de temps ?</P>
<P><EM>Umsdos</EM> repose sur le mode du <EM>DOS</EM>. Vous pourvez tirer partie
de cette particularit&eacute; si vous voulez installer <EM>Linux</EM>
facilement. </P>
<P>Vous pouvez ainsi installer et configurer un syst&egrave;me <EM>Umsdos</EM> sur
un site. Lorsque vous &ecirc;tes satisfait de la configuration obtenue et
des paquetages s&eacute;lectionn&eacute;s, vous pouvez d&eacute;marrer sous <EM>DOS</EM> et
copier la totalit&eacute; du r&eacute;pertoire <CODE>linux</CODE> sur votre serveur de
fichiers <EM>DOS</EM>. Ensuite il vous suffit d'aller sur une autre
station <EM>DOS</EM> et de copier les fichiers du lecteur r&eacute;seau vers le
lecteur local. C'est tout. Il ne vous reste plus qu'&agrave; modifier le
script de d&eacute;marrage (<EM>Loadlinx</EM>) et c'est parti.</P>
<P>Avec quelques modifications minimes (nom de l'h&ocirc;te, adresse IP),
n'importe qui pourra installer un syst&egrave;me <EM>Linux</EM> en deux temps
trois mouvements.</P>
<P>Les lecteurs int&eacute;ress&eacute;s auront pu remarquer qu'il est aussi possible
d'installer n'importe quel syst&egrave;me <EM>Linux</EM> de la m&ecirc;me mani&egrave;re, y
compris les syst&egrave;mes bas&eacute;s sur <EM>Ext2</EM>.</P>
<P>Un des aspects les plus sympathiques de <EM>Linux</EM> est qu'il n'y a pas
de fichiers cach&eacute;s qui doivent absolument &ecirc;tre install&eacute;s par des
programmes "magiques".</P>

<H2><A NAME="s7">7. Configurer une section <EM>Linux</EM> dans une partition <EM>DOS</EM>.</A></H2>


<P><EM>Umsdos</EM> peut se r&eacute;v&eacute;ler utile m&ecirc;me aux utilisateurs de
<EM>Ext2</EM> (le syst&egrave;me de fichiers natif de <EM>Linux</EM>). Un sc&eacute;nario
classique est le suivant :</P>
<P>
<UL>
<LI><EM>Linux</EM> &eacute;tant votre syst&egrave;me d'exploitation
pr&eacute;f&eacute;r&eacute;, la partition <EM>Linux</EM> se remplit &agrave; n'en
plus finir.</LI>
<LI>Votre partition <EM>DOS</EM> est pleine de poussi&egrave;re, et &agrave;
moiti&eacute; vide.</LI>
<LI>Soudain vous n'avez plus de place sur votre partition
<EM>Ext2</EM>. </LI>
<LI>Vous n'&ecirc;tes pas encore s&ucirc;r de vouloir vous d&eacute;barasser
de votre partition <EM>DOS</EM>.</LI>
</UL>
</P>
<P>C'est ici que <EM>Umsdos</EM> peut vous aider. Vous pouvez configurer un
r&eacute;pertoire <EM>Linux</EM> sur votre partition <EM>DOS</EM>, et l'utiliser
sans restriction sous <EM>Linux</EM>. Par exemple, supposons que vous
voulez cr&eacute;er un nouveau r&eacute;pertoire nomm&eacute; <CODE>"extra"</CODE> sur votre
lecteur <CODE>C:</CODE>, et que vous voulez qu'il se comporte comme un
r&eacute;pertoire <EM>Linux</EM> normal. Faites ceci :
(en supposant que <CODE>C:</CODE> est <CODE>/dev/hda1</CODE>)</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        mkdir /c
        /sbin/mount -t umsdos /dev/hda1 /c
        mkdir /c/extra
        umssync /c/extra
        
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Il vous faut &ecirc;tre sous root pour ex&eacute;cuter ces commandes</P>
<P>En configurant <CODE>/etc/fstab</CODE> comme ceci, vous aurez toujours
acc&egrave;s au r&eacute;pertoire <CODE>/c/extra</CODE>.</P>

<H2><A NAME="s8">8. Pourquoi <EM>Umsdos</EM> ?</A></H2>

<P>Expliquer le fonctionnement et l'installation d'un syst&egrave;me
<EM>Umsdos</EM> ne suffit pas. Ce que la plupart des gens cherche, ce sont
des conseils pour savoir s'ils doivent utiliser <EM>Umsdos</EM> ou non.</P>

<H2><A NAME="ss8.1">8.1 Le but de <EM>Umsdos</EM></A>
</H2>

<P>Le but de <EM>Umsdos</EM> est de faciliter l'installation de
<EM>Linux</EM>. Un autre but est de faciliter sa DES-installation. L'id&egrave;e
ici &eacute;tait de favoriser la diffusion de <EM>Linux</EM>. Installer un
nouveau syst&egrave;me d'exploitation est toujours
probl&eacute;matique. <EM>OS/2</EM> par exemple va gentiment polluer la
racine de votre lecteur <CODE>C:</CODE> avec tout un tas de nouveaux
r&eacute;pertoires. Si vous &ecirc;tes aussi dou&eacute; que moi, il va m&ecirc;me effacer
vos fichiers config.sys et autoexec.bat :-( (NdT : Tant qu'&agrave; faire !). </P>
<P>L'utilisation de la pseudo-racine permet d'&eacute;viter cette invasion non
d&eacute;sir&eacute;e, et <EM>Linux</EM> peut &ecirc;tre d&eacute;sinstall&eacute; sans effets de bord.</P>

<H2><A NAME="ss8.2">8.2 Qui en a besoin ?</A>
</H2>

<P>Si vous avez un petit disque dur, <EM>Umsdos</EM> va vous permettre de
partager l'espace disque entre le <EM>DOS</EM> et <EM>Linux</EM>. A mon avis,
on peut consid&eacute;rer qu'un disque de moins de 300 Mo est un petit
disque. Cette opinion repose sur la taille des diff&eacute;rents paquetages
disponibles &agrave; l'heure actuelle. Un traitement de textes populaire
veut prendre jusqu'&agrave; 70 Mo si vous choisissez toutes les
possibilit&eacute;s. </P>
<P>Si vous avez un disque plus gros, vous pouvez choisir d'avoir une
partition d&eacute;di&eacute;e &agrave; <EM>Linux</EM> utilisant le syst&egrave;me de fichiers
<EM>Ext2</EM>. <EM>Ext2</EM> utilise une taille de clusters plus petite que
<EM>DOS</EM> (en fait 1 Ko), donc installer beaucoup de petits fichiers
prendra moins de place que sur une partition <EM>Umsdos</EM>.</P>

<H2><A NAME="ss8.3">8.3 Performances</A>
</H2>


<P>Ceci s'applique &agrave; une comparaison entre <EM>Umsdos</EM> et <EM>Ext2</EM>.</P>
<P>
<UL>
<LI>La gestion des r&eacute;pertoires est plus rapide sous
<EM>Ext2</EM>. Cela provient de la double structure des
r&eacute;pertoires sous <EM>Umsdos</EM>.</LI>
<LI>L'acc&egrave;s aux fichiers (lecture et &eacute;criture) est
probablement plus rapide sous <EM>Umsdos</EM> que sous
<EM>Ext2</EM>. Cela vient de la simplicit&eacute; du syst&egrave;me de
fichiers <EM>FAT</EM> utilis&eacute; par <EM>DOS</EM>.
                
Cependant cette simplicit&eacute; a un co&ucirc;t :

<UL>
<LI>Un maximum d'environ 65 000 fichiers ou clusters
par partition. Cela signifie aussi qu'une
parition de 500 Mo utilisera des clusters de
16 Ko. En d'autres termes, un fichier d'un
octet utilisera 16 K0 d'espace disque.</LI>
<LI>Tout est control&eacute; par la <CODE>FAT</CODE> qui se trouve
au d&eacute;but du disque dur. Le syst&egrave;me <EM>DOS</EM>
est donc certainement plsu fragile &agrave; cause de
cela.</LI>
<LI>Aucune pr&eacute;vision pour &eacute;viter la fragmentation
des fichiers. Un syst&egrave;me <EM>Umsdos</EM> est
g&eacute;n&eacute;ralement utilis&eacute; en mode
mono-utilisateur. Dans ce cas, cela n'a pas
beaucoup d'importance. Mais pour un syst&egrave;me
multi-utilisateurs, les fichiers seront
&eacute;parpill&eacute;s dans tous les coins du disque, ce
qui aura pour effet de r&eacute;duire les
performances d'acc&egrave;s aux fichiers.</LI>
</UL>
</LI>
<LI>Les liens symboliques sont stock&eacute;s dans des fichiers
normaux. Si vous comptex en avoir beaucoup, vous vous
rendrez compte que <EM>Umsdos</EM> utilise beaucoup
d'espace disque compar&eacute; &agrave; <EM>Ext2</EM>.</LI>
</UL>
</P>
</BODY>
</HTML>
