<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>VPN HOWTO</TITLE>
</HEAD>
<BODY>
<H1>VPN HOWTO</H1>

<H2>Matthew D. Wilson, 
<A HREF="mailto:matthew@shinythings.com">matthew@shinythings.com</A>
                Traduction fran&ccedil;aise de Nicolas Prigent 
<A HREF="mailto:prigentn@thmulti.com">prigentn@thmulti.com</A>
        </H2>v 1.0, Dec 1999
<HR>
<EM>            Ce HOWTO d&eacute;crit la mani&egrave;re de mettre en place un R&eacute;seau Priv&eacute; Virtuel (Virtual Private Network) avec Linux.
        </EM>
<HR>
<H2><A NAME="Introduction"></A> <A NAME="s1">1. Introduction</A>                </H2>

<H2><A NAME="ss1.1">1.1 Pourquoi ai-je &eacute;crit ce HOWTO</A>
                        </H2>

<P>Je travaille chez Real Network, et nous avions besoin d'un VPN. C'&eacute;tait mon
premier v&eacute;ritable projet, et j'en ai r&eacute;ellement appris plus au sujet de Linux
gr&acirc;ce &agrave; cela qu'avec n'importe quelle autre t&acirc;che. Je me suis servi de 
l'exp&eacute;rience ainsi acquise pour r&eacute;diger ce document, pour partager avec 
d'autres ce que j'avais appris, pour qu'ils puissent eux aussi r&eacute;aliser de super
trucs avec Linux.</P>
<H2><A NAME="ss1.2">1.2 Remerciements</A>
                        </H2>

<P>Je voudrais tout d'abord et surtout remercier mon &eacute;pouse Julie, sans qui je ne 
serais pas o&ugrave; j'en suis actuellement. Je voudrais aussi remercier Arpad Magosanyi, 
l'auteur du premier VPN mini-howto et de pty-redir, l'utilitaire qui a rendu tout
cela possible. Jerry, Rod, Glen, Mark V., Mark W., et David, vous &ecirc;tes trop fort
les mecs. Merci pour votre aide.</P>
<H2><A NAME="ss1.3">1.3 Format de ce document</A>
                        </H2>

<P>Ce document est divis&eacute; en 5 sections.</P>
<P>
<DL>

<DT><B>Section 1: Introduction</B><DD><P>Cette section</P>

<DT><B>Section 2: Th&eacute;orie</B><DD><P>La th&eacute;orie &agrave; la base des VPNs. Qu'est-ce qu'un VPN, et comment fonctionne-t-il. Lisez cette partie si vous &ecirc;tes n&eacute;ophyte en mati&egrave;re de VPN.</P>

<DT><B>Section 3: Serveur</B><DD><P>Cette section d&eacute;crit la mise en place d'un serveur de VPN.</P>

<DT><B>Section 4: Client</B><DD><P>Cette section d&eacute;crit la mise en place d'un client de VPN.</P>

<DT><B>Section 5: Impl&eacute;mentation</B><DD><P>Une impl&eacute;mentation de VPN d&eacute;crite pas &agrave; pas.</P>

<DT><B>Section 6: Addenda</B><DD><P>D'autres &eacute;l&eacute;ments d'information qui pourraient vous &ecirc;tre utiles.</P>
</DL>
</P>
<H2><A NAME="ss1.4">1.4 Copyright et Avertissements</A>
                        </H2>

<P>Copyright (c) Matthew Wilson. Ce document ne peut &ecirc;tre distribu&eacute; qu'en accord avec
les termes et les conditions de la licence LDP que vous trouverez a l'adresse 
<A HREF="http://www.linuxdoc.org/COPYRIGHT.html">http://www.linuxdoc.org/COPYRIGHT.html</A>, except&eacute; le fait que ce document ne doit
pas &ecirc;tre distribu&eacute; sous une forme alt&eacute;r&eacute;e sans le consentement de son auteur.</P>
<P>Ni l'auteur, ni le traducteur n'assument une quelconque responsabilit&eacute; pour quoi que 
ce soit pouvant advenir suite a l'utilisation de ce document, ni ne fournissent une 
quelconque garantie, implicite ou explicite. Si vous cassez quelque chose, nous ne sommes
en rien responsable. Souvenez vous que ce que vous allez faire ici pourrait cr&eacute;er d'&eacute;normes
trous de s&eacute;curit&eacute; sur votre r&eacute;seau. Vous aurez &eacute;t&eacute; pr&eacute;venus.</P>
<H2><A NAME="ss1.5">1.5 Histoire de ce document</A>
                        </H2>

<P>Le VPN mini-HOWTO original a &eacute;t&eacute; &eacute;crit par 
<A HREF="mag@bunuel.tii.matav.hu">Arpad Magosanyi</A> en 1997. Il m'a depuis autoris&eacute;
&agrave; reprendre le document, et &agrave; l'&eacute;tendre jusqu'&agrave; en faire un HOWTO complet.
Rien de ceci n'aurait &eacute;t&eacute; possible sans le document original. Merci encore Arpad. :)</P>
<P>La version 1.0 de ce HOWTO a &eacute;t&eacute; termin&eacute;e le 10 d&eacute;cembre 1999.</P>
<H2><A NAME="ss1.6">1.6 Documents associ&eacute;s</A>
                        </H2>

<P>
<UL>
<LI>
<A HREF="/HOWTO/Networking-Overview-HOWTO.html">Networking Overview HOWTO</A></LI>
<LI>
<A HREF="/HOWTO/NET3-4-HOWTO.html">Networking HOWTO</A></LI>
<LI>
<A HREF="/HOWTO/VPN-Masquerade-HOWTO.html">VPN-Masquerade HOWTO</A></LI>
</UL>
</P>
<H2><A NAME="s2">2. Th&eacute;orie</A>                </H2>

<H2><A NAME="ss2.1">2.1 Qu'est-ce qu'un VPN?                   </A>
</H2>

<P>VPN est l'acronyme de Virtual Private Network, ou r&eacute;seau priv&eacute; virtuel. Un VPN 
utilise l'Internet comme m&eacute;canisme de transport, en maintenant la s&eacute;curit&eacute; des
donn&eacute;es sur le VPN.</P>
<H3>Mais c'est quoi, en vrai, un VPN?                                </H3>

<P>Et bien il y a plusieurs r&eacute;ponses &agrave; cette question. Cela d&eacute;pends vraiment
de l'apparence du r&eacute;seau. En g&eacute;n&eacute;ral, on dispose d'un r&eacute;seau principal 
unique, avec des noeuds distants qui utilisent le VPN pour gagner un 
acc&egrave;s complet au r&eacute;seau central. Les noeuds distants sont g&eacute;n&eacute;ralement 
des bureaux &eacute;loign&eacute;s, ou des employ&eacute;s travaillant &agrave; partir de chez eux.
Il est aussi possible de relier deux r&eacute;seaux plus petits (ou m&ecirc;me plus
grands!) pour former un seul r&eacute;seau encore plus grand.</P>
<H3>Alors, &ccedil;a marche comment?                                </H3>

<P>Pour simplifier, pour r&eacute;aliser un VPN, vous cr&eacute;ez un tunnel s&eacute;curis&eacute; 
entre deux r&eacute;seaux et l'utilisez pour router les datagrammes IP.
Au cas ou vous seriez d&eacute;j&agrave; perdu, vous devriez lire
<A HREF="http://www.linuxdoc.org/HOWTO/Networking-Overview-HOWTO.html">Le Linux Networking Overview HOWTO</A> pour vous informer au 
sujet des r&eacute;seaux sous Linux.</P>
<P>Pri&egrave;re de ne pas m'en vouloir, mes sch&eacute;mas ASCII m&eacute;riterait un peu 
plus de travail.</P>
<P>
<PRE>
                                 \          \
                 ---------       /          /      ---------
   R&eacute;seau ______| Routeur |______\ Internet \_____| Routeur |______ R&eacute;seau
   Distant      | Client  |      /          /     | Serveur |       Priv&eacute;
                 ---------       \          \      ---------
                                 /          /


                         Routeur Client
               ----------------------------------------------------
              |   /->    10.0.0.0/255.0.0.0   \                    |
  R&eacute;seau      |  |-->  172.16.0.0/255.240.0.0  |--> Tunnel >---\   |
  Distant >---|--|--> 192.168.0.0/255.255.0.0 /                 |--|----> Internet
 192.168.12.0 |  |                                              |  |
              |   \-----> 0.0.0.0/0.0.0.0 --> Masquarade IP >--/   |
               ----------------------------------------------------


                        Routeur Serveur
             ----------------------------------------------------
            |                   /->    10.0.0.0/255.0.0.0    \   |
            |   /--> Tunnel >--|-->  172.16.0.0/255.240.0.0   |--|----> R&eacute;seau
Internet >--|--|                \--> 192.168.0.0/255.255.0.0 /   |      Priv&eacute;
            |  |                                                 |     172.16.0.0/12
            |   \-----> 0.0.0.0/0.0.0.0 -----> /dev/null         |    192.168.0.0/16
             ----------------------------------------------------
</PRE>
</P>
<P>Le diagramme ci-dessus montre comment le r&eacute;seau peut &ecirc;tre mis en place.
Si vous ne savez pas ce qu'est la masquarade IP, vous ne devriez 
probablement pas &ecirc;tre ici. Allez lire
<A HREF="/HOWTO/Networking-Overview-HOWTO.html">Le Linux Networking Overview HOWTO</A> et revenez une fois inform&eacute;.</P>
<P>Le routeur client est une machine Linux tenant le r&ocirc;le de passerelle/firewall
pour le r&eacute;seau distant. Comme vous pouvez le voir, le r&eacute;seau distant utilise
le r&eacute;seau local 192.168.12.0. Pour plus de simplicit&eacute; dans le diagramme, j'ai
laiss&eacute; les informations de routage sur les routeurs. L'id&eacute;e de base est de 
router le trafic destin&eacute; aux r&eacute;seaux priv&eacute;s (10.0.0.0, 172.16.0.0, et
192.168.0.0) via le tunnel. L'installation montr&eacute;e ici est une mani&egrave;re de le
faire. C'est &agrave; dire qu'alors que le r&eacute;seau distant peut voir le r&eacute;seau priv&eacute;, 
le r&eacute;seau priv&eacute; ne peut pas n&eacute;cessairement voir le r&eacute;seau distant. Pour que
ceci arrive, il faut sp&eacute;cifier que les routes sont bidirectionnelles.</P>
<P>Vous devriez aussi remarquer sur le sch&eacute;ma que tout le trafic sortant du
routeur client appara&icirc;t comme en provenant, c'est &agrave; dire qu'il porte toujours
la m&ecirc;me adresse IP. Vous pouvez router les valeurs v&eacute;ritables de l'int&eacute;rieur
de votre r&eacute;seau, mais cela induit une grande diversit&eacute; de probl&egrave;mes de s&eacute;curit&eacute;.</P>
<H2><A NAME="ss2.2">2.2 SSH et PPP</A>
                        </H2>

<P>Le syst&egrave;me que je d&eacute;cris pour impl&eacute;menter un VPN utilise SSH et PPP. Sch&eacute;matiquement, 
je me sers de ssh pour cr&eacute;er une connexion prot&eacute;g&eacute;e par tunnel, puis utilise pppd pour y
d&eacute;marrer le trafic TCP/IP. C'est ainsi que le tunnel est mis en place.</P>
<P>Le v&eacute;ritable truc pour faire fonctionner ssh et pppd ensemble correctement
est l'utilitaire &eacute;crit par Arpad Magosanyi qui permet la redirection de l'entr&eacute;e
et de la sortie standard vers un pseudo tty. Ceci permets &agrave; pppd de parler 
au travers de ssh comme s'il s'agissait d'une liaison s&eacute;rie. Du c&ocirc;t&eacute; du serveur,
pppd est lanc&eacute; comme interpreteur de commande utilisateur dans la session ssh,
compl&eacute;tant le lien.
Apr&egrave;s cela, tout ce qu'il reste a faire est de r&eacute;aliser le routage.</P>
<H2><A NAME="ss2.3">2.3 Syst&egrave;mes VPN alternatifs</A>
                        </H2>

<P>Il y a bien sur d'autres moyens de mettre en place un VPN, dont voici quelques
exemples.</P>
<H3>PPTP                                </H3>

<P>PPTP est un protocole Microsoft pour les VPN. Il est support&eacute; sous Linux,
mais est connu pour avoir de nombreux probl&egrave;mes de s&eacute;curit&eacute;. Je ne d&eacute;cris
pas ici la mani&egrave;re de l'utiliser, &eacute;tant donn&eacute; que ce th&egrave;me est couvert par
<A HREF="http://www.linuxdoc.org/HOWTO/VPN-Masquerade-HOWTO.html">Linux VPN Masquerade HOWTO</A>.</P>
<H3>IPSec                                </H3>

<P>IPSec est un ensemble de protocoles diff&eacute;rents de SSH. Franchement, je n'en 
connais pas &eacute;norm&eacute;ment &agrave; son sujet. De fait, si quelqu'un veut m'aider d'une
description, je lui en serais tr&egrave;s reconnaissant. Encore une fois, je ne d&eacute;cris
pas comment l'utiliser &eacute;tant donn&eacute; que le 
<A HREF="http://www.linuxdoc.org/HOWTO/VPN-Masquerade-HOWTO.html">Linux VPN Masquerade HOWTO</A> couvre le sujet.</P>
<H3>CIPE                                </H3>

<P>CIPE est un syst&egrave;me de chiffrement au niveau noyau probablement mieux  
adapt&eacute; aux dispositifs d'entreprise. Vous pourrez en savoir plus sur
<A HREF="http://sites.inka.de/sites/bigred/devel/cipe.html">la page de      CIPE</A>. J'envisage de m'y int&eacute;resser plus s&eacute;rieusement, et aurais donc
peut &ecirc;tre plus d'informations &agrave; son sujet bient&ocirc;t.</P>
<H2><A NAME="s3">3. Le serveur</A>                </H2>

<P>Cette section explique comment mettre en place l'aspect serveur des choses. 
J'ai plac&eacute; cette section en premier, &eacute;tant donn&eacute; que sans serveur, un client
est assez inutile.</P>
<H2><A NAME="ss3.1">3.1 La s&eacute;curit&eacute; - garder les gens dehors</A>
                        </H2>

<P>La s&eacute;curit&eacute; est un aspect tr&egrave;s important des VPNs. C'est pour &ccedil;a que vous &ecirc;tes
en train d'en monter un, non? Vous devez garder ces quelques choses &agrave; l'esprit 
en mettant en place votre serveur.</P>
<H3>Pr&eacute;parez vos d&eacute;mons                                </H3>

<P>Etant donn&eacute; que ce serveur va &ecirc;tre des deux c&ocirc;t&eacute;s du firewall et qu'il 
va &ecirc;tre mis en place pour transmettre le trafic sur votre r&eacute;seau, c'est 
une bonne id&eacute;e de s&eacute;curiser la machine autant que possible. Vous pourrez
en apprendre plus sur la s&eacute;curit&eacute; Linux dans 
<A HREF="/HOWTO/Security-HOWTO.html">Linux Security HOWTO</A>. 
Pour ma part, j'ai tu&eacute; tous les services, except&eacute; sshd et un serveur web
Roxen. J'utilise ce dernier pour t&eacute;l&eacute;charger quelques fichiers (mes scripts, 
etc.) pour permettre &agrave; d'autres machines d'acc&eacute;der au VPN. Je n'utilise pas
de serveur FTP &eacute;tant donn&eacute; qu'il est plus dur d'en s&eacute;curiser un que de 
rendre quelques fichiers disponibles sur un serveur web. De plus, j'ai
seulement besoin de pouvoir r&eacute;cup&eacute;rer des fichiers. Si vous souhaitez r&eacute;ellement
ex&eacute;cuter des serveurs diff&eacute;rents sur votre passerelle, vous pourriez
vouloir envisager de restreindre leur acc&egrave;s aux machines situ&eacute;es sur
votre r&eacute;seau priv&eacute;.</P>
<H3>Ne pas autoriser de mots de passe                                </H3>

<P>Effectivement, cela semble assez stupide, mais &ccedil;a a retenu votre attention non?
Non, vous n'utilisez pas de mots de passe, vous les d&eacute;sactivez compl&egrave;tement.
Toute l'authentification n&eacute;cessaire sur cette machine devrait &ecirc;tre faite
via le syst&egrave;me d'authentification &agrave; cl&eacute; publique de ssh. Ainsi, seul les 
entit&eacute;s dot&eacute;es de cl&eacute;s peuvent entrer, et il est pratiquement impossible
de se rappeler d'une cl&eacute; binaire de 530 caract&egrave;res.</P>
<P>Alors, comment faites-vous &ccedil;a? Il faut &eacute;diter le fichier /etc/passwd. 
Le second champ contient soit le r&eacute;sum&eacute; cryptographique (hash) du mot
de passe, ou un 'x' pr&eacute;venant le syst&egrave;me d'authentification qu'il faut regarder
dans le fichier /etc/shadow. Vous devez changer ce champ en '*'. Ainsi
le syst&egrave;me d'authentification est inform&eacute; qu'il n'y a pas de mot de passe, 
et qu'aucun ne devrait &ecirc;tre autoris&eacute;.</P>
<P>
<A NAME="passwd"></A> 
Voila &agrave; quoi ressemble un fichier /etc/passwd classique:
<PRE>
...
nobody:x:65534:100:nobody:/dev/null:
mwilson:x:1000:100:Matthew Wilson,,,:/home/mwilson:/bin/bash
joe:*:504:101:Joe Mode (home),,,:/home/vpn-users:/usr/sbin/pppd
bill:*:504:101:Bill Smith (home),,,:/home/vpn-users:/usr/sbin/pppd
frank:*:504:101:Frank Jones (home),,,:/home/vpn-users:/usr/sbin/pppd
...
</PRE>

Remarquez que j'ai fait plus qu'&eacute;diter simplement le second champ.
J'en dirais plus sur les autres champs par la suite.</P>
<H2><A NAME="ss3.2">3.2 Acc&egrave;s des utilisateur - les laisser rentrer</A>
                        </H2>

<P>L'acc&egrave;s des utilisateurs est r&eacute;alis&eacute; via le sch&eacute;ma d'authentification de ssh.
Comme je l'ai indiqu&eacute; pr&eacute;c&eacute;demment, c'est ainsi que les utilisateurs peuvent
acc&eacute;der au syst&egrave;me, tout en maintenant un haut niveau de s&eacute;curit&eacute;. Si vous
n'&ecirc;tes pas familier de ssh, jetez un oeuil &agrave; 
<A HREF="http://www.ssh.org/">http://www.ssh.org/</A> Remarquez que j'utilise
la version 1 de ssh, pas la version 2. Il y a une grande diff&eacute;rence, 
particuli&egrave;rement sur le fait que la version 1 est libre, contrairement
&agrave; la version 2.</P>
<H3>Configurer <CODE>sshd</CODE>                                </H3>

<P>Vous aurez besoin de configurer sshd. Les options suivantes devraient
&ecirc;tre pr&eacute;sentes. L'id&eacute;e est de d&eacute;sactiver l'authentification par mot de
passe, et les authentifications par rhosts. Les options suivantes devraient
&ecirc;tre pr&eacute;sentes dans votre fichier <CODE>/etc/sshd_config</CODE>. </P>
<P>
<PRE>
PermitRootLogin yes
IgnoreRhosts yes
StrictModes yes
QuietMode no
CheckMail no
IdleTimeout 3d
X11Forwarding no
PrintMotd no
KeepAlive yes
RhostsAuthentication no
RhostsRSAAuthentication no
RSAAuthentication yes
PasswordAuthentication no
PermitEmptyPasswords no
UseLogin no
</PRE>
</P>
<H2><A NAME="ss3.3">3.3 Restreindre les possibilit&eacute;s des utilisateurs</A>
                        </H2>

<P>Maintenant que vous maintenez les m&eacute;chants &agrave; l'ext&eacute;rieur et ne laissez entrer que
les gentils, vous pourriez avoir besoin de vous assurer que ces derniers se 
comportent correctement. La mani&egrave;re la plus simple de le faire est de ne rien les
laisser faire d'autre que de lancer pppd. Ceci peut &ecirc;tre, ou non, n&eacute;cessaire.
J'ai restreins les possibilit&eacute;s des utilisateurs parce que le syst&egrave;me que je 
maintiens est d&eacute;di&eacute; au VPN, et que les utilisateurs n'ont aucune raison de 
faire quoique ce soir d'autre dessus.</P>
<H3>sudo ou pas sudo                                </H3>

<P>Il existe un petit programme propret appel&eacute; sudo qui permet &agrave; 
l'administrateur d'un syst&egrave;me Unix d'autoriser &agrave; certains utilisateurs
la possibilit&eacute; de lancer certains programmes en tant que root. C'est ici
certainement le cas, &eacute;tant donn&eacute; que pppd doit &ecirc;tre lanc&eacute; ainsi. Vous
devrez utiliser cette m&eacute;thode si vous souhaitez autoriser les acc&egrave;s
ligne de commande aux utilisateurs. R&eacute;f&eacute;rez-vous &agrave; la page man de sudo pour savoir
comment mettre sudo en place. Utiliser sudo est pr&eacute;f&eacute;rable 
sur les syst&egrave;mes multi-usage qui h&eacute;bergent g&eacute;n&eacute;ralement un faible nombre
d'utilisateurs de confiance.</P>
<P>Si vous d&eacute;sirez ne pas autoriser les utilisateurs &agrave; disposer d'un acc&egrave;s par ligne
de commande, le meilleur moyen de le faire est de faire que leur shell soit pppd.
Ceci se fait dans le fichier /etc/passwd. Vous pouvez voir 
<A HREF="#passwd">ci-dessous</A> que c'est ce que j'ai fait pour les 
trois derniers utilisateurs. Le dernier champ du fichier /etc/passwd est 
le shell de l'utilisateur. Vous n'avez pas besoin de faire quoique ce soit
de sp&eacute;cial &agrave; pppd pour le faire fonctionner. Il est ex&eacute;cut&eacute; en tant que 
root lorsque l'utilisateur se connecte. C'est certainement la mise en place
la plus simple possible, ainsi que la plus s&ucirc;re. Elle est id&eacute;ale pour les
syst&egrave;mes industriels et &agrave; grande &eacute;chelle. J'ai d&eacute;cris exactement tout ce
qu'il faut faire plus loin dans ce document. Vous pouvez 
<A HREF="#user-accounts">y aller directement</A> si vous le souhaitez.</P>
<H2><A NAME="ss3.4">3.4 Le r&eacute;seau</A>
                        </H2>

<P>Maintenant que vos utilisateurs ont acc&egrave;s au syst&egrave;me, nous devons nous assurer
qu'ils ont acc&egrave;s au r&eacute;seau. Pour ce faire, nous utilisons les r&egrave;gles du noyau
Linux relatives au firewall et les tables de routage. En nous servant des commandes
<CODE>route</CODE> et <CODE>ipfwadm</CODE>, nous pouvons configurer le noyau pour
g&eacute;rer le trafic r&eacute;seau de mani&egrave;re correcte. Pour plus d'information sur 
<CODE>ipfwadm</CODE>, <CODE>ipchains</CODE> et <CODE>route</CODE>, r&eacute;f&eacute;rez vous au 
<A HREF="http://www.linuxdoc.org/HOWTO/Linux-Networking-HOWTO.html">Linux Networking HOWTO</A>.</P>
<H3>Le noyau                                </H3>

<P>Pour que cela fonctionne, votre noyau doit &ecirc;tre configur&eacute; correctement.
Si vous ne savez pas comment cr&eacute;er votre propre noyau, vous devriez
lire le 
<A HREF="http://www.linuxdoc.org/HOWTO/Kernel-HOWTO.html">Kernel      HOWTO</A>.
Vous devez vous assurer que les options suivantes sont activ&eacute;es, en plus
des options r&eacute;seaux de base. J'utilise un noyau 2.0.38 sur mon syst&egrave;me.</P>
<P>Pour les noyaux 2.0:
<UL>
<LI>CONFIG_FIREWALL</LI>
<LI>CONFIG_IP_FORWARD</LI>
<LI>CONFIG_IP_FIREWALL</LI>
<LI>CONFIG_IP_ROUTER</LI>
<LI>CONFIG_IP_MASQUERADE (optionnel)</LI>
<LI>CONFIG_IP_MASQUERADE_ICMP (optionnel)</LI>
<LI>CONFIG_PPP</LI>
</UL>
</P>
<P>Pour les noyaux 2.2:
<UL>
<LI>CONFIG_FIREWALL</LI>
<LI>CONFIG_IP_ADVANCED_ROUTER</LI>
<LI>CONFIG_IP_FIREWALL</LI>
<LI>CONFIG_IP_ROUTER</LI>
<LI>CONFIG_IP_MASQUERADE (optionnel)</LI>
<LI>CONFIG_IP_MASQUERADE_ICMP (optionnel)</LI>
<LI>CONFIG_PPP</LI>
</UL>
</P>
<H3>R&ecirc;gles de filtrage                                </H3>

<P>Tout d'abord, nous devons &eacute;crire des r&egrave;gles de filtrage de firewall qui
permettent aux utilisateurs d'acc&eacute;der &agrave; nos r&eacute;seaux internes, 
tout en leur interdisant d'acc&eacute;der au r&eacute;seau externe. Cela peut
sembler &eacute;trange, mais envisagez le sous cet angle: Ils ont d&eacute;j&agrave;
acc&egrave;s &agrave; l'Internet, alors pourquoi les laisser utiliser le tunnel
pour y acc&eacute;der? Cela g&acirc;che &agrave; la fois la bande passante et le 
processeur.</P>
<P>Les r&egrave;gles de filtrage utilis&eacute;es d&eacute;pendent du r&eacute;seau interne utilis&eacute;.
En gros, elle disent: "Autoriser le trafic venant de nos VPNs et
destin&eacute; &agrave; nos r&eacute;seaux internes". Comment allons nous faire?
Comme toujours, &ccedil;a d&eacute;pends. Si vous utilisez un noyau 2.0, vous
devez vous servir d'un outil appel&eacute; <CODE>ipfwadm</CODE>, alors que si 
vous utilisez un noyau 2.0, vous utiliserez <CODE>ipchains</CODE>.</P>
<P>Pour mettre en place les r&egrave;gles avec <CODE>ipfwadm</CODE>, lancez le avec
les options suivantes:</P>

<P>
<PRE>
# /sbin/ipchains -F forward
# /sbin/ipchains -P forward DENY
# /sbin/ipchains -A forward -j ACCEPT -s 192.168.13.0/24 -d 172.16.0.0/12
</PRE>
</P>
<P>Pour les utilisateurs de noyau 2.2, se r&eacute;f&eacute;rer &agrave; 
<A HREF="#ipv4forwarding">ceci</A>.</P>
<H3>Routage                                </H3>

<P>D&eacute;sormais, nos utilisateurs sont autoris&eacute;s &agrave; acc&eacute;der &agrave; nos r&eacute;seaux, 
et nous devons dire au noyau o&ugrave; envoyer les paquets. Sur mon syst&egrave;me,
je dispose de deux ethernets : L'un d'entre eux est reli&eacute; au r&eacute;seau
externe, l'autre au r&eacute;seau interne. Ceci aide &agrave; la s&eacute;curisation, car 
le trafic ext&eacute;rieur est masqu&eacute; par notre passerelle, et n'importe
quel trafic entrant est filtr&eacute; et rout&eacute; par notre Cisco. Pour la 
plupart des dispositifs, le routage devrait &ecirc;tre une chose simple.</P>
<P>Nous routons l'int&eacute;gralit&eacute; du trafic destin&eacute; au r&eacute;seaux priv&eacute;s vers
l'interface connect&eacute;e au r&eacute;seau interne, et le reste du trafic vers
l'interface externe. Les commandes de routage sp&eacute;cifiques d&eacute;pendent 
des r&eacute;seaux internes que vous utilisez. Voici un exemple de ce &agrave; quoi
elles pourraient ressembler. Ces lignes sont bien s&ucirc;r ajout&eacute;es &agrave; vos
r&egrave;gles de routages habituelles pour vos r&eacute;seaux locaux. Je doute
que vous utilisiez les trois groupes d'adresses priv&eacute;es.</P>
<P>
<PRE>
En supposant que 172.16.254.254 est notre passerelle interne:

# /sbin/route add -net 10.0.0.0 netmask 255.0.0.0 gw 172.16.254.254 dev eth1
# /sbin/route add -net 172.16.0.0 netmask 255.240.0.0 gw 172.16.254.254 dev eth1
# /sbin/route add -net 192.168.0.0 netmask 255.255.0.0 gw 172.16.254.254 dev eth1
</PRE>
</P>
<P>Encore une chose sur le routage. Si vous utilisez du routage 
bidirectionnel, vous aurez alors besoin de r&eacute;aliser une chose 
en plus. Il vous faudra mettre en place les routes revenant
vers le client. La mani&egrave;re la plus simple de le faire est de lancer
un cron chaque minute qui va assigner les valeurs des
routes. Ce n'est pas tr&egrave;s grave si le client n'est pas connect&eacute;, 
<CODE>route</CODE> va simplement cracher une erreur (que vous aurez
judicieusement redirig&eacute; vers <CODE>/dev/null</CODE>).</P>
<H2><A NAME="s4">4. Le client</A>                </H2>

<P>Nous nous consacrons maintenant au client. En pratique, lorsqu'elle est utilis&eacute;
pour permettre l'acc&egrave;s &agrave; un r&eacute;seau distant, cette machine peut facilement servir
de serveur Samba (r&eacute;seau Windows), DHCP, ou m&ecirc;me web interne. L'aspect important
dont il faut se souvenir est que cette machine doit &ecirc;tre aussi s&eacute;curis&eacute;e que
possible, &eacute;tant donn&eacute;e qu'elle fait fonctionner tout votre r&eacute;seau distant.</P>
<H2><A NAME="ss4.1">4.1 Le noyau</A>
                        </H2>

<P>Commen&ccedil;ons par le commencement. Vous devez disposer de ppp dans votre noyau.
Si vous souhaitez autoriser plusieurs machines &agrave; utiliser le tunnel, il vous
faut aussi les services de firewall et de transmission (forwarding). Si le
client consiste en une seule machine, ppp est suffisant.</P>
<H2><A NAME="ss4.2">4.2 R&eacute;aliser la liaison</A>
                        </H2>

<P>La liaison est cr&eacute;&eacute;e en lan&ccedil;ant <CODE>pppd</CODE> &agrave; travers un pseudo terminal
lui-m&ecirc;me cr&eacute;&eacute; par <CODE>pty-redir</CODE> et connect&eacute; &agrave; <CODE>ssh</CODE>. C'est 
ce que r&eacute;alise la s&eacute;quence de commande suivante.</P>
<P>
<PRE>
# /usr/sbin/pty-redir /usr/bin/ssh -t -e none -o 'Batchmode yes' -c blowfish -i /root/.ssh/identity.vpn -l joe > /tmp/vpn-device
# sleep 10

# /usr/sbin/pppd `cat /tmp/vpn-device`
# sleep 15

# /sbin/route add -net 172.16.0.0 gw vpn-internal.mycompany.com netmask 255.240.0.0
# /sbin/route add -net 192.168.0.0 gw vpn-internal.mycompany.com netmask 255.255.0.0
</PRE>
</P>
<P>Clairement, on lance ssh, et on redirige ses entr&eacute;es et sorties vers
pppd. Les options pass&eacute;es &agrave; ssh le configurent pour s'ex&eacute;cuter sans 
caract&egrave;re d'&eacute;chappement (-e), en utilisant l'algorithme de chiffrement
blowfish (-i), en mode terminal (-l), avec les options 'Batchmode yes'
(-o). Les commandes sleep sont utilis&eacute;es pour espacer les ex&eacute;cutions
des commandes pour que chacune puisse compl&eacute;ter son initialisation 
avant que la suivante ne soit lanc&eacute;e.</P>
<H2><A NAME="ss4.3">4.3 Faire des scripts</A>
                        </H2>

<P>Bien s&ucirc;r, vous ne souhaitez pas avoir &agrave; taper ces commandes &agrave; chaque
fois que vous souhaitez voir le tunnel fonctionner. J'ai &eacute;crit un 
ensemble de scripts bash qui gardent le tunnel en &eacute;tat de fonctionnement.
Vous pouvez t&eacute;l&eacute;charger le package &agrave; partir 
<A HREF="http://www.shinythings.com/vpnd/vpnd.tar.gz">d'ici</A>. 
Il suffit de les t&eacute;l&eacute;charger et de les d&eacute;compresser dans /usr/local/vpn.
Vous trouverez trois fichiers &agrave; l'int&eacute;rieur:</P>
<P>
<UL>
<LI>vpnd: le script qui contr&ocirc;le la connexion du tunnel.</LI>
<LI>check-vpnd: un script qui sera lanc&eacute; par le cron pour v&eacute;rifier
que le VPN fonctionne toujours.</LI>
<LI>pty-redir: un petit ex&eacute;cutable requis pour l'initiation du tunnel.</LI>
</UL>
</P>
<P>Vous aurez besoin d'&eacute;diter le script <CODE>vpnd</CODE> pour assigner quelques
valeurs telles que le nom d'utilisateur du client et le nom du serveur.
Vous pourrez aussi avoir besoin de modifier la section starttunnel du 
script pour sp&eacute;cifier le r&eacute;seau utilis&eacute;.
Vous trouverez ci-dessous une copie du script pour le plaisir des yeux.
Remarquez que vous pouvez mettre le script dans un r&eacute;pertoire diff&eacute;rent, 
il suffit de changer la variable VPN_DIR.</P>
<P>
<A NAME="vpnd-script"></A> <PRE>

#! /bin/bash
#
# vpnd: Monitor the tunnel, bring it up and down as necessary
#

USERNAME=vpn-username
IDENTITY=/root/.ssh/identity.vpn

VPN_DIR=/usr/local/vpn
LOCK_DIR=/var/run
VPN_EXTERNAL=vpn.mycompany.com
VPN_INTERNAL=vpn-internal.mycompany.com
PTY_REDIR=${VPN_DIR}/pty-redir
SSH=${VPN_DIR}/${VPN_EXTERNAL}
PPPD=/usr/sbin/pppd
ROUTE=/sbin/route
CRYPTO=blowfish
PPP_OPTIONS="noipdefault ipcp-accept-local ipcp-accept-remote local noauth nocrtscts lock nodefaultroute"
ORIG_SSH=/usr/bin/ssh


starttunnel () {
   $PTY_REDIR $SSH -t -e none -o 'Batchmode yes' -c $CRYPTO -i $IDENTITY -l $USERNAME > /tmp/vpn-device
   sleep 15

   $PPPD `cat /tmp/vpn-device` $PPP_OPTIONS
   sleep 15

   # Add routes (modify these lines as necessary)
   /sbin/route add -net 10.0.0.0 gw $VPN_INTERNAL netmask 255.0.0.0
   /sbin/route add -net 172.16.0.0 gw $VPN_INTERNAL netmask 255.240.0.0
   /sbin/route add -net 192.168.0.0 gw $VPN_INTERNAL netmask 255.255.0.0
}

stoptunnel () {
   kill `ps ax | grep $SSH | grep -v grep | awk '{print $1}'`
}

resettunnel () {
   echo "reseting tunnel."
   date >> ${VPN_DIR}/restart.log
   eval stoptunnel
   sleep 5
   eval starttunnel
}

checktunnel () {
   ping -c 4 $VPN_EXTERNAL 2>/dev/null 1>/dev/null

   if [ $? -eq 0 ]; then
      ping -c 4 $VPN_INTERNAL 2>/dev/null 1>/dev/null
      if [ $? -ne 0 ]; then
         eval resettunnel
      fi
   fi
}

settraps () {
   trap "eval stoptunnel; exit 0" INT TERM
   trap "eval resettunnel" HUP
   trap "eval checktunnel" USR1
}

runchecks () {
   if [ -f ${LOCK_DIR}/tunnel.pid ]; then
      OLD_PID=`cat ${LOCK_DIR}/vpnd.pid`
      if [ -d /proc/${OLD_PID} ]; then
         echo "vpnd is already running on process ${OLD_PID}."
         exit 1
      else
         echo "removing stale pid file."
         rm -rf ${LOCK_DIR}/vpnd.pid
         echo $$ > ${LOCK_DIR}/vpnd.pid
         echo "checking tunnel state."
         eval checktunnel
      fi
   else
      echo $$ > ${LOCK_DIR}/vpnd.pid
      eval starttunnel
   fi
}

case $1 in
    check)  if [ -d /proc/`cat ${LOCK_DIR}/vpnd.pid` ]; then
               kill -USR1 `cat ${LOCK_DIR}/vpnd.pid`
               exit 0
            else
               echo "vpnd is not running."
               exit 1
            fi ;;

    reset)  if [ -d /proc/`cat ${LOCK_DIR}/vpnd.pid` ]; then
               kill -HUP `cat ${LOCK_DIR}/vpnd.pid`
               exit 0
            else
               echo "vpnd is not running."
               exit 1
            fi ;;

   --help | -h)
            echo "Usage: vpnd [ check | reset ]"
            echo "Options:"
            echo "     check    Sends running vpnd a USR1 signal, telling it to check"
            echo "              the tunnel state, and restart if neccesary."
            echo "     reset    Sends running vpnd a HUP signal, telling it to reset"
            echo "              it's tunnel connection." ;; 
esac

ln -sf $ORIG_SSH $SSH
settraps
runchecks

while true; do
   i=0
   while [ $i -lt 600 ]; do
      i=((i+1))
      sleep 1
   done
   eval checktunnel
done
</PRE>
</P>
<H2><A NAME="ss4.4">4.4 LRP - Projet de Routeur Linux (Linux Router Project)</A>
                        </H2>

<P>J'ai lanc&eacute; cette installation sur un Pentium 90 ex&eacute;cutant la distribution
LRP de Linux. LRP est une distribution de Linux qui tient et se charge
sur une seule disquette. Vous en apprendrez plus sur 
<A HREF="http://www.linuxrouter.org/">http://www.linuxrouter.org/</A>.
Vous pouvez t&eacute;l&eacute;charger 
<A HREF="http://www.shinythings.com/vpnd/vpnd.lrp">ici</A>
mon package LRP pour le client VPN. Vous aurez aussi besoin des packages 
ppp et ssh du s&icirc;te LRP.</P>
<H2><A NAME="s5">5. Impl&eacute;mentation</A>                </H2>

<P>Dans cette section, j'explique pas &agrave; pas comment mettre en place votre syst&egrave;me
VPN. Je commencerais par le serveur, et poursuivrais avec le client. Pour les
besoins de l'exemple, j'inventerais une situation qui n&eacute;cessitera diff&eacute;rentes
mise en place de VPN.</P>
<H2><A NAME="ss5.1">5.1 Organisation</A>
                        </H2>

<P>Imaginons que nous ayons une entreprise, appel&eacute;e monentreprise.com. 
Au si&egrave;ge, nous utilisons l'adresse r&eacute;seau r&eacute;serv&eacute;e 192.168.0.0, et s&eacute;parons
le r&eacute;seau de classe B en 256 r&eacute;seaux de classe C pour permettre le 
routage. Nous venons de mettre en place deux petits bureaux distants, 
et souhaitons les ajouter &agrave; notre r&eacute;seau. Nous souhaitons aussi permettre
aux employ&eacute;s travaillant chez eux d'utiliser leurs connexions c&acirc;ble ou 
DSL plut&ocirc;t que de leur faire utiliser une communication directe par modem.
Pour commencer, nous devons organiser quelques peu les choses.</P>
<P>J'ai d&eacute;cid&eacute; que je voulais donner &agrave; chaque bureau distant une plage d'adresse
de classe C pour leur permettre de s'&eacute;tendre si cela devait &ecirc;tre n&eacute;cessaire.
J'ai donc r&eacute;serv&eacute; les r&eacute;seaux 192.168.10.0 et 192.168.11.0. J'ai aussi d&eacute;cid&eacute;
que pour les utilisateur se connectant depuis leur domicile, je disposais de 
suffisamment d'adresses et que je n'avais donc pas besoin de leur appliquer
de masquarade du c&ocirc;t&eacute; du serveur VPN. Chaque client dispose de sa propre 
adresse IP interne. J'ai donc eu besoin de r&eacute;server une autre adresse r&eacute;seau
de classe C pour cela, disons 192.168.40.0. La seule chose que j'ai alors du
faire fut d'ajouter ces espaces d'adresse &agrave; mon routeur. Imaginons que notre
entreprise poss&egrave;de un petit Cisco (192.168.254.254) qui g&egrave;re tout le trafic
via notre OC1. Nous n'avons alors qu'&agrave; ajouter les routes sur le Cisco 
de telle mani&egrave;re que le trafic dirig&eacute; vers ces r&eacute;seaux r&eacute;serv&eacute;s soit
dirig&eacute; vers notre serveur VPN (192.168.40.254). J'ai consid&eacute;r&eacute; que le serveur
VPN appartenait au r&eacute;seau de l'utilisateur se connectant depuis son domicile
pour une raison qui sera plus claire tout &agrave; l'heure. Nous appellerons l'interface
externe du serveur vpn.monentreprise.com, et l'interface interne 
vpn-interne.monentreprise.com.</P>
<P>Nous n'avons pas besoin de conna&icirc;tre explicitement les adresses externes. 
Vous devriez avoir les v&ocirc;tres, fournies par votre FAI.</P>
<H2><A NAME="ss5.2">5.2 Rassembler les outils</A>
                        </H2>

<P>Nous allons avoir besoin de quelques logiciels. R&eacute;cup&eacute;rez les 
packages suivants, et installez les &agrave; l'endroit indiqu&eacute;.</P>
<H3>Pour le serveur :                        </H3>

<P>
<UL>
<LI>pppd (version 2.3 ou sup&eacute;rieure)</LI>
<LI>ssh (version 1.2.26 ou sup&eacute;rieure)</LI>
</UL>
</P>
<H3>Pour le client :                        </H3>

<P>
<UL>
<LI>pppd (la m&ecirc;me version que le serveur)</LI>
<LI>ssh</LI>
<LI>
<A HREF="ftp://ftp.vein.hu/ssa/contrib/mag/pty-redir-0.1.tar.gz">pty-redir</A></LI>
</UL>
</P>
<H2><A NAME="ss5.3">5.3 Serveur: Compiler le noyau</A>
                        </H2>

<P>Pour commencer, vous aurez probablement besoin de recompiler le noyau
pour le serveur. Il faut vous assurer que les options suivantes du noyau
sont activ&eacute;es, en plus des option r&eacute;seaux de base, et de toutes celles
dont vous avez besoin. Si vous n'avez jamais compil&eacute; de noyau, r&eacute;f&eacute;rez vous au
<A HREF="/HOWTO/Kernel-HOWTO.html">Kernel HOWTO</A>.</P>
<P>Pour les noyaux 2.0 :        
<UL>
<LI>CONFIG_FIREWALL</LI>
<LI>CONFIG_IP_FORWARD</LI>
<LI>CONFIG_IP_FIREWALL</LI>
<LI>CONFIG_IP_ROUTER</LI>
<LI>CONFIG_PPP</LI>
</UL>
</P>
<P>Pour les noyaux 2.2 :
<UL>
<LI>CONFIG_FIREWALL</LI>
<LI>CONFIG_IP_ADVANCED_ROUTER</LI>
<LI>CONFIG_IP_FIREWALL</LI>
<LI>CONFIG_IP_ROUTER</LI>
<LI>CONFIG_PPP</LI>
</UL>
</P>
<H2><A NAME="ss5.4">5.4 Serveur: Configurer les param&egrave;tres r&eacute;seaux</A>
                        </H2>

<P>Si vous pr&eacute;parez un serveur ne disposant que d'une carte r&eacute;seau, je vous
sugg&egrave;re d'envisager d'en acheter une autre, et de refaire la connectique
de votre r&eacute;seau. La meilleure m&eacute;thode pour garder votre r&eacute;seau priv&eacute; est
encore de le doter de ses propres c&acirc;bles.
Si vous avez deux cartes r&eacute;seaux, vous aurez besoin de savoir les configurer.
Nous nous servirons de eth0 comme interface externe, et de eth1
comme interface interne.</P>
<H3>Configurer les interfaces                                </H3>

<P>Nous devons tout d'abord configurer l'interface externe du serveur.
Vous &ecirc;tes cens&eacute; savoir le faire, et l'avez probablement d&eacute;j&agrave; fait.
Si ce n'est pas le cas, faites le. Si vous ne savez pas le faire, 
r&eacute;f&eacute;rez vous au 
<A HREF="/HOWTO/NET3-4-HOWTO.html">Networking HOWTO</A></P>
<P>Occupons nous maintenant de l'interface interne. Selon la num&eacute;rotation
que nous avons choisi, elle dispose de l'adresse 192.168.40.254.</P>
<P>Pour les noyaux 2.0, utilisez les commandes suivantes :</P>
<P>
<PRE>
# /sbin/ifconfig eth1 192.168.40.254 netmask 255.255.255.0 broadcast 192.168.40.255
# /sbin/route add -net 192.168.40.0 netmask 255.255.255.0 dev eth1
</PRE>
</P>
<P>Pour les noyaux 2.2, utilisez la commande suivante :</P>
<P>
<PRE>
# /sbin/ifconfig eth1 192.168.40.254 netmask 255.255.255.0 broadcast 192.168.40.255
</PRE>
</P>
<P>Cela active nos interfaces. Vous pouvez maintenant communiquer avec
les machines situ&eacute;es sur les deux r&eacute;seaux connect&eacute;s localement au serveur.</P>
<H3>Mettre les routes en place                                </H3>

<P>Nous pouvons parler aux machines situ&eacute;es sur nos r&eacute;seaux locaux, mais ne pouvons
acc&eacute;der au reste de notre r&eacute;seau interne. Ceci n&eacute;cessite quelques lignes de code
suppl&eacute;mentaires. Pour pouvoir atteindre les machines situ&eacute;es sur les autres
sous-r&eacute;seaux, nous devons avoir une route envoyant le trafic vers le routeur
Cisco. C'est ce que fait la commande suivante :
<PRE>
# /sbin/route add -net 192.168.0.0 gw 192.168.254.254 netmask 255.255.0.0 dev eth1
</PRE>
</P>
<P>Cette ligne indique au noyau que le trafic destin&eacute; au r&eacute;seau 192.168.0.0 devrait
&ecirc;tre envoy&eacute; par eth1, et transmis au Cisco. Le trafic pour notre r&eacute;seau local
va toujours o&ugrave; il est suppos&eacute; aller puisque les tables de routage sont ordonn&eacute;es
par taille de masque de sous-r&eacute;seau. Si nous devions avoir d'autres r&eacute;seaux
internes dans notre r&eacute;seau, nous devrions avoir une ligne comme celle-ci pour
chacun d'entre eux.</P>
<H3>Mettre en place les r&egrave;gles de filtrage                                </H3>

<P>Tr&egrave;s bien, nous pouvons donc atteindre toutes les machines que nous voulons.
Nous devons maintenant &eacute;crire les r&egrave;gles de filtrage du firewall qui autorise
ou refuse l'acc&egrave;s au via le serveur VPN.</P>
<P>Pour mettre en place les r&egrave;gles avec <CODE>ipfwadm</CODE>, lancez le ainsi :</P>
<P>
<PRE>
# /sbin/ipfwadm -F -f
# /sbin/ipfwadm -F -p deny
# /sbin/ipfwadm -F -a accept -S 192.168.40.0/24 -D 192.168.0.0/16
# /sbin/ipfwadm -F -a accept -b -S 192.168.10.0/24 -D 192.168.0.0/16
# /sbin/ipfwadm -F -a accept -b -S 192.168.11.0/24 -D 192.168.0.0/16
</PRE>
</P>
<P>Pour mettre en place les r&egrave;gles avec <CODE>ipchains</CODE>, lancez le ainsi :</P>
<P>
<PRE>
# /sbin/ipchains -F forward
# /sbin/ipchains -P forward DENY
# /sbin/ipchains -A forward -j ACCEPT -s 192.168.40.0/24 -d 192.168.0.0/16
# /sbin/ipchains -A forward -j ACCEPT -b -s 192.168.10.0/24 -d 192.168.0.0/16
# /sbin/ipchains -A forward -j ACCEPT -b -s 192.168.11.0/24 -d 192.168.0.0/16
</PRE>
</P>
<P>Cela dit au noyau de refuser tout trafic, except&eacute; celui provenant du r&eacute;seau
192.168.40.0/24 et destin&eacute; au r&eacute;seau 192.168.0.0/16. Le trafic est autoris&eacute;
entre les r&eacute;seaux 192.168.10.0/24 et 192.168.0.0/16, de m&ecirc;me que pour le r&eacute;seau
192.168.11.0. Ces deux derni&egrave;res r&egrave;gles sont bi-directionnelles, ce qui est 
important pour obtenir un routage fonctionnant dans les deux sens.</P>
<H3>Le routage                                </H3>

<P>Pour les utilisateurs souhaitant se connecter depuis leur domicile, tout 
fonctionnera parfaitement &agrave; partir de maintenant. Toutefois, pour les
bureaux distants, nous devons r&eacute;aliser un peu de routage. Nous devons 
tout d'abord dire au routeur principal que les bureaux
distants sont derri&egrave;re le serveur VPN, et donc lui sp&eacute;cifier des routes 
indiquant d'envoyer le trafic destin&eacute; aux bureaux distants au VPN. 
Ceci fait, il faut indiquer au serveur VPN ce qu'il doit faire de ce trafic.
Pour ce faire, il faut lancer la commande <CODE>route</CODE> sur le serveur. Le
seul probl&egrave;me est que pour que celle-ci fonctionne, la liaison doit fonctionner.
Si celle-ci tombe, la route sera perdue. La solution consiste &agrave; ajouter les
routes quand les clients se connectent, ou, plus simplement, &agrave; lancer la commande
route fr&eacute;quemment, &eacute;tant donn&eacute; qu'il n'est pas grave de l'utiliser plus que
n&eacute;cessaire. De fait, cr&eacute;ez un script contenant les lignes suivantes, 
et ajoutez le &agrave; votre crontab pour qu'il soit lanc&eacute; toutes les quelques minutes.  </P>
<P>
<PRE>
/sbin/route add -net 192.168.11.0 gw 192.168.10.253 netmask 255.255.255.0
/sbin/route add -net 192.168.10.0 gw 192.168.11.253 netmask 255.255.255.0
</PRE>
</P>
<H2><A NAME="ss5.5">5.5 Serveur: Configurer <CODE>pppd</CODE></A>
                        </H2>

<P>Nous allons maintenant configurer pppd sur le serveur pour g&eacute;rer les connections au VPN.
Si vous utilisez d&eacute;j&agrave; ce serveur pour g&eacute;rer des utilisateurs acc&eacute;dant au r&eacute;seau par
modem, ou que vous m&ecirc;me vous servez d'un modem pour sortir du r&eacute;seau, sachez que ces 
modifications peuvent affecter ces services. J'expliquerais 
comment &eacute;viter les conflits &agrave; la fin de cette section.</P>
<H3><CODE>/etc/ppp/</CODE>                                </H3>

<P>Ce r&eacute;pertoire peut contenir de nombreux fichiers. Vous disposez d&eacute;j&agrave; probablement
d'un fichier appel&eacute; <CODE>options</CODE>.  Ce fichier contient toutes les options
globales pour <CODE>pppd</CODE>. Elles ne peuvent &ecirc;tre surcharg&eacute;es par 
l'utilisation de <CODE>pppd</CODE> en ligne de commande.</P>
<H3><CODE>/etc/ppp/options</CODE>                                </H3>

<P>Votre fichier <CODE>options</CODE> devrait au moins contenir les param&egrave;tres suivants :</P>
<P>
<PRE>
ipcp-accept-local
ipcp-accept-remote
proxyarp
noauth
</PRE>
</P>
<P>Les deux premi&egrave;res lignes indiquent &agrave; <CODE>pppd</CODE> d'accepter que l'autre
c&ocirc;t&eacute; sp&eacute;cifie les adresses IP. Ces options sont n&eacute;cessaires lorsque l'on se connecte
avec des bureaux distants, mais peut &ecirc;tre d&eacute;sactiv&eacute;e si l'on ne la fait
qu'avec des travailleurs &agrave; domicile. Les laisser activ&eacute;es ne pose pas de probl&egrave;mes,
&eacute;tant donn&eacute; qu'elles n'emp&ecirc;chent pas le serveur d'assigner une adresse, mais 
informe simplement celui-ci que le client a le droit d'en proposer une.</P>
<P>La troisi&egrave;me ligne est tr&egrave;s importante.  Selon la page man de <CODE>pppd</CODE> :</P>
<P>
<PRE>
proxyarp
        Ajoute une entr&eacute;e &agrave; la table ARP [Address Resolution
        Protocol] de ce syst&egrave;me avec l'adresse IP du pair
        et l'adresse Ethernet de ce syst&egrave;me. Cela aura pour 
        effet de faire croire aux autres syst&egrave;mes que
        le pair est situ&eacute; sur l'ethernet local.
</PRE>
                </P>
<P>C'est une option importante, car si elle n'est pas utilis&eacute;e, le trafic
local ne pourra pas revenir par le tunnel.</P>
<P>La derni&egrave;re ligne est toute aussi importante. Elle informe <CODE>pppd</CODE> 
qu'il faut autoriser les connections sans nom d'utilisateur ni mot de passe.
Cette m&eacute;thode ne nuit pas &agrave; la s&eacute;curit&eacute;, puisque l'authentification est
d&eacute;j&agrave; r&eacute;alis&eacute;e par <CODE>sshd</CODE>.</P>
<H3>Eviter les conflits                                </H3>

<P>Si vous g&eacute;rez d'autres services avec <CODE>pppd</CODE>, vous devez consid&eacute;rer
que les configurations respectives de ces autres services peuvent &ecirc;tre
diff&eacute;rentes de celle requise par le VPN.  <CODE>pppd</CODE> est con&ccedil;u pour que
les options du fichier d'options principal <CODE>/etc/ppp/options</CODE> ne
puissent pas &ecirc;tre surcharg&eacute;es par les options sp&eacute;cifi&eacute;es au moment de
l'ex&eacute;cution, et ceci pour des raisons de s&eacute;curit&eacute;. Afin d'&eacute;viter les conflits,
d&eacute;terminez les options qui en sont &agrave; l'origine, et d&eacute;placez les du fichier
principal vers un fichier d'option distinct, charg&eacute; lorsque l'application
appropri&eacute;e de <CODE>pppd</CODE> est lanc&eacute;e. </P>
<H2><A NAME="ss5.6">5.6 Serveur: Configurer <CODE>sshd</CODE></A>
                        </H2>

<P>Voici a quoi ressemble mon fichier <CODE>/etc/sshd_config</CODE>, et &agrave; quoi devrait
approximativement ressembler le votre :</P>
<P>
<PRE>
# Fichier de configuration ssh du serveur

Port 22
ListenAddress 0.0.0.0
HostKey /etc/ssh_host_key
RandomSeed /etc/ssh_random_seed
ServerKeyBits 768
LoginGraceTime 600
KeyRegenerationInterval 3600
PermitRootLogin yes
IgnoreRhosts yes
StrictModes yes
QuietMode no
FascistLogging yes
CheckMail no
IdleTimeout 3d
X11Forwarding no
PrintMotd no
KeepAlive yes
SyslogFacility DAEMON
RhostsAuthentication no
RhostsRSAAuthentication no
RSAAuthentication yes
PasswordAuthentication no
PermitEmptyPasswords no
UseLogin no
</PRE>
</P>
<P>Il est important de remarquer que l'authentification par mot de passe a &eacute;t&eacute; d&eacute;sactiv&eacute;e, 
tout comme tous les autres services &quot;r&quot;.  J'ai aussi d&eacute;sactiv&eacute; la notification
de mail, et le message du jour, &eacute;tant donn&eacute; qu'il peuvent d&eacute;sorienter <CODE>pppd</CODE> du
c&ocirc;t&eacute; client. J'autorise toujours la connexion en tant que root, qui reste s&ucirc;re &eacute;tant
donn&eacute; qu'elle requiert l'utilisation d'une cl&eacute;.</P>
<H2><A NAME="user-accounts"></A> <A NAME="ss5.7">5.7 Serveur: Mettre en place les comptes utilisateurs</A>
                        </H2>

<P>Nous allons maintenant mettre en place les comptes utilisateurs.</P>
<H3>Ajouter un groupe <CODE>vpn-users</CODE>                                </H3>

<P>lancez simplement:</P>
<P>
<PRE>
# /usr/sbin/groupadd vpn-users
</PRE>
</P>
<P>Faites maintenant un cat du fichier <CODE>/etc/group</CODE> et regardez la derni&egrave;re
ligne. Il doit s'agir de l'entr&eacute;e pour le groupe vpn-users. Remarquez le 
troisi&egrave;me champ. Il s'agit de l'identifiant du groupe (Group ID ou GID).
Notez le, &eacute;tant donn&eacute; que nous allons en avoir besoin sous peu. Dans notre
exemple, GID vaut 101.</P>
<H3>Cr&eacute;er le r&eacute;pertoire domicile des <CODE>vpn-users</CODE>                                </H3>

<P>Nous utiliserons un seul r&eacute;pertoire domicile pour tous les utilisateurs.
Lancez simplement :</P>
<P>
<PRE>
# mkdir /home/vpn-users
</PRE>
</P>
<H3>Le r&eacute;pertoire <CODE>.ssh</CODE>                                </H3>

<P>Cr&eacute;ez maintenant le r&eacute;pertoire <CODE>.ssh</CODE> dans le r&eacute;pertoire
domicile des <CODE>vpn-users</CODE>.</P>
<P>
<PRE>
# mkdir /home/vpn-users/.ssh
</PRE>
</P>
<H3>Ajouter des utilisateurs                                </H3>

<P>Ca devient amusant. Nous allons &eacute;diter le fichier <CODE>/etc/passwd</CODE> &agrave; la
main :) . Normalement, vous laissez le syst&egrave;me g&eacute;rer ce fichier, mais pour 
une installation aussi &eacute;trange que celle-ci, il est plus simple de le faire
vous m&ecirc;me. Pour commencer, ouvrons le fichier <CODE>/etc/passwd</CODE> et 
regardons ce qu'il contient. Voici un exemple de ce que vous pourriez trouver:</P>
<P>
<PRE>
...
nobody:x:65534:100:nobody:/dev/null:
mwilson:x:1000:100:Matthew Wilson,,,:/home/mwilson:/bin/bash
joe:*:1020:101:Joe Mode (home),,,:/home/vpn-users:/usr/sbin/pppd
bill:*:1020:101:Bill Smith (home),,,:/home/vpn-users:/usr/sbin/pppd
frank:*:1020:101:Frank Jones (home),,,:/home/vpn-users:/usr/sbin/pppd
...
</PRE>
</P>
<P>Vous trouverez le premier utilisateur sur la plupart des syst&egrave;mes. Le
suivant, c'est moi :). Apr&egrave;s viennent quelques vpn-users que j'ai cr&eacute;&eacute;.
Le premier champ est le nom d'utilisateur, le second le mot de passe. 
Le troisi&egrave;me est l'identifiant d'utilisateur (User ID ou UID), et le
quatri&egrave;me l'identifiant de groupe. Apr&egrave;s viennent certaines infos sur 
l'identit&eacute; de l'utilisateur (dans le cinqui&egrave;me champ). Le sixi&egrave;me est 
le r&eacute;pertoire domicile de l'utilisateur, et le dernier son shell. Comme
vous pouvez le voir, chaque champ est s&eacute;par&eacute; par une deux points.
Regardez les trois derni&egrave;res lignes. La seule diff&eacute;rence existant entre 
eux est le nom d'utilisateur du premier champ et l'information sur 
l'utilisateur dans le cinqui&egrave;me. Nous souhaitons cr&eacute;er une ligne comme
celles-ci pour chaque utilisateur. Evitez d'utiliser un seul utilisateur
pour toutes les connections, faute de quoi il vous sera impossible de 
les diff&eacute;rencier par la suite. Donc, copiez la derni&egrave;re ligne du fichier, 
et &eacute;ditez la afin de qu'elle ressemble &agrave; notre exemple. Assurez vous que 
le second champ contient une ast&eacute;risque. Le troisi&egrave;me champ devrait &ecirc;tre unique
par rapport &agrave; tous les autres identifiants dans le fichier. J'ai utilis&eacute; 
1020. Vous devriez utiliser un nombre sup&eacute;rieur &agrave; 1000, &eacute;tant donn&eacute; que
les nombres inf&eacute;rieurs &agrave; 1000 sont g&eacute;n&eacute;ralement r&eacute;serv&eacute;s pour le syst&egrave;me.
Le quatri&egrave;me champ devrait &ecirc;tre l'identifiant du groupe vpn-users. Je vous
ai dit tout &agrave; l'heure de l'&eacute;crire, c'est maintenant qu'il faut s'en servir.
Donc, mettez ici l'identifiant du groupe. Enfin, changez le r&eacute;pertoire
domicile en <CODE>/home/vpn-users</CODE>, et le shell en <CODE>/usr/sbin/pppd</CODE>.
C'est fait. Maintenant, copiez celle ligne pour cr&eacute;er plus d'utilisateurs.
Editez simplement le premier et le dernier champ, et c'est fait.</P>
<H2><A NAME="ss5.8">5.8 Serveur: Administration</A>
                        </H2>

<P>Un des avantages de l'utilisation de ce syst&egrave;mes pour les comptes utilisateurs
est que l'on peut b&eacute;n&eacute;ficier des commandes d'administrations d'utilisateur UNIX.
Comme chaque client est connect&eacute; en tant qu'utilisateur, on peut utiliser les 
m&eacute;thodes standards pour obtenir les statistiques des utilisateurs. Voici quelques
commandes que j'aime utiliser pour voir ce qui se passe:</P>
<P>
<DL>

<DT><B>who</B><DD><P>Affiche les utilisateurs connect&eacute;s actuellement, ainsi que le moment o&ugrave;
ils se sont connect&eacute;s, de quelle machines (par le nom de celle-ci ou
son adresse IP), et sur quel port.</P>

<DT><B>w</B><DD><P>Cette commande affiche une description plus exhaustive des entit&eacute;s actuellement
connect&eacute;es. Il fournit aussi le temps &eacute;coul&eacute; depuis la mise en fonctionnement
du syst&egrave;me, ainsi que sa charge. De m&ecirc;me, il liste les processus des utilisateurs
(qui devraient &ecirc;tre -pppd pout les client VPN) qui tournent, le temps processeur
non utilis&eacute; (idle time), et l'utilisation faite du processeur, pour chacun des
processus et pour le processus courant. R&eacute;f&eacute;rez vous &agrave; la page man <CODE>w</CODE>
pour plus d'information.</P>

<DT><B>last [nom_utilisateur]</B><DD><P>Cette commande fournit l'historique pour l'utilisateur sp&eacute;cifi&eacute;, et pour tout les
utilisateurs si aucun nom_utilisateur n'est fourni. Elle est particuli&egrave;rement
utile pour s'assurer que les tunnels fonctionnent bien, car elle affiche le
temps &eacute;coul&eacute; depuis la connexion de l'utilisateur, et donne la liste des
utilisateur connect&eacute;s. Je dois vous pr&eacute;venir que sur un syst&egrave;me qui n'a 
pas &eacute;t&eacute; red&eacute;marr&eacute; depuis longtemps, cette liste peut devenir extr&ecirc;mement longue.
Je vous conseille donc de l'utiliser conjointement avec <CODE>grep</CODE> ou
<CODE>head</CODE>, gr&acirc;ce &agrave; un pipe, pour d&eacute;couvrir exactement ce que vous souhaitez.</P>
</DL>
</P>
<P>Vous pouvez aussi contr&ocirc;ler quels utilisateurs sont autoris&eacute;s &agrave; se connecter en 
modifiant le fichier <CODE>/home/vpn-users/.ssh/authorized_keys</CODE>.
Si vous en retirez la ligne contenant la cl&eacute; publique d'un utilisateur, il ne
sera plus capable de se reconnecter.</P>
<H2><A NAME="ss5.9">5.9 Client: Compiler le noyau</A>
                        </H2>

<P>Nous nous int&eacute;ressons maintenant au client. Nous devons tout d'abord recompiler le
noyau pour qu'il contienne toutes les fonctionnalit&eacute;s n&eacute;cessaires. Il faut au minimum
disposer de ppp dans le noyau. Apr&egrave;s cela, il nous faudra les fonctions de forwarding, 
de firewall, et de passerelle, mais seulement si vous comptez autoriser d'autres 
machines &agrave; acc&eacute;der au tunnel. Dans cet exemple, je configurerais une des machines du
bureau distant. Ajoutez les options ci-dessous &agrave; votre noyau. Une fois encore, si
vous n'avez jamais recompil&eacute; de noyau, r&eacute;f&eacute;rez vous au
<A HREF="/HOWTO/Kernel-HOWTO.html">Kernel HOWTO</A>.</P>
<P>Pour les noyaux 2.0:
<UL>
<LI>CONFIG_PPP</LI>
<LI>CONFIG_FIREWALL</LI>
<LI>CONFIG_IP_FORWARD</LI>
<LI>CONFIG_IP_FIREWALL</LI>
<LI>CONFIG_IP_ROUTER</LI>
<LI>CONFIG_IP_MASQUERADE</LI>
<LI>CONFIG_IP_MASQUERADE_ICMP</LI>
</UL>
</P>
<P>Pour les noyaux 2.2:
<UL>
<LI>CONFIG_PPP</LI>
<LI>CONFIG_FIREWALL</LI>
<LI>CONFIG_IP_ADVANCED_ROUTER</LI>
<LI>CONFIG_IP_FIREWALL</LI>
<LI>CONFIG_IP_ROUTER</LI>
<LI>CONFIG_IP_MASQUERADE</LI>
<LI>CONFIG_IP_MASQUERADE_ICMP</LI>
</UL>
</P>
<H2><A NAME="ss5.10">5.10 Client: Configurer les param&egrave;tres r&eacute;seaux</A>
                        </H2>

<P>Nous devons maintenant configurer les param&egrave;tres r&eacute;seaux sur notre client.
Consid&eacute;rons que tout fonctionne correctement avec le r&eacute;seau externe. Nous allons
maintenant mettre en place l'interface interne du client notre intranet.</P>
<H3>Interface                                </H3>

<P>Nous devons tout d'abord configurer l'interface r&eacute;seau interne. Pour ce faire,
ajoutez les lignes suivantes &agrave; votre fichier <CODE>/etc/rc.d/rc.inet1</CODE> 
(ou &eacute;quivalent):</P>
<P>Pour les noyaux 2.0 : </P>
<P>
<PRE>
/sbin/ifconfig eth1 192.168.10.253 broadcast 192.168.10.255 netmask 255.255.255.0
/sbin/route add -net 192.168.10.0 netmask 255.255.255.0 dev eth1
</PRE>
</P>
<P>Pour les noyaux 2.2 : </P>
<P>
<PRE>
/sbin/ifconfig eth1 192.168.10.253 broadcast 192.168.10.255 netmask 255.255.255.0
</PRE>
</P>
<H3>R&egrave;gles de filtrage                                </H3>

<P>Pour configurer le bureau distant, nous voulons mettre en place des r&egrave;gles
de filtrage qui permettent au trafic d'emprunter le tunnel dans les 
deux directions. Ajoutez pour cela les lignes suivantes &agrave; votre fichier
<CODE>/etc/rc.d/rc.inet1</CODE> ou &eacute;quivalent: </P>
<P>Pour les noyaux 2.0 :</P>
<P>
<PRE>
/sbin/ipfwadm -F -f
/sbin/ipfwadm -F -p deny
/sbin/ipfwadm -F -a accept -b -S 192.168.10.0/24 -D 192.168.0.0/16
</PRE>
</P>
<P>Pour les noyaux 2.2 :</P>
<P>
<PRE>
/sbin/ipchains -F forward
/sbin/ipchains -P forward DENY
/sbin/ipchains -A forward -j ACCEPT -b -s 192.168.10.0/24 -d 192.168.0.0/16
</PRE>
</P>
<P>Vous avez peut-&ecirc;tre remarqu&eacute; que ces lignes ressemblent &agrave; celles que nous avons
sur le serveur. C'est parce qu'elles sont identiques. Elles d&eacute;crivent simplement
o&ugrave; le trafic est autoris&eacute; &agrave; aller, c'est &agrave; dire entre les deux r&eacute;seaux.</P>
<H3>Routage                                </H3>

<P>Les seules deux routes suppl&eacute;mentaires n&eacute;cessaires sont cr&eacute;es par le script
qui met en place le tunnel.</P>
<H2><A NAME="ss5.11">5.11 Client: Configurer <CODE>pppd</CODE></A>
                        </H2>

<P>Vous n'aurez peut-&ecirc;tre pas besoin d'&eacute;diter le fichier <CODE>/etc/ppp/options</CODE> du
client. Ce ne sera n&eacute;cessaire que si l'option "auth" ou certaines autres options
sont pr&eacute;sentes. Essayez, et si &ccedil;a ne marche pas, un fichier <CODE>/etc/ppp/options</CODE>
vide fonctionnera. Continuez simplement &agrave; ajouter les options de l'ancien fichier pour
savoir laquelle pose probl&egrave;me (si ce n'est pas &eacute;vident), et regardez si vous pouvez
vous en passer. Peut-&ecirc;tre est-ce le cas, notamment si vous ne vous servez de <CODE>pppd</CODE> 
pour rien d'autre.</P>
<H2><A NAME="ss5.12">5.12 Client: Configurer <CODE>ssh</CODE></A>
                        </H2>

<P>En tant que root, ex&eacute;cutez les lignes suivantes sur le client:</P>
<P>
<PRE>
# mkdir /root/.ssh
# ssh-keygen -f /root/.ssh/identity.vpn -P ""
</PRE>
</P>
<P>Ces commandes vont cr&eacute;er deux fichiers, <CODE>identity.vpn</CODE> et
<CODE>identity.vpn.pub</CODE> dans le r&eacute;pertoire <CODE>.ssh</CODE>. Le premier est votre
cl&eacute; priv&eacute;e, et devrait le rester. <EM>NE L'ENVOYEZ JAMAIS SUR LE RESEAU</EM>, &agrave; 
moins que ce ne soit au travers d'un transfert chiffr&eacute;e. Le second fichier est 
votre cl&eacute; publique, et vous pouvez l'envoyer o&ugrave; vous voulez, il ne sert 
qu'&agrave; vous autoriser l'acc&egrave;s aux autres syst&egrave;mes, et ne peut &ecirc;tre utilis&eacute; 
pour p&eacute;n&eacute;trer le votre. Il s'agit d'un fichier texte d'une ligne, codant votre cl&eacute;. 
A la fin de la ligne se trouve le champ commentaire, que vous pouvez modifier sans 
craindre de briser la cl&eacute;. Voici un exemple de cl&eacute; : </P>
<P>
<PRE>
1024 35 1430723736674162619588314275167.......250872101150654839 root@vpn-client.mycompany.com
</PRE>
</P>
<P>C'est en fait beaucoup plus long que cela, mais &ccedil;a ne tiendrait pas sur une page si
je montrais la totalit&eacute; de la chose. Copiez votre cl&eacute; dans le fichier
<CODE>/home/vpn-users/.ssh/authorized_keys</CODE> sur le serveur. Assurez vous 
qu'il s'agit de la seule cl&eacute; de la ligne, et que chaque cl&eacute; n'est pas s&eacute;par&eacute;e sur
de multiples lignes. Vous pouvez modifier le champ de commentaire comme vous voulez
pour vous rappeler quelle cl&eacute; corresponds &agrave; quel utilisateur. Je vous le recommande
fortement. </P>
<H2><A NAME="ss5.13">5.13 Client: mettre en place la connexion</A>
                        </H2>

<P>Nous allons maintenant essayer de r&eacute;aliser la connexion au serveur VPN. Tout d'abord, 
nous avons besoin d'&eacute;diter le fichier known_hosts de <CODE>ssh</CODE> pour r&eacute;aliser 
la moindre connexion. Ex&eacute;cutez ceci:</P>
<P>
<PRE>
# ssh vpn.mycompany.com
</PRE>
</P>
<P>R&eacute;pondez par l'affirmative lorsqu'il vous est demand&eacute; si vous souhaitez continuer
&agrave; vous connecter. Le serveur va r&eacute;pondre ''permission denied'', mais c'est normal.
Il est important que vous utilisiez le m&ecirc;me nom pour le serveur que celui que vous
utilisez pour vos scripts de connexion. Ex&eacute;cutez maintenant les lignes suivantes. 
Vous aurez &eacute;videment besoin de changer la plupart des options pour correspondre
&agrave; votre installation.</P>
<P>
<PRE>
# /usr/sbin/pty-redir /usr/bin/ssh -t -e none -o 'Batchmode yes' -c blowfish -i /root/.ssh/identity.vpn -l vpn-user vpn.mycompany.com > /tmp/vpn-device

        (Maintenant, attendez &agrave; peu pr&egrave;s 10 secondes)

# /usr/sbin/pppd `cat /tmp/vpn-device` 192.168.10.254:192.168.40.254
</PRE>
</P>
<P>Remarquez les adresses IP sp&eacute;cifi&eacute;es dans la ligne pppd. La premi&egrave;re est
l'adresse du client &agrave; l'autre bout du tunnel. La seconde est l'adresse 
de l'issue du tunnel cot&eacute; serveur, mise &agrave; la valeur de l'adresse interne
du serveur. Si tout semble fonctionner, continuez. Si non, v&eacute;rifiez que
vous avez bien toutes les options, et qu'elles sont correctement entr&eacute;e.
Si les probl&egrave;mes persistent, v&eacute;rifiez la 
<A HREF="#pitfalls">section Probl&egrave;mes</A>.</P>
<H2><A NAME="ss5.14">5.14 Client: D&eacute;finir les routes</A>
                        </H2>

<P>D&eacute;finissez maintenant la route pour envoyer le trafic au travers du tunnel. Lancez
simplement cette commande :</P>
<P>
<PRE>
# /sbin/route add -net 192.168.0.0 gw vpn-internal.mycompany.com netmask 255.255.0.0
</PRE>
</P>
<P>Vous devriez maintenant &ecirc;tre capable de communiquer avec les machines de 
l'autre c&ocirc;t&eacute; du tunnel. Faites un essais... Nickel, hein? Si &ccedil;a ne 
fonctionne pas, essayez d'utiliser <CODE>ping</CODE> et <CODE>traceroute</CODE> 
pour d&eacute;couvrir o&ugrave; se situe le probl&egrave;me. Si en fait &ccedil;a fonctionne r&eacute;ellement, 
continuez en mettant en place des scripts qui feront le travail pour vous.</P>
<H2><A NAME="ss5.15">5.15 Client: Faire des scripts</A>
                        </H2>

<P>Utilisez le script vpnd que je montre 
<@@ref>vpn-scriptici</A>.
Vous n'avez qu'&agrave; le modifier un petit peu. Faites les changements suivants:</P>
<P>
<UL>
<LI>Changez les variables du d&eacute;but pour correspondre &agrave; votre configuration.
La plupart sont probablement corrects, mais vous pouvez les changer
si vous en avez besoin...</LI>
<LI>Ligne 27: ajoutez les adresses IP locales et distantes avant $PPP_OPTIONS</LI>
<LI>Ligne 31: changez cette ligne, et les deux suivantes pour configurer les 
routes pour votre r&eacute;seau interne.</LI>
</UL>
</P>

<H3>Le maintenir en &eacute;tat de fonctionnement                                </H3>

<P>M&ecirc;me si les scripts bash sont g&eacute;n&eacute;ralement stables, il sont connus
pour planter parfois. Pour s'assurer que le script <CODE>vpnd</CODE> continue
&agrave; tourner, ajoutez une entr&eacute;e dans la contab du client qui ex&eacute;cute
le script <CODE>check-vpnd</CODE>. Je lance le mien toute les cinq minutes &agrave; 
peu pr&egrave;s. Si <CODE>vpnd</CODE> tourne r&eacute;ellement, <CODE>check-vpnd</CODE> n'utilise
pas beaucoup de puissance de calcul.</P>
<H2><A NAME="s6">6. Annexes</A>                </H2>

<H2><A NAME="pitfalls"></A> <A NAME="ss6.1">6.1 Probl&egrave;mes</A>
                        </H2>

<P>Voici quelques-uns des probl&egrave;mes que j'ai rencontr&eacute; alors que j'utilisais ce syst&egrave;me.
Je les ai indiqu&eacute;s ici dans l'espoir que vous puissiez les &eacute;viter. Si vous rencontrez
un probl&egrave;me que je ne d&eacute;cris pas ici, envoyez moi un
<A HREF="mailto:matthew@shinythings.com">courrier &eacute;lectronique</A> pour que 
je puisse le r&eacute;f&eacute;rencer et permettre aux autres de l'&eacute;viter.</P>
<H3>Lecture : erreur d'entr&eacute;e/sortie                                </H3>

<P>Cette erreur vient apparemment de pppd. C'est du &agrave; l'utilisation d'une mauvaise
version de pppd. Si cela vous arrive, essayez de mettre &agrave; jour les deux 
c&ocirc;t&eacute;s de la connexion avec la derni&egrave;re version de pppd. J'ai d&eacute;couvert 
que la version 2.2 pose probl&egrave;me, et utilise les versions 2.3.7 ou 2.3.8 
&agrave; la place.</P>
<H3>SIOCADDRT: Le r&eacute;seau est non-atteignable                                </H3>

<P>Cette erreur est g&eacute;n&eacute;r&eacute;e par <CODE>route</CODE>. Je l'ai vu se produire quand le
temps d'attente entre <CODE>ssh</CODE> et <CODE>pppd</CODE> n'est pas assez grand.
Si vous rencontrez cette erreur, lancez <CODE>ifconfig</CODE>, il se peut que 
vous vous aperceviez qu'il n'y a pas d'interface pppX. Cela signifie que 
<CODE>ssh</CODE> n'avait pas fini l'authentification avant que <CODE>pppd</CODE> 
ne soit lanc&eacute;, et que <CODE>pppd</CODE> n'ait donc pu r&eacute;aliser la connexion.
Augmentez simplement le d&eacute;lai d'attente, et vos probl&egrave;mes seront r&eacute;solus.</P>
<P>Je me demande toutefois s'il n'existe pas une option pppd qui r&egrave;glerait
ce probl&egrave;me.</P>
<H3><A NAME="ipv4forwarding"></A> Transmission IPv4 et les noyaux 2.2                                </H3>

<P>Dans les nouveaux noyaux 2.2, vous devez sp&eacute;cifier que vous installez
le forwarding IPv4 dans le noyau au d&eacute;marrage. Ce qui se fait avec la
commande suivante:</P>
<P>
<PRE>
# echo 1 > /proc/sys/net/ipv4/ip_forward
</PRE>
</P>
<P>Sans cela, le noyau ne transmettra aucun datagramme, et le serveur ne
fonctionnera donc pas, pas plus qu'aucun des clients passerelles.</P>
<H3>Routage                                </H3>

<P>Cela va sans dire, mais faites attention quand vous routez des adresses
r&eacute;elles que vous ne routez pas le trafic destin&eacute; aux adresses externes
du serveur VPN au travers du tunnel. Ca ne le fera pas (Oui, il s'agit 
<EM>vraiment</EM> d'une exp&eacute;rience personnelle). </P>
<H2><A NAME="ss6.2">6.2 Configuration minimale mat&eacute;rielle et logicielle</A>
                        </H2>

<H3>Configuration mat&eacute;rielle minimale                                </H3>

<P>Croyez le ou pas, ce syst&egrave;me a &eacute;t&eacute; ex&eacute;cut&eacute; sur un 486SX33 avec 8 Mo de RAM.
Ca ne marchait toutefois pas tr&egrave;s bien, car il avait des probl&egrave;mes &agrave; 
g&eacute;rer le gros trafic.</P>
<P>Ca n'a cependant pas &eacute;t&eacute; trop dur de le faire fonctionner. Ce syst&egrave;me 
marche tr&egrave;s bien sur un Pentium 75 avec 16 Mo de RAM, utilisant une 
distribution LRP sur disquette, avec 6 Mo de ramdisk, et 10 Mo de m&eacute;moire
principale. J'ai test&eacute; cette configuration en faisant passer un flux RealVideo
&agrave; 700Kbits au travers pendant plus d'une heure.</P>
<P>Je le fait maintenant fonctionner en g&eacute;n&eacute;ral sur des Pentium 90, &eacute;tant donn&eacute;
que leur fr&eacute;quence d'horloge fonctionne mieux avec les cartes Ethernet &agrave;
100Mbits/sec.</P>
<H3>Configuration logicielle minimale                                </H3>

<P>Ce syst&egrave;me fonctionne tant avec les noyaux 2.0 qu'avec les 2.2. Le script
permettant de garder le tunnel en fonctionnement demande un bash raisonnablement
moderne. J'ai toutefois remarqu&eacute; que les versions de bash que l'on trouve
sur certaines distributions ne fonctionnent pas tr&egrave;s bien avec le script.</P>
<P>De fait, si quelqu'un pouvait m'aider &agrave; am&eacute;liorer mes scripts (ou m&ecirc;me 
&agrave; &eacute;crire un ex&eacute;cutable?), &ccedil;a m'aiderait beaucoup. Je ne suis pas certains 
de savoir pourquoi, mais m&ecirc;me mon propre bash ne suit pas les r&egrave;gles et ne 
semble pas interpr&eacute;ter les signaux correctement. Si vous faites des am&eacute;liorations, 
envoyez moi un courrier &eacute;lectronique &agrave; 
<A HREF="mailto:matthew@shinythings.com">matthew@shinythings.com</A>
s'il vous plait.</P>
</BODY>
</HTML>
