<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Guide pratique de mise en &#339;uvre de XDMCP sous Linux</title><link href="style.css" rel="stylesheet" type="text/css"><meta content="DocBook XSL Stylesheets V1.68.1" name="generator"><meta name="description" content="

      Ce guide pratique explique comment utiliser ensemble un 
      gestionnaire d'affichage X (xdm, kdm et gdm) et XDMCP (le 
      protocole de contr&ocirc;le du gestionnaire d'affichage X) pour fournir 
      une solution de terminaux X et une plate-forme d'ex&eacute;cution 
      efficace d'applications X &agrave; distance. Ce document met l'accent sur 
      la configuration d'une connexion X avec XDMCP.

    "></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article" lang="fr"><div class="titlepage"><div><div><h1 class="title"><a name="N10001"></a>Guide pratique de mise en &#339;uvre de XDMCP sous Linux</h1></div><div><h3 class="subtitle"><i>

    Version fran&ccedil;aise du <span class="foreignphrase" lang="en"><em class="foreignphrase">Linux XDMCP
    HOWTO</em></span>

    </i></h3></div><div><div class="author"><h3 class="author"><span class="firstname">Thomas</span> <span class="surname">Chao</span></h3><code class="email">&lt;<a href="mailto:tomchao CHEZ lucent POINT com">tomchao CHEZ lucent POINT com</a>&gt;</code></div></div><div><p class="othercredit"><span class="contrib">Adaptation fran&ccedil;aise</span>&nbsp;: <span class="firstname">Denis</span> <span class="surname">Berhaut</span></p></div><div><p class="othercredit"><span class="contrib">Relecture de la version fran&ccedil;aise</span>&nbsp;: <span class="firstname">&Eacute;ric</span> <span class="surname">Madesclair</span></p></div><div><p class="othercredit"><span class="contrib">Pr&eacute;paration de la publication de la v.f.</span>&nbsp;: <span class="firstname">Jean-Philippe</span> <span class="surname">Gu&eacute;rard</span></p></div><div><p class="releaseinfo">Version&nbsp;: 1.3.fr.1.0</p></div><div><p class="pubdate">26 janvier 2005</p></div><div><div class="revhistory"><table summary="Revision history" width="100%" border="1"><tr><th colspan="3" valign="top" align="left"><b>Historique des versions</b></th></tr><tr><td align="left">Version 1.3.fr.1.0</td><td align="left">2005-01-26</td><td align="left">DB, &Eacute;M, JPG</td></tr><tr><td colspan="3" align="left">Premi&egrave;re version fran&ccedil;aise.</td></tr><tr><td align="left">Version 1.3</td><td align="left">2003-01-02</td><td align="left">TC</td></tr><tr><td colspan="3" align="left">

            Ajout d'informations pour la configuration de Red Hat 7.3
            &amp; 8.0, Mandrake 8.2 &amp; 9.0, SuSE et mise &agrave; jour de
            contenu.

        </td></tr><tr><td align="left">Version 1.2</td><td align="left">2002-03-15</td><td align="left">TC</td></tr><tr><td colspan="3" align="left">

            Ajout d'informations sur la configuration de Linux Red Hat
            7.2, Mandrake 8.1 et Slackware 8.0 ainsi que sur le
            transfert de X11 sous SSH.

        </td></tr><tr><td align="left">Version 1.1</td><td align="left">2001-03-20</td><td align="left">TC</td></tr><tr><td colspan="3" align="left">R&eacute;vision et ajout de RH 7.0.</td></tr><tr><td align="left">Version 1.0</td><td align="left">2000-11-01</td><td align="left">TC</td></tr><tr><td colspan="3" align="left">Premi&egrave;re r&eacute;vision et diffusion.</td></tr></table></div></div><div><div class="abstract"><p class="title"><b>R&eacute;sum&eacute;</b></p><p>

      Ce guide pratique explique comment utiliser ensemble un 
      gestionnaire d'affichage X (xdm, kdm et gdm) et XDMCP (le 
      protocole de contr&ocirc;le du gestionnaire d'affichage X) pour fournir 
      une solution de terminaux X et une plate-forme d'ex&eacute;cution 
      efficace d'applications X &agrave; distance. Ce document met l'accent sur 
      la configuration d'une connexion X avec XDMCP.

    </p></div></div></div><hr></div><div class="toc"><p><b>Table des mati&egrave;res</b></p><dl><dt><span class="sect1"><a href="#intro">1. Introduction</a></span></dt><dd><dl><dt><span class="sect2"><a href="#disclaimer">1.1. Limitations de responsabilit&eacute;</a></span></dt><dt><span class="sect2"><a href="#nouvelles-versions">1.2. 
          Nouvelles versions de ce document
      </a></span></dt><dt><span class="sect2"><a href="#feedback">1.3. Commentaires et r&eacute;actions</a></span></dt></dl></dd><dt><span class="sect1"><a href="#procedure">2. La proc&eacute;dure</a></span></dt><dd><dl><dt><span class="sect2"><a href="#N100B2">2.1. Avant de commencer, quelques notions</a></span></dt><dt><span class="sect2"><a href="#security">2.2. Rappel de s&eacute;curit&eacute;</a></span></dt><dt><span class="sect2"><a href="#system">2.3. Mon syst&egrave;me</a></span></dt><dt><span class="sect2"><a href="#remote">2.4. Pi&egrave;ces rapport&eacute;es</a></span></dt><dt><span class="sect2"><a href="#prep">2.5. Pr&eacute;paration du serveur</a></span></dt><dt><span class="sect2"><a href="#steps">2.6. Proc&eacute;dures &agrave; suivre</a></span></dt><dt><span class="sect2"><a href="#testing">2.7. Tests</a></span></dt></dl></dd><dt><span class="sect1"><a href="#ssh">3. Transfert X11 &agrave; l'aide de SSH</a></span></dt><dt><span class="sect1"><a href="#ts">4. D&eacute;pannage</a></span></dt><dt><span class="sect1"><a href="#gdm">5. 

    XDMCP et GDM (le Gestionnaire d'affichage Gnome)

    </a></span></dt><dt><span class="sect1"><a href="#refs">6. Ressources</a></span></dt><dt><span class="sect1"><a href="#au">7. Auteurs</a></span></dt><dt><span class="sect1"><a href="#tr">8. Traducteurs</a></span></dt><dt><span class="sect1"><a href="#copyright">9. Droits d'utilisation</a></span></dt></dl></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="intro"></a>1.&nbsp;Introduction</h2></div></div></div><p>

    XDMCP signifie &laquo;&nbsp;<span class="quote">protocole de contr&ocirc;le du gestionnaire
    d'affichage X</span>&nbsp;&raquo;&thinsp;; c'est un protocole r&eacute;seau. Il constitue
    un moyen de faire tourner un terminal X sur votre PC (ou votre MAC)
    en utilisant le serveur X qui fournira une interface client-serveur
    entre le mat&eacute;riel d'affichage (la souris, le clavier et les
    affichages vid&eacute;o) et l'environnement de l'ordinateur, tout en
    offrant l'infrastructure d'affichage et une interface d'application
    standardis&eacute;e (r&eacute;f&eacute;rence issue de la page d'accueil du projet
    Xfree86). Le terminal X peut &ecirc;tre affich&eacute; dans une fen&ecirc;tre
    individuelle ou dans de multiples fen&ecirc;tres, en fonction des
    capacit&eacute;s logicielles et de la configuration de votre syst&egrave;me
    d'affichage X.

    </p><p>

    Je recherche toujours la meilleure fa&ccedil;on d'utiliser Linux, que ce 
    soit &agrave; la maison au travail. L'un de ses avantages entre tous est sa 
    capacit&eacute; &agrave; r&eacute;utiliser les vieux syst&egrave;mes (tels que des 486 et des 
    Pentium, Pentium II) comme terminaux X (en utilisant les 
    applications Win32 telles que Exceed (de Hummingbird), Reflection X, 
    X-Win32 or X-ThinPro&thinsp;; sous MAC, essayez eXodus) pour 
    s'ex&eacute;cuter &agrave; distance sur n'importe lequel de vos PC. J'ai d&eacute;couvert 
    avec une certaine surprise qu'il y a beaucoup de documents sur 
    Internet qui peuvent vous aider &agrave; le configurer, mais pas sous forme 
    de guide pas &agrave; pas&thinsp;!Voici pourquoi j'en suis venu &agrave; &eacute;crire ce 
    document qui m'a paru &ecirc;tre une mani&egrave;re de partager mes exp&eacute;riences 
    avec tous les utilisateurs. En utilisant X et XDMCP, vous pouvez 
    b&acirc;tir pour la maison ou le travail une bonne solution, fiable et bon 
    march&eacute;.

    </p><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="disclaimer"></a>1.1.&nbsp;Limitations de responsabilit&eacute;</h3></div></div></div><p>

      Aucune responsabilit&eacute; l&eacute;gale ne sera accept&eacute;e quant au contenu de 
      ce document. L'utilisation des concepts, exemples et autres 
      contenus du document s'effectue &agrave; vos risques et p&eacute;rils. Dans la 
      mesure o&ugrave; il s'agit d'une nouvelle &eacute;dition de ce document, il peut 
      comporter des erreurs ou des inexactitudes, &eacute;videmment 
      susceptibles d'endommager votre syst&egrave;me. Proc&eacute;dez prudemment, et 
      bien que cela soit improbable, le ou les auteurs refusent toute 
      responsabilit&eacute; &agrave; ce sujet.

      </p><p>

      Sauf mention sp&eacute;cifique, les droits d'auteur sont la possession de 
      leurs propri&eacute;taires respectifs. L'utilisation d'un terme dans ce 
      document ne doit pas &ecirc;tre consid&eacute;r&eacute;e comme ayant une influence sur 
      la validit&eacute; d'une quelconque marque d&eacute;pos&eacute;e ou marque de services.

      </p><p>

      Le fait de nommer un produit ou une marque ne doit pas &ecirc;tre 
      consid&eacute;r&eacute; comme une recommandation.

      </p><p>

      Nous vous recommandons fortement d'effectuer une sauvegarde de 
      votre syst&egrave;me avant toute installation importante et d'effectuer 
      des sauvegardes &agrave; intervalles r&eacute;guliers.

      </p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="nouvelles-versions"></a>1.2.&nbsp;
          Nouvelles versions de ce document
      </h3></div></div></div><p>

          Vous trouverez la plus r&eacute;cente version fran&ccedil;aise de ce document &agrave;
          l'adresse&nbsp;: <a href="http://www.traduc.org/docs/howto/lecture/XDMCP-HOWTO.html" target="_top">http://www.traduc.org/docs/howto/lecture/XDMCP-HOWTO.html</a>.

      </p><p>
      
          La plus r&eacute;cente version originale de ce document est disponible &agrave;
          l'adresse&nbsp;: <a href="http://tldp.org/HOWTO/XDMCP-HOWTO/index.html" target="_top">http://tldp.org/HOWTO/XDMCP-HOWTO/index.html</a>.
  
      </p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="feedback"></a>1.3.&nbsp;Commentaires et r&eacute;actions</h3></div></div></div><p>

      Les commentaires sur ce document sont bienvenus. Sans vos 
      suggestions et autres apports, ce document n'existerait pas. 
      Envoyez-moi (en anglais) vos ajouts, commentaires et critiques &agrave; 
      l'adresse suivante&nbsp;:

      <code class="email">&lt;<a href="mailto:tomchao CHEZ lucent POINT com">tomchao CHEZ lucent POINT com</a>&gt;</code>.

      </p><p>

        N'h&eacute;sitez pas &agrave; faire parvenir vos commentaires et suggestions 
        concernant l'adaptation fran&ccedil;aise de ce document au projet 
        <a href="http://www.traduc.org" target="_top">Traduc.org</a> &agrave; l'adresse&nbsp;:

        <code class="email">&lt;<a href="mailto:commentaires CHEZ traduc POINT org">commentaires CHEZ traduc POINT org</a>&gt;</code>.

      </p></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="procedure"></a>2.&nbsp;La proc&eacute;dure</h2></div></div></div><p>

    Cette section d&eacute;taille la proc&eacute;dure de configuration d'un terminal X
    avec XDMCP. Comme pr&eacute;-requis, vous devez avoir n'importe quelle
    distribution Linux install&eacute;e, ainsi que X.

    </p><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N100B2"></a>2.1.&nbsp;Avant de commencer, quelques notions</h3></div></div></div><p>

      Avant de commencer, il vaut mieux comprendre globalement le 
      fonctionnement. (Vous trouverez plus de d&eacute;tails <a href="#REFS" target="_top">Ressources</a> ci-dessous et sur le site de <a href="http://www.traduc.org" target="_top">Traduc.org</a>)

      </p><p>

      D'habitude, le serveur X est lanc&eacute; &agrave; partir d'un gestionnaire
      d'affichage X. Presque toutes les distributions Linux embarquent
      xdm, kdm et gdm. Le choix de l'un d'entre eux est libre. (Ce
      document se servira de gdm et kdm comme exemples). Le gestionnaire
      d'affichage constitue une interface agr&eacute;able et uniforme pour les
      utilisateurs lambda (ouverture de session graphique, d&eacute;marrage
      d'un gestionnaire de fen&ecirc;tre, horloge, et c&aelig;tera). Un gestionnaire
      d'affichage contr&ocirc;le une s&eacute;rie d'affichages X, qui peuvent &ecirc;tre
      situ&eacute;s sur l'h&ocirc;te local ou sur des serveurs distants. Il est bon
      de noter que ce qu'ex&eacute;cute votre environnement est le fichier
      <code class="filename">Xsession</code>.

      </p><p>

      Quand xdm s'ex&eacute;cute, il propose deux mani&egrave;res diff&eacute;rentes de g&eacute;rer
      l'affichage. Il peut g&eacute;rer un serveur X qui s'ex&eacute;cute sur la
      machine locale (indiqu&eacute; dans <code class="filename">Xservers</code>) et des
      serveurs X distants (en g&eacute;n&eacute;ral des terminaux X) en utilisant
      XDMCP (en fonction de ce qui est indiqu&eacute; dans le fichier
      <code class="filename">Xaccess</code> &mdash; voir les pages de manuel de
      xdm).

      </p><p>

      Quant &agrave; kdm (qui fait partie de l'environnement graphique KDE),
      c'est un rempla&ccedil;ant de xdm qui se configure de fa&ccedil;on identique, &agrave;
      ceci pr&egrave;s que ses fichiers sont <code class="filename">/etc/X11/kdm</code>
      pour Caldera, dans <code class="filename">/etc/kde/kdm</code> pour Red Hat,
      et dans <code class="filename">/usr/share/config/kdm</code> pour Mandrake.

      </p><p>

      Le gdm (Gestionnaire d'affichage Gnome) est une r&eacute;&eacute;criture du
      fameux xdm. Les fonctions de gdm sont similaires &agrave; celles de xdm
      et kdm. Gdm (gdm) est le gestionnaire d'affichage de Gnome, et ses
      fichiers de configuration sont situ&eacute;s dans
      <code class="filename">/etc/X11/gdm/gdm.conf</code>. Le fichier
      <code class="filename">gdm.conf</code> contient un ensemble de variables et
      un grand nombre d'options pour gdm. Le r&eacute;pertoire Sessions
      contient un script pour chaque option de session&thinsp;; chaque script
      appelle <code class="filename">/etc/X11/xdm/Xsession</code> avec l'option
      appropri&eacute;e. Gdm offre des fonctions similaires &agrave; xdm et kdm, mais
      a &eacute;t&eacute; &eacute;crit &agrave; partir de z&eacute;ro et ne contient aucun code originaire de XDM
      ou du consortium X.

      </p><p>

      Avec RH 8.0, une nouvelle interface graphique appel&eacute;e
      &laquo;&nbsp;<span class="quote">Bluecurve</span>&nbsp;&raquo; appara&icirc;t. Son objectif est d'imiter
      l'apparence de XP. Dans ce cas, il n'y a aucune diff&eacute;rence de
      configuration&thinsp;!

      </p><p>

      On peut trouver d'autres bonnes r&eacute;f&eacute;rences pour une configuration
      similaire dans les documents suivants&nbsp;:

      </p><div class="itemizedlist"><ul type="disc"><li><p>

            Le petit guide <a href="http://www.traduc.org/docs/howto/lecture/XDM-Xterm.html" target="_top">XDM et les
            terminaux X</a>, &eacute;crit par Kevin Taylor.

          </p></li><li><p>

            Le <a href="http://www.traduc.org/docs/howto/lecture/Remote-X-Apps.html" target="_top">Petit guide
            d'ex&eacute;cution &agrave; distance des applications X</a>, une
            excellente r&eacute;f&eacute;rence d'approche pratique et th&eacute;orique
            d'ex&eacute;cution de X &agrave; distance. &Eacute;crit par Vincent Zweije.

          </p></li><li><p>

            Le petit guide <a href="http://ftp.traduc.org/projets/howto/obsoletes/X-Terminal.html" target="_top">
            Xterminal</a>, &eacute;crit par Scot W. Stevenson.

          </p></li></ul></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="security"></a>2.2.&nbsp;Rappel de s&eacute;curit&eacute;</h3></div></div></div><p>

      L'utilisation de XDMCP est par d&eacute;finition dangereuse, ce qui fait
      que la plupart des distributions ont d&eacute;sactiv&eacute; son utilisation par
      d&eacute;faut. Si vous devez utiliser XDMCP, ne le fa&icirc;tes qu'au sein de
      r&eacute;seaux s&eacute;curis&eacute;s, tels que des r&eacute;seaux d'entreprises prot&eacute;g&eacute;es par un
      pare-feu. Malheureusement, XDMCP utilise le port UDP 177 et TCP le port
      6000&thinsp;; il n'est donc pas possible de l'utiliser nativement avec SSH.
      Actuellement, SSH1 et SSH2 ne permettent pas de transmettre les
      communications UDP de mani&egrave;re s&eacute;curis&eacute;e.

      </p><p>

      La technique de s&eacute;curisation des connexions via SSH est appel&eacute;e
      transfert de port X11 TCP/IP (X11 TCP/IP Port Forwarding).
      Rendez-vous sur <a href="http://www.ox.compsoc.net/~steve/portforwarding.html" target="_top">Why
      Port Forwarding?</a> et dans la section <a href="#REFS" target="_top">Ressources</a> pour des informations
      compl&eacute;mentaires (en anglais). Au cas o&ugrave; vous voudriez
      l'exp&eacute;rimenter, j'ai ajout&eacute; une petite section plus bas pour vous
      montrer son fonctionnement. Je vous d&eacute;crirai sommairement son
      fonctionnement&thinsp;; je laisse les autres experts et/ou les guides
      pratiques vous expliquer son utilisation avanc&eacute;e.

      </p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="system"></a>2.3.&nbsp;Mon syst&egrave;me</h3></div></div></div><p>

      J'ai test&eacute; les configurations de GNOME (gdm) et de KDE (kdm) sur 
      Red Hat 6.0, 6.2 et Red Hat 7.x et 8.0. J'ai eu aussi la chance de 
      les tester sur Mandrake 7.2, 8.0, 8.2 et 9.0. Les configurations 
      de SuSE 7.2 and Slakware 8.0 ont &eacute;t&eacute; test&eacute;es par les 
      utilisateurs&thinsp;; merci &agrave; Peter Van Aerten et &agrave; tous ceux qui 
      m'ont aid&eacute; &agrave; la pr&eacute;paration de ce guide pratique. Je d&eacute;sire 
      remercier tous les utilisateurs qui m'ont aid&eacute; &agrave; r&eacute;aliser ce 
      projet. J'ai aussi essay&eacute; sur Caldera eDesktop 2.4, dont la 
      configuration est similaire &agrave; celle de RH, &agrave; la diff&eacute;rence qu'il 
      utilise KDE. Je n'ai pas eu l'occasion de tester sur d'autres 
      variantes telles que Debian ou Slackware (les utilisateurs de 
      Slackware m'ont rapport&eacute; que le fonctionnement est identique &agrave; 
      celui d&eacute;crit dans ce document). Cependant, la configuration 
      devrait &ecirc;tre similaire et devrait bien fonctionner. Si vous avez 
      r&eacute;ussi &agrave; configurer sur d'autres distributions que Red Hat, 
      Caldera et Mandrake, faites-moi partager votre exp&eacute;rience. Je 
      l'ajouterai &agrave; ce document.

      </p><p>

      Le PC que j'utilise est un compatible IBM, &eacute;quip&eacute; d'un AMD Athlon
      XP 1800+, de 384 Mo de m&eacute;moire et d'un disque dur de 60 Go
      ATA-100. Cette machine a &eacute;t&eacute; mise &agrave; jour &agrave; partir d'un PC &eacute;quip&eacute;
      d'un Intel Pentium II 500 MHz (je me suis aper&ccedil;u que mon vieux PC
      Pentium 100 MHz marche tr&egrave;s bien). J'utilise une carte Fast
      Ethernet int&eacute;gr&eacute;e dans ma nouvelle carte m&egrave;re AMD. Sur mon vieux
      PC, j'utilise l'adaptateur 3Com 10/100 (3C509B), un c&eacute;d&eacute;rom 48X et
      un disque ZIP IOMEGA. J'ai aussi effectu&eacute; des tests avec mon
      portable Toshiba Tecra 8100 connect&eacute; par carte sans fil Agere.

      </p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="remote"></a>2.4.&nbsp;Pi&egrave;ces rapport&eacute;es</h3></div></div></div><p>

      J'utilise Exceed 7.0 (Exceed 6.x fonctionne aussi correctement) 
      sur mon PC, et je les ai test&eacute; sous Windows 98 SE, Windows NT 4.0 
      et Windows 2000 Pro. J'ai aussi constat&eacute; que X-Win32 et X-ThinPro 
      sont d'autres choix r&eacute;pandus. Il existe &eacute;galement beaucoup 
      d'applications, libres ou commerciales.

      </p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="prep"></a>2.5.&nbsp;Pr&eacute;paration du serveur</h3></div></div></div><p>

      Sous RH 7.x, il faut configurer la recherche des DNS, pour
      permettre &agrave; certaines fonctions de r&eacute;seau de fonctionner
      correctement (comme <span><strong class="command">telnet</strong></span> qui sera utilis&eacute;e
      pour tester la configuration). Vous pouvez saisir
      <strong class="userinput"><code>netstat&nbsp;-r</code></strong> ou
      <strong class="userinput"><code>arp&nbsp;-a</code></strong> pour v&eacute;rifier la configuration
      des DNS ou les temps de r&eacute;ponse. Si vous &ecirc;tes dans un petit
      environnement (comme &agrave; la maison ou un petit r&eacute;seau d'entreprise)
      qui n'a pas son propre serveur DNS et qui utilise le serveur DNS
      du FAI, ajoutez l(es) adresse(s) des serveurs de noms dans le
      fichier <code class="filename">resolv.conf</code>. Si vous l'utilisez
      uniquement &agrave; la maison ou au labo, vous pouvez alors ajouter dans
      votre fichier local les noms d'h&ocirc;te de toutes les stations de
      travail <code class="filename">host</code>.

      </p><p>

      Pour que votre serveur X accepte une session XDMCP, assurez-vous
      que les &eacute;l&eacute;ments suivants sont bien install&eacute;s&nbsp;:

      </p><div class="orderedlist"><ol type="1"><li><p>

          Installez votre OS Linux. Dans mon cas, j'ai install&eacute; Red Hat
          7.3 (installation personnalis&eacute;e). Si vous projetez d'utiliser
          SSH pour faire du transfert de port, il vous faudra installer
          le paquetage OpenSSH ou compiler SSH dans le kernel. De plus,
          RH 7.x est fourni avec un pare-feu install&eacute; par d&eacute;faut (&agrave;
          moins que vous ne fassiez pas ce choix). Vous pourrez
          rencontrer des probl&egrave;mes si vous n'ajoutez pas des r&egrave;gles &agrave;
          votre pare-feu ou si vous ne le neutralisez pas temporairement
          le temps de configurer XDMCP. Je ne d&eacute;taillerai pas
          les r&egrave;gles du pare-feu dans la mesure o&ugrave; ce n'est pas l'objet
          de ce document. Je montrerai seulement comment le faire
          fonctionner, &agrave; charge pour vous de le r&eacute;gler finement.

          </p><p>

          Avec le noyau 2.2x, vous afficherez les r&egrave;gles de votre
          pare-feu en saisissant la commande
          <strong class="userinput"><code>ipchains&nbsp;-L</code></strong>. Pour le d&eacute;sactiver
          temporairement, utilisez la commande
          <strong class="userinput"><code>ipchains&nbsp;-F</code></strong> pour effacer les
          r&egrave;gles (pas de panique, elles seront restaur&eacute;es en les
          rechargeant ou au red&eacute;marrage). Avec le noyau 2.4x, remplacez
          la commande <span><strong class="command">ipchains</strong></span> par
          <span><strong class="command">iptables</strong></span>. Un utilisateur m'a indiqu&eacute; qu'en
          ajoutant cette r&egrave;gle, vous n'aurez pas besoin de d&eacute;sactiver
          votre pare-feu et que vous pourrez acc&eacute;der au serveur X (vous
          pouvez le v&eacute;rifier par vous-m&ecirc;me).

          </p><pre class="screen">
ipchains -A input -p udp -i $extint --dport 177 -j ACCEPT
</pre><p>

          Vous devriez pouvoir utiliser la commande
          <span><strong class="command">iptables</strong></span> de mani&egrave;re identique. (Vous
          trouverez des r&eacute;f&eacute;rences &agrave; iptables dans les <a href="#REFS" target="_top">Ressources</a>).

          </p><p>

          Pour plus de d&eacute;tails sur les pare-feu, rendez-vous sur la page
          du <a href="http://www.traduc.org/docs/howto/lecture/IP-Masquerade-HOWTO.html" target="_top">Guide pratique
          de masquage IP</a>.

          </p><p>

          Il est aussi possible d'ajouter des r&egrave;gles pour qu'il accepte
          uniquement les adresses IP des stations de travail de
          confiance. Vous pouvez utiliser la commande
          <span><strong class="command">iptables</strong></span> &agrave; votre gr&eacute;. Je rappelle que sa
          description n'est pas l'objet de ce document. J'ai de la
          chance dans le sens o&ugrave; j'utilise le pare-feu de ma soci&eacute;t&eacute;.

        </p></li><li><p>

          Configuration du r&eacute;seau. Vous pouvez utiliser les commandes
          <span><strong class="command">ping</strong></span>, <span><strong class="command">ftp</strong></span> et
          <span><strong class="command">telnet</strong></span> pour tester le fonctionnement de
          votre r&eacute;seau. Pour des raisons de s&eacute;curit&eacute;, le d&eacute;mon de la commande
          <span><strong class="command">telnet</strong></span> est d&eacute;sactiv&eacute; sur RH 7.x et versions
          ult&eacute;rieures. Pensez &agrave; l'activer
          si vous d&eacute;sirez l'utiliser pour effectuer vos tests. Vous
          pourrez toujours le d&eacute;sactiver (avec la commande
          <span><strong class="command">ntsysv</strong></span>) lorsque vous en aurez termin&eacute;. Il
          est aussi bon de se souvenir que les r&egrave;gles du pare-feu sont
          actives. Ajoutez vos propres r&egrave;gles ou d&eacute;sactivez les
          temporairement (comme mentionn&eacute; plus haut) pour permettre
          l'ex&eacute;cution de ces commandes.

        </p></li><li><p>

          Configuration de X

          </p><p>

          <span class="emphasis"><em>Ne configurez pas X</em></span> avec une r&eacute;solution
          plus haute que celle dont les utilisateurs distants pourront
          disposer. Testez le serveur X en saisissant soit
          <span><strong class="command">startx</strong></span> soit <span><strong class="command">telinit 5</strong></span>.
          Assurez-vous que X fonctionne correctement.

          </p></li><li><p>Cr&eacute;ez les comptes indispensables (et les groupes associ&eacute;s)
          pour les utilisateurs devant acc&eacute;der par le terminal X.</p></li></ol></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="steps"></a>2.6.&nbsp;Proc&eacute;dures &agrave; suivre</h3></div></div></div><p>J'ai utilis&eacute; les &eacute;tapes suivantes pour configurer le serveur X
      afin qu'il accepte les requ&ecirc;tes XDMCP&nbsp;:
      <div class="orderedlist"><ol type="1"><li><p>Dans un environnement grahique Linux, les polices utilis&eacute;es
          sont soit celles du serveur X (xfs), soit celles dont le chemin est
          sp&eacute;cifi&eacute; dans les fichiers de configuration XF86Config ou
          XF86Config-4. .Si vous pr&eacute;voyez d'utiliser le serveur de polices
          xfs (cliquez ici pour voir les
          <a href="http://www.redhat.com/docs/manuals/linux/RHL-7.3-Manual/ref-guide/s1-x-fonts.html" target="_top">
          avantages de xfs</a>), pour RH 6.2 et Mandrake 8.x et 9.0,
          modifiez le fichier
          <code class="filename">/etc/rc.d/init.d/xfs</code> et
          apportez-y les modifications suivantes. Changez tout ce qui suit
          (cela concerne le port du serveur de polices)&nbsp;:</p><pre class="screen">daemon xfs -droppriv -daemon -port
          -1</pre><p>en:</p><pre class="screen">daemon xfs -droppriv -daemon -port
          7100</pre><p>Dans la Mandrake 7.2, le port est d&eacute;j&agrave; 7100. De plus, sur la
          RH 7.x, l'&eacute;coute sur un port TCP est &agrave; pr&eacute;sent d&eacute;sactiv&eacute;e par
          d&eacute;faut pour des raisons de s&eacute;curit&eacute;&thinsp;! Si vous d&eacute;sirez param&eacute;trer le
          serveur de polices de X, suivez les &eacute;tapes

          </p><p>

          Changez la ligne suivante du fichier
          <code class="filename">/etc/rc.d/init.d/xfs</code>&nbsp;:

          </p><pre class="screen">
daemon xfs -droppriv -daemon
</pre><p>en&nbsp;:</p><pre class="screen">
daemon xfs -droppriv -daemon -port 7100
</pre><p>

          Puis, dans <code class="filename">/etc/X11/fs/config</code>, mettez
          cette ligne en commentaires&nbsp;:

          </p><pre class="screen">
# Ne pas &eacute;couter sur les ports TCP (pour des raisons de s&eacute;curit&eacute;)
#no-listen = tcp
</pre><p>

          Si vous changez ou ajoutez le port, utilisez cette commande
          pour red&eacute;marrer votre serveur de polices X (n&eacute;cessite les droits de
          root)&nbsp;:

          </p><pre class="screen">
service xfs restart
</pre><p>

          Le port 7100 n'est pas obligatoire. Vous pouvez choisir un
          autre port, dans la mesure o&ugrave; vous aurez v&eacute;rifi&eacute; soigneusement
          que ce port n'occasionne pas de conflit. Il est de bon ton de
          consulter votre administrateur Linux avant de le faire, afin
          qu'il sache que le port est utilis&eacute;&thinsp;! Les diff&eacute;rentes
          distributions Linux peuvent placer xfs dans diff&eacute;rents
          r&eacute;pertoires sous /etc/rc.d. Si c'est le cas, vous pouvez le
          rechercher.

        </p></li><li><p>

          Modifiez <code class="filename">/etc/X11/xdm/xdm-config</code> en
          effectuant les modifications suivantes&nbsp;: Par d&eacute;faut dans
          la plupart des distributions Linux, cette ligne est active, ce
          qui fait qu'il n'&eacute;coute pas les connexions XDMCP. Ceci pour
          des raisons de s&eacute;curit&eacute;. Pour Caldera et en utilisant kdm, le
          fichier est situ&eacute; en <code class="filename">/etc/X11/kdm</code>.
          Trouvez cette ligne&nbsp;:

          </p><pre class="screen">
DisplayManager.requestPort: 0
</pre><p>

          et mettez la en commentaire comme ceci&nbsp;:

          </p><pre class="screen">
! DisplayManager.requestPort: 0
</pre><p>

          Rappelez vous que ceci n'affecte pas gdm. La configuration de
          gdm se trouve dans la section suivante.

        </p></li><li><p>

          Dans le fichier <code class="filename">/etc/X11/xdm/Xaccess</code>
          modifiez ce qui suit. (cela permet &agrave; tous les h&ocirc;tes de se
          connecter). Pour Caldera, et en utilisant kdm, le fichier est
          situ&eacute; en <code class="filename">/etc/X11/kdm</code>. Changez les droits
          d'acc&egrave;s en 644 (chmod 644)&nbsp;:

        </p><pre class="screen">
#* # any host can get a login window
</pre><p>

          en&nbsp;:

          </p><pre class="screen">
* # any host can get a login window
</pre><p>

          La configuration ci-dessus est en mode Diffusion (Broadcast),
          qui permet d'&eacute;tablir la liste de tous les serveurs X &eacute;coutant les
          demandes de prise en charge de connexion X et en mesure de
          l'effectuer. Si vous d&eacute;sirez n'autoriser que certaines
          connexions, utilisez la section <span><strong class="command">CHOOSER</strong></span> du
          m&ecirc;me fichier. Vous trouverez un exemple dans les <a href="#REFS" target="_top">Ressources</a>.

        </p></li><li><p>

          J'utilise gdm par d&eacute;faut ainsi que l'invite de connexion gdm
          pour permuter KDE et GNOME. Pour gdm, &eacute;ditez le fichier
          <code class="filename">/etc/X11/gdm/gdm.conf</code>. Ce qui suit active
          XDMCP, en le faisant &eacute;couter les requ&ecirc;tes. Pour kdm (si vous
          avez choisi KDE comme gestionnaire d'affichage lors de
          l'installation), &eacute;ditez le fichier <code class="filename">
          /usr/share/config/kdm/kdmrc</code> pour Mandrake et
          <code class="filename">/etc/kde/kdm/kdmrc</code> pour Red Hat ou
          <code class="filename">/opt/kde2/share/config/kdm/kdmrc</code> pour
          Slackware version (KDE2). Modifiez cette ligne&nbsp;:

        </p><pre class="screen">
[xdmcp]
# false peut &ecirc;tre remplac&eacute; par 0 dans certaines distributions
Enable=false
</pre><p>en&nbsp;:</p><pre class="screen">
# true peut &ecirc;tre remplac&eacute; par 1 dans certaines distributions
Enable=true
</pre><p>

          Assurez-vous que <code class="literal">Port=177</code> est pr&eacute;sent &agrave; la
          fin de ce bloc.

        </p></li><li><p>

          &Agrave; pr&eacute;sent, &eacute;ditez le fichier <code class="filename">/etc/inittab</code>
          et modifiez la ligne suivante&nbsp;:

        </p><pre class="screen">
id:3:initdefault:
</pre><p>en:</p><pre class="screen">
id:5:initdefault:
</pre><p>

          Dans la Slackware, le mode graphique (X11) est
          <code class="literal">4</code> et non <code class="literal">5</code>.

          </p><p>

          Ceci fait passer la connexion du mode ligne de commande en
          mode graphique. Vous pouvez utiliser la commande
          <span><strong class="command">telinit</strong></span> pour effectuer un test avant de
          modifier cette ligne. Utilisez soit <span><strong class="command">telinit
          3</strong></span> pour passer au niveau 3, ou <span><strong class="command">telinit
          5</strong></span> pour passer au niveau 5 en mode graphique (vous
          pouvez essayer cette commande sur la deuxi&egrave;me machine reli&eacute;e
          par telnet &agrave; votre serveur).

          </p></li><li><p>Assurez-vous que les attributs de s&eacute;curit&eacute; du fichier
          <code class="filename">/etc/X11/xdm/Xservers</code> sont
          fix&eacute;s &agrave; 444 (chmod 444).</p></li><li><p>Localisez
          <code class="filename">/etc/X11/xdm/Xsetup_0</code> et
          ex&eacute;cutez
          <span><strong class="command">chmod 755</strong></span> sur ce fichier.</p></li><li><p>

          &Eacute;ditez le fichier <code class="filename">XF86Config</code> (si vous
          utilisez Xfree86 4.x, le fichier se nomme
          <code class="filename">XF86Config-4</code>) situ&eacute; en
          <code class="filename">/etc/X11</code> et modifiez la ligne&nbsp;:

          </p><pre class="screen">
FontPath "unix/:-1"
</pre><p>en&nbsp;:</p><pre class="screen">
FontPath "unix/:7100"
</pre><p>

          Si vous d&eacute;cidez d'utiliser un port diff&eacute;rent du traditionnel
          port 7100, assurez-vous de le modifier &agrave; la fois dans le
          fichier <code class="filename">/etc/rc.d/init.d/xfs</code> et
          ici&thinsp;!

          </p><p>

          Afin de vous &eacute;conomiser du temps et de l'&eacute;nergie, je vous
          recommande d'ajouter le chemin des polices (FontPath) dans les
          fichiers de configuration XF86Config et XF86Config-4. Si vous
          n'&ecirc;tes pas certain de la disponibilit&eacute; des polices, vous
          pouvez utiliser cette commande pour le v&eacute;rifier (avec les
          droits de root)&nbsp;:

          </p><pre class="screen">
chkfontpath --list
</pre><p>

          Les polices suivantes constituent quelques exemples de
          r&eacute;f&eacute;rence. Assurez-vous de disposer de ces polices avant
          d'&eacute;diter ces chemins.

          </p><pre class="screen">
FontPath "/usr/X11R6/lib/X11/fonts/75dpi/"
FontPath "/usr/X11R6/lib/X11/fonts/misc/"
FontPath "/usr/X11R6/lib/X11/fonts/CID/"
FontPath "/usr/X11R6/lib/X11/fonts/Speedo/"
FontPath "/usr/X11R6/lib/X11/fonts/100dpi/"
FontPath "/usr/X11R6/lib/X11/fonts/Type1/"
</pre></li><li><p>

          (Il <span class="emphasis"><em>n'est pas n&eacute;cessaire</em></span> d'effectuer
          cette modification. Vous pouvez laisser les param&egrave;tres par
          d&eacute;faut, cependant je pr&eacute;f&egrave;re ce r&eacute;glage. En cas de doute,
          laissez-les tels quels). Modifiez cette ligne &agrave; la fin du
          fichier <code class="filename">/etc/inittab</code>&nbsp;:

          </p><pre class="screen">
x:5:respawn:/usr/bin/gdm
</pre><p>

          Si vous d&eacute;cidez de ne pas modifier cette ligne, tant
          mieux&thinsp;! Ce n'est pas une &eacute;tape n&eacute;cessaire, mais une
          pr&eacute;f&eacute;rence personnelle&thinsp;!

        </p></li></ol></div></p><p>

      &Agrave; pr&eacute;sent, vous allez pouvoir effectuer un test.

      </p><p>

      Un autre point &agrave; conna&icirc;tre (qui a &eacute;t&eacute; demand&eacute; par certains), est
      la mani&egrave;re d'afficher le message au chargement avec
      <span><strong class="command">Willing to manage</strong></span>. D'apr&egrave;s ce que je sais,
      cette op&eacute;ration est possible dans xdm en ajoutant ce qui suit au
      fichier <code class="filename">/etc/X11/xdm/xdm-config</code>.

      </p><pre class="screen">
DisplayManager.willing: su noboby -c /etc/X11/xdm/Xwilling
</pre><p>
      Le script Xwilling devant &ecirc;tre pr&eacute;sent sur votre syst&egrave;me.
      </p><p>

      Pour gdm, ajoutez cette ligne au fichier
      <code class="filename">/etc/X11/gdm/gdm.conf</code> dans la section
      <code class="filename">[security]</code>&nbsp;:

      </p><pre class="screen">
Willing=/etc/X11/gdm/Xwilling
</pre><p>

      Vous trouverez ici un exemple du <a href="http://www.penguinlovers.net/linux/Xwilling" target="_top">script
      Xwilling</a> &agrave; titre de r&eacute;f&eacute;rence. La d&eacute;cision d'ajouter ou
      non
      ce script vous appartient. Ce n'est pas une &eacute;tape n&eacute;cessaire
      ici&thinsp;!

      </p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="testing"></a>2.7.&nbsp;Tests</h3></div></div></div><p>

      Pour tester si votre XDMCP fonctionnant avec le serveur X est pr&ecirc;t
      &agrave; accepter les connexions, suivez ces &eacute;tapes. Je trouve qu'il est
      plus ais&eacute; d'utiliser le serveur X et un autre poste pour effectuer
      les tests.

      </p><div class="orderedlist"><ol type="1"><li><p>

          (Re)lancez X (situ&eacute; dans le niveau d'ex&eacute;cution n&deg;5). Si vous
          ne savez pas trop comment le faire, red&eacute;marrez simplement votre
          syst&egrave;me (ce n'est cependant pas n&eacute;cessaire si vous savez comment le
          red&eacute;marrer en ligne de commande. C'est toute la beaut&eacute; de Linux,
          compar&eacute;e &agrave; Windows).

        </p></li><li><p>

          Si vous n'avez pas proc&eacute;d&eacute; &agrave; la modification des r&egrave;gles de
          votre pare-feu, il vous faut le d&eacute;sactiver temporairement par
          le commande <strong class="userinput"><code>iptables&nbsp;-F</code></strong> (ou
          <strong class="userinput"><code>ipchains&nbsp;-F</code></strong>).

        </p></li><li><p>

          V&eacute;rifiez que l'invite de connexion appara&icirc;t. V&eacute;rifiez que la
          r&eacute;solution d'affichage et que la souris fonctionnent.
          Connectez-vous depuis la console pour voir si l'acc&egrave;s en local est
          possible. Si oui, ne vous d&eacute;connectez pas.

        </p></li><li><p>

          Param&eacute;trez Exceed (ou tout autre logiciel de client graphique 
          (X)) pour soit appeler cette machine (par son adresse IP ou 
          son nom DSN totalement qualifi&eacute;), soit pour utiliser le 
          param&egrave;tre de diffusion de XDMCP (XDMCP-Broadcast) et essayez 
          de vous connecter au serveur X. Vous devriez voir appara&icirc;tre 
          l'&eacute;cran de la session X et l'invite de connexion.

        </p></li></ol></div></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="ssh"></a>3.&nbsp;Transfert X11 &agrave; l'aide de SSH</h2></div></div></div><p>

    Comme je l'ai expliqu&eacute; pr&eacute;c&eacute;demment, utiliser XDMCP pour afficher
    une interface graphique via Internet est fondamentalement un
    non-sens, car les donn&eacute;es ne sont pas chiffr&eacute;es lors de leur passage sur
    Internet. Une des mani&egrave;res de renforcer la s&eacute;curit&eacute; du transfert est
    de recourir &agrave; SSH par appel de X11 dans un tunnel s&eacute;curis&eacute; ou par
    transfert de port. SSH (Secure Shell, &laquo;&nbsp;<span class="quote">interpr&eacute;teur de
    commandes s&eacute;curis&eacute;</span>&nbsp;&raquo; a &eacute;t&eacute; d&eacute;velopp&eacute; en 1995 par Tatu Ylonen
    pour remplacer les telnet, ftp, scp, rcp, rlogin, rsh, etc, par
    nature non s&eacute;curis&eacute;s. La premi&egrave;re chose &agrave; savoir est que le
    transfert X11 avec SSH est diff&eacute;rent de votre fa&ccedil;on habituelle et
    non s&eacute;curis&eacute;e de faire tourner un fen&ecirc;trage X.

    </p><p>

    Avant de commencer cette configuration, il vous faut des
    informations compl&eacute;mentaires. Premi&egrave;rement, il faut que le paquetage
    SSH soit install&eacute;. Dans Linux, il s'agit des paquetages OpenSSH.
    V&eacute;rifiez dans votre distribution les paquetages &agrave; installer
    (certaines l'installent par d&eacute;faut). Deuxi&egrave;mement, il vous faut un
    client SSH Windows (client SSH Windows (des versions pour d'autres
    syst&egrave;mes d'exploitation tels que MAC, sont aussi
    disponibles). Je recommande PuTTY. C'est un merveilleux client SSH
    libre. Vous pouvez le t&eacute;l&eacute;charger de <a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/" target="_top">ce
    lien</a>. N'oubliez pas de t&eacute;l&eacute;charger la documentation et de la
    lire soigneusement. Un autre bon client SSH libre est Tera
    Term Pro + TTSSH, qui constitue une extension SSH &agrave; Tera Term. Celui-ci
    est un client SSH &eacute;dit&eacute; par SSH.com (gratuit pour des utilisations
    non commerciales). Je vais proc&eacute;der de nouveau par &eacute;tapes, de fa&ccedil;on
    &agrave; vous permettre de suivre facilement.

    </p><div class="orderedlist"><ol type="1"><li><p>

        Ouvrez le programme <span><strong class="command">putty.exe</strong></span> en
        double-cliquant dessus. Cela va lancer l'interface.
        Premi&egrave;rement, renseignez les informations de connexion dans le
        champ &ldquo;<span class="quote">Host Name (or IP address)</span>&rdquo; avec le
        nom de l'h&ocirc;te distant ou son adresse IP et s&eacute;lectionnez SSH (SSH
        utilise le port 22). Dans la fen&ecirc;tre &ldquo;<span class="quote">Category</span>&rdquo;, trouvez la branche &ldquo;<span class="quote">Connection</span>&rdquo;. Dans SSH, d&eacute;veloppez-la et vous
        verrez la fen&ecirc;tre &ldquo;<span class="quote">Tunnels</span>&rdquo;. Cliquez sur
        &ldquo;<span class="quote">Enable X11 forwarding</span>&rdquo; (autoriser le
        transfert de port). Il configurera l'affichage graphique par
        d&eacute;faut &agrave; <code class="literal">localhost:0</code>. &Agrave; pr&eacute;sent, retournez &agrave;
        la fen&ecirc;tre &ldquo;<span class="quote">Session</span>&rdquo; et sauvegardez cette
        session sous le nom de votre choix. J'utilise normalement le nom
        d'h&ocirc;te pour me rappeler facilement o&ugrave; je d&eacute;sire me connecter.

      </p></li><li><p>

        Dans l'exemple d'Exceed, voici comment faire. (Pour les autres 
        clients X, la configuration est analogue). Ouvrez Xconfig de 
        votre r&eacute;pertoire Exceed. Dans votre &eacute;cran Screen Definition 
        (d&eacute;finition de l'&eacute;cran), passez le &ldquo;<span class="quote">Window 
        mode</span>&rdquo; &agrave; &ldquo;<span class="quote">Multiple</span>&rdquo; et 
        sauvegardez-le. Appelez ensuite votre ic&ocirc;ne &ldquo;<span class="quote">Communication</span>&rdquo; et d&eacute;finissez le mode &ldquo;<span class="quote">Startup</span>&rdquo; &agrave; &ldquo;<span class="quote">Passive</span>&rdquo;.

      </p></li><li><p>

        C'est termin&eacute;. Afin d'effectuer les tests, nous allons d'abord
        utiliser PuTTY (ou un autre client SSH) pour se connecter sur le
        serveur. &Agrave; la premi&egrave;re connexion, il vous demandera si vous
        d&eacute;sirez conserver la cl&eacute; de s&eacute;curit&eacute;. (&ldquo;<span class="quote">Yes</span>&rdquo;
        (oui) est le choix par d&eacute;faut). Une fois
        connect&eacute;, lancez Exceed. Il demeurera en t&acirc;che de fond. Vous
        pouvez &agrave; pr&eacute;sent ex&eacute;cuter n'importe quelle application X&thinsp;;
        l'application X devrait &ecirc;tre transmise &agrave; travers SSH &agrave; votre
        &eacute;cran local. Par exemple&nbsp;:

      </p><pre class="screen">
$ xclock &amp;
</pre><p>

        Vous devriez voir Xclock tourner sur votre &eacute;cran local.

      </p></li></ol></div><p>

    Vous constatez &agrave; pr&eacute;sent la diff&eacute;rence&nbsp;: vous ne voyez pas toutes
    vos fen&ecirc;tres graphiques. Vous ex&eacute;cutez simplement vos applications
    une par une et elles sont rout&eacute;es via SSH vers votre &eacute;cran local. Ce
    qui fait qu'il vous faut conna&icirc;tre la commande de chaque application
    &agrave; lancer. Tous les contr&ocirc;les s'effectuent &agrave; l'int&eacute;rieur de la
    fen&ecirc;tre du client SSH. Pour moi, la s&eacute;curit&eacute; est plus importante que
    ce l&eacute;ger inconv&eacute;nient&thinsp;!

    </p><p>

    Si vous utilisez X-Win32 et que vous d&eacute;sirez mettre en &#339;uvre
    <a href="http://www.starnet.com/products/ssh.htm" target="_top">SSH et le
    transfert de port</a>, vous pouvez avoir recours &agrave; cette
    r&eacute;f&eacute;rence pour le configurer.

    </p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="ts"></a>4.&nbsp;D&eacute;pannage</h2></div></div></div><div class="itemizedlist"><ul type="disc"><li><p>

          Si X ne veut pas d&eacute;marrer et est cass&eacute;&nbsp;:

          </p><p>

          Si X est cass&eacute; et que la connexion &eacute;choue, dans la plupart
          des cas les messages d'erreur suivants s'affichent&nbsp;:

          </p><pre class="screen">
_ FontTransSocketUNIXConnect : Can't connect: errno = 111
failed to set dafault font path 'unix:-1'
Fatal server error:
could not open default font 'fixed'
</pre><p>

          Il est probable que xfs ne trouve pas le bon port du serveur
          de polices ou que le chemin des polices n'est pas configur&eacute;
          correctement. Pour r&eacute;soudre le probl&egrave;me, v&eacute;rifier les &eacute;tapes 1
          et 8 ci-dessus. V&eacute;rifiez que la configuration pointe vers le
          port 7100 et assurez-vous que les polices suivantes sont
          install&eacute;es (si ce n'est pas le cas, r&eacute;installez les paquetages
          des polices de Xfree86 &agrave; partir de votre c&eacute;d&eacute;rom). V&eacute;rifiez la
          liste dans le fichier <code class="filename">XF86Config</code> (si vous
          utilisez Xfree86, le fichier est
          <code class="filename">XF86Config-4</code>) situ&eacute; dans le r&eacute;pertoire
          <code class="filename">/etc/X11</code>&nbsp;:

          </p><pre class="screen">
FontPath "/usr/X11R6/lib/X11/fonts/75dpi/"
FontPath "/usr/X11R6/lib/X11/fonts/misc/"
FontPath "/usr/X11R6/lib/X11/fonts/CID/"
FontPath "/usr/X11R6/lib/X11/fonts/Speedo/"
FontPath "/usr/X11R6/lib/X11/fonts/100dpi/"
FontPath "/usr/X11R6/lib/X11/fonts/Type1/"
</pre><p>

          Saisissez en mode ligne de commande <span><strong class="command">startx</strong></span>
          (en local) pour red&eacute;marrer le serveur X (ou utilisez la
          commande <span><strong class="command">telinit 5</strong></span> pour d&eacute;finir le niveau
          d'ex&eacute;cution). Pour red&eacute;marrer xfs, utilisez la commande de
          l'&eacute;tape&nbsp;1.

          </p><p>

          J'ai constat&eacute; que dans la RH 7.3 que si mon xfs n'est pas
          d&eacute;marr&eacute;, la connexion avec Exceed plantera si j'utilise GNOME.
          (Avec KDE, le fonctionnement est correct et le GNOME de la
          Mandrake n'est pas affect&eacute;). Apr&egrave;s avoir corrig&eacute; et red&eacute;marr&eacute;
          xfs, &ccedil;a marche bien&thinsp;!

        </p></li><li><p>

          Si Exceed ne r&eacute;pond pas (vous avez un &eacute;cran blanc)&nbsp;:

          </p><p>

          Dans ce cas, il est tr&egrave;s probable que xdm (ou gdm, en fonction
          de celui qui est d&eacute;clar&eacute; dans
          <code class="filename">/etc/inittab</code>) ne d&eacute;marre pas
          correctement. Essayez la commande&nbsp;: <span><strong class="command">ps -ef |
          grep gdm</strong></span> (ou xdm ou kdm, mettez le bon dans la
          commande). De plus, si votre syst&egrave;me est configur&eacute; pour
          utiliser udp avec XDMCP, vous pouvez saisir <span><strong class="command">netstat
          -l | grep xdmcp</strong></span>. Vous devriez voir ceci&nbsp;:

          </p><pre class="screen">
udp 0 0 *:xdmcp *:*
</pre><p>

          Si le processus n'est pas lanc&eacute;, v&eacute;rifiez les &eacute;tapes de la
          configuration ci-dessus (assurez-vous qu'il n'y a pas de faute
          de frappe et que le chemin d&eacute;clar&eacute; est correct). Red&eacute;marrez X
          &agrave; l'aide de la commande <span><strong class="command">telinit 5</strong></span>. Si XDMCP
          n'est pas configur&eacute; pour utiliser udp, suivez l'&eacute;tape&nbsp;2
          ci-dessus.

          </p><p>

          Il est aussi possible que la configuration de votre DNS soit
          incorrecte et/ou que votre pare-feu soit actif. Vous pouvez
          facilement l'&eacute;tablir en appelant simplement votre h&ocirc;te par
          <span><strong class="command">ping</strong></span> ou <span><strong class="command">telnet</strong></span>&thinsp;; si
          la r&eacute;ponse est longue &agrave; arriver, c'est que vous avez un
          probl&egrave;me avec votre DNS. Si avec <span><strong class="command">telnet</strong></span>
          vous recevez en retour un un message &laquo;&nbsp;<code class="computeroutput">Connection
          Refused</code>&nbsp;&raquo;, alors c'est que le probl&egrave;me vient du
          pare-feu (dans la mesure o&ugrave; votre d&eacute;mon telnet est d&eacute;j&agrave;
          lanc&eacute;&thinsp;!) Voyez la section situ&eacute;e plus haut pour plus
          d'informations sur la mani&egrave;re de r&eacute;soudre ce probl&egrave;me.

        </p></li><li><p>

          Ordinateur de type PC Box avec PPPoE (PPP par Ethernet)&nbsp;:

          </p><p>

          Un utilisateur de PPPoE m'a rapport&eacute; que si vous utilisez
          PPPoE, il se peut que vous rencontriez des difficult&eacute;s avec
          XDMCP. Apr&egrave;s l'avoir d&eacute;sinstall&eacute;, il devrait &ecirc;tre capable de
          faire tourner XDMCP. N'ayant pas d'environnement pour
          effectuer un test, je vous laisse le soin de le tester
          vous-m&ecirc;me.

        </p></li><li><p>

          Exportation d'affichage de Linux &agrave; Linux&nbsp;:

          </p><p>

          Si vous utilisez une autre station sous Linux avec X, vous
          n'aurez pas besoin d'XDMCP pour g&eacute;rer votre affichage. En
          fait, vous pouvez exporter l'affichage de votre PC. &Agrave; cet
          effet, il vous faut autoriser une autre station &agrave; se connecter
          au serveur X. Sans cela, les messages d'erreur les plus
          fr&eacute;quents que vous obtiendrez seront&nbsp;:

          </p><pre class="screen">
xlib: Connection refused (error 111): unable to connect to X server
xlib: No such process (error 3): Server error
</pre><p>

          Pour r&eacute;soudre le probl&egrave;me, saisissez la commande
          ci-dessous&nbsp;:

          </p><pre class="screen">
$ xhost +
$ export DISPLAY=<em class="replaceable"><code>adresse_IP_de_votre_machine</code></em>:0.0
</pre><p>

          Souvenez-vous bien qu'il faut autoriser l'acc&egrave;s par la
          commande <strong class="userinput"><code>xhost&nbsp;-</code></strong> une nouvelle
          fois. Une chose &agrave; retenir est que vous n'en avez pas besoin si
          vous utilisez un PC comme terminal X avec XDMCP. Le besoin
          existe si vous utilisez une connexion Linux vers Linux ou
          Linux vers UNIX.

          </p><p>

          Si vous utilisez un grand nombre de stations Linux sous X et
          que vous d&eacute;sirez pouvoir choisir &agrave; quel serveur X vous connecter,
          il vous faudra d&eacute;commenter ce qui suit dans le fichier
          <code class="filename">/etc/X11/gdm/gdm.conf</code>&nbsp;:

          </p><pre class="screen">
[daemon]
Chooser=/usr/bin/gdmchooser --disable-sound --disable-crash-dialog
...
[xdmcp]
Enable=1
HonorIndirect=1
</pre></li><li><p>

          J'ai un message d'erreur
          <code class="computeroutput">Signal&nbsp;11</code>&nbsp;:

          </p><p>

          Le message d'erreur
          <code class="computeroutput">Signal&nbsp;11</code>, nomm&eacute;
          &eacute;galement <code class="computeroutput">Segmentation Fault</code>
          (Erreur de segmentation), peut parfois avoir pour cause un
          probl&egrave;me mat&eacute;riel ou logiciel. Si vous rencontrez ce probl&egrave;me
          en d&eacute;marrant votre serveur X, il vous faudra r&eacute;gler ce
          probl&egrave;me avant de configurer XDMCP. Malheureusement, un tel
          probl&egrave;me n'est pas facile &agrave; r&eacute;gler, en raison de nombreuses
          causes possibles. Pour plus d'informations, rendez-vous sur ce
          site (en anglais) consacr&eacute; &agrave; l'erreur&nbsp;11 lors de la
          compilation du noyau <a href="http://www.bitwizard.nl/sig11/" target="_top">SIG 11 while compiling
          the Kernel.</a>

        </p></li></ul></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="gdm"></a>5.&nbsp;

    XDMCP et GDM (le Gestionnaire d'affichage Gnome)

    </h2></div></div></div><p>

    Ce qui suit est tir&eacute; du <a href="http://www.jirka.org/gdm-documentation/t1.html" target="_top">Manuel de
    r&eacute;f&eacute;rence du Gestionnaire d'Affichage Gnome</a>&nbsp;:

    </p><p>

    GDM est &eacute;galement compatible avec le protocole de gestionnaire
    d'affichage X (XDMCP) pour la gestion des affichages distants. GDM
    &eacute;coute le port UDP 177 et r&eacute;pond aux requ&ecirc;tes QUERY (vers un h&ocirc;te) et
    aux requ&ecirc;tes BROADCAST (appel g&eacute;n&eacute;ral au r&eacute;seau) en envoyant un
    paquet WILLING &agrave; l'initiateur de la requ&ecirc;te. Il est &eacute;galement
    possible de configurer GDM pour qu'il honore les requ&ecirc;tes indirectes
    et qu'il pr&eacute;sente un &eacute;cran de choix d'h&ocirc;tes &agrave; l'affichage distant.
    GDM m&eacute;morisera le choix de l'utilisateur et transmettra les requ&ecirc;tes
    sous-jacentes au gestionnaire retenu. GDM est uniquement compatible
    avec le syst&egrave;me d'authentification MIT-MAGIC-COOKIE-1. Les autres
    possibilit&eacute;s ont peu de valeur ajout&eacute;e, et aucun effort n'a &eacute;t&eacute;
    consacr&eacute; &agrave; leur mise en &#339;uvre. Dans la mesure o&ugrave; il est tr&egrave;s facile
    de lancer une attaque en d&eacute;ni de service contre le service XDMCP,
    GDM comporte quelques dispositifs pour s'en prot&eacute;ger. Pour plus
    d'informations, r&eacute;f&eacute;rez vous &agrave; la section de r&eacute;f&eacute;rence de XDMCP
    ci-dessous.

    </p><p>

    M&ecirc;me si GDM tente de berner les attaquants potentiels, nous vous
    conseillons cependant de faire en sorte que votre pare-feu bloque le
    port 177, &agrave; moins que vous n'en ayez r&eacute;ellement besoin. GDM prot&egrave;ge
    des attaques en d&eacute;ni de service&thinsp;; il n'en demeure pas moins que
    le protocole X est encore non s&eacute;curis&eacute; par nature, et qu'il devrait
    &ecirc;tre utilis&eacute; uniquement dans des environnements prot&eacute;g&eacute;s. M&ecirc;me si
    votre affichage est prot&eacute;g&eacute; par un dispositif, les &eacute;v&eacute;nements de X
    et donc les caract&egrave;res tap&eacute;s au clavier lorsque vous saisissez votre
    mot de passe passeront en clair &agrave; travers le r&eacute;seau. Il est enfantin
    de les capturer. Il vous faut aussi savoir que les dispositifs de
    s&eacute;curit&eacute;, s'ils sont plac&eacute;s dans un r&eacute;pertoire mont&eacute; par NFS, sont
    susceptible d'&ecirc;tre &eacute;cout&eacute;s.

    </p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="refs"></a>6.&nbsp;Ressources</h2></div></div></div><p>

    Quelques r&eacute;f&eacute;rences compl&eacute;mentaires sur le sujet&nbsp;:

    </p><div class="itemizedlist"><ul type="disc"><li><p>

      Votre page de manuel locale de xdm.

      </p></li><li><p>

      Votre page de manuel locale de gdm.

      </p></li><li><p>

      <a href="http://ftp.traduc.org/doc-vf/gazette-linux/html/1999/lecture/issue-43/lg43-fr-2.html" target="_top">Configuration 
      de XDM</a>

      </p></li><li><p>

      <a href="http://www.me.umn.edu/~kaszeta/unix/xterminal/config.html" target="_top">Configuration
      du gestionnaire de ressources X (en anglais)</a>

      </p></li><li><p>

      <a href="http://www.certa.ssi.gouv.fr/site/CERTA-2002-AVI-059/" target="_top">xdmcp
      sur udp</a>

      </p></li><li><p>

      <a href="http://nlsn.free.fr/lin-docs/xterminal/diskless-xterminal/node12.html" target="_top">
      Documentation XDMCP pour quasi-terminaux</a>

      </p></li><li><p>

        <a href="http://www-uxsup.csx.cam.ac.uk/security/probing/about/xdmcp.html" target="_top">Faut-il
        mettre en &#339;uvre XDMCP&thinsp;?</a> (en anglais)

      </p></li><li><p>

      <a href="http://www.linuxgazette.com/issue27/kaszeta.html" target="_top">Terminaux X
      (en anglais)</a>

      </p></li><li><p>

      <a href="http://cygwin.com" target="_top">Acc&eacute;der &agrave; des terminaux X &agrave; partir
      de Windows&nbsp;: Cygwin (en anglais)</a>

      </p></li><li><p>

      <a href="http://www.linux-france.org/prj/edu/p-mcurie/xterm9x/" target="_top">Installer
      et configurer X-Win32</a>

      </p></li><li><p>

      <a href="http://www.rru.com/~meo/pubsntalks/xrj/xdm.html" target="_top">Apprivoiser
      le gestionnaire d'affichage X (en anglais)</a>

      </p></li><li><p>

        <a href="http://www.ox.compsoc.net/~steve/portforwarding.html" target="_top">
        Pourquoi recourir au transfert de port&thinsp;? (en
        anglais)</a>&thinsp;; <a href="http://www.ssh.com/products/ssh/administrator30/Port_Forwarding.html" target="_top">
        Transfert de port (en anglais)</a>&thinsp;; <a href="http://www.ssh.com/products/ssh/administrator30/X11_Forwarding.html" target="_top">
        SSH&nbsp;: Transfert X11</a>

      </p></li><li><p>

          <a href="http://www.5z.com/jirka/gdm.html" target="_top">Gestionnaire
          d'affichage GNOME (en anglais)</a>

      </p></li><li><p>

        <a href="http://www.onlamp.com/pub/a/onlamp/2001/10/19/firewalls.html" target="_top">
        aper&ccedil;u d'un pare-feu bas&eacute; sur ip-tables en 10 minutes (en
        anglais)</a>&thinsp;; <a href="http://www.onlamp.com/linux/cmd/i/iptables.html" target="_top">
        Initiation aux commandes iptables (en anglais)</a>

      </p></li><li><p>

        <a href="http://www.linuxsecurity.com/resource_files/host_security/securing-debian-howto/ch-sec-services.en.html" target="_top">
        Comment s&eacute;curiser les services de votre syst&egrave;me (en
        anglais)</a> (Debian)

      </p></li><li><p>

          <a href="http://www.traduc.org/docs/howto/lecture/KDE-GUI-Login-Configuration-HOWTO.html" target="_top">
          Guide pratique de configuration du gestionnaire de connexion
          KDM</a>

      </p></li></ul></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="au"></a>7.&nbsp;Auteurs</h2></div></div></div><p>Auteur actuel&nbsp;: Thomas Chao, Lucent Technologies.
    <code class="email">&lt;<a href="mailto:tomchao CHEZ lucent POINT com">tomchao CHEZ lucent POINT com</a>&gt;</code></p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="tr"></a>8.&nbsp;Traducteurs</h2></div></div></div><p>
    
        Traducteur version fran&ccedil;aise&nbsp;: Denis Berhaut.
    
        <code class="email">&lt;<a href="mailto:denis POINT berhaut CHEZ free POINT fr">denis POINT berhaut CHEZ free POINT fr</a>&gt;</code>
    
    </p><p>
    
        Relecteur version fran&ccedil;aise&nbsp;: &Eacute;ric Madesclair.
        
        <code class="email">&lt;<a href="mailto:eric TIRET m CHEZ wanadoo POINT fr">eric TIRET m CHEZ wanadoo POINT fr</a>&gt;</code>
    
    </p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="copyright"></a>9.&nbsp;Droits d'utilisation</h2></div></div></div><p>
    
    La version originale de ce document est copyright &copy; 2000-2003 
    Thomas Chao et est diffus&eacute; selon les termes de la licence du Projet 
    de documentation Linux (LDP), telle qu'indiqu&eacute;e ci-dessous.
    
    </p><p>
    
    L'adaption fran&ccedil;aise de ce document est copyright &copy; 2004-2005 
    Denis Berhaut, &Eacute;ric Madesclair et Jean-Philippe Gu&eacute;rard et est 
    diffus&eacute; selon les termes de la licence du Projet de documentation 
    Linux (LDP), telle qu'indiqu&eacute;e ci-dessous.
    
    </p><p>
    
    Sauf mention du contraire, les droits d'auteurs des Guides pratiques 
    Linux (<span class="foreignphrase" lang="en"><em class="foreignphrase">Linux HOWTO</em></span>) 
    appartiennent &agrave; leurs auteurs respectifs. Les Guides pratiques Linux 
    peuvent &ecirc;tre reproduits et diffus&eacute;s en totalit&eacute; ou en partie, sur 
    n'importe que support, physique ou &eacute;lectronique, tant que cette 
    mention des droits d'auteur et d'utilisation est conserv&eacute;e sur 
    toutes les copies. La diffusion &agrave; titre commercial est autoris&eacute;e et 
    encourag&eacute;e&thinsp;; cependant, les auteurs souhaitent &ecirc;tre avertis de 
    toute diffusion de ce type.
    
    </p><p>

    Toute traduction, &#339;uvre d&eacute;riv&eacute;e ou &#339;uvre incorporant un 
    quelconque Guide pratique Linux doit &ecirc;tre r&eacute;alis&eacute; dans le cadre de 
    cette licence. Autrement dit, vous n'avez pas le droit de produire 
    une &#339;uvre d&eacute;riv&eacute;e de ce Guide pratique en imposant des 
    restrictions suppl&eacute;mentaires &agrave; sa diffusion. Des exceptions &agrave; ces 
    r&egrave;gles peuvent &ecirc;tre accord&eacute;es dans certains cas&thinsp;; veuillez 
    contacter (en anglais) le coordinateur des Guides pratiques Linux &agrave; 
    l'adresse indiqu&eacute;e ci-dessous.
    
    </p><p>

    En r&eacute;sum&eacute;, nous souhaitons promouvoir une large diffusion de ces 
    informations au travers du plus grand nombre de supports possibles. 
    Cependant, nous souhaitons conserver nos droits d'auteur sur ce 
    document et nous voudrions &ecirc;tre notifi&eacute; de tout projet de diffusion 
    de ces guides pratiques.    
    
    </p><p>Pour toute question, veuillez contacter&nbsp;:
    
    <code class="email">&lt;<a href="mailto:linux TIRET howto AT metalab DOT unc DOT edu">linux TIRET howto AT metalab DOT unc DOT edu</a>&gt;</code>
    
    </p></div></div></body></html>