<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Utilisation de l'extension Xinerama pour le multi-&eacute;cran avec XFree86 V.&nbsp;4.0+</TITLE>
</HEAD>
<BODY>
<H1>Utilisation de l'extension Xinerama pour le multi-&eacute;cran avec XFree86 V.&nbsp;4.0+</H1>

<H2>Dennis Baker <CODE>&lt;drbaker at softhome dot net&gt;</CODE>.<BR>
Traduction fran&ccedil;aise de Xavier Serpaggi <CODE>&lt;xavier dot serpaggi at free dot fr&gt;</CODE>.</H2>R&eacute;vision&nbsp;v2.0, 2&nbsp;Novembre 2000
<HR>
<EM>Ce document d&eacute;crit comment configurer XFree86 version&nbsp;4.0 ou plus, pour
utiliser plusieurs moniteurs avec l'extension Xinerama.</EM>
<HR>
<H2><A NAME="s1">1. Introduction</A>De nombreuses am&eacute;liorations sont dues &agrave; Nico Schottelius <CODE>nicos@pcsystems.de</CODE>.</H2>

<H2><A NAME="ss1.1">1.1 Xinerama, c'est quoi&nbsp;?</A>
</H2>

<P>Pourquoi auriez-vous besoin de Xinerama&nbsp;? Et qu'est ce que c'est&nbsp;?
Les extensions Xinerama ont-&eacute;t&eacute; ajout&eacute;es &agrave; XFree86 &agrave; la version 4.0. Xinerama
est une extension de XFree86 Release&nbsp;6 Version&nbsp;4 (X4.0) qui permet aux
applications et aux gestionnaires de fen&ecirc;tres de disposer de deux &eacute;crans
physiques (ou plus), comme un seul grand &eacute;cran virtuel.</P>
<P>La beaut&eacute; des extensions Xinerama est qu'elles sont compl&egrave;tement
transparentes &agrave; l'utilisateur. Avant cela, les applications ne pouvaient occuper
qu'un seul affichage (<EM>display</EM>) et ne pouvaient pas &ecirc;tre d&eacute;plac&eacute;es de
l'un &agrave; l'autre. Les gestionnaires de fen&ecirc;tres devaient g&eacute;rer explicitement les
deux affichages. Avec Xinerama, les gestionnaires de fen&ecirc;tres et les
applications ne doivent pas &ecirc;tre &eacute;crits sp&eacute;cialement dans le but de supporter
l'<EM>&eacute;cran virtuel</EM> de plus grande taille ainsi cr&eacute;&eacute;.</P>
<H2><A NAME="ss1.2">1.2 Directives</A>
</H2>

<P>Ce document ne pr&eacute;tend pas &ecirc;tre un guide sur la mise en service de votre
moniteur ou de votre carte graphique. En r&eacute;alit&eacute;, je fais l'hypoth&egrave;se que vous
disposez d&eacute;j&agrave; d'un environnement X&nbsp;Window qui fonctionne pour votre
configuration. Je vous conseille de vous plonger dans le documentation de
XF86 pour plus d'informations.</P>
<P>Autant que je saches il n'y a pas de limite au nombre de cartes graphiques
que vous pouvez configurer de cette mani&egrave;re. Il ne semble pas non plus y avoir
de probl&egrave;me &agrave; m&eacute;langer diff&eacute;rents types de cartes graphiques dans une m&ecirc;me
configuration. La configuration de test que j'utilise pour cette documentation
comporte deux cartes graphiques&nbsp;: une Fire&nbsp;GL&nbsp;1000 AGP et une
Matrox&nbsp;Millenium&nbsp;II PCI. Quel effet cela a-t-il sur l'acc&eacute;l&eacute;ration 3D,
je n'en sait rien vu que je ne l'utilise sur aucune de mes cartes.</P>
<P>Pour ce HowTo je fais les hypoth&egrave;ses que vous savez &eacute;diter un fichier,
configurer une carte graphique avec X&nbsp;Window, ajouter et enlever des cartes
de votre ordinateur, d&eacute;marrer et arr&ecirc;ter des services et suivre des instructions
simples. Si vous pensez ne pas pouvoir faire l'une de ces actions, je vous en
prie, demandez de l'aide. Je ne suis pas responsable des &eacute;ventuels dommages
subis par votre ordinateur.</P>
<H2><A NAME="s2">2. Pr&eacute;voir</A></H2>

<P>Pr&eacute;voir une configuration Xinerama est un processus assez imm&eacute;diat. Il y a
principalement trois chose qu'il faut prendre en compte&nbsp;: la r&eacute;solution, le
nombre de couleurs et le positionnement de l'&eacute;cran.</P>
<H2><A NAME="ss2.1">2.1 Ce dont vous avez besoin</A>
</H2>

<P>Vous aurez besoin d'au moins deux cartes graphiques (une carte <EM>dual
head</EM> devrait &eacute;galement faire l'affaire) et de deux moniteurs. Il vous
faudra &eacute;galement un syst&egrave;me qui supporte XFree86 (par exemple Linux ou Solaris)
et XFree86 version&nbsp;4.0. Je fais l'hypoth&egrave;se que votre configuration
fonctionne et que vos deux cartes graphiques sont support&eacute;es par XFree86.</P>
<P>&Agrave; moins que vous ayez fait une mise &agrave; jour ou install&eacute; Linux r&eacute;cemment, vous
disposez certainement d'une ancienne version de&nbsp;X. V&eacute;rifiez que vous
utilisez bien une version&nbsp;4.0 ou  plus r&eacute;cente en entrant la commande
suivante&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<CODE>papel:/home/nico/X/bin # X -version</CODE>
</CODE></BLOCKQUOTE>
</P>
<P>Vous devriez obtenir quelque chose dans ce genre&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
  XFree86 Version 4.0 / X Window System
  (protocol Version 11, revision 0, vendor release 6400)
  Release Date: 8 March 2000
         If the server is older than 6-12 months, or if your card is newer
         than the above date, look for a newer version before reporting
         problems.  (see http://www.XFree86.Org/FAQ)
  Operating System: Linux 2.3.46 i686 [ELF] 
  Module Loader present
  
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>
<P>Si la version n'est pas au moins&nbsp;4.0 (la premi&egrave;re ligne), vous devez
proc&eacute;der &agrave; une mise &agrave; jour. Pour cela vous pouvez, soit utiliser le gestionnaire
de paquetages de votre distributions, soit t&eacute;l&eacute;charger directement la derni&egrave;re
version depuis 
<A HREF="ftp://ftp.xfree86.org/pub/XFree86/4.0/">le site de XFree86</A> et l'installer, ou mieux, utiliser un des 
<A HREF="http://www.xfree86.org/4.0/ftp.html">miroirs</A>.</P>
<P>Une fois les fichiers t&eacute;l&eacute;charg&eacute;s, installez la nouvelle version avec le
script <CODE>Xinstall.sh</CODE>. Remarquez que si vous installez X de cette mani&egrave;re,
il ne sera pas pris en compte par le gestionnaire de paquetages de votre syst&egrave;me
(si ce dernier en a un).</P>
<H2><A NAME="ss2.2">2.2 &Agrave;-propos de la mise en place</A>
</H2>

<P>Il est possible que chacun des &eacute;cran de votre configuration Xinerama ait une
r&eacute;solution diff&eacute;rente. Ceci pr&eacute;sente certains avantages. Par exemple, cela m'a
permis d'utiliser un vieux moniteur qui ne peut afficher que du 640&times;480
avec un 17" affichant du 1280&times;1024. J'ai &eacute;galement entendu parler de
d&eacute;veloppeurs web et de graphistes qui utilisent un grand &eacute;cran pour la
pr&eacute;visualisation, plus un ou deux autres plus petits. Je pense que cette
flexibilit&eacute; repr&eacute;sente un des grands avantages des extensions Xinerama.</P>
<P>Quelques probl&egrave;mes d'interface, sp&eacute;cifiques &agrave; Xinerama, demeurent avec
certains gestionnaires de fen&ecirc;tres (reportez-vous &agrave; la section 
<A HREF="#Window Managers">Gestionnaires de fen&ecirc;tres et Xinerama</A>). Le plus ennuyeux &eacute;tant la gestion des zones mortes.</P>
<P>Les gestionnaires de fen&ecirc;tres font l'hypoth&egrave;se que la zone affichable est un
rectangle dont la taille est &eacute;gale &agrave; la largeur et &agrave; la hauteur totale de votre
bureau. Si vous n'utilisez pas la m&ecirc;me r&eacute;solution sur tous les &eacute;crans, votre
zone affichable ne sera pas rectangulaire. Ceci fait appara&icirc;tre des <EM>zones
morte</EM> qui n'ont pas d'existence au niveau de votre affichage, mais que
votre gestionnaire de fen&ecirc;tres va interpr&eacute;ter comme <EM>vides</EM>. Nombreux
sont les gestionnaires de fen&ecirc;tres qui vont tenter d'utiliser ces zones mortes
pour placer les nouvelles fen&ecirc;tres. Les fen&ecirc;tres ainsi plac&eacute;es seront alors
inaccessibles. Avec le temps, les gestionnaires de fen&ecirc;tres prennent en compte
les extensions Xinerama et ces limitations disparaissent rapidement.</P>
<P>Les gestionnaires de fen&ecirc;tres ne savent pas non plus comment maximiser
une fen&ecirc;tre quand on utilise Xinerama. Ce qui se passe en g&eacute;n&eacute;ral c'est que les
fen&ecirc;tres sont maximis&eacute;es sur tous les &eacute;crans disponibles. Netscape &eacute;tal&eacute; sur
deux &eacute;crans n'est pas la disposition id&eacute;ale pour naviguer sur l'Internet.</P>
<P>Contrairement &agrave; ce qu'il est possible de faire pour les r&eacute;solutions, Xinerama
n'accepte qu'une seule profondeur d'&eacute;cran pour l'int&eacute;gralit&eacute; de l'&eacute;cran virtuel.
C'est un point &agrave; bien garder en t&ecirc;te au moment de ressortir sa vieille carte
graphique. Si cette derni&egrave;re ne peut afficher que 8&nbsp;bits, vous aurez un
grand &eacute;cran, mais avec seulement 256&nbsp;couleurs.</P>

<H2><A NAME="ss2.3">2.3 Agencement</A>
</H2>

<P>La d&eacute;cision de comment tout cela va &ecirc;tre agenc&eacute; est assez simple &agrave; prendre.
Vous devez uniquement savoir comment vont &ecirc;tre physiquement dispos&eacute;s vos
moniteurs. La plupart des gens mettront simplement leurs moniteurs c&ocirc;te-&agrave;-c&ocirc;te
et disposeront d'un bureau &eacute;tal&eacute; sur les deux. Il est &eacute;galement possible que les
affichages se superposent par endroits, ou encore, il est possible de les
disposer de mani&egrave;re plus compliqu&eacute;e. Gardez cependant en t&ecirc;te ce que j'ai dit
plus haut au sujet des gestionnaires de fen&ecirc;tres&nbsp;: ils s'attendent &agrave; avoir
un affichage rectangulaire.</P>
<H2><A NAME="s3">3. Configuration de la carte graphique</A></H2>

<P>Voici venu le moment id&eacute;al pour faire une sauvegarde de votre configuration
existante.</P>
<P>J'ai personnellement proc&eacute;d&eacute; de la sorte&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<CODE>root# > cp /etc/X11/XF86Config /etc/X11/XFree86Config.working</CODE>
</CODE></BLOCKQUOTE>
</P>
<P>Avant de s'attaquer &agrave; la partie multi-&eacute;crans, il faut vous assurer que
<EM>toutes</EM> vos cartes graphiques fonctionnent parfaitement avec la
r&eacute;solution qu'elles auront dans la configuration finale. Si ce n'est pas d&eacute;j&agrave;
fait, installez et configurez chaque combinaison de carte/moniteur tels qu'ils
seront dans la configuration finale. Si vous disposez de plusieurs cartes
graphiques identiques vous pouvez en configurer une et recopier le r&eacute;sultat pour
les autres.</P>
<P>Remarquez qu'il est possible de configurer et tester vos cartes graphiques
sans les changer physiquement de place. Pour cela il vous faudra utiliser la
technique de scan, d&eacute;crite dans la section 
<A HREF="#PCI Bus Section">Identifiant et bus&nbsp;PCI</A> ci-dessous, en pr&eacute;cisant l'ID sur le
bus&nbsp;PCI.</P>
<P>Une fois que toutes vos cartes sont configur&eacute;es, faites une sauvegarde ou
bien imprimez leur fichier de configuration. Vous en aurez besoin plus tard.
J'ai proc&eacute;d&eacute; comme suit&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<CODE>root# > cp /etc/X11/XF86Config /etc/X11/XFree86Config.Matrox</CODE>
</CODE></BLOCKQUOTE>
</P>
<P>Il se peut que le fichier de configuration soit stock&eacute; dans <CODE>/etc</CODE> et
voici alors ce qu'il faudra faire&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<CODE>root# > cp /etc/XF86Config /etc/XFree86Config.Matrox</CODE>
</CODE></BLOCKQUOTE>
</P>
<P>Si vos cartes graphiques sont identiques vous pouvez certainement vous en
sortir avec une seule copie. Cependant, ne sautez pas cette &eacute;tape. Si les
instructions que je vous donne mettent votre syst&egrave;me sans dessus dessous, ce
sont ces copies de sauvegarde qui vous sauveront.</P>
<P>Une fois les affichages configur&eacute;s, tout est pratiquement fait...</P>
<H2><A NAME="s4">4. Identifiant et bus&nbsp;PCI</A></H2>

<P>C'est le moment, il faut mettre toutes vos cartes graphiques dans la boite et
brancher vos moniteurs. Mettez tout en place comme vous le d&eacute;sirez d&egrave;s &agrave; pr&eacute;sent
sinon vous devrez r&eacute;p&eacute;ter ces &eacute;tapes plus tard.</P>
<P>Ce qui suit devra &ecirc;tre fait depuis la console, sans que&nbsp;X ne tourne. Si
vous &ecirc;tes sous&nbsp;X, quittez le. Si vous utilisez un gestionnaire comme xdm ou
gdm, vous devez arr&ecirc;ter le service qui lui est associ&eacute;. Sous une RedHat, le plus
simple est de faire&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<CODE>root# > telinit 3</CODE>
</CODE></BLOCKQUOTE>
</P>
<P>Pour Debian, Storm ou Corel&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<CODE>root# > /etc/init.d/xdm stop</CODE>
</CODE></BLOCKQUOTE>
</P>
<P>Si aucune de ces m&eacute;thode ne fonctionne, relancez votre ordinateur et d&eacute;marrez
en mode <CODE>single</CODE> (mono utilisateur).</P>
<P>Dans le cadre du multi-&eacute;crans vous devez, dans le fichier de configuration,
explicitement identifier chaque carte graphique. Ceci se fait en utilisant
l'identifiant (ID), que le syst&egrave;me donne &agrave; votre carte, sur le bus&nbsp;PCI.
Pour cela, toutes les cartes graphiques doivent &ecirc;tre enfich&eacute;es.</P>
<P>Pour conna&icirc;tre les ID sur le bus&nbsp;PCI, faites&nbsp;:</P>
<P>
<A NAME="PCI Bus Section"></A> 
<BLOCKQUOTE><CODE>
<CODE>root# > XFree86 -scanpci </CODE>
</CODE></BLOCKQUOTE>
</P>
<P>X vous donnera un code pour chaque p&eacute;riph&eacute;rique sur le bus&nbsp;PCI.</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
(0:0:0) Intel 82443BX Host
(0:1:0) Intel 82443BX AGP
(0:7:0) Intel 82371AB PIIX4 ISA
(0:7:1) Intel 82371AB PIIX4 IDE
(0:7:2) Intel 82371AB PIIX4 USB
(0:7:3) Intel 82371AB PIIX4 ACPI
(0:9:0) Adaptec 2940U/UW
(0:11:0) 3COM 3C900 10b Combo
(0:12:0) Matrox unknown card (0x2007) using a Matrox MGA 2164W
(1:0:0) unknown card (0x1092/0x0152) using a Texas Instruments Permedia 2
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>
<P>Le&nbsp;0 du d&eacute;but identifie les cartes et p&eacute;riph&eacute;riques&nbsp;PCI, alors que
le&nbsp;1 est r&eacute;serv&eacute; aux cartes AGP. Dans mon cas il y a une Matrox
Millenium&nbsp;II&nbsp;(0:12:0) et une Diamond FireGL&nbsp;(1:0:0). Relevez les
num&eacute;ros associ&eacute;s &agrave; vos cartes graphiques. Il est important que vous sachiez quel
num&eacute;ro est affect&eacute; &agrave; quelle carte.</P>
<H2><A NAME="s5">5. &Eacute;diter votre fichier XF86Config</A></H2>

<P>Si vous n'&ecirc;tes pas encore perdu, rentrons dans le vif du sujet. Cette section
peut &ecirc;tre assez d&eacute;routante, je vous sugg&egrave;re donc de lire la page de manuel de
XF86Config, ou du moins de la parcourir. Faites-le&nbsp;! J'attendrai...</P>
<P>
<BLOCKQUOTE><CODE>
<CODE> root# > man XF86Config</CODE>
</CODE></BLOCKQUOTE>
</P>
<H2><A NAME="ss5.1">5.1 Ajout de toutes les cartes graphiques</A>
</H2>

<P>Ouvrez le fichier XF86Config et descendez jusqu'&agrave; la section traitant de
moniteur (<CODE>Section "Monitor"</CODE>). Il faut copier les sections
<CODE>Monitor</CODE>, <CODE>Device</CODE> et <CODE>Screen</CODE> des diff&eacute;rents fichiers
XF86Config de sauvegarde cr&eacute;&eacute;s plus haut. Ces sections doivent &ecirc;tre report&eacute;es
dans votre fichier XF86Config apr&egrave;s les sections correspondantes dans le fichier
que vous avez ouvert. Assurez-vous que l'identifiant (<CODE>Identifier</CODE>) est
unique pour chaque section; vous y ferez r&eacute;f&eacute;rence plus tard.</P>
<P>Comment &ccedil;a c'est, pas clair&nbsp;! Vous devez avoir, en d&eacute;finitive, une
section <CODE>Monitor</CODE>, <CODE>Device</CODE> et <CODE>Screen</CODE> pour chacune des
combinaison carte graphique/moniteur. Si vous &ecirc;tes toujours embrouill&eacute;, relisez
le paragraphe pr&eacute;c&eacute;dent. Si cela ne vous aide pas, jetez un oeil au fichier
<A HREF="#XF86Config">XF86Config</A>
 d'exemple &agrave; la fin de ces quelques pages. Vous avez bien
lu la page de manuel, hein&nbsp;?</P>
<H2><A NAME="ss5.2">5.2 Identifier vos cartes graphiques</A>
</H2>

<P>Il faut &agrave; pr&eacute;sent ajouter les ID du bus&nbsp;PCI &agrave; la fin de chaque section
<CODE>Device</CODE>. C'est une option de la section. La ligne devra ressembler &agrave;
&ccedil;a&nbsp;: <CODE>BusID    "PCI:0:12:0"</CODE>, avec <EM>votre</EM> identifiant,
recherch&eacute; &agrave; la section 
<A HREF="#PCI Bus Section">Identifiant et bus&nbsp;PCI</A>, en lieu et place de <CODE>0:12:0</CODE>. Ci-dessous, un exemple de
section <CODE>Device</CODE> d'une de mes cartes graphiques.</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
Section "Device"
    Identifier  "FireGL"
    Driver      "glint"
    BusID      "PCI:1:0:0"
EndSection
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>
<P>Remarquez que m&ecirc;me les cartes&nbsp;AGP utilisent ce format.</P>
<H2><A NAME="ss5.3">5.3 Configurer la section <CODE>ServerLayout</CODE></A>
</H2>

<P>&Agrave; pr&eacute;sent, il faut &eacute;diter la section <CODE>ServerLayout</CODE> situ&eacute;e &agrave; la fin de
votre fichier XF86Config. La section <CODE>ServerLayout</CODE> permet de d&eacute;crire
les &eacute;crans utilis&eacute;s, leur positionnement relatifs et les unit&eacute;s qui leur sont
attach&eacute;es. Actuellement vous devez avoir une disposition ne contenant qu'un
&eacute;cran, un clavier et une souris. Vous devez ajouter chacune des sections
<CODE>Screen</CODE> que vous avez cr&eacute;&eacute;es auparavant pour qu'elles fassent partie de
votre &eacute;cran.</P>
<P>Ajoutez les nouvelles r&eacute;f&eacute;rences &agrave; vos &eacute;crans en vous basant sur ce qui
existe d&eacute;j&agrave;. Une r&eacute;f&eacute;rence se pr&eacute;sente sous la forme&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<CODE>Screen "Screen 2" <I>position</I> "Screen 1"</CODE>
</CODE></BLOCKQUOTE>
</P>
<P> Cela d&eacute;crit le positionnement relatif de <CODE>Screen 2</CODE> et <CODE>Screen
1</CODE>. <CODE><I>position</I></CODE> peut prendre les valeurs <CODE>RightOf</CODE>
(<I>&agrave; droite de</I>), <CODE>Below</CODE> (<I>en-dessous de</I>),
<CODE>Above</CODE> (<I>au-dessus de</I>), <CODE>LeftOf</CODE> (<I>&agrave; gauche de</I>),
<CODE>Absolute X Y</CODE>, <CODE>Relative</CODE>. Les quatres premi&egrave;res se comprennent
d'elles m&ecirc;mes comme on peut le voir sur l'exemple suivant&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
Section "ServerLayout"
    Identifier  "Simple Layout"
    Screen "Screen 2"
    Screen "Screen 1" RightOf "Screen 2"
    InputDevice "Mouse1" "CorePointer"
    InputDevice "Keyboard1" "CoreKeyboard"
EndSection
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>
<P>Vous pouvez retrouver d'autres exemples dans la section 
<A HREF="#sample XF86Config">Exemples de fichiers XF86Config</A>.</P>
<H2><A NAME="s6">6. Tester votre configuration</A></H2>

<P>Une fois que votre fichier XF86Config a &eacute;t&eacute; modifi&eacute;, sauvegardez-le. Vous
pouvez &agrave; pr&eacute;sent tester votre configuration&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<CODE> root# > startx -- +xinerama</CODE>
</CODE></BLOCKQUOTE>
</P>
<P>Vous pouvez &agrave; pr&eacute;sent vous r&eacute;jouir de plusieurs partenaires X... pardon, je
voulais dire moniteurs&nbsp;!</P>
<H2><A NAME="s7">7. &Eacute;diter vos fichiers de d&eacute;marrage</A></H2>

<P>Si cela a fonctionn&eacute; vous voudrez probablement modifier votre
configuration&nbsp;X pour qu'il d&eacute;marre directement sous ce mode. Il existe une
multitude de fa&ccedil;ons de faire &ccedil;a et probablement de bien meilleures que celles
que je vais vous proposer. Voici les m&eacute;thodes que j'ai utilis&eacute;es pour modifier
startx et gdm.</P>
<P>Si vous lancez X depuis une ligne de commande, ajoutez simplement l'option
<CODE>+xinerama</CODE> au script startx.</P>
<P>
<BLOCKQUOTE><CODE>
<CODE> root# > vi /usr/X11R6/bin/startx</CODE>
</CODE></BLOCKQUOTE>
</P>
<P>Tout &agrave; la fin du fichier, le script lance X &agrave; l'aide de la commande
<CODE>xinit</CODE>.
Ajoutez l'option <CODE>+xinerama</CODE> &agrave; la fin de cette ligne.</P>
<P>Pour que gdm se lance avec l'option xinerama, recherchez la section
<CODE>[servers]</CODE> &agrave; la fin du fichier <CODE>/etc/X11/gdm/gdm.conf</CODE>. Ajoutez
l'option <CODE>+xinerama</CODE> &agrave; la fin de la ligne qui commence avec <CODE>0=</CODE>.
Ca devrait ressembler &agrave; &ccedil;a&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<CODE> 0=/usr/bin/X11/X +xinerama</CODE>
</CODE></BLOCKQUOTE>
</P>
<P>Je n'ai jamais essay&eacute; d'utiliser kdm ou xdm avec Xinerama, mais j'ai eu
l'astuce suivante de la part de Dalibor <CODE>&lt;dali at dali dot net dot nz&gt;</CODE>.</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
Voici les modifications faites &agrave; mes fichiers de d&eacute;marrage pour une
slackware&nbsp;7.x (j'utilise KDM et x4.01)

&eacute;ditez /var/X11R6/lib/xdm/Xservers
ajoutez +xinerama &agrave; la fin de la derni&egrave;re ligne
soit&nbsp;:
:0 local /usr/X11R6/bin/X +xinerama

Il se trouve que KDM utilise les fichiers standard XFree de xdm, du coup
cela devrait &eacute;galement fonctionner avec xdm.
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="Window Managers"></A> <A NAME="s8">8. Gestionnaires des fen&ecirc;tres et Xinerama </A></H2>

<P>Comme je l'ai dit pr&eacute;c&eacute;demment, un gestionnaire de fen&ecirc;tres n'a pas besoin
d'&ecirc;tre sp&eacute;cialement &eacute;crit pour supporter Xinerama. Cependant, certaines petites
am&eacute;liorations apport&eacute;es par les d&eacute;veloppeurs peuvent faciliter l'utilisation de
Xinerama. Les fonctionnalit&eacute;s souhait&eacute;es sont&nbsp;:</P>
<P>-&nbsp;Positionnement intelligent des fen&ecirc;tres. Les gestionnaires de fen&ecirc;tres
ne doivent pas placer ces derni&egrave;res dans les zones mortes ou &agrave; la jonction de
deux &eacute;crans. Les nouvelles fen&ecirc;tres doivent &ecirc;tre ouvertes sur le bureau courant.</P>
<P>-&nbsp;Maximiser une fen&ecirc;tre doit uniquement la maximiser sur l'&eacute;cran
courant.</P>
<P>-&nbsp;Le d&eacute;placement des fen&ecirc;tres doit &ecirc;tre sujet &agrave; r&eacute;sistance &agrave; la limite
de deux &eacute;crans (de la m&ecirc;me mani&egrave;re qu'il y a une r&eacute;sistance entre deux
fen&ecirc;tres).</P>
<P>-&nbsp;Les fen&ecirc;tres de dialogue et d'information ne doivent pas appara&icirc;tre
sur un autre &eacute;cran.</P>
<P>J'ai cherch&eacute; dans leur liste de diffusion, leurs FAQ et j'ai &eacute;galement envoy&eacute;
des messages aux d&eacute;veloppeurs des principaux gestionnaires de fen&ecirc;tres, pour
savoir s'ils fonctionnaient avec les extensions Xinerama ou assimil&eacute;es. Les
gestionnaires de fen&ecirc;tres que j'ai test&eacute;s sont Blackbox, Enlightenment, Sawfish,
KDE, WindowMaker et XFCE. Enlightenment et Sawfish sont les deux seuls pour
lesquels j'ai trouv&eacute; des am&eacute;liorations, relatives &agrave; Xinerama, significatives
(NdT&nbsp;: ce n'est plus le cas &agrave; l'heure actuelle. Par exemple kdwm, le
gestionnaire de fen&ecirc;tres de KDE, sait prendre en compte Xinerama de mani&egrave;re
&eacute;l&eacute;gante). Je donne ci-dessous une description d&eacute;taill&eacute;e de ce que j'ai trouv&eacute;.</P>
<H2><A NAME="ss8.1">8.1 Enlightenment</A>
</H2>

<P>Tir&eacute; de leur page de nouvelles&nbsp;: dimanche 26 mars 2000</P>
<P>E et Xinerama</P>
<P><CODE>Nous avons juste termin&eacute; l'int&eacute;gration du support Xinerama cette semaine. Vous
pouvez &agrave; pr&eacute;sent disposer de la r&eacute;sistance au d&eacute;placement &agrave; la fronti&egrave;res des
&eacute;crans, les fen&ecirc;tres appara&icirc;tront toujours sur l'&eacute;cran courant (sauf si vous
voulez qu'elles aillent ailleurs, soit par modification de <CODE>geometry</CODE>
soit parce que vous avez sauvegard&eacute; leur position), maximiser (&agrave; part le mode
<CODE>absolute</CODE>) se fait &eacute;galement sur l'&eacute;cran courant. Si vous disposez de
Xinerama et que vous faites tourner un&nbsp;E CVS, testez-&ccedil;a et donnez-en des
nouvelles.</CODE></P>
<H2><A NAME="ss8.2">8.2 Sawfish</A>
</H2>

<P>J'ai d&eacute;couvert, en lisant la liste de diffusion de Sawfish, qu'ils
d&eacute;veloppent activement la prise en compte Xinerama. Les fonctionnalit&eacute;s en train
d'&ecirc;tre &eacute;crites sont&nbsp;:</P>
<P>-&nbsp;Emp&ecirc;cher que les fen&ecirc;tres soient ouvertes sur plusieurs &eacute;crans.</P>
<P>-&nbsp;Emp&ecirc;cher que les fen&ecirc;tres soient ouvertes dans les zones mortes.</P>
<P>-&nbsp;R&eacute;sistance au d&eacute;placement entre les &eacute;crans.</P>
<P>-&nbsp;Les mode de placement de fen&ecirc;tres Ramdom et Centered positionnent ces
derni&egrave;res sur l'&eacute;cran courant.</P>
<P>Ce n'ai pas test&eacute; ces fonctionnalit&eacute;s.</P>
<H2><A NAME="XF86Config"></A> <A NAME="s9">9. Exemples de fichiers XF86Config</A></H2>

<P>Voici mon fichier XF86Config actuel&nbsp;:
<HR>
<PRE>
Section "Module"
    Load        "dbe"   # extension pour le double buffer
    SubSection  "extmod"
      Option    "omit xfree86-dga"   # ne pas initialiser l'extension DGA
    EndSubSection
    Load        "type1"
    Load        "freetype"
# Chargement du module GLX
#    Load       "glx"
EndSection

Section "Files"
    RgbPath     "/usr/X11R6/lib/X11/rgb"
    FontPath   "/usr/X11R6/lib/X11/fonts/local/"
    FontPath   "/usr/X11R6/lib/X11/fonts/misc/"
    FontPath   "/usr/X11R6/lib/X11/fonts/75dpi/:unscaled"
    FontPath   "/usr/X11R6/lib/X11/fonts/100dpi/:unscaled"
    FontPath   "/usr/X11R6/lib/X11/fonts/Type1/"
    FontPath   "/usr/X11R6/lib/X11/fonts/Speedo/"
    FontPath   "/usr/X11R6/lib/X11/fonts/75dpi/"
    FontPath   "/usr/X11R6/lib/X11/fonts/100dpi/"
# Chemin de recherche des modules. Ceci est le chemin par d&eacute;faut
#    ModulePath "/usr/X11R6/lib/modules"
EndSection

Section "ServerFlags"

EndSection

Section "InputDevice"
    Identifier  "Keyboard1"
    Driver      "Keyboard"
    Option "AutoRepeat" "500 30"
    Option "XkbRules"   "xfree86"
    Option "XkbModel"   "pc101"
    Option "XkbLayout"  "us"
EndSection

Section "InputDevice"
    Identifier  "Mouse1"
    Driver      "mouse"
    Option "Protocol"    "PS/2"
    Option "Device"      "/dev/psaux"
EndSection

Section "Monitor"
    Identifier  "Mini"
    HorizSync   31.5
    VertRefresh 50-90
EndSection

Section "Monitor"
    Identifier  "Impression"
    HorizSync   31.5 - 82.0
    VertRefresh 50-100
EndSection

# Carte graphique N°1, Matrox Millenium II PCI
Section "Device"
    Identifier  "Matrox"
    Driver      "mga"
    VideoRam 8192
    BusID      "PCI:0:12:0"
EndSection

# Carte graphique N°2, Fire GL 1000 AGP
Section "Device"
    Identifier  "FireGL"
    Driver      "glint"
    #VideoRam    8192
    BusID      "PCI:1:0:0"

EndSection

Section "Screen"
    Identifier  "Screen 2"
    Device      "FireGL"
    Monitor     "Impression"
    DefaultDepth 16

    Subsection "Display"
        Depth       16
        Modes       "1280x1024" "640x480"
        ViewPort    0 0
    EndSubsection
EndSection

# Mon moniteur miniature. Remarquez que j'ai utilis&eacute; l'option virtual, de
# ce fait, la hauteur sera la m&ecirc;me que celle du moniteur le plus grand.
# Ceci n'est pas indispensable.
Section "Screen"
    Identifier  "Screen 1"
    Device      "Matrox"
    Monitor     "Mini"
    DefaultDepth 16

    Subsection "Display"
        Depth       16
        Modes       "640x480"
        ViewPort    0 0
        Virtual     640 1024
    EndSubsection
EndSection

Section "ServerLayout"
    Identifier  "Simple Layout"
    Screen "Screen 2"  
    Screen "Screen 1" Rightof "Screen 2" 
    InputDevice "Mouse1" "CorePointer"
    InputDevice "Keyboard1" "CoreKeyboard"
EndSection
</PRE>
<HR>

<A NAME="sample XF86Config"></A> </P>
<P>Un autre exemple de section ServerLayout, avec un moniteur au-dessous de
l'autre.
<HR>
<PRE>
Section "ServerLayout"
    Identifier  "Simple Layout"
    Screen "Screen 2"
    Screen "Screen 1" Below "Screen 2"
    InputDevice "Mouse1" "CorePointer"
    InputDevice "Keyboard1" "CoreKeyboard"
EndSection
</PRE>
<HR>
</P>
<P>Il est &eacute;galement possible que les &eacute;crans se superposent. Dans cet exemple,
les deux &eacute;crans ont un recouvrement de 80&nbsp;pixels...
<HR>
<PRE>
Section "ServerLayout"
    Identifier  "Simple Layout"
    Screen "Screen 2"
    Screen "Screen 1" Relative "Screen 2" 1200 0
    InputDevice "Mouse1" "CorePointer"
    InputDevice "Keyboard1" "CoreKeyboard"
EndSection
</PRE>
<HR>
</P>
<H2><A NAME="s10">10. Cr&eacute;dits</A></H2>

<P>La majeure partie de l'introduction et de la premi&egrave;re section sont bas&eacute;es sur
un document qui m'a &eacute;t&eacute; propos&eacute; par Nico Schottelius
<CODE>&lt;nicos at pcsystems dot de&gt;</CODE>. Comme cela a d&eacute;j&agrave; &eacute;t&eacute; mentionn&eacute;, les
configurations de KDM et xdm m'ont &eacute;t&eacute; fournies par Dalibor <CODE>&lt;dali at dali
dot net dot nz&gt;</CODE>.</P>
<P>Je remercie &eacute;galement les nombreuses personnes qui m'ont aid&eacute; &agrave; corriger les
fautes d'othographe et qui m'ont donn&eacute; des id&eacute;es. J'ai, autant que possible,
essay&eacute; de prendre en compte ces remarques.</P>
</BODY>
</HTML>
