<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.52">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf372, Applications: Bayonne: le projet opensource pour le t&eacute;l&eacute;phone et les services IVR</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 table.left { margin-right:0.3cm }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 div.tbbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   margin: 2px 5px 2px 5px;
   text-align: center;
   width: 20em;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
 div.bbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   float: left;
   margin: 2px 5px 2px 5px;
   text-align: center;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Luca Bariani
 =LF=CAT___: Applications
 =LF=TITLE_: Bayonne: le projet opensource pour le t&eacute;l&eacute;phone et les services IVR
 =LF=NUMBER: 372
 =LF=ANAME_: article372.shtml
 =LF=PARSER: 2.52
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, current, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><a href="../../index.shtml"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></a></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 
                 <A class="nodec" href="../../index.shtml"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Carte</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Index</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/index.html"><FONT color=
                 "#DDDDDD" size="2">Recherche</FONT></A> </TD>
                 
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/index.shtml"><FONT color=
           "#FFFFFF">Nouvelles</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/index.html"><FONT color=
           "#FFFFFF">Archives</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/index.html"><FONT color=
           "#FFFFFF">Liens</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">A propos</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfdynahead ver 1.5 --><TABLE ALIGN="right" border=0><TR><TD ALIGN="right"><FONT SIZE="-1" FACE="Arial,Helvetica">Ce document est disponible en: <A href="../../English/April2005/article372.shtml">English</a> &nbsp;<A href="../../ChineseGB/April2005/article372.shtml">ChineseGB</a> &nbsp;<A href="../../Deutsch/April2005/article372.shtml">Deutsch</a> &nbsp;<A href="../../Francais/April2005/article372.shtml">Francais</a> &nbsp;<A href="../../Italiano/April2005/article372.shtml">Italiano</a> &nbsp;</FONT></TD></TR></TABLE><br>
 


<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_START -->
<TABLE ALIGN="LEFT" BORDER="0" WIDTH="195" summary="about the author" class="left">
<TR>
<TD>

<IMG SRC="../../common/images2/LucaBariani.jpg" ALT="[Photo of the Author]" width="190" height="322">
<BR>par  Luca Bariani <br> <small>&lt;lucabariani /at/ ferrara.linux.it&gt;</small>
<BR><BR>
<I>L&acute;auteur:</I><BR>
<!-- aboutauthor_start -->
<P>N&eacute; Ferrara (Italie) en 1977, il obtient un diplome d'ing&eacute;nieur en &eacute;lectronique &agrave; Ferrara en 2002. Il est membre du groupe d'utilisateur de Linux &agrave; Ferrara et du groupe GNU Bayonne. Il d&eacute;veloppe des services IVR et sms pour les t&eacute;l&eacute;phones.Au seins du projet GNU Bayonne, il r&eacute;dige de la documentation et des articles. Il profite des rencontres opensource pour parler de Bayonne et s'occupe aussi du site internet italien <a href="http://bayonne.it">bayonne.it</a>.
</P>
<!-- aboutauthor_stop -->
<!-- TRANSLATED_TO fr -->
<BR><BR><I>Traduit en Français par:</I><BR>
Erwin Kwolek <small>&lt;kaoul.kae /at/ gmail.com&gt;</small>
<br>
<!--
 =LF=TRANSTO=fr: Erwin Kwolek
-->
<!-- TRANSLATED_TO_STOP -->
<!-- INDEX_START -->
<BR><i>Sommaire</i>:
<UL>
  <LI><A HREF="#372lfindex0">Syt&egrave;mes et services IVR</A></LI>
  <LI><A HREF="#372lfindex1">Bayonne</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=372">Talkback form for this article</A></LI>
</UL>

</TD></TR></TABLE>
<!-- INDEX_STOP -->
<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_STOP -->
<!-- HEAD_OF_THE_ARTICLE_START -->
<br>&nbsp;
<table border="0"><tr><td>
<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfPdf ver 0.1 -->
<TABLE style="border-style:outset; border-width:1px" align="right" bgcolor="#ff9616" cellspacing="1"><TR><TD bgcolor="#ff9616">
        <a href="../Archives/lf-2005_04-0372.pdf"><small>PDF</small></a>
        </TD></TR></TABLE>
         

<H2>Bayonne: le projet opensource pour le t&eacute;l&eacute;phone et les services IVR</H2>
 <IMG SRC="../../common/images2/article372.jpg" ALT="[Illustration]" HSPACE=10 width="376" height="215">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>R&eacute;sum&eacute;</i>:
<P>
<!-- articleabstract_start -->
<p>
Bayonne est le serveur IVR et t&eacute;l&eacute;phone du projet GNU, de ce fait, c'est un logiciel libre et opensource.
<br><br>
IVR signifie Interactive Voice Response.  Un syst&egrave;me IVR relie l'informatique aux r&eacute;seaux t&eacute;l&eacute;phoniques (avec le mat&eacute;riel appropri&eacute;) et agit gr&acirc;ce &agrave; des commandes re&ccedil;ues de ces derniers (des signaux de tonalit&eacute; par pression de touche et parfois, de v&eacute;ritables commandes vocales). Les syst&egrave;mes IVR permettent la cr&eacute;ation et la gestion de services t&eacute;l&eacute;phoniques compl&egrave;tement automatis&eacute;s sans op&eacute;rateur humain.
</p>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- HEAD_OF_THE_ARTICLE_STOP -->
<!-- BODY_OF_THE_ARTICLE_START -->


<A NAME="372lfindex0">&nbsp;</A>
<H2>Syt&egrave;mes et services IVR</H2>



  <p>De nos jours, n'importe qui a d&eacute;j&agrave; eu &agrave; utiliser un service IVR par t&eacute;l&eacute;phone au moins une fois (peut-&ecirc;tre m&ecirc;me sans s'en &ecirc;tre aper&ccedil;u). En fait ces derniers sont employ&eacute;s par toutes les compagnies de t&eacute;l&eacute;phone (mobile ou pas) pour leurs centres d'appel ou pour des services. Reflechissez, combien de fois avez-vous &eacute;cout&eacute; des voix enregistr&eacute;es pour choisir un menu dans tel ou tel service, ou pour attendre d'&ecirc;tre mis en commmunication avec un op&eacute;rateur humain). Les serveurs IVR peuvent agir les uns sur les autres de plusieurs fa&ccedil;ons et ce, sur des ressources locales ou &agrave; distance. Ils peuvent &eacute;galement acc&eacute;der &agrave; des syt&egrave;mes de fichiers, aux bases de donn&eacute;es, aux r&eacute;seaux et ainsi de suite... Enfin, les syst&egrave;mes IVR peuvent &ecirc;tre facilement int&eacute;gr&eacute;s dans les syst&egrave;mes pr&eacute;existants ou faire partie de syst&egrave;mes distribu&eacute;s.
</p>
  <p>
  Avec l'IVR beaucoup de services t&eacute;l&eacute;phoniques peuvent &ecirc;tre cr&eacute;&eacute;s et utilis&eacute;s, ci-dessous quelques exemples:
 <ul>
    <li>Service de r&eacute;ponse: un service t&eacute;l&eacute;phonique de base, habituellement mis en application avec des syst&egrave;mes plus simples et meilleur march&eacute; que ceux d'IVR. N&eacute;anmoins, en utilisant IVR, beaucoup de possibilit&eacute;s et de personnalisations deviennent disponibles:
 <ul>
     <li> Contr&ocirc;ler diff&eacute;rentes bo&icirc;tes vocales pour plusieurs utilisateurs;
     <li> Authentifier un utilisateur &agrave; distance;
     <li> Ajouter une notification (courriel ou autre) pour chaque message re&ccedil;u;
     <li> Transf&eacute;rer les messages vocaux &agrave; un serveur distant (par Internet et/ou courriell).
 </ul>
     <li> Mises &agrave; jour en ligne d'informations dynamiques: Les syst&egrave;mes IVR peuvent manipuler des donn&eacute;es dynamiques qui changent chaque jour, chaque heure.  Cela permet la cr&eacute;ation des services t&eacute;l&eacute;phoniques informatifs, par exemple les cours des actions, les derni&egrave;res nouvelles, la m&eacute;t&eacute;o, des offres sp&eacute;ciales quotidiennes de magasins...
     <li> Lecture et exploration de catalogues en ligne : Un IVR peut facilement se connecter aux bases de donn&eacute;es et &agrave; d'autres points d'&eacute;mission de donn&eacute;es (locaux ou &agrave; distance), ainsi nous pouvons facilement fournir des services sur le catalogue (par exemple : des livres, des films, CD, des magasins et ainsi de suite). Choisissant la cat&eacute;gorie, le co&ucirc;t et de ce dont il a besoin, l'utilisateur peut obtenir des listes et des informations sur tous les articles choisis.
     <li> Achats et reservations : Par l'utilisation des bases de donn&eacute;es ou d'autres syst&egrave;mes dynamiques de donn&eacute;es, IVR permet la r&eacute;servation et les services d'achat de marchandises comme la r&eacute;servation d'un billet de cin&eacute;ma ou d'un film dans un magasin de location, l'achat d'un livre ou un DVD. Un catalogue peut &ecirc;tre inclus (voir le point pr&eacute;c&eacute;dent), comme le paiement par cartes de cr&eacute;dit ou par d'autres modes de paiement (voir le prochain point).
     <li>Services de paiement: dans chaque pays il y a plusieurs classes de num&eacute;ros de t&eacute;l&eacute;phone avec diff&eacute;rents co&ucirc;ts:
  <ul>
     <li> « num&eacute;ros normaux »: le co&ucirc;t des communications t&eacute;l&eacute;phoniques d&eacute;pend du fournisseur, du secteur et du temps d'appel (ce sont les num&eacute;ros habituels, maison, bureau);
     <li> « num&eacute;ros verts gratuits »: aucun co&ucirc;t pour l'utilisateur (ces num&eacute;ros sont souvent ceux de centres d'appel de fournisseurs t&eacute;l&eacute;phoniques);
     <li> « num&eacute;ros payants »: le co&ucirc;t d'appel est choisi par le fournisseur et habituellement il est plus &eacute;lev&eacute; que qu'un appel normal; la somme peut d&eacute;pendre du temps de connection ou &ecirc;tre fixe.
 </ul>
   Avec les « num&eacute;ros payant », l'IVR permet &agrave; l'utilisateur le paiement de marchandises et d'informations sans cartes de cr&eacute;dit ou transactions &eacute;lectroniques.
     <li>Notification d'&eacute;venements: Les syst&egrave;mes IVR sont bidirectionnels: ils recoivent et &eacute;mettent des appels t&eacute;l&eacute;phoniques; en utilisant des appels automatiques et programm&eacute;s, un syst&egrave;me IVR peut annoncer au sujet des &eacute;v&eacute;nements par t&eacute;l&eacute;phone (par exemple : rendez-vous, r&eacute;unions, dates d'expiration, alarmes dans les cas importants...).
</ul>
  </p>
  <p>
 IVR fonctionne gr&acirc;ce aux lignes t&eacute;l&eacute;phoniques en utilisant le son d'entr&eacute;e et de sortie &agrave; l'utilisateur, permettant une int&eacute;gration tr&egrave;s facile par syst&egrave;mes vocaux comme TTS (texte &agrave; la parole: synth&eacute;tiseur audio qui convertit le texte &eacute;crit en discours oral) et ASR (reconnaissance de la parole asynchrone: analyseur vocal qui convertit le discours humain en texte).
 Les premiers permettent &agrave; des syst&egrave;mes IVR de vocaliser oralement du texte &eacute;crit et pas seulement des voix pr&eacute;-enregistr&eacute;es; les derniers servent &agrave; identifier des commandes vocales de voix en entr&eacute;e utilisateur.
  </p>
  <p>
 Les syst&egrave;mes TTS et ASR permettent plus de services t&eacute;l&eacute;phoniques IVR:
  <ul>
      <li> Courriel &eacute;lectronique vocal: notre serveur de courriel re&ccedil;oit un message normal, TTS le convertit en audio et (apr&egrave;s authentification appropri&eacute;e) il peut &ecirc;tre &eacute;cout&eacute; par l'utilisateur qui appelle syst&egrave;me IVR.
      <li> Service de r&eacute;ponse avanc&eacute;: ASR peut am&eacute;liorer le service de r&eacute;ponse d&eacute;crit ci-dessus. La conversion de la voix re&ccedil;ue par le r&eacute;seau t&eacute;l&eacute;phonique en texte qui peut &ecirc;tre facilement envoy&eacute; (par l'interm&eacute;diaire de courriel ou sur un serveur web, etc.).
      <li> Services t&eacute;l&eacute;phoniques pour les personnes sourdes et/ou muettes: nous pouvons utiliser le r&eacute;seau t&eacute;l&eacute;phonique et rendre disponibles des informations aux gens qui habituellement ne peuvent pas y acc&eacute;der parce qu'ils sont handicap&eacute;s:
 <ul>
      <li>les personnes sourdes-muettes peuvent employer un clavier normal pour &eacute;crire un texte converti par un syst&egrave;me de TTS et plac&eacute; sur le r&eacute;seau t&eacute;l&eacute;phonique par IVR;
      <li> les personnes sourdes peuvent recevoir un appel t&eacute;l&eacute;phonique par IVR, le faire convertir en texte par ASR et &ecirc;tre affich&eacute;;
      <li> Les solutions peuvent &ecirc;tre combin&eacute;es pour les personnes qui sont sourdes-muettes, leur permettant d'&eacute;metre et recevoir des appels t&eacute;l&eacute;phoniques.
  </ul>
  </ul>
  </p>
  <p>
 D'une mani&egrave;re g&eacute;n&eacute;rale, IVR offre chaque service et chaque information offerte par un site Web habituel mais sur le r&eacute;seau t&eacute;l&eacute;phonique. La majorit&eacute; de ces services peuvent donc utiliser les syst&egrave;mes IVR. Mais IVR permet plus: le t&eacute;l&eacute;phone est bidirectionnel, ainsi les syst&egrave;mes IVR peuvent avoir des services qui appellent des utilisateurs directement (un site web ne peut pas offrir ce dispositif).



  <A NAME="372lfindex1">&nbsp;</A>
<H2>Bayonne</H2>


    <p>Les syst&egrave;mes IVR ont &eacute;t&eacute; pendant longtemps le monopole de solutions ferm&eacute;es et non libres propos&eacute;es par quelques vendeurs. Chacun d'eux d&eacute;veloppant des serveurs IVR adapt&eacute;s &agrave; leur propre mat&eacute;riel; Bayonne est la r&eacute;ponse du monde opensource et du projet GNU &agrave; cette situation.

    <p>Le site officiel de Bayonne est <a href="http://www.gnu.org/software/bayonne">www.gnu.org/software/bayonne</a> o&ugrave; vous pouvez trouver les sources et la documentation (des manuels d'installation et d'administration, un bon nombre d'exemples et des Howtos). Sur <a href="http://bayonne.sourceforge.org">bayonne.sourceforge.org</a>, il y a des liens externes vers des ressources et le dernier paquet de d&eacute;veloppement. Bayonne poss&egrave;de un acc&egrave;s public (en lecture seulement) CVS pour ses sources: la version 1,2 sur savannah.org (la version actuellement stable pour des applications de production) et la version 1,3/2,0 sur sourceforge.org (les versions exp&eacute;rimentales et de d&eacute;veloppement)

    <p>Le but et la principale caract&eacute;ristique de Bayonne est d'offrir une plateforme IVR virtuelle qui est ind&eacute;pendante du mat&eacute;riel utilis&eacute;. Et Bayonne peut fonctionner avec une partie des familles IVR (pas toutes encore) sans pour autant avoir besoin d'une d'entre elles. Pour chaque famille et/ou fournisseur de plateforme IVR, Bayonne comporte un tron commun modulaire qui d&eacute;finit un ensemble d'instructions et un environnement virtuel, pour un usage g&eacute;n&eacute;ral et sans aucune r&eacute;f&eacute;rence de mat&eacute;riel. Dans cet environnement virtuel on peut d&eacute;velopper des services IVR sans &ecirc;tre restreint au mat&eacute;riel utilis&eacute;; il est donc possible de changer de plateforme IVR ou la mise en communication d'un service IVR &agrave; un autre syst&egrave;me avec une plateforme diff&eacute;rente ne demande pas de r&eacute;&eacute;crire le code.

    <p>Comme indiqu&eacute; pr&eacute;c&eacute;demment, Bayonne supporte plusieurs panneaux, m&ecirc;me tr&egrave;s diff&eacute;rents les uns des autres, de 2 &agrave; 120 lignes t&eacute;l&eacute;phoniques (analogique ou num&eacute;rique). D'ailleurs, Bayonne peut utiliser encore plus de panneaux de la m&ecirc;me famille en m&ecirc;me temps (dans la nouvelle version de Bayonne, on peut m&ecirc;me utiliser le panneau de diff&eacute;rentes familles en m&ecirc;me temps), ainsi des centaines de lignes t&eacute;l&eacute;phoniques peuvent &ecirc;tre manipul&eacute;es simultan&eacute;ment. Malheureusement Bayonne ne support pas les modems habituels s&eacute;rie/USB (analogique, RNIS ou GSM).

    <p>Pour essayer ou tester Bayonne, il ne faut pas de plateforme IVR co&ucirc;teuse. Actuellement, il suffit d'une carte son car Bayonne utilise un pilote qui &eacute;mule une plateforme IVR utilisant les entr&eacute;es/sorties du PC (clavier, microphone et &eacute;couteurs) : Bayonne tourne sur un PC de bureau.

    <p>Donc pour lancer des services IVR, Bayonne utilise son propre langage, appel&eacute; CcScript (un composant externe en version 1.2 integr&eacute; dans le paquet principal et pour la version de d&eacute;veloppement en 1.3/2.0). Ce langage est tres simple, avec des actions informatiques compl&egrave;tes et les principales structures de programmation: Blocs conditionnels, boucles, sauts conditionnels ou non, routines.... Une fonction principale de CcScript est d'avoir des instructions « limit&eacute;es temporellement »: avant qu'une instruction ne soit ex&eacute;cut&eacute;e, le language conna&icirc;t son temps maximum d'ex&eacute;cution. Pour des op&eacute;rations incluant des appels &agrave; des systemes externes, comme les syst&egrave;mes de fichiers, les bases de donn&eacute;es et les connexions r&eacute;seau, il y a un param&egrave;tre « timeout ». Si l'ex&eacute;cution dure plus longtemps que le timeout, l'op&eacute;ration &eacute;choue. Du point de vue du serveur, cette fonction est tr&egrave;s importante car elle permet &agrave; Bayonne d'offrir des services d&eacute;terministes et reli&eacute;s.

    <p>Les possibilit&eacute;s informatiques de Bayonne ne sont pas seulement limit&eacute;es &agrave; ceux de CcScript. En fait Bayonne peut interagir avec des langages de haut niveau comme le Perl et le Python. Gr&acirc;ce &agrave; cette int&eacute;gration directe, Bayonne h&eacute;rite de toutes les biblioth&egrave;ques et modules disponibles pour ces langages: chaque op&eacute;ration informatique, algorithme habituel ou non, manipulation de donn&eacute;es, raccordement &agrave; la base de donn&eacute;es ou serveur externe (encha&icirc;nement, courriel, LDAP, dossier partag&eacute;s)... Ainsi Bayonne peut traiter tout qu'on peut lui demander.

    <p>M&ecirc;me sans Perl et Python, Bayonne peut directement acc&eacute;der &agrave; des bases de donn&eacute;es MySql ou Postgres et aux requ&ecirc;tes SQL sans utiliser CcScript. De la m&ecirc;me mani&egrave;re, Bayonne peut acc&eacute;der au Systemes de fichiers et se connecter par l'interm&eacute;diaire du r&eacute;seau &agrave; des ressources distantes. En outre, Bayonne peut directement interagir avec un synth&eacute;tiseur de voix TTS comme Flite, th&ecirc;ta (seulement les voix anglaises sont disponibles) et festival (multilingue). Actuellement, Bayonne ne peut se relier aux syst&egrave;mes de reconnaissance de la parole, mais ce dispositif est au statut de d&eacute;veloppement.

    <p>Pour la pluspart des services IVR, Bayonne n'a pas besoin de syst&egrave;mes externes Texte &agrave; Parole car il poss&egrave;de d&eacute;j&agrave; ces propres modules vocaux multilingues (Anglais, Fran&ccedil;ais, Italien et Russe) qui peuvent dire des nombres (ordinaires ou cardinaux), des dates et des temps (ces modules et l'audio sont compl&egrave;tement personnalisables). Ces modules incluent des voies humaines pr&eacute;-enregistr&eacute;es et peuvent &ecirc;tre utilis&eacute;s pour la pluspart des services t&eacute;l&eacute;phones IVR directement dans la architecture de Bayonne.

    <p>Bayonne peut g&eacute;rer des entr&eacute;es venants de connections t&eacute;l&eacute;phoniques et des entr&eacute;es provenants du syst&egrave;me lui-m&ecirc;me dans plusieurs buts : gestion synchronis&eacute;e, o&ugrave; Bayonne attend pour un signal d'entr&eacute;e (exemple : attendre qu'une touche soit press&eacute;e par l'utilisateur) et de la gestion d&eacute;synchronis&eacute;e, o&ugrave; Bayonne re&ccedil;oit une notification quand un &eacute;v&eacute;nement arrive (exemple : une touche press&eacute;e ou un timeout expir&eacute;) sans explicitement les attendre. Ces deux modes de gestion d'entr&eacute;es permettent &agrave; Bayone de r&eacute;agir rapidement &agrave; l'utilisateur et au &eacute;v&eacute;nements syst&egrave;me sans aucune perte de temps.

    <p>Comme vu pr&eacute;c&eacute;dement, Bayonne a &eacute;t&eacute; d&eacute;velopp&eacute; pour g&eacute;rer un grand nombre de lignes t&eacute;l&eacute;phoniques simultanement, donc il permet des commandes et des instructions « multithreading » (gestion simultan&eacute;e de plusieurs processus). Chaque processus peut interagir avec les autres par le biais de signaux. Cela autorise des processus de synchronisation et des &eacute;changes de donn&eacute;es entre les processus et, de plus, en connectant des t&acirc;ches qui utilisent des lignes diff&eacute;rentes (exemple : deux utilisateurs peuvent se parler &agrave; travers Bayonne).

    <p>Toutes ces caract&eacute;ristiques rendent Bayonne utile dans un large &eacute;ventail de situations. Il peut &ecirc;tre utilis&eacute; pour de petits services t&eacute;l&eacute;phoniques IVR avec quelques lignes, tout aussi bien que pour un grand service central supportant des centaines de lignes. Avec Bayonne on peut facilement avoir des services « simples et rapides » ou des services complexes invoquant par la m&ecirc;me des syst&egrave;mes externes. En conclusion, Bayonne est la bonne solution de serveur IVR pour tous les besoins en services IVR.


    
    
<!-- vim: set sw=2 ts=2 et : -->

<!-- BODY_OF_THE_ARTICLE_STOP -->
<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback form for this article</h2>
Every article has its own talkback page. On this page you can submit a comment or look at comments from other readers:
<center>
    <table width="250" border=0><tr><td>
    <div class="tbbutton"><A class="nodec" href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=372">&nbsp;talkback page&nbsp;</a></div>
    </td></tr></table>
</center>

<br clear="all">
<HR size="2" noshade>
<table width="250" border=0><tr><td>
<div class="bbutton"><a class="nodec" href="../../index.shtml">&lt;--, LF Sommaire</a></div>
</td><td>
<div class="bbutton"><a class="nodec" href="index.shtml">Sommaire de ce num&eacute;ro</a></div>
</td></tr></table>
<br clear="all">
<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">Site Web maintenu par l&acute;&eacute;quipe d&acute;&eacute;dition LinuxFocus</A>
<BR><FONT COLOR="#1111aa"><a href="../../common/copy.html">&copy; Luca Bariani</a><br>&quot;some rights reserved&quot; see <a href="../../license/index.shtml">linuxfocus.org/license/</a><br><a href="http://www.linuxfocus.org">http://www.LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Translation information:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Luca Bariani <small>&lt;lucabariani /at/ ferrara.linux.it&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; fr: Erwin Kwolek &lt;kaoul.kae /at/ gmail.com&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2005-09-05, generated by lfparser version 2.52</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
