<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//DE">
<HTML lang="en">
<HEAD>
<META http-equiv="Content-Type" 
      content="text/html; charset=iso-8859-1">
<TITLE> LinuxFocus Oktober 1998 </TITLE>
</HEAD>
<BODY bgcolor="#ffffff" 
      text="#000000" 
      alink="#336633" 
      link="#336633" 
      vlink="#336633">
<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../index.shtml">
<AREA shape="rect" 
      coords="423, 9, 457, 30" 
      alt="Map" 
      href="../map.html">
<AREA shape="rect" 
      coords="463, 9, 508, 30" 
      alt="Index" 
      href="../indice.html">
<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/index.html">
</MAP>
<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15" alt="News" href="../News/index.shtml">
<AREA shape="rect" coords="189, 0, 284, 15" alt="Archives" href="../Archives/index.html">
<AREA shape="rect" coords="319, 0, 395, 15" alt="Links" href="../Links/index.shtml">
<AREA shape="rect" 
      coords="436, 0,  523, 15" 
      alt="About LF" 
      href="../aboutus.html">
</MAP>
<!-- Top and Bottom navegation bars -->
<CENTER>
<IMG src="../../common/images/Topbar-en.gif" 
     width="600" 
     height="40" 
     border="0" 
     alt="[Top Bar]" 
     ismap 
     usemap="#top" >
<BR>
<IMG src="../../common/images/Bottombar-en.gif" 
     width="600" 
     height="21" 
     border="0" 
     alt="[Bottom Bar]" 
     ismap 
     usemap="#bottom">
</CENTER>
<TABLE align="center" 
       width="100%"  
       cellspacing="0" 
       cellpadding="15" 
       border="0">
       <TR>                         <!-- Row 1 --> 
       <TD>
       <IMG src="../../common/images/lforg.gif">
       </TD>
       <TD align="center">
       <H1>
       Oktober 1998
       </H1>
       </TD>
       </TR>
       <TR valign="top">            <!-- Row 2 --> 
       <TD>
<P>
       <B> Seite f&uuml;r die Mitarbeiter </B>
        Die Artikel im LF werden kostenlos allen Lesern zug&auml;nglich
        gemacht. Dadurch ist es uns nicht m&ouml;glich, die Autoren und
        &Uuml;bersetzer f&uuml;r ihre Arbeit zu entlohnen. Dennoch glauben
        wir, vielen Leuten f&uuml;r ihre gro&szlig;artigen Bem&uuml;hungen,
        dieses Magazin am Leben zu erhalten, etwas zu schulden. Deswegen
        wollen wir eine Seite f&uuml;r alle Mitarbeiter
        aufbauen, auf der diese Platz haben, sich selbst vorzustellen, sowie
        ihre E-Mail und WWW Adresse zu ver&ouml;ffentlichen. Dies d&uuml;rfte
        nicht nur eine kleine Wiedergutmachung f&uuml;r unsere Helfer sein, sondern
        auch als Informationshilfe der Linux Gemeinde dienen.
</P>
<P>
        <B>Copyrights und Lizenen</B>
        Jegliches Material dieser WWW Seiten ist urheberrechtlich durch die
        jeweiligen Autoren gesch&uuml;tzt. Linux<b><FONT color="#ff0000">Focus</FONT></b>
        selbst h&auml;lt keine Rechte an den publizierten Artikeln. Das
        Material, welches durch den LF in Magazinform angeboten wird, wird
        mit direktem Einverst&auml;ndnis der Autoren ver&ouml;ffentlicht.
        Die Autoren geben uns ebenso die Erlaubnis, die Artikel in ihrer
        eingereichten Form zu &uuml;bersetzen und via WWW, FTP oder anderem
        Wege zu verbreiten, solange dies im Zusammenhang mit dem Magazin geschieht.
        Weitere Informationen sind im  <a href="../LF-manifesto.html">LinuxFocus-Manifest</a>
        zu finden.
</P>
       </TD>
       <TD  width="60%" valign="top" >
<P>
 <B>Was ist der Linux<FONT color="#ff0000">Focus</FONT>?</B>
        Wir sind eine Gruppe von begeisterten Linux Anh&auml;ngern aus aller
        Welt. Unser Ziel ist, eines der besten Online Magazine &uuml;ber Linux
        zu schaffen, ohne dabei die Vielf&auml;ltigkeit der Linux Gemeinde zu
        vernachl&auml;ssigen. Alle Artikel werden in vielen verschiedenen Sprachen
        ver&ouml;ffentlicht, woduch neue und junge Leute f&uuml;r die fantastische
        Welt von Linux und UNIX begeistert werden sollen. Im Gegensatz zum dem,
        was wir im Netz gelesen haben, kann unser Magazin nicht wirklich als
        Sammlung von &quot;Tips & Tricks&quot; bezeichnet werden. Wie der Name schon sagt,
        versucht der LinuxFocus tiefer in die jeweilige Materie einzudringen,
        es gibt Artikelserien &uuml;ber bestimmte Themen, in deren Verlaufe
        der Leser sich ein gewisses Ma&szlig; an Erfahrung aneignen kann.
</P>       
<P>
       <B>In wievielen Sprachen erscheint der Linux<FONT color="#ff0000">Focus</FONT>?</B>
        Das ist schwer zu sagen, w&auml;chst doch unser Team von Monat zu Monat.
        Es gibt bereits vier Sektionen, die recht weit fortgeschritten sind:
        die englische, die franz&ouml;sische, die spanische und auch die deutsche
        Sektion. Daneben gibt es noch kleinere Gruppen mit wechselnder Zahl von
        Mitarbeitern f&uuml;r die Sprachen: Russisch, Italienisch, Portugisisch,
        Niederl&auml;ndisch, uvm. Es w&auml;re sch&ouml;n, wenn diese Gruppen
        auch gest&auml;rkt werden w&uuml;rden und kontinuierlich einen Beitrag
        leisten k&ouml;nnten. Wir sind immer offen f&uuml;r Neueinsteiger, wenn
        jemand beim LF mitmachen will, kann er einfach den jeweiligen Editor unter
         <A href="../aboutus.html">About LF</A> finden und anschreiben. Es ist immer
        sch&ouml;n, ein paar neue Gesichter zu sehen.
        </P>              
<P>
	</TD>
	</TR>
	<TR>                   <!--  Row 3 -->
	<TD colspan="2">
	<HR size=1 noshade>
	<H3>
	<FONT face="Helvetica, Arial" 
	      color="#660033">
	Inhalt
	</FONT>
	</H3>
        <H4>
	<FONT face="Helvetica, Arial" 
              color="#660033">
        Hardware & Software Review
        </FONT>
        </H4>
        <UL>
          <LI type="circle">
	    <IMG src="../../common/images/frame.gif" 
                 border="0" 
		 height="" 
		 width="" 
		 alt="" 
		 align="absmiddle">
	    <A href="article67.html">
	    Linux in der akademischen Ausbildung,
	    </A> 
	    von
	    Emre Demiralp
	    <BR>
	Der Autor beschreibt aus erster Hand, wie Linux das Gesicht
	der Forschungs-  und Lehreinrichtungen in der T&uuml;rkei
	ge&auml;ndert hat. Seine Erfahrungen stehen stellvertretend
	f&uuml;r den Wandel, der sich an den Universit&auml;ten in aller
	Welt vollzieht.
          </LI>
	  
	</TD>
	</TR>
</TABLE>
<!-- Page Foot -->
<BR clear="all">
<CENTER>
<TABLE width="95%">
<TR>
 <TD align="center" bgcolor="#666666">
  <FONT color="#ffffff">
  This website is maintained by Miguel Angel Sepulveda<BR>
 <B>&copy; 1998  LinuxFocus</B>
  </FONT>
 </TD>
</TR>
</TABLE>
</CENTER>
</BODY>
</HTML>
