<!-- Ceci est le source SGML pour le HOWTO DOSEMU, version fran&ccedil;aise -->
<!-- Auteur original: Mike Deisher, deisher@dspsun.eas.asu.edu -->
<!-- Traduction: Thomas Parmelan, tom@darshiva.efrei.fr -->

<!doctype linuxdoc system>

<article>

<title>Le HOWTO <tt/dosemu/
<author>&Eacute;dit&eacute; par Mike Deisher (<tt/deisher@dspsun.eas.asu.edu/)
<date>v0.60pl3, 17 Avril 1995

<abstract>
Ceci est la traduction fran&ccedil;aise <footnote>Traduction&nbsp;: Thomas
Parmelan <tt>&lt;tom@darshiva.efrei.fr&gt;</tt> </footnote> de la &dquot;Foire Aux
Questions&dquot; (FAQ) / document HOWTO pour <tt/dosemu/. La version la
plus &agrave; jour du document original est disponible dans
<tt>dspsun.eas.asu.edu:/pub/dosemu</tt>.  </abstract>

<toc>

<sect>Introduction

<sect1>Qu'est-ce que <tt/dosemu/?

<p>D'apr&egrave;s le manuel&nbsp;: &dquot;<tt/dosemu/ est un programme
utilisant certaines fonctionnalit&eacute;s du noyau Linux et du processeur
80386 afin de faire tourner MS-DOS dans une `bo&icirc;te DOS'. La
bo&icirc;te DOS est une combinaison d'astuces mat&eacute;rielles et
logicielles, et est capable&nbsp;:
<itemize>
<item>de virtualiser toutes les entr&eacute;es/sorties et les instructions de
contr&ocirc;le du processeur
<item>de supporter la taille de mot et les modes d'adressage du &dquot;mode
r&eacute;el&dquot; de la famille de processeurs iAPX86, tout en
s'ex&eacute;cutant dans l'environnement du &dquot;mode
prot&eacute;g&eacute;&dquot;
<item>de d&eacute;tourner et d'&eacute;muler tous les appels syst&egrave;me
du DOS et du BIOS n&eacute;cessaires au bon fonctionnement, avec des
performances correctes
<item>de simuler l'environnement mat&eacute;riel que les programmes DOS ont
l'habitude de contr&ocirc;ler
<item>de fournir des services MS-DOS &agrave; travers des services Linux; par
exemple, <tt/dosemu/ peut fournir un disque virtuel qui est en fait un
r&eacute;pertoire Linux.&dquot;
</itemize>

<sect1>Quelle est la derni&egrave;re version de <tt/dosemu/ et o&ugrave; la trouver?

<p>La derni&egrave;re version est <tt/dosemu 0.60/. Elle est disponible par
<tt/ftp/ sur&nbsp;:
<tscreen><verb>
	tsx-11.mit.edu:/pub/linux/ALPHA/dosemu/
	dspsun.eas.asu.edu:/pub/dosemu/
</verb></tscreen>

Cependant, des pr&eacute;-versions sont disponibles pour les
d&eacute;veloppeurs et les alpha-testeurs sur&nbsp;:
<tscreen><verb>
	tsx-11.mit.edu:/pub/linux/ALPHA/dosemu/Development
	dspsun.eas.asu.edu:/pub/dosemu/Development/
</verb></tscreen>
et ont des noms de la forme <tt>pre0.61.&ast;.tgz</tt>. Ce code a l'avantage
d'&ecirc;tre compatible avec les noyaux Linux les plus r&eacute;cents. Il
inclut &eacute;galement de nouvelles fonctionnalit&eacute;s
Il ne faut cependant pas oublier que ceci est du code
ALPHA&nbsp;: il peut y avoir des bogues s&eacute;rieux et tr&egrave;s peu
de documentation pour les nouvelles fonctionnalit&eacute;s.

<sect1>Comment suivre le d&eacute;veloppement?

<p>Si vous voulez suivre le d&eacute;veloppement de <tt/dosemu/, souscrivez
&agrave; la liste de distribution linux-msdos-digest. Pour souscrire,
il suffit d'envoyer un mail &agrave;
<tt>Majordomo@vger.rutgers.edu</tt> avec, dans le corps du message,
la ligne suivante&nbsp;:
<tscreen><verb>
    subscribe linux-msdos-digest votre_nom@votre.adresse.email
</verb></tscreen>

Si jamais vous d&eacute;sirez vous d&eacute;sabonner de la liste, vous pouvez envoyer
un mail &agrave; <tt>Majordomo@vger.rutgers.edu</tt> avec la commande suivante
dans le corps de votre message&nbsp;:
<tscreen><verb>
    unsubscribe linux-msdos-digest votre_nom@votre.adresse.email
</verb></tscreen>

<sect1>Quelle est la documentation disponible pour <tt/dosemu/?

<p>Le manuel de <tt/dosemu/ (<tt>dosemu.texinfo</tt>) &eacute;crit par
Robert Sanders n'a pas &eacute;t&eacute; mis &agrave; jour depuis un
certain temps, mais il reste encore une bonne source d'informations. Il est
distribu&eacute; avec <tt/dosemu/.

Le DANG, ou <sq><em/<tt/dosemu/ Novice's Altering Guide/</sq>, explique le
fonctionnement interne de <tt/dosemu/. Il est &eacute;crit pour les
aventureux, ceux qui veulent modifier eux-m&ecirc;mes le source. Il est
maintenu par Alistair MacDonald (<tt>am20@unix.york.ac.uk</tt>) et est
post&eacute; r&eacute;guli&egrave;rement dans la liste de distribution
MSDOS de Linux Activists.

La liste EMU (<tt/EMUsuccess.txt/) est une liste de tous les programmes qui
ont &eacute;t&eacute; essay&eacute;s avec succ&egrave;s sous <tt/dosemu/.
Elle est post&eacute;e de temps &agrave; autres dans la liste de
distribution. La derni&egrave;re version est
disponible par <tt/ftp/ dans <tt>dspsun.eas.asu.edu:/pub/dosemu</tt>.

Et, bien s&ucirc;r, il y a le HOWTO <tt/dosemu/. Mais vous
le saviez d&eacute;j&agrave;, n'est-ce pas? Il est post&eacute;
r&eacute;guli&egrave;rement dans la liste de distribution MSDOS de
Linux Activists. La version la plus &agrave; jour est disponible dans
<tt>dspsun.eas.asu.edu:/pub/dosemu</tt>.

<sect1>Comment soumettre des corrections ou additions &agrave; ce HOWTO?

<p>La meilleure m&eacute;thode est d'&eacute;diter le fichier
<tt>dosemu-HOWTO-xx.x.sgml</tt> afin d'y incorporer les changements, de
cr&eacute;er un fichier diff comme ceci
<tscreen><verb>
		diff fichier-original nouveau-fichier
</verb></tscreen>
et de l'envoyer &agrave; <tt>deisher@dspsun.eas.asu.edu</tt>. Ce n'est pas
grave si vous ne connaissez pas SGML. Les changements et nouvelles
informations seront accept&eacute;es sous toutes les formes, cr&eacute;er
un fichier diff rend simplement le travail plus facile au coordinateur. :-)

<tt/[/&nbsp;Note&nbsp;: Cette version fran&ccedil;aise n'est
qu'une traduction du document original. Addresser les
corrections et suggestions d'ordre technique &agrave;
<tt>deisher@dspsun.eas.asu.edu</tt>; signaler les erreurs de traduction
&agrave; <tt>Thomas.Parmelan@darshiva.efrei.fr</tt>.&nbsp;<tt/]/

<sect1>Un petit message de Greg &hellip;

<p>Sauf mention contraire, les auteurs d&eacute;tiennent les copyrights sur
les HOWTO Linux. Les HOWTO Linux, ou des extraits des HOWTO Linux, peuvent
&ecirc;tre reproduits et distribu&eacute;s, sur n'importe quel m&eacute;dia
physique ou &eacute;lectronique, tant que cette notice de copyright reste
pr&eacute;sente sur toutes les copies. La redistribution commerciale est
autoris&eacute;e et encourag&eacute;e&nbsp;; cependant, l'auteur d&eacute;sire
&ecirc;tre mis au courant de telles distributions.

Toute traduction, synth&egrave;se ou travail d&eacute;riv&eacute; d'un HOWTO
Linux doit &ecirc;tre couvert par cette notice de copyright.
C'est-&agrave;-dire que vous pouvez r&eacute;aliser un travail
d&eacute;riv&eacute; d'un HOWTO Linux, mais que vous ne pouvez pas imposer des
restrictions suppl&eacute;mentaires sur sa distribution. Des exceptions
&agrave; cette r&egrave;gle peuvent &ecirc;tre accord&eacute;es dans certains
cas&nbsp;; contacter le coordinateur des HOWTO Linux &agrave; l'adresse
donn&eacute;e plus bas.

En bref, nous d&eacute;sirons promouvoir la circulation de ces informations
autant que possible. Cependant, nous d&eacute;sirons &eacute;galement garder
le copyright sur ces HOWTOs, et aimerions &ecirc;tre pr&eacute;venus de leur
redistribution.

Si vous avez des questions, contactez Greg Hankins, le coordinateur des HOWTO
LInux, &agrave; <tt/gregh@cc.gatech.edu/.  <footnote>NDT: En ce qui concerne
les traductions fran&ccedil;aises, contacter Xavier Cazin, le coordinateur
fran&ccedil;ais, &agrave; <tt/xc@itp.fr/.</footnote>.

Voici le texte original du copyright, pour r&eacute;f&eacute;rence&nbsp;:

Unless otherwise stated, Linux HOWTO documents are copyrighted by
their respective authors. Linux HOWTO documents may be reproduced and
distributed in whole or in part, in any medium physical or electronic,
as long as this copyright notice is retained on all copies. Commercial
redistribution is allowed and encouraged; however, the author would
like to be notified of any such distributions.

All translations, derivative works, or aggregate works incorporating
any Linux HOWTO documents must be covered under this copyright notice.
That is, you may not produce a derivative work from a HOWTO and impose
additional restrictions on its distribution. Exceptions to these rules
may be granted under certain conditions; please contact the Linux HOWTO
coordinator at the address given below.

In short, we wish to promote dissemination of this information through as
many channels as possible. However, we do wish to retain copyright on the
HOWTO documents, and would like to be notified of any plans to redistribute
the HOWTOs.

If you have questions, please contact Greg Hankins, the Linux HOWTO
coordinator, at gregh@cc.gatech.edu.

<sect>Compiler et installer <tt/dosemu/

<sect1>O&ugrave; sont les instructions d'installation?

<p>Les instructions d'installation sont dans le fichier <tt/QuickStart/
pr&eacute;sent dans la distribution.

<sect1>Les 10 Erreurs Stupides les plus courantes &agrave; l'installation
<p>(08/04/95)

<enum>
<item>Oublier de lire le QuickStart Guide;
<item>Essayer de compiler avec un noyau post&eacute;rieur au 1.1.45;
<item>Ne pas avoir les sources du bon noyau dans <tt>/usr/src/linux</tt>;
<item>Utiliser <tt/dosemu/ avec un noyau n'ayant pas le support pour les IPC;
<item>Compiler avec un gcc ant&eacute;rieur &agrave; 2.5.8 ou une libc ant&eacute;rieure &agrave; 4.5.21;
<item>Oublier d'&eacute;diter le fichier <tt>/etc/dosemu.conf</tt>;
<item>Oublier de lancer &dquot;<tt>FDISK /mbr</tt>&dquot; sur son hdimage;
<item>Lancer DOSEMU avec un acc&egrave;s partition lorsque ces partitions sont d&eacute;j&agrave; mont&eacute;es;
<item>Ne pas compiler <tt/dosemu/ avec suffisamment de privil&egrave;ges (root).
<item>Essayer de lancer DOSEMU sur le syst&egrave;me multi-utilisateurs d'un fournisseur de connectivit&eacute; IP.
</enum>

<sect1>Comment cr&eacute;er un ex&eacute;cutable simple (pas de librairie)&nbsp;?

<p>Marty Leisner (<tt>leisner@sdsp.mc.xerox.com</tt>, 08/04/95

Si vous voulez un ex&eacute;cutable QMAGIC, il faut d&eacute;finir <tt/STATIC/ dans le
<tt/Makefile/; sinon il y aura une combinaison librairie/ex&eacute;cutable.

<sect1>Comment cr&eacute;er des binaires ELF&nbsp;?

<p>Marty Leisner (<tt>leisner@sdsp.mc.xerox.com</tt>, 08/04/95

Pour cr&eacute;er un binaire ELF, d&eacute;finir <tt/ELF/ dans le <tt/Makefile/. Compiler
et installer la librairie <tt/slang/ s&eacute;par&eacute;ment. <tt/slang/ fonctionne tr&egrave;s
bien en librairie ELF partag&eacute;e.

<sect1>Comment compiler dosemu sur une machine ayant peu de m&eacute;moire&nbsp?

<p>Marty Leisner (<tt>leisner@sdsp.mc.xerox.com</tt>, 08/04/95

Si vous &ecirc;tes &agrave; court de place dans le swap, vous pouvez ajouter la ligne
<tscreen><verb>
    CFLAGS+=-fno-inline
</verb</tscreen>
apr&egrave;s la d&eacute;finition de <tt/CFLAGS/ dans <tt>dpmi/Makefile</tt>. Attention
&agrave; bien v&eacute;rifier que vous avez activ&eacute; votre swap: j'ai d&eacute;j&agrave; exp&eacute;riment&eacute;
des plantages quand Linux manque de swap.

<sect1>Comment acc&eacute;lerer la compilation&nbsp;?

<p>Marty Leisner (<tt>leisner@sdsp.mc.xerox.com</tt>, 08/04/95

L'optimisation par d&eacute;faut est <tt/-O2/. Il suffit de changer le
<tt/Makefile/ afin d'utiliser <tt/-O/ (compilation un peu plus rapide,
ex&eacute;cutable l&eacute;g&egrave;rement plus petit).

<sect1>Comment compiler de mani&egrave;re non-interactive&nbsp;?

<p>
En d&eacute;finissant <tt/do_DEBUG/ dans le <tt/Makefile/, vous aurez <tt/-Wall -g/,
une compilation non-interactive et sans tex.

<sect1>Autres astuces de compilation de Marty &hellip;

<p>
Il faut avoir compil&eacute; le noyau sur son propre syst&egrave;me pour avoir la
version courante. Sinon, il faut modifier &agrave; la main <tt/KERNEL_VERSION/
dans le <tt/Makefile/ racine. Le nombre est de la forme <tt/nmmmppp/,
o&ugrave; <tt/n/ est le num&eacute;ro de version, <tt/mmm/ est le
num&eacute;ro mineur de version, et <tt/ppp/ le num&eacute;ro de patch.
Par exemple, le noyau 1.1.88 correspond &agrave; "1001088" et le noyau 1.2.1
&agrave; "1002001".

Commencer toutes les compilations &agrave; partir du r&eacute;pertoire racine
des sources. Dans ce r&eacute;pertoire, <sq><tt/make sous-repertoire/</sq>
lancera <tt/make/ dans <tt/sous-repertoire/. Chaque r&eacute;pertoire 
poss&egrave;de les cibles habituelles <tt/clean/ et <tt/realclean/.
<tt/clean/ efface les fichiers objets, <tt/realclean/ efface &eacute;galement
les fichiers de d&eacute;pendance et quelques autres fichiers.

<sect1>Faut-il compiler dosemu sous l'identit&eacute; <sq/root/&nbsp;?

<p>08/04/95

Non. Il faut l'installer sous l'identit&eacute; <sq/root/, cependant.

<p>Marty Leisner (<tt>leisner@sdsp.mc.xerox.com</tt>) ajoute&nbsp;:

Afin d'acc&eacute;der aux ports E/S (y compris la console), <tt/dosemu/ a besoin
de tourner avec l'identit&eacute; <sq/root/. Lancer <tt/dosemu/ dans un <tt/xterm/
ou une fen&ecirc;tre X et demander ensuite l'acc&egrave;s direct au mat&eacute;riel vous permet
de tourner <tt/dosemu/ sous une identit&eacute; utilisateur. Les implications
de s&eacute;curit&eacute; / setuid seront &eacute;tudi&eacute;es dans les versions de d&eacute;veloppement.

<sect1>Le Makefile est dans une boucle infinie &hellip;

<p>James B. MacLean (<tt>jmaclean@fox.nstn.ns.ca</tt>), 12/04/95

Nous avons quelquefois remarqu&eacute; ceci, g&eacute;n&eacute;ralement lorsque la date d'un 
fichier est importante. Quelques personnes r&eacute;solvent le probl&egrave;me en mettant
&agrave; jour leur noyau, d'autres (dont moi) en lancant les commandes&nbsp;:
<tscreen><verb>
	make realclean
	make most
</verb></tscreen>

<sect>Configuration du disque dur

<sect1>Comment puis-je utiliser mon disque dur avec <tt/dosemu/?

<p>Tout d'abord, montez votre partition DOS sur un r&eacute;pertoire
Linux. Par exemple, on peut cr&eacute;er un r&eacute;pertoire tel que
<tt>/dos</tt> sous Linux (<tt>mkdir -m 755 /dos</tt>) et ajouter une ligne
du type&nbsp;:
<tscreen><verb>
 /dev/hda1	/dos	msdos	umask=022
</verb></tscreen>
&agrave; <tt>/etc/fstab</tt>. (Dans cet exemple, le disque DOS est
mont&eacute; en lecture seule. Il est possible de le monter en
lecture et &eacute;criture en rempla&ccedil;ant &dquot;022&dquot; par
&dquot;000&dquot;, et en utilisant l'option <tt/-m 777/ avec <tt/mkdir/).
Maintenant, <tt>mount /dos</tt>. Vous pouvez ensuite ajouter une ligne
<tscreen><verb>
 lredir d: linux\fs/dos
</verb></tscreen>
au fichier <tt/AUTOEXEC.BAT/ de votre <tt/hdimage/ (voir plus bas
les commentaires au sujet de <tt/LREDIR/). Sur un syst&egrave;me
multi-utilisateurs, on peut utiliser&nbsp;:
<tscreen><verb>
 lredir d: linux\fs\${home}
</verb></tscreen>
o&ugrave; <bf/home/ est le nom d'une variable d'environnement contenant
l'emplacement du r&eacute;pertoire dos (<tt>/dos</tt> dans cet exemple).

---------------------

<p>Tim Bird (<tt/Tim_R_Bird@Novell.COM/) explique qu'il faut faire
attention lorsque l'on utilise <tt/LREDIR/ dans l'<tt/autoexec.bat/, car
<tt/COMMAND.COM/ continue &agrave; lire dans l'<tt/autoexec.bat/ du disque
redirig&eacute; &agrave; partir de l'endroit o&ugrave; il en &eacute;tait
rest&eacute; dans l'<tt/autoexec.bat/ du disque physique. Pour cette
raison, il est plus s&ucirc;r d'utiliser le m&ecirc;me <tt/autoexec.bat/
pour les deux disques.

---------------------

<p>Robert D. Warren (<tt/rw11258@xx.acs.appstate.edu/) expliquait le 28/04/94&nbsp;:

Je boote &agrave; partir d'un fichier <tt/hdimage/ de moins d'1 Mo, et
la derni&egrave;re ligne de mon <tt/config.sys/ dans le <tt/hdimage/
est&nbsp;:
<tscreen><verb>
	install=c:\lredir.exe LINUX\FS\home/dos
</verb></tscreen>
Ceci ex&eacute;cute <tt/lredir/ juste avant de lancer l'interpr&eacute;teur
de commandes. J'ai utilis&eacute; cela avec succ&egrave;s avec
<tt/COMMAND.COM/ et <tt/4DOS/. Cela &eacute;limine le probl&egrave;me
de l'offset li&eacute; &agrave; l'utilisation de <tt/lredir/ dans
l'<tt/AUTOEXEC.BAT/.

<sect1>Puis-je utiliser un disque compress&eacute; avec stacker/double-space/super-store?

<p>Pour le moment, il n'est pas possible d'acc&eacute;der aux disques
compress&eacute;s &agrave; partir des redirigeurs (<tt/lredir/ ou
<tt/emufs/). Cependant, de nombreuses personnes ont utilis&eacute; avec
succ&egrave;s la technique consistant &agrave; d&eacute;commenter la ligne
<tscreen><verb>
 disk { wholedisk "dev/hda" } # 1ere partition du 1er disque
</verb></tscreen>
du fichier de configuration de <tt/dosemu/. D'autres utilisent la ligne
<tscreen><verb>
 disk { partition "dev/hda1" }
</verb></tscreen>

Si votre partition DOS est d&eacute;j&agrave; mont&eacute;e et accessible en &eacute;criture lorsque
vous lancez <tt/dosemu/ avec l'acc&egrave;s partition ou l'acc&egrave;s disque, <tt/dosemu/
affiche un message d'avertissement et ne se lance pas. Ceci &eacute;vite DOS et Linux
d'&eacute;crire ind&eacute;pendamment l'un de l'autre sur votre disque, et de rendre votre
partition DOS inutilisable (tout au moins les fichiers qui y r&eacute;sident).

---------------------

Si LILO est install&eacute;, la proc&eacute;dure ci-dessus ne fonctionnera pas. Cependant...

Thomas Mockridge (<tt>thomas@aztec.co.za</tt>) (8/5/94):

Pour d&eacute;marrer <tt/dosemu/ avec LILO et Stacker 4.0 j'ai
proc&eacute;d&eacute; de la mani&egrave;re suivante...

<enum>
<item><tt/dd/ le MBR vers un fichier (ou norton utility, etc., les premiers
512 octets)
<item>D&eacute;marrer le DOS (le vrai), faire un <tt>fdisk /mbr</tt>,
rendre la partition dos active avec fdisk.
<item>Copier le nouveau MBR vers un fichier.
<item>Remplacer le MBR original.
<item>Copier le second MBR vers <tt>/var/lib/dosemu/partition.hda?</tt>
(suivant votre partition dos).
<item>Editer <tt/dosemu.conf/
<tscreen><verb>
		disk {partition "/dev/hda? ?"}
</verb></tscreen>
<item>Lancer <tt/dosemu/ et voil&agrave;! Plus de LILO.
</enum>

---------------------

Holger Schemel (<tt>q99492@pbhrzx.uni-paderborn.de</tt>) expliquait le 10/02/94&nbsp;:

Cela marche parfaitement sous <tt/dosemu/ avec MS-DOS 6.0. Si vous avez des
probl&egrave;mes, il faut &eacute;diter le fichier <tt/DBLSPACE.INI/ pour
mettre la lettre d'unit&eacute; de disque qui correspond &agrave; votre
disque sous <tt/dosemu/.

---------------------

Darren J Moffat (<tt>moffatd@dcs.gla.ac.uk</tt>) expliquait le 27/03/94&nbsp;:

<sq>&hellip;utilisez 6.2 si vous pouvez&nbsp;!! Assurez-vous d'avoir sous
la main une disquette de boot avec LILO, car le DOS 6.2 change le MBR du
disque de d&eacute;marrage.</sq>

<sect>Ports s&eacute;ries, parall&egrave;les et souris

<sect1>O&ugrave; sont les pilotes pour les souris (compatibles microsoft)?

<p>Tom Kimball (<tt/tk@pssparc2.oc.com/) expliquait le 24/11/93&nbsp;:

De nombreuses personnes utilisent un autre pilote de souris.
En voici quelques uns qui semblent fonctionner correctement&nbsp;:
<tscreen><verb>
 oak.oakland.edu:/pub/msdos/mouse/mouse701.zip (mscmouse)
 oak.oakland.edu:/pub/msdos/mouse/gmous102.zip (gmouse)
</verb></tscreen>

<sect1>Pourquoi le pilote de ma souris ne fonctionne-t-il pas?

<p>Mark Rejhon (<tt>mdrejhon@magi.com</tt>), 07/04/95

Si le pilote de souris <sq>plante</sq> lorsque vous le lancez (cela peut
prendre de 30 &agrave; 60 secondes), et si vous attendez plus d'une minute
avant qu'il soit charg&eacute;, essayer de pr&eacute;ciser sur la ligne de commande
du pilote de souris, le port COM sur lequel votre souris est branch&eacute;e.

<sect1>Pourquoi <tt/dosemu/ rend-il COM4 inaccessible?

<p>Rob Janssen (<tt>rob@pe1chl.ampr.org</tt>) expliquait le 24/03/94&nbsp;:

D'apr&egrave;s <tt>jmorriso@bogomips.ee.ubc.ca</tt>, <sq><tt/dosemu/ rend
encore inaccessible le port COM4 (0x2e8, IRQ 5). 0x2e8 n'est pas
list&eacute; dans <tt/ports{}/ dans la configuration. Je suis oblig&eacute;
de lancer <tt>setserial /dev/cua3 irq 5</tt> lorsque <tt/dosemu/ est
termin&eacute;.</sq>

Ceci est d&ucirc; au BIOS de la carte VGA. J'ai trouv&eacute; cela en
utilisant la trace des ports d'E/S et en regardant &agrave; quel moment
COM4 devenait inutilisable.

Commentez la ligne <tt/allowvideoportaccess on/ dans le fichier de
configuration et tout devrait rentrer dans l'ordre. Si vous avez
des probl&egrave;mes vid&eacute;o, essayez de s&eacute;lectionner plus
pr&eacute;cis&eacute;ment les ports autoris&eacute;s dans le fichier de
configuration (par exemple, 40-43).

<sect1>Comment utiliser <tt/dosemu/ et un shell &agrave; travers une liaison s&eacute;rie?

<p>John Taylor (<tt/taylor@pollux.cs.uga.edu/tt) expliquait le 25/05/94&nbsp;:

J'utilise Linux 1.1.13 et j'aimerais signaler une fonctionnalit&eacute;
int&eacute;ressante qu'il faudrait, &agrave; mon avis, conserver. Avec
la version 52, il est possible d'utiliser le programme <tt/screen/.
&Agrave; partir de <tt/screen/, on peut invoquer <tt/dos -D-a/. Le point
int&eacute;ressant est que les commandes de <tt/screen/ fonctionnent
encore&nbsp;! Ainsi avec <tt/CTRL-A C/ il est possible d'ajouter un autre
shell unix, et de passer de l'un &agrave; l'autre (DOS / UNIX). Ceci
permet d'utiliser facilement <tt/dosemu/ &agrave; travers une liaison
s&eacute;rie.

<sect1>Comment faire fonctionner les ports parall&egrave;les&nbsp;?

<p>Dennis Flaherty (<tt>dennisf@flaherty.elk.miles.com</tt>, 02/03/95

Le fichier <tt/dosemu.conf/ permet de rediriger les imprimantes vers <tt/lpr/
ou vers des fichiers. Si vous d&eacute;sirez un acc&egrave;s direct au port,
commentez ces lignes et ajoutez la ligne suivante:
<tscreen><verb>
    ports { 0x3b8 0x3b9 0x3ba 0x3bb 0x3bc 0x3bd 0x3be 0x3bf } # lpt0
</verb></tscreen>
pour le port parall&egrave;le correspond &agrave; la carte moniteur (LPT0),
ou les lignes
<tscreen><verb>
    ports { 0x378 0x379 0x37a 0x37b 0x37c 0x37d 0x37e 0x37f } # lpt1
    ports { 0x278 0x279 0x27a 0x27b 0x27c 0x27d 0x27e 0x27f } # lpt2
</verb></tscreen>
pour LPT1 et LPT1, respectivement.

<sect>Multi-utilisateurs et sessions non-interactives

<sect1>Est-il possible d'utiliser <tt/dosemu/ sur un syst&egrave;me multi-utilisateurs?

<p>Corey Sweeney (<tt>corey@amiganet.xnet.com</tt>) expliquait le 08/12/93&nbsp;:

Si plusieurs personnes doivent utiliser <tt/dosemu/ sur votre
machine, il faut changer le r&eacute;pertoire de votre <tt/hdimage/.
Dans le fichier <tt>/etc/dosemu.conf</tt>, remplacez <tt/hdimage/ par
<tt>/var/lib/dosemu/hdimage</tt>. Ainsi les utilisateurs n'ont pas
&agrave; se soucier de leur r&eacute;pertoire courant lorsqu'ils lancent
<tt/dosemu/, et il n'est plus n&eacute;cessaire de d&eacute;placer
<tt/hdimage/ &agrave; chaque installation d'une nouvelle version.

Si vous faites cela pour un <tt/dosemu/ multi-utilisateurs, positionnez
<tt>/var/lib/dosemu/hdimage</tt> en lecture seule pour tout le monde, sauf
pour l'administrateur de <tt/dosemu/.

Notez qu'il est &eacute;galement possible d'utiliser la nouvelle
fonctionnalit&eacute; <tt/emufs.sys/ pour monter un r&eacute;pertoire
public et/ou un r&eacute;pertoire priv&eacute; (un sous-r&eacute;pertoire
dans le r&eacute;pertoire racine de chaque utilisateur).

<tt/[/Note&nbsp;: Les utilisateurs peuvent aussi cr&eacute;er un fichier
de configuration personnel <tt>~/.dosrc</tt> (m&ecirc;me format que
<tt>/etc/dosemu.conf</tt>) pour ex&eacute;cuter leur propre version de
dos.<tt/]/

<sect1>Comment ex&eacute;cuter des commandes DOS de mani&egrave;re non-interactive ?

<p>Dan Newcombe (<tt>newcombe@aa.csc.peachnet.edu</tt>) reporte (27/01/94)&nbsp;:

Voici une id&eacute;e (non test&eacute;e) pour lancer une commande
DOS depuis la ligne de commande (ou depuis un menu, etc...) sans
modifier l'&eacute;mulateur actuel. <tt/[/&nbsp;Votre partition DOS
est cens&eacute;e &ecirc;tre d&eacute;j&agrave; mont&eacute;e sous
Linux.&nbsp<tt/]/

Supposons que vous vouliez lancer wp60.exe avec le
param&egrave;tre &dquot;<tt>wp60 d:&bsol;doc&bsol;paper.txt</tt>&dquot;.
Il suffirait de lancer quelquechose comme &dquot;<tt>dosrun wp60
d:&bsol;doc&bsol;paper.txt</tt>&dquot;. <tt/dosrun/ serait un script shell
qui a) &eacute;dite/modifie/recr&eacute;e le fichier <tt>autoexec.bat</tt>
sur votre partition DOS, et b) lance simplement <tt/dosemu/ (par
exemple, &dquot;<tt>dos -C &gt;/dev/null</tt>&dquot;. L'&eacute;tape a)
consisterait &agrave; garder tout ce qui est normalement dans votre
<tt>autoexec.bat</tt> et &agrave; rajouter &agrave; la fin &dquot;<tt>wp60
d:&bsol;doc&bsol;paper.txt</tt>&dquot;.

Il faudrait auparavant modifier le <tt>config.sys</tt> situ&eacute;
sur votre <tt/hdimage/ afin que <tt/dosemu/ utilise emufs pour
acc&eacute;der &agrave; la partition DOS comme <tt>D:</tt>, positionner
<tt>COMPSEC=D:&bsol</tt> (Je pense. Je n'ai pas de manuel DOS sous la
main), et <tt>shell=c:&bsol;command.com /p</tt>.

Le principe est le suivant: &agrave; chaque fois que vous
lancerez l'&eacute;mulateur DOS, il recr&eacute;era un autoexec.bat
sp&eacute;cifique &agrave; cette session. Ce qui le rend sp&eacute;cifique
est cette derni&egrave;re ligne qui ex&eacute;cute le programme que vous
voulez utiliser. Les modifications du <tt/hdimage/ sont n&eacute;cessaire
pour indiquer &agrave; l'&eacute;mulateur et au DOS que vous voulez
utiliser et booter depuis D:, qui sera en fait la vraie partition DOS.

Si vous n'utilisez pas <tt/hdimage/ et acc&eacute;dez au syst&egrave;me de
fichiers DOS directement au d&eacute;marrage de <tt/dosemu/, alors ceci
fonctionnera, et vous n'avez pas &agrave; vous soucier de la partie
concernant le hdimage.

---------------------

<p>Daniel T. Schwager (<tt>danny@dragon.s.bawue.de</tt>) rapporte (02/07/94)&nbsp;:

Vous pouvez utiliser plusieurs <tt/dosemu.conf/ (et plusieurs images de
boot avec plusieurs <tt/autoexec.bat/) en lan&ccedil;ant <tt/dosemu/ comme
ceci&nbsp;:
<tscreen><verb>
$ dos -F my_quicken_q_exe_dosemu.conf
</verb></tscreen>

---------------------

<p>Dietmar Braun (<tt>braun@math20.mathematik.uni-bielefeld.de</tt>)
rapporte (04/07/94)&nbsp;:

Cela est facile si l'on utilise le redirigeur de <tt/dosemu/. Il est
possible de rediriger une lettre d'unit&eacute; DOS vers un chemin linux
donn&eacute; par une variable d'environnement.

Ainsi, j'ai un script shell appel&eacute; &dquot;<tt/DOS/&dquot; qui contient
<tscreen><verb>
 mkdir /tmp/dos.$$;
 DOSTMP=/tmp/dos.$$; export DOSTMP
</verb></tscreen>
et un petit truc pour faire fonctionner &dquot;<tt>echo &dollar;&ast; &gt;
&dollar;DOSTMP/startup.bat</tt>&dquot; (en fait, un petit programme C qui
convertit '/' en '&bsol;', termine les lignes correctement pour DOS
(CR/LF) et ajoute <tt/^Z/ &agrave; la fin du fichier), cr&eacute;e les
fichiers de d&eacute;marrage et les liens dans ce r&eacute;pertoire,
et lance <tt/dosemu/. Dans l'<tt/autoexec.bat/, l'unit&eacute; C: est
redirig&eacute;e depuis le <tt/hdimage/ vers ce r&eacute;pertoire
temporaire, qui contient des liens pour <tt>&dollar;HOME</tt> et
<tt>&dollar;PWD</tt>.

Ainsi, si je veux voir mes fichiers r&eacute;duits en 8.3 je tape
&dquot;<tt>DOS dir</tt>&dquot;. Comme cela, j'ai un DOS multi-utilisateurs
(je n'ai pas de partition DOS, et rediriger vers Linux pr&eacute;serve les
permissions utilisateur) et multi-t&acirc;ches (les sessions <tt/dosemu/ sont
compl&egrave;tement ind&eacute;pendantes). J'ai fait cela un jour pour
utiliser un programme DOS pour mon imprimante. En fait, l'entr&eacute;e
<tt/df/ de mon printcap est un r&eacute;alit&eacute; un programme DOS !

<sect><tt/dosemu/ and Netware

<sect1>Comment acc&eacute;der &agrave; Netware depuis <tt/dosemu/?

<p>James B. MacLean (<tt/jmaclean@fox.nstn.ns.ca/) expliquait le 28/11/94&nbsp;:

<tt/dosemu/ supporte maintenant <tt/pdipx/ (un pilote de paquets IPX)
et <tt/pdether/ (qui utilise les sp&eacute;cifications MLID de Novell)
pour acc&eacute;der &agrave; un r&eacute;seau Novell &agrave; travers le
pilote de paquets int&eacute;gr&eacute;. Ce pilote utilise l'interruption
<tt/0x60/, et respecte les r&egrave;gles du pilote normal. Cela
&eacute;tant dit, n'essayez pas encore d'utiliser des outils TCP/IP DOS.
Pour utiliser Netware, il faut&nbsp;:
<enum>
<item><tt>cd ./net</tt>
<item><tt>cp libpacket.c.single libpacket.c</tt>
<item><tt>cp pktnew.c.single pktnew.c</tt>
<item>recompiler <tt/dosemu/
<item>lancer <tt/dosemu/
<item>lancer <tt/pdether/ comme expliqu&eacute; dans sa documentation
(<tt/pdipx/ est une autre possibilit&eacute;)
<item>Lancer <tt/netx/.
<item>Utiliser l'acc&egrave;s Netware :-)
</enum>
Si vous avez besoin d'un acc&egrave;s sp&eacute;cial &agrave; votre
NIC, lisez attentivement ce qui suit. Par d&eacute;faut, <tt/dosemu/ ne
re&ccedil;oit pas d'interruptions du noyau. Ceci dit, j'ai un pilote (Silly
Interrupt Generator), &agrave; compiler dans le noyau, que <tt/dosemu/
ou d'autres programmes peuvent utiliser pour acc&eacute;der &agrave;
l'interruption correspondant &agrave; votre NIC. Je l'ai utilis&eacute;
avec <tt/dosemu/ pour acc&eacute;der &agrave; un r&eacute;seau Novell Lite
lorsque le pilote de paquet n'&eacute;tait pas disponible.

Si vous &ecirc;tes int&eacute;ress&eacute;s, envoyez-moi un courrier
&eacute;lectronique (<tt>jmaclean@fox.nstn.ns.ca</tt>) et je vous donnerai
des explications.

Vous voulez plusieurs acc&egrave;s &agrave; Novell depuis <tt/dosemu/?
<enum>
<item>Compiler la [pr&eacute;-]version courante de <tt/dosemu/
<item>Suivre les indications de <tt>./v-net/dosnet.README</tt>
<item>Reprendre au point 5 ci-dessus.
</enum>

<sect1>Netware-HOWTO

<p>Le Netware-HOWTO de Lauri Tischler (<tt>ltischler@fipower.pp.fi</tt>) est
maintenant un document &agrave; part enti&egrave;re. Il est inclus dans la
distribution <tt/dosemu/ et est bien s&ucirc;r disponible sur les sites
archivant les HOWTOs, par exemple
<tt>http://sunsite.unc.edu/mdw/linux.html</tt>
<footnote>NDT: Pour nous autres francophones, il vaut mieux aller sur
<tt>http://www.loria.fr/linux/.</tt></footnote>.

<sect><tt/dosemu/ et X-Window

<sect1>Est-il possible d'utiliser <tt/dosemu/ sur une console tout en utilisant X?

<p>Ronald Schalk (<tt>R.Schalk@uci.kun.nl</tt>) expliquait le 17/01/94&nbsp;:

Oui, sans aucun probl&egrave;me. Il suffit de se rappeler qu'il faut
utiliser <tt/Ctrl-Alt-&lt;Fn&gt;/ pour acc&eacute;der &agrave; une console
virtuelle, et qu'il est alors possible de lancer n'importe quelle
application Linux (<tt/dosemu/ est une application Linux). J'ai quasiment
en permanence WP 5.1 dans une session dos.

<tt/[/Note&nbsp;: Utiliser <tt/Ctrl-Alt-F7/ pour revenir &agrave; X
&agrave; partir de <tt/dosemu/.<tt/]/

<sect1>Est-il possible d'utiliser <tt/dosemu/ dans une fen&ecirc;tre X&nbsp;?

<p>Mark Rejhon (<tt>mdrejhon@magi.com</tt>), 08/04/95

Si vous avez install&eacute; X, avez compil&eacute; <tt/dosemu/, et
r&eacute;ussissez &agrave; l'utiliser en dehors de X-Window, il devrait
suffire de lancer directement "<tt/xdos/" ou "<tt/dos -X/" pour obtenir une
fen&ecirc;tre <tt/dosemu/. Si cela ne marche pas, v&eacute;rifier que&nbsp;:

<enum>
<item>
    <tt/dosemu/ a &eacute;t&eacute; compil&eacute; avec le support X (<tt>X_SUPPORT=1</tt>
    dans le <tt/Makefile/)&nbsp;;
<item>
    les fontes VGA ont &eacute;t&eacute; install&eacute;es. Il suffit de lancer le script
    <tt>xinstallvgafont</tt> dans le r&eacute;pertoire source de <tt/dosemu/&nbsp;:
    <tscreen><verb>
	sh xinstallvgafont
    </verb></tscreen>
<item>
    les codes claviers sont corrects. Dans un xterm, taper:
    <tscreen><verb>
	 xmodmap -e "keycode 22 = 0xff08"
	 xmodmap -e "keycode 107 = 0xffff"
    </verb></tscreen>
    Ces commandes corrigent les touches <tt>Backspace</tt> et
    <tt>Delete</tt>&nbsp;;
<item>
    les options relatives &agrave; X ont &eacute;t&eacute; configur&eacute;es correctement dans
    <tt>/etc/dosemu.conf</tt>.
</enum>

Une autre m&eacute;thode est de lancer <tt/dosemu/ &agrave; l'int&eacute;rieur
d'un <tt/color_xterm/, mais cela n'est pas recommand&eacute; car la plupart
des <tt/color_xterm/ ne sont pas capables de g&eacute;rer correctement toutes
les ressources complexes d'affichage de <tt/dosemu/. Cette m&eacute;thode ne
n&eacute;cessite pas l'option de compilation <tt/X_SUPPORT/. Si vous voulez
vraiment faire comme ceci, voici les instructions:

<enum>
<item>
    Installer <tt/ansi_xterm/. Il est disponible sur <tt>tsx-11.mit.edu:/pub/linux/ALPHA/dosemu/Development/ansi-xterm-R6.tar.gz</tt>&nbsp;;
<item>
    Installer les fontes VGA. Il suffit de lancer le script
    <tt>xinstallvgafont</tt> dans le r&eacute;pertoire source de <tt/dosemu/&nbsp;:
    <tscreen><verb>
        sh xinstallvgafont
    </verb></tscreen>
<item>
    Configurer les codes clavier. Dans un xterm, taper:
    <tscreen><verb>
         xmodmap -e "keycode 22 = 0xff08"
         xmodmap -e "keycode 107 = 0xffff"
    </verb></tscreen>
    Ces commandes corrigent les touches <tt>Backspace</tt> et
    <tt>Delete</tt>&nbsp;;
<item>
    Configuer les options de terminal dans <tt>/etc/dosemu.conf</tt>
</enum>

<p>Marty Leisner (<tt>leisner@sdsp.mc.xerox.com</tt>), 31/03/95

J'utilise <tt/xrdb/ pour utiliser les ressources suivantes&nbsp;:
<tscreen><verb>
dosxterm*Font:		vga
dosxterm*geometry:	80x25
dosxterm*saveLines:	25
</verb></tscreen>

ou bien je fais un alias <tt/dosxterm/ correspondant &agrave;
<tscreen><verb>
xterm -fn vga -title dosxterm -geometry 80x25 -sl 25
</verb></tscreen>

Pour utiliser la m&eacute;thode <tt/xrdb/, il suffit de taper&nbsp;:
<tscreen><verb>
xterm -name dosxterm
</verb></tscreen>

<sect1>L'&eacute;mulation ansi fonctionne-t-elle correctement&nbsp;?

<p>Marty Leisner (<tt>leisner@sdsp.mc.xerox.com</tt>), 31/03/95

Oui. J'utilise <tt/nnansi.com/ sous X-Window. Les modes 25, 43 et 50 lignes
fonctionnent correctement, bien que le mode 50 lignes soit difficile &agrave;
lire sur un &eacute;cran 1024x768 (&agrave; moins d'utiliser des fontes plus
petites ou un &eacute;cran plus grand). Le mode 43 lignes retaille le
<tt/xterm/ pour utiliser 43 lignes.

<sect>dosemu et MS-Windows 3.1

<sect1>Est-il possible de lancer MS-Windows 3.1 sous dosemu&nbsp;?

<p>D'apr&egrave;s le fichier <tt/README/&nbsp;:

<tscreen><verb>
****************************************************************
*    ATTENTION !!!  ATTENTION !!!  ATTENTION!!!  ATTENTION !!! *
*                                                              *
*  Danger ! Ceci n'est pas completement supporte et de         *
*  nombreux bogues connus sont presents ! La plupart des gros  *
*  programmes ne fonctionneront sans doute pas !!!             *
*                                                              *
*  Soyez prets pour des plantages systeme si vous essayez !!!  *
*                                                              *
*    ATTENTION !!!  ATTENTION !!!  ATTENTION!!!  ATTENTION !!! *
****************************************************************
</verb></tscreen>

Bon, vous &ecirc;tes toujours l&agrave;&nbsp;? Bien. Il est possible de lancer
WINOS2 (la version modifi&eacute;e de Windows 3.1 utilis&eacute;e par OS/2)
sous <tt/dosemu/.  F&eacute;licitations &agrave; Lutz et Dong&nbsp;!

De nombreux probl&egrave;mes sont connus. Windows est enclin aux plantages et
peut vous faire perdre des donn&eacute;es. Les gros programmes ne se chargent
pas. La souris risque d'&ecirc;tre tr&egrave;s peu maniable, etc. En d'autres
termes, ceci n'est pas pr&ecirc;t pour une utilisation normale. De nombreuses
cartes graphiques posent probl&egrave;me (vous pouvez obtenir un tr&egrave;s
bel &eacute;cran blanc). Vos groupes de programmes peuvent dispara&icirc;tre.
En un mot, c'est une horreur.

D'un autre c&ocirc;t&eacute;, si vous mourrez d'envie de voir le logo Windows
s'afficher sous Linux et que vous avez lu attentivement tout ceci, et que vous
promettez de ne pas bombarder les d&eacute;veloppeurs de <tt/dosemu/ de
messages du type <sq>MS Word 6.0 ne fonctionne pas&nbsp;!</sq> &hellip;

<enum>
<item>
    Prendre les distributions sources de Linux et <tt/dosemu/&nbsp;;
<item>
    D&eacute;compresser la distribution <tt/dosemu/&nbsp;;
<item>
    Appliquer le patch <tt>dpmi/kernel.diff</tt> &agrave; vos sources du noyau&nbsp;;
<item>
    Recompiler le noyau&nbsp;;
<item>
    Compiler <tt/dosemu/&nbsp;;
<item>
    Se procurer <tt/WINOS2.ZIP/ sur <tt/tsx-11.mit.edu/&nbsp;;
<item>
    D&eacute;compresser le contenu de <tt/WINOS2.ZIP/ dans votre r&eacute;pertoire
    <tt>WINDOWS/SYSTEM</tt>&nbsp;;
<item>
    Red&eacute;marrer avec le nouveau noyau&nbsp;;
<item>
    Lancer <tt/dosemu/ (apr&egrave;s avoir v&eacute;rifi&eacute; que <tt/DPMI/ est "<tt/ON/")&nbsp;;
<item>
    Croiser les doigts.
</enum>

Bonne chance&nbsp;!

<em>RAPPEL: CECI N'EST PAS RECOMMAND&Eacute;&nbsp;! NOUS NE VOUS CONSEILLONS PAS
DE FAIRE CECI&nbsp;!!!</em>

<sect>Vid&eacute;o et son

<sect1>Peut-on utiliser les jeux 32-bits sous dosemu&nbsp;?

<p>Mark Rejhon (<tt>mdrejhon@magi.com</tt>), 08/04/95

Avec les am&eacute;liorations concernant le DPMI qui ont &eacute;t&eacute;
int&eacute;gr&eacute;es &agrave; la version 0.60, il est maintenant possible
de faire tourner quelques jeux 32 bits sous <tt/dosemu/. Si le jeu est
compatible avec OS/2, il y a de fortes chances pour qu'il fonctionne sous
<tt/dosemu/ (exemples de jeux 32 bits&nbsp;: Descent, Dark Forces, Mortal
Kombat 2, Rise of The Triad, ont tous &eacute;t&eacute; test&eacute;s avec les
versions r&eacute;centes de <tt/dosemu/).

Avant d'essayer quoi que ce soit, il faut avoir configur&eacute; le clavier en
mode direct <footnote>NDT: <em/raw mode/</footnote> et autoris&eacute; les
graphiques VGA dans <tt>/etc/dosemu.conf</tt>. Si vous avez d&eacute;j&agrave;
r&eacute;ussi &agrave; lancer des programmes graphiques sous <tt/dosemu/, et
que vous &ecirc;tes pr&ecirc;t &agrave; prendre le risque d'un plantage
syst&egrave;me (puisque vous laissez dosemu acc&eacute;der directement
&agrave; la carte vid&eacute;o, ce qui peut laisser celle-ci dans un
&eacute;tat instable dont il est difficile de ressortir), alors allez-y,
lancez votre jeu&nbsp;!

Attention cependant, il faut d&eacute;sactiver le son du jeu. (Il faudra que
quelqu'un programme une &eacute;mulation de carte son pour &eacute;viter
cela). Le jeu sera peut-&ecirc;tre un peu lent, &eacute;tant donn&eacute; que
Linux est multi-t&acirc;ches et ne poss&egrave;de pas de timer &agrave; haute
fr&eacute;quence. Alors, le jeu peut fonctionner de 5 &agrave; 100 &percnt; de
sa vitesse normale. En g&eacute;n&eacute;ral, il s'agit de 50 &percnt; pour
les versions r&eacute;centes de <tt/dosemu/, et cela devrait augmenter.

Qui sait, cela pourrait m&ecirc;me fonctionner. N'h&eacute;siter pas &agrave;
envoyer un message au coordinateur de <tt/EMUsuccess.txt/ si votre jeu
fonctionne correctement sous <tt/dosemu/ &nbsp;!


<sect1>En quittant <tt/dosemu/, j'obtiens un &eacute;cran rempli de caract&egrave;res bizarres.

<p>08/04/95


Le probl&egrave;me est que la police de l'&eacute;cran texte VGA n'est
pas sauv&eacute;e. Procurez vous le kit <tt/svgalib/. La version courante
est dans
<tscreen><verb>
    sunsite.unc.edu:/pub/Linux/libs/graphics/svgalib125.tar.gz
</verb></tscreen>
Ce kit est sans doute &eacute;galement disponible sous forme
pr&eacute;compil&eacute;e dans votre distribution Linux
pr&eacute;f&eacute;r&eacute;e (par exemple, <em>Slackware</em>). Utilisez
<tt/savetextmode/ pour sauver les param&egrave;tres du mode courant vers un
fichier dans <tt>/tmp</tt> avant de lancer <tt/dosemu/. En sortant de
<tt/dosemu/, lancez <tt/textmode/ pour les restaurer.

<sect1>Comment utiliser <tt/dosemu/ avec ma carte vid&eacute;o Trident/Actix/etc?

<p>
<tt/[/L'&eacute;cran vacille, affiche le message du BIOS vid&eacute;o, puis plus rien.<tt/]/

Andrew Tridgell (<tt/tridge@nimbus.anu.edu.au/) expliquait le 29/01/94&nbsp;:

Avec les versions pr&eacute;c&eacute;dentes, j'ai d&eacute;couvert que cela
fonctionnait en utilisant&nbsp;:
<tscreen><verb>
 ports { 0x42 }
</verb></tscreen>
mais quelquefois, ma machine se plantait pendant que le BIOS vid&eacute;o
s'ex&eacute;cutait dans <tt/dosemu/. La raison est que l'on permet au BIOS
VGA de re-programmer l'horloge, ce qui interagit avec Linux.

Cela m'a conduit &agrave; impl&eacute;menter <tt/readonly/ et <tt/masking/
dans <tt/dosemu/, et je crois qu'ils sont toujours dans la derni&egrave;re
version. Maintenant, j'utilise&nbsp;:
<tscreen><verb>
 ports { readonly 0x42 }
</verb></tscreen>
et <tt/dosemu/ se lance plus lentement, mais plus s&ucirc;rement.

---------------------

Tim Shnaider (<tt>tims@kcbbs.gen.nz</tt>) expliquait aussi le 18/01/94&nbsp;:

L'une des solutions pour corriger ce probl&egrave;me est d'utiliser
le programme <tt/GETROM/ afin de copier le BIOS vid&eacute;o vers
un fichier, et d'&eacute;diter le fichier de configuration dans le
r&eacute;pertoire <tt>/etc/dosemu</tt>. Voici la ligne que j'utilise pour
la vid&eacute;o&nbsp;:
<tscreen><verb>
 video { vga console graphics chipset trident memsize 1024 vbios_file
 /etc/dosemu/vbios }
</verb></tscreen>
o&ugrave; <tt/vbios/ est le fichier g&eacute;n&eacute;r&eacute; par la
commande
<tscreen><verb>
 getrom > vbios
</verb></tscreen>

---------------------

<p>Douglas Gleichman (<tt>p86884@tcville.edsg.hac.com</tt>) explique (01/09/94) que (avec une ATI Graphics Ultra)&nbsp;:

Pour <tt/dosemu 0.52/ il faut ajouter cette ligne &agrave; <tt>dosemu.conf</tt>&nbsp;:
<tscreen><verb>
 ports { 0x1ce 0x1cf 0x238 0x23b 0x23c 0x23f 0x9ae8 0x9ae9 0x9aee 0x9aef }
</verb></tscreen>
Le programme d'auto-test de la carte indiquera une erreur, mais les
programmes graphiques fonctionneront correctement.

<sect1>Pourquoi les programmes livr&eacute;s avec ma carte son ne fonctionnent-ils pas sous <tt/dosemu/?

<p>Hannu Savolainen (<tt>hsavolai@cs.Helsinki.FI</tt>) expliquait le 21/03/94&nbsp;:

<tt/dosemu/ et les programmes DOS s'ex&eacute;cutent sous le contr&ocirc;le
d'un syst&egrave;me d'exploitation en mode prot&eacute;g&eacute;. Cela
signifie que la m&eacute;moire n'est pas projet&eacute;e de la
mani&egrave;re attendue par le programme. S'il r&eacute;ussit, d'une
mani&egrave;re ou d'une autre, &agrave; commencer un enregistrement
bas&eacute; sur la DMA de la SB, le son enregistr&eacute; n'arrive
pas jusqu'&agrave; l'application. Il ne fait que d&eacute;truire des
informations quelque part dans la m&eacute;moire du syst&egrave;me.

<p>James B. MacLean (<tt>jmaclean@fox.nstn.ns.ca</tt>) explique (19/06/94)&nbsp;:

D&eacute;sol&eacute; de vous d&eacute;cevoir, mais &agrave; l'heure
actuelle <tt/dosemu/ ne supporte pas directement les interceptions
d'interruptions ou DMA g&eacute;n&eacute;ralement n&eacute;cessaires
&agrave; l'utilisation d'une carte son sous <tt/dosemu/ :-(.

Cela devrait cependant arriver dans un futur proche, cependant :-)

<sect>Autres mat&eacute;riels

<sect1>Comment faire fonctionner mon p&eacute;riph&eacute;rique xxxxx avec <tt/dosemu/?

<p>
Corey Sweeney (<tt/corey@bbs.xnet.com/) expliquait le 30/05/94&nbsp;:

Voici un compte rendu de mes tentatives pour faire fonctionner des
p&eacute;riph&eacute;riques avec <tt/dosemu/. J'ai r&eacute;ussi &agrave;
faire fonctionner correctement mon syst&egrave;me de courrier vocal, et mon
scanner fonctionne &agrave; moiti&eacute;. Voici ce qu'il faut faire&nbsp;:

<enum>
<item>
    Regarder dans le manuel si la carte utilise des ports. Si oui, les
inclure dans la ligne <sq>ports</sq> du fichier de configuration. Attention
au fait que, quelquefois, plusieurs ports sont utilis&eacute;s mais seul le
premier est document&eacute;.
<item>
    Essayer. Si cela ne marche pas, ou en l'absence de
manuel (ou si celui-ci est aussi int&eacute;ressant que mon
manuel AT&amp;T :), lancer <tt/dosemu/ par <sq><tt>dos -D+i 2>
/tmp/io.debug</tt></sq>. Lancer les logiciels d&eacute;di&eacute;s au
p&eacute;riph&eacute;rique utilis&eacute;, et sortir de <tt/dosemu/.
Regarder dans <tt>/tmp/io.debug</tt> tous les num&eacute;ros de ports.
Essayer de les ajouter au fichier de configuration et essayer &agrave;
nouveau.
<item>
    Si cela ne marche toujours pas, le p&eacute;riph&eacute;rique utilise
peut-&ecirc;tre des interruptions. Trouver l'interruption en question et
installer le paquetage <tt/SIG.tgz/ (Silly Interrupt Generator) disponible
sur <tt/tsx-11.mit.edu/ apr&egrave;s avoir lu les instructions.
</enum>

Et c'est tout...

Question&nbsp;: Et si ma carte utilise le DMA?<newline>R&eacute;ponse&nbsp;: Dommage.

<sect>Probl&egrave;mes et solutions

<sect1>dosemu s'est plant&eacute; et je ne peux plus rien taper

<p>Daniel Barlow(<tt>jo95004@sable.ox.ac.uk</tt>), 08/04/95

Si vous ne pouvez pas vous connecter depuis le r&eacute;seau ou sur un autre
terminal, il y a de fortes chances pour que vous soyez oblig&eacute; d'appuyer
sur le bouton <tt/Reset/. Si vous r&eacute;ussisez tout de m&ecirc;me &agrave; obtenir un
shell utilisable, lancez "<tt/kbd_mode -a/" pour sortir le clavier du mode
direct, et/ou "<tt/stty sane/" sur la console pour voir ce que vous tapez.

Le plus simple est de se faire un script pour lancer <tt/dosemu/, qui
lance automatiquement "<tt/kbd_mode -a/" juste apr&egrave;s <tt/dosemu/. Quand
<tt/dosemu/ se plante, le script r&eacute;cup&egrave;re la main et ex&eacute;cute la commande
"<tt/kbd_mode -a/".

<sect1>J'ai mis de l'EMS dans <tt/dosemu.conf/, mais cela ne fait rien.

<p>Rob Janssen (<tt>rob@pe1chl.ampr.org</tt>) (11/07/94)&nbsp;:

N'oubliez pasde charger <tt/ems.sys/ depuis le <tt/config.sys/.

<sect1>Comment me d&eacute;barasser de tous ces messages &dquot;<tt>disk change</tt>&dquot;?

<p>(11/08/94)

Installez <tt/klogd/.
<tscreen><verb>
 sunsite.unc.edu:/pub/Linux/system/Daemons/sysklogd1.2.tgz
</verb></tscreen>

<sect1>Pourquoi <tt/dosemu/ refuse-t-il de se lancer une deuxi&egrave;me fois
apr&egrave;s &ecirc;tre revenu en mode console?

<p> Aldy Hernandez (<tt>aldy@sauron.cc.andrews.edu</tt>) (7/8/94)&nbsp;:

Vous devriez d&eacute;sactiver le cache de votre carte vid&eacute;o et/ou
de votre BIOS.

<sect1>Pourquoi <tt/dosemu/ fonctionne-t-il dans un <tt/xterm/ mais pas sur la console?

<p>JyiJiin Luo (<tt/jjluo@casbah.acns.nwu.edu/) expliquait le 19/04/94&nbsp;:

J'ai eu exactement le m&ecirc;me probl&egrave;me. J'ai d&eacute;couvert
que tout le cache de la m&eacute;moire vid&eacute;o devait &ecirc;tre
invalid&eacute;. Maintenant, <tt/dosemu/ fonctionne parfaitement.

<sect1>Comment acc&eacute;l&eacute;rer <tt/dosemu/?

<p>Dans certains cas, il peut &ecirc;tre utile de jouer avec le param&egrave;tre
<tt/HogThreshold/ dans <tt/dosemu.conf/.

<p>Daniel Barlow(<tt>jo95004@sable.ox.ac.uk</tt>), 08/04/95

<tt/HogThreshold/ devrait &ecirc;tre positionn&eacute; environ &agrave; la
moiti&eacute; du nombre de BogoMips donn&eacute; au d&eacute;marrage du
syt&egrave;me.

<sect1>Mon lecteur de CD-ROM &agrave; quelquefois des probl&egrave;mes pour acc&eacute;der &agrave; certains fichiers sous <tt/dosemu/.

<p>Vinod G Kulkarni (<tt/vinod@cse.iitb.ernet.in/) expliquait le 07/04/94&nbsp;:

Quand un CDROM est mont&eacute; depuis Linux et utilis&eacute; depuis
<tt/dosemu/ (lecteur redirig&eacute;), il peut y avoir quelques
probl&egrave;mes. Le pilote de CDROM (<tt/iso9660/) du noyau tente
de d&eacute;terminer le type de fichier (binaire ou texte). S'il ne
r&eacute;ussit pas, il essaye de d&eacute;terminer ce type en utilisant
une m&eacute;thode heuristique. Cette m&eacute;thode &eacute;choue dans
certains cas, g&eacute;n&eacute;ralement quand un fichier texte est
trait&eacute; comme un fichier binaire (je ne sais pas si c'est un bogue ou
une fonctionnalit&eacute;).

Quoi qu'il en soit, il en r&eacute;sulte que la copie d'une tel
fichier depuis le CDROM (depuis Linux lui-m&ecirc;me, et pas
n&eacute;cessairement depuis <tt/dosemu/) g&eacute;n&egrave;re un fichier
cible g&eacute;n&eacute;ralement plus gros que le fichier source. (Des
espaces sont ajout&eacute;s avant <tt/^J/,<tt/^M/.) C'est pourquoi un
programme tournant sous <tt/dosemu/ produit des messages d'erreurs ou se
plante, ce qui peut &ecirc;tre pris, &agrave; tort (&dquot;t&dquot;), pour
un probl&egrave;me de <tt/dosemu/.

<p>Rob Janssen (<tt>pe1chl@rabo.nl</tt>) (10/08/94)&nbsp;:

La solution &agrave; ce probl&egrave;me est de d&eacute;sactiver la
conversion. Utiliser l'option &dquot;<tt>-o conv=binary</tt>&dquot;
&agrave; la commande mount pour le CDROM, ou la sp&eacute;cifier dans
<tt>/etc/fstab</tt>&nbsp;:
<tscreen><verb>
/dev/cdrom /cdrom iso9660 conv=binary,ro
</verb></tscreen>
Aucune modification du noyau n'est n&eacute;cessaire.

<sect1>Comment obtenir des informations de d&eacute;boguage?

<p>Daniel Barlow(<tt>jo95004@sable.ox.ac.uk</tt>), 08/04/95

En ce qui concerne <tt/dosemu0.60/, les informations de d&eacute;boguage sont
stock&eacute;s dans un fichier pr&eacute;cis&eacute; en argument sur la ligne de commande.
Utiliser "<tt>dos -D+a -o /tmp/debug</tt>" pour stocker tous les 
informations de d&eacute;boguage dans <tt>/tmp/debug</tt>. Il ne devrait plus y
avoir besoin de rediriger <tt/stderr/.

<sect1>Pourquoi les caract&egrave;res que j'entre au clavier sont-ils affich&eacute;s ddeeuuxx fois?

<p>Nick Holloway (<tt/alfie@dcs.warwick.ac.uk/) expliquait le 22/02/94&nbsp;:

Apr&egrave;s avoir lanc&eacute; dos et apr&egrave;s avoir chang&eacute;
quelques param&egrave;tres avec <tt/stty/, j'avais des caract&egrave;res en
double. Je peux maintenant en expliquer la raison&nbsp;!

Cela arrive uniquement lorsque dos est lanc&eacute; sur la console avec
<tt/istrip/ positionn&eacute;. Je pense que l'explication est que les codes
clavier bruts sont modifi&eacute;s par <tt/istrip/, de telle mani&egrave;re
que les &eacute;v&eacute;nement <sq>rel&acirc;chement d'une touche</sq>
sont vus comme des &eacute;v&eacute;nements <sq>appui sur une touche</sq>.

Donc, il faut que <tt/istrip/ ne soit pas positionn&eacute; pour utiliser
les codes claviers sur une console (ce ne serait pas une bonne id&eacute;e
pour les lignes tty).

<sect>Si vous voulez participer au projet <tt/dosemu/

<sect1>Qui est le coordinateur de <tt/dosemu/?

<p>(3/18/94)

<tt/dosemu/ a &eacute;t&eacute; con&ccedil;u d'apr&egrave;s le
travail de Matthias Lautner et Robert Sanders. James B. MacLean
(<tt>jmaclean@fox.nstn.ns.ca</tt>) est le coordinateur pour les prochaines
versions de <tt/dosemu/.

<sect1>Historique de <tt/dosemu/

<p>
<tabular CA="lll">
Version	<colsep>Date			<colsep>Personne		<rowsep>
<hline>
0.1	<colsep>3 Septembre 1992	<colsep>Matthias Lautner	<rowsep>
0.2	<colsep>13 Septembre 1992	<colsep>Matthias Lautner	<rowsep>
0.3	<colsep>???			<colsep>Matthias Lautner	<rowsep>
0.4	<colsep>26 Novembre 1992	<colsep>Matthias Lautner	<rowsep>
0.47	<colsep>27 Janvier 1993		<colsep>Robert Sanders		<rowsep>
0.47.7	<colsep>5 F&eacute;vrier 1993	<colsep>Robert Sanders		<rowsep>
0.48	<colsep>16 F&eacute;vrier 1993	<colsep>Robert Sanders		<rowsep>
0.48pl1	<colsep>18 F&eacute;vrier 1993	<colsep>Robert Sanders		<rowsep>
0.49	<colsep>20 Mai 1993		<colsep>Robert Sanders		<rowsep>
0.49pl2	<colsep>18 Novembre 1993	<colsep>James MacLean		<rowsep>
0.49pl3	<colsep>30 Novembre 1993	<colsep>James MacLean		<rowsep>
0.49pl3.3 <colsep>3 D&eacute;cembre 1993 <colsep>James MacLean		<rowsep>
0.50	<colsep>4 Mars 1994		<colsep>James MacLean		<rowsep>
0.50pl1	<colsep>18 Mars 1994		<colsep>James MacLean		<rowsep>
0.52	<colsep>16 Juin 1994		<colsep>James MacLean		<rowsep>
0.60	<colsep>9 Avril 1995		<colsep>James MacLean		<rowsep>
</tabular>

<sect1>J'aimerais participer. Qui dois-je contacter?

<p>Le projet <tt/dosemu/ est un travail d'&eacute;quipe. Si vous souhaitez
y participer, lisez le DPR (<tt/dosemu/ Project Registry). Il est
disponible par <tt/ftp/ dans <tt>dspsun.eas.asu.edu:/pub/dosemu</tt>.

</article>

