<!doctype linuxdoc system>

<article>

<title>Token-Ring HOWTO
<author>Mike Eckhoff (<tt/meckhoff@zaphod.wayne.esu1.k12.ne.us/). &nl&nl
Version fran&ccedil;aise et adaptation&nbsp;: Etienne BERNARD
(<tt/eb@via.ecp.fr/) &nl
v1.0, 22 Octobre 1996

<date>Version 3, 5 Juillet 1995

<abstract>
L'Ethernet-HOWTO fait r&eacute;f&eacute;rence au driver Token Ring qui est
en cours
d'&eacute;criture. Ce Howto a &eacute;t&eacute; cr&eacute;&eacute; dans le
but de vous
aider &agrave; installer le
patch pour le noyau et aussi essayer de mettre en &eacute;vidence les points
&agrave;
surveiller. Je sugg&egrave;re que vous lisiez, au moins rapidement, ce document,
avant d'essayer d'installer quelque partie que ce soit du driver Token
Ring pour Linux.
</abstract>

<toc>

<sect>Introduction

<sect1>Remerciements

<p>
Remerciements &agrave; Mark Swanson, Peter De Schrijver, David Morris et toutes
les autres personnes que j'aurais pu oublier qui ont rendu possible le
support Token Ring pour Linux.

Remerciements aussi &agrave; Larry Sanders (<tt/lsanders@iadfw.net/) qui m'a
aid&eacute; &agrave; corriger ce document.

<sect1>Mise en garde

<p>
Nous ne garantissons pas que ce Howto sera valable pour votre syst&egrave;me. De
nombreuses personnes l'ont utilis&eacute; avec de tr&egrave;s bons
r&eacute;sultats pour
installer Linux sur un r&eacute;seau Token Ring.

VOUS UTILISEZ CE DOCUMENT A VOS PROPRES RISQUES&nbsp;! ... Nous ne sommes
responsables d'aucun des probl&egrave;mes pouvant vous arriver en utilisant ce
Howto.

Si vous avez un quelconque probl&egrave;me qui n'est pas signal&eacute; dans ce
document, envoyez moi un mail &agrave;
<tt/meckhoff@zaphod.wayne.esu1.k12.ne.us/.

Ce document est copyright &copy; 1995 Michael Eckhoff. Vous pouvez faire
des copies de ce document (en entier ou certaines portions du document),
sur quelque support physique ou &eacute;lectronique que ce soit, du moment que
cette notice de copyright soit incluse dans chaque copie. Une
redistribution commerciale est autoris&eacute;e et encourag&eacute;e&nbsp;;
cependant,
veuillez me tenir au courant afin que je v&eacute;rifie que vous avez la
derni&egrave;re
version.

<sect>Exigences mat&eacute;rielles

<p>
V&eacute;rifiez que vous avez une carte Token Ring qui est support&eacute;e
par le
driver. Jusqu'&agrave; pr&eacute;sent, les seules cartes support&eacute;es
sont celles qui
utilisent le chipset Tropic.

Les cartes qui sont r&eacute;put&eacute;es marcher sous Linux sont&nbsp;:

<itemize>
<item>IBM Token Ring 16/4 Adapter&nbsp;;
<item>IBM Token Ring Adapter&nbsp;;
<item>IBM Token Ring Adapter II (4 M&eacute;gabit seulement)&nbsp;;
<item>Carte IBM 16/4 ISA Token Ring (16 bit)&nbsp;;
<item>Carte IBM 16/4 ISA Token Ring (8 bit)&nbsp;;
<item>3Com TokenLink Adapter (mode IBM et 3Com)&nbsp;;
<item>HyperRing Classic 16/4.
</itemize>

Veuillez noter qu'IBM fabrique une carte <tt>IBM Token-Ring Network 16/4
Adapter II</tt>. Cette carte <bf>n'est pas reconnue sous Linux</bf>. Il ne
faut pas la confondre avec la carte <tt>IBM Token Ring Adapter II
(4mbit)</tt>, qui elle est support&eacute;e.

Si vous trouvez une autre carte qui fonctionne sous Linux, envoyez-moi un mail
d&eacute;crivant la marque et le type de la carte afin que je puisse l'inclure
dans la liste pr&eacute;c&eacute;dente
(<tt/meckhoff@zaphod.wayne.esu1.k12.ne.us/).

<sect>Les logiciels requis

<p>
Si vous utilisez une version du noyau Linux de la s&eacute;rie 1.3 ou
sup&eacute;rieur,
le support pour le Token Ring y est d&eacute;j&agrave; inclus.

Sinon, je vous encourage vivement &agrave; mettre &agrave; jour votre noyau
Linux vers
un de ceux de la s&eacute;rie 2.0 ou sup&eacute;rieur.

<sect>Installation et configuration

<p>
Installez la carte Token Ring dans l'ordinateur et configurez-la pour les
r&eacute;glages que vous voulez utiliser. Il est conseill&eacute; de
v&eacute;rifier que la
carte fonctionne sous Dos ou Windows avant d'essayer de l'utiliser sous
Linux. Si elle marche sous Dos ou Windows, il y a de fortes chances pour
que cela marche sous Linux.

Configurez votre noyau Linux pour l'utilisation de la carte Token Ring.
<tscreen><verb>
cd /usr/src/linux
make config
</verb></tscreen>

R&eacute;pondre ''y'' (yes) &agrave; la question&nbsp;:
<tscreen><verb>
Token Ring support (CONFIG_TR) [N/y/?]
</verb></tscreen>

Ainsi qu'&agrave; la question&nbsp;:
<tscreen><verb>
IBM Tropic chipset based adaptor support (CONFIG_IBMTR) [N/y/m/?] (NEW)
</verb></tscreen>

Reconstruire le noyau avec les commandes&nbsp;:
<tscreen><verb>
make dep
make clean
make zImage
</verb></tscreen>

Il faut ensuite reconfigurer lilo pour d&eacute;marrer sur ce nouveau noyau.
Pour cela, il faut d'abord renommer votre noyau <tt>/vmlinuz</tt> en
<tt>/vmlinuz.old</tt> et copier le nouveau en <tt>/vmlinuz</tt>. Sur mon
syst&egrave;me, cela revient &agrave; copier
<tt>/usr/src/linux/arch/i386/boot/zImage</tt> en <tt>/vmlinuz</tt> et &agrave;
&eacute;diter <tt>/etc/lilo.conf</tt> pour d&eacute;marrer sur ce noyau.
N'oubliez 
pas de lancer lilo (avec la commande <tt/lilo/) afin que les changements
de noyau soient pris en compte.

Si ce n'est pas d&eacute;j&agrave; fait, lancez le programme ``netconfig''
sur votre
syst&egrave;me. Configurez votre machine comme si celle-ci se trouvait sur un
r&eacute;seau Ethernet.

Editez votre fichier <tt>/etc/rc.d/rc.inet1</tt> (ou un fichier dans
<tt>/etc/init.d</tt> pour certaines distributions) et changez toutes les
r&eacute;f&eacute;rences &agrave; <tt/eth0/ en <tt/tr0/. Vous devriez avoir
une ligne
ressemblant &agrave;
<tscreen><verb>
/sbin/ifconfig eth0 ${IPADDR} broadcast ${BROADCAST} netmask ${NETMASK}
</verb></tscreen>

qu'il faut changer en
<tscreen><verb>
/sbin/ifconfig tr0 ${IPADDR} broadcast ${BROADCAST} netmask ${NETMASK}
</verb></tscreen>

Vous devriez maintenant pouvoir rebooter votre syst&egrave;me et utiliser la
carte Token Ring avec votre ordinateur.

<sect>Probl&egrave;mes connus

<p>
J'ai personnellement eu quelques petits probl&egrave;mes avec ce driver. Selon
Peter De Schrijver, un des probl&egrave;mes principaux avec ce driver est le
routage.
<tscreen><verb>
From: Peter de Schrijver <Peter.DeSchrijver@linux.cc.kuleuven.ac.be>

La cause principale du probl&egrave;me est le routage. Si vous ne pouvez pas
atteindre un noeud du r&eacute;seau situ&eacute; derri&egrave;re un pont,
vous avez un probl&egrave;me
de routage. Contactez-moi si vous rencontrez ce probl&egrave;me, et j'essaierai
de faire ce que je peux. Je n'ai pas moi-m&ecirc;me acc&egrave;s &agrave; un
anneau comportant
un pont, il devrait donc &ecirc;tre difficile de r&eacute;soudre le
probl&egrave;me.

Peter.
</verb></tscreen>

Notre r&eacute;seau, ici, &agrave; la Wayne Community Schools est
constitu&eacute; de deux
anneaux et d'un r&eacute;seau Ethernet dont le pont est
r&eacute;alis&eacute; par des IBM 8229.
Je n'ai eu aucun probl&egrave;me de routage avec ces ponts.

J'ai aussi test&eacute; le driver sur un r&eacute;seau constitu&eacute; de 7
ponts, reli&eacute;s par
une combinaison d'IBM 8229 et d'IBM PC utilisant le logiciel IBM. Aucun
probl&egrave;me l&agrave; non plus.

<sect>Questions

<p>
Voici quelques questions que j'ai re&ccedil;ues par mail &agrave; propos du
Token Ring
sous Linux.


<itemize>
<item>Au d&eacute;marrage, j'ai le message
<tscreen><verb>
tr0: Can't assign device to adapter
</verb></tscreen>

Lorsque c'est le seul message produit au d&eacute;marrage, cela signifie que la
requ&ecirc;te PIO d'information sur l'adaptateur est tellement en dehors de
l'intervalle qu'il n'y a pas de carte &agrave; cette adresse
d'entr&eacute;e-sortie 
(voir <tt>segment = inb(PIOaddr)</> dans <tt>ibmtr.c</>).</item>

<item>Ma carte est une <tt>Olicom 16/4 Adapter</>. J'ai le message suivant dans
<tt>/var/log/messages</>&nbsp;:
<tscreen><verb>
May  2 10:03:14 linux kernel: tr0: Unable to assign adapter to device.
May  2 10:03:14 linux kernel: tr1: Unable to assign adapter to device.
</verb></tscreen>

Cette carte ne doit pas utiliser le chipset Tropic. Essayez d'utiliser une
des cartes de la liste du d&eacute;but du document.</item>

<item>J'ai une carte Token Ring IBM, mais j'ai les messages suivants au
d&eacute;marrage&nbsp;:
<tscreen><verb>
May  2 16:23:07 linux kernel: tr0: PIOaddr:  a20 seg/intr: b8 mmio base:
000dc000 intr: 0
May  2 16:23:07 linux kernel: tr0: Channel ID string not found for PIOaddr:  a20
May  2 16:23:07 linux kernel: tr0: Expected for ISA: 5049434f3631313039393020
May  2 16:23:07 linux kernel: tr0:            found: 000902003021111000182000
May  2 16:23:07 linux kernel: tr0: Expected for MCA: 4d4152533633583435313820
May  2 16:23:07 linux kernel: tr0: Unable to assign adapter to device.
May  2 16:23:07 linux kernel: tr1: Unable to assign adapter to device.
</verb></tscreen>

Ce message indique soit un conflit m&eacute;moire soit une carte Token Ring
qui n'est
pas reconnue (la signature de cette carte n'est en tout cas pas
connue).</item>

<item>Je trouve dans mon fichier <tt>/var/log/messages</> des dizaines de
lignes de
ce type&nbsp;:
<tscreen><verb>
May  3 15:11:47 linux kernel: tr0: Arrg. Transmitter busy for more than 50
msec. Donald resets adapter, but resetting
May  3 15:11:47 linux kernel:  the IBM tokenring adapter takes a long time.
It might not even help when the
May  3 15:11:47 linux kernel:  ring is very busy, so we just wait a little
longer and hope for the best.
</verb></tscreen>
Ces messages apparaissent lorsque j'essaye un telnet, un rlogin ou un ftp sur
une machine distante. La connexion est alors bloqu&eacute;e pendant longtemps.

Certaines personnes travaillent &agrave; la correction de ce
probl&egrave;me. Je mettrai &agrave;
jour cette r&eacute;ponse lorsqu'une solution sera trouv&eacute;e.</item>
</itemize>
</article>
