<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Alsa-sound-mini-HOWTO</TITLE>
</HEAD>
<BODY>
<H1>Alsa-sound-mini-HOWTO</H1>

<H2>Valentijn Sessink <CODE>valentyn@alsa-project.org</CODE></H2>v 1.7, 29 Juillet 1999
<HR>
<EM>Ce document d&eacute;crit l'installation des gestionnaires sonores ALSA pour Linux.
Ces gestionnaires peuvent &ecirc;tre utilis&eacute;s en remplacement des gestionnaires
habituels, et sont enti&egrave;rement compatibles avec eux.</EM>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>

<P>Ce document explique comment installer et utiliser les gestionnaires sonores
ALSA pour votre carte son. Les gestionnaires ALSA sont enti&egrave;rement modularis&eacute;s
et supportent kerneld et kmod. Ils sont compatibles avec l'API OSS, avec
des possibilit&eacute;s sup&eacute;rieures. En deux mots&nbsp;: compatibles, mais meilleurs.</P>

<H2><A NAME="ss1.1">1.1 Remerciements</A>
</H2>

<P>Ce document contient des informations obtenues sur les pages des
gestionnaires ALSA. La structure est inspir&eacute;e du SB-mini-HOWTO, principalement
parce qu'il avait la structure recherch&eacute;e. Gr&acirc;ce aux 
<A HREF="http://www.sgmltools.org">SGML</A> Tools, ce HOWTO est disponible dans
plusieurs formats, g&eacute;n&eacute;r&eacute;s &agrave; partir d'un seul fichier source. Merci &agrave; Erik
Warmelink pour sa relecture, ainsi qu'&agrave; Alfred Munnikes pour ses quelques
questions et pr&eacute;cieuses suggestions.<BR>
Remerciements &agrave; Yamahata Isaku pour la traduction en japonais, et &agrave;
Miodrag Vallat, 
<A HREF="mailto:miodrag@multimania.com">miodrag@multimania.com</A>, pour l'adaptation fran&ccedil;aise.
De plus, merci &agrave; Steve Crowder qui a fait un excellent travail de relecture et
d'&eacute;dition du texte, ainsi qu'&agrave; Marc-Aur&egrave;le Darche, Piotr Ingling, Juergen
Kahrs, Tim Pearce, Patrick Stoddard, Rutger de Graaf, Shuly Wintner, Jyrki
Saarela, Jonas Lofwander, Kumar Sankaran et bien d'autres personnes encore pour
leurs conseils utiles et leurs ajouts.</P>

<H2><A NAME="ss1.2">1.2 Historique</A>
</H2>

<P>Version 1.7 - 29 juillet 1999. Quelques corrections.</P>
<P>Version 1.6 - 26 juillet 1999. Ajout d'une section sur les versions d'Alsa.</P>
<P>Version 1.5 - 21 mai 1999. Modifi&eacute; la section sur le mixer, ajout&eacute; une section
installation rapide.</P>
<P>Version 1.4 - 18 mai 1999. Ajout de l'URL de la version fran&ccedil;aise, chang&eacute;
quelques URL.</P>
<P>Version 1.3 - 16 mai 1999. Gr&acirc;ce &agrave; Jaroslav le HOWTO dispose d'une place sur
le site du projet ALSA. Du coup, quelques changements d'URL et d'adresses
email.</P>
<P>Version 1.2 - 11 mai 1999. Diverses mises &agrave; jour.</P>
<P>Version 1.1 - 11 mars 1999. Ajout&eacute; deux cartes sons des nouveaux gestionnaires
0.3, et quelques notes &agrave; propos des noyaux 2.2.</P>
<P>Version 1.0 - 8 f&eacute;vrier 1999. Ajout&eacute; quelques notes &agrave; la section d&eacute;pannage, qui
semble d&eacute;sormais compl&egrave;te.</P>
<P>Version 0.3 beta - 20 janvier 1999. Un lien sur la page web d'ALSA. Nous voici
officiels&nbsp;!</P>
<P>Version 0.2 alpha - mi janvier 1999, premi&egrave;re version sgml.</P>
<P>Version 0.1 alpha - janvier 1999, premi&egrave;re version, principalement HTML.</P>

<H2><A NAME="ss1.3">1.3 Nouvelles versions de ce document</A>
</H2>

<P>La derni&egrave;re version peut &ecirc;tre trouv&eacute;e sur
<A HREF="http://www.alsa-project.org/~valentyn">http://www.alsa-project.org/~valentyn</A></P>
<P>Des versions en d'autres formats se trouvent dans le r&eacute;pertoire
<A HREF="http://www.alsa-project.org/~valentyn/other-formats">other-formats</A>. Malheureusement, je n'ai pas r&eacute;ussi &agrave; compiler une
version Postscript, car le script sgml2latex &eacute;choue avec un tas d'erreurs.</P>
<P>Yamahata Isaku a r&eacute;alis&eacute; une version en japonais, qui sera disponible
sur le site Japonais d'ALSA, 
<A HREF="http://plaza21.mbn.or.jp/~momokuri/alsa/index.html">http://plaza21.mbn.or.jp/~momokuri/alsa/index.html</A>
Miodrag Vallat a r&eacute;alis&eacute; une version en fran&ccedil;ais, disponible en
<A HREF="http://www.freenix.fr/unix/linux/HOWTO/mini/Alsa.html">http://www.freenix.fr/unix/linux/HOWTO/mini/Alsa.html</A>.</P>
<P>Si vous r&eacute;alisez une traduction de ce document dans une autre langue, faites-le
moi savoir et je rajouterai une r&eacute;f&eacute;rence ici.</P>
<H2><A NAME="ss1.4">1.4 Commentaires</A>
</H2>

<P>Je compte sur vous, les lecteurs, pour rendre ce HOWTO utile. Si vous avez des
suggestions, des corrections, ou des commentaires, n'h&eacute;sitez pas &agrave; me les
envoyer (&agrave; 
<A HREF="mailto:alsa-howto@alsa-project.org">alsa-howto@alsa-project.org</A>), et je t&acirc;cherai de les inclure dans la
prochaine version.</P>
<P>Remarque : Je ne re&ccedil;ois pas beaucoup de courrier &agrave; propos des gestionnaires
ALSA, mais toute addition sera la bienvenue. M&ecirc;me un «&nbsp;merci&nbsp;» sera appr&eacute;ci&eacute; -
peut-&ecirc;tre qu'il ne sera pas une mauvaise id&eacute;e d'ajouter une section «&nbsp;J'ai bien
appr&eacute;ci&eacute;&nbsp;» ou «&nbsp;Ceci-ou-cela n'&eacute;tait pas tr&egrave;s clair&nbsp;».</P>
<P>Si vous publiez ce document sur CD-ROM ou sous forme imprim&eacute;e, un exemplaire
serait appr&eacute;ci&eacute;. &Eacute;crivez-moi pour avoir mon adresse postale. Pensez &eacute;galement &agrave;
faire un don au Linux Documentation Project pour aider la documentation libre
pour Linux. Contactez le coordinateur des HOWTO Linux, Guylhem Aznar, &agrave;
<A HREF="mailto:linux-howto@metalab.unc.edu">linux-howto@metalab.unc.edu</A>, pour plus d'informations.</P>
<H2><A NAME="ss1.5">1.5 Politique de distribution</A>
</H2>

<P>Copyright 1998/1999 Valentijn Sessink</P>
<P>Ce HOWTO est une documentation libre&nbsp;; vous pouvez la redistribuer et/ou la
modifier selon les termes de la Licence Publique G&eacute;n&eacute;rale GNU publi&eacute;e par
la Free Software Foundation (version 2 ou bien toute autre version ult&eacute;rieure
choisie par vous.</P>
<P>Ce document est distribu&eacute; car potentiellement utile, mais <B>sans aucune
garantie</B>, ni explicite, ni implicite, y compris les garanties de
commercialisation ou d'adaptation dans un but sp&eacute;cifique. Reportez-vous &agrave; la
Licence Publique G&eacute;n&eacute;rale GNU pour plus de d&eacute;tails.</P>
<P>Vous pouvez obtenir une copie de la GNU General Public License en &eacute;crivant
&agrave; la 
<A HREF="http://www.fsf.org">Free Software Foundation</A>, Inc.,
59 Temple Place, Suite 330, Boston, MA 02111-1307, &Eacute;tats-Unis.</P>

<H2><A NAME="s2">2. Guide d'installation rapide</A></H2>

<P>Si vous voulez du son, imm&eacute;diatement, sans attendre d'avoir lu ce HOWTO, ce
bref aper&ccedil;u de l'installation des gestionnaires ALSA peut &ecirc;tre utile.</P>
<H2><A NAME="ss2.1">2.1 Installation</A>
</H2>

<P>Les gestionnaires ALSA versions 0.3.0, 0.3.1 et 0.3.2 ont divers probl&egrave;mes d&ucirc;s
&agrave; la restructuration de l'interface mixer. Veuillez utiliser une version
adapt&eacute;e (cf. la section sur les versions). Vous devriez sans aucun doute
utiliser la version 0.3.0-pre4.</P>
<P>Puis la routine&nbsp;: «&nbsp;./configure ; make ; make install&nbsp;» pour <B>les
gestionnaires, la biblioth&egrave;que et les utilitaires</B>.
Il vous faut les trois car vous avez besoin des utilitaires pour d&eacute;sactiver la
sourdine. Les noyaux 2.2.x <B>doivent</B> &ecirc;tre configur&eacute;s avec
le support son g&eacute;n&eacute;rique («&nbsp;Sound card support&nbsp;»), mais sans choisir de carte
son, tandis que les noyaux 2.0.x doivent avoir le <B>support son
d&eacute;sactiv&eacute;</B>.</P>
<P>Les gestionnaires ALSA utilisent leur propres fichiers de p&eacute;riph&eacute;riques, que
vous pouvez cr&eacute;er &agrave; l'aide du script <B>./snddevices</B>.</P>
<P>Vous devez charger le module pour votre carte (ou utiliser kmod) et si vous
souhaitez avoir la compatibilit&eacute; avec les gestionnaires sonores standard du
noyau Linux (qui n'en voudrait pas ?) vous devez charger un autre module nomm&eacute;
<B>snd-pcm1-oss</B>. Consultez la section 
<A HREF="#which-module">Quel module pour quelle carte ?</A> pour d&eacute;terminer quel module charger. Une 
fois les
modules charg&eacute;s, vous pouvez regarder dans /proc/asound pour plus
d'informations sur les gestionnaires ALSA.</P>
<H2><A NAME="ss2.2">2.2 Jouer et enregistrer du son</A>
</H2>

<P>Quelques remarques. ALSA a ses propres fichiers de p&eacute;riph&eacute;riques dans /dev/snd,
par exemple /dev/snd/pcmC0D1 pour la carte 0, p&eacute;riph&eacute;rique (device) 1.
Vous pouvez utiliser les anciens fichiers /dev/pcmXY si vous avez charg&eacute; le
module snd-pcm1-oss de compatibilit&eacute;. Avant de pouvoir jouer du son, il vous
faut d&eacute;sactiver la sourdine avec amixer. Lancez «&nbsp;amixer&nbsp;», puis essayez quelque
chose du genre</P>
<P><CODE>amixer pcm 100 unmute</CODE></P>
<P>En r&egrave;gle g&eacute;n&eacute;rale, vous pouvez utiliser les options «&nbsp;mute&nbsp;» ou «&nbsp;unmute&nbsp;», «&nbsp;rec&nbsp;»
ou «&nbsp;norec&nbsp;», une valeur num&eacute;rique ou une combinaison gauche:droite.</P>
<P>Voil&agrave;&nbsp;! Maintenant si tout fonctionne, vous avez gagn&eacute;. S'il y a des 
probl&egrave;mes,
vous allez devoir lire quand m&ecirc;me ce HOWTO...</P>
<H2><A NAME="s3">3. Avant de commencer</A></H2>



<H2><A NAME="ss3.1">3.1 Introduction</A>
</H2>

<P>Ce document tente de vous aider &agrave; installer et &agrave; utiliser les gestionnaires
sonores ALSA pour votre syst&egrave;me Linux. Le syst&egrave;me de r&eacute;f&eacute;rence est une
distribution Slackware 4.0 tournant sur un ordinateur AMD/K6 (compatible x86),
mais cela devrait fonctionner avec toute autre distribution Linux. Je ne sais
pas si les pilotes ALSA fonctionnent sur d'autres plates-formes&nbsp;; d'apr&egrave;s la
documentation, ALSA fonctionne &eacute;galement sur les plates-formes Alpha. Je n'ai que
des ordinateurs x86 ici, et toute information suppl&eacute;mentaire que vous pourriez
avoir sera la bienvenue.</P>
<P>Il peut s'av&eacute;rer utile de lire le Linux Sound HOWTO (cf.&nbsp;section Autres HOWTO),
mais ce HOWTO ne traite que des gestionnaires du noyau.</P>
<H2><A NAME="ss3.2">3.2 Informations g&eacute;n&eacute;rales sur les gestionnaires ALSA</A>
</H2>

<P>ALSA a &eacute;t&eacute; initialement &eacute;crit comme remplacement du gestionnaire sonore pour
les cartes Gravis UltraSound (GUS). Devant le succ&egrave;s de ces gestionnaires GUS,
l'auteur a lanc&eacute; le projet ALSA afin d'aboutir &agrave; un gestionnaire g&eacute;n&eacute;rique
pour plusieurs cartes sonores, avec une conception enti&egrave;rement modulaire.</P>
<P>ALSA est compatible avec les gestionnaires sonores OSS/Free et OSS/Linux (les
gestionnaires du noyau), mais dispose de sa propre interface qui est encore
meilleure que celle d'OSS. Une liste des fonctionnalit&eacute;s se trouve en
<A HREF="http://www.alsa-project.org/intro.html">http://www.alsa-project.org/intro.html</A></P>
<P>Veuillez noter que les gestionnaires ALSA sont toujours en d&eacute;veloppement. Ils
&eacute;voluent au cours du temps, et certains programmes utilisant ALSA ne
fonctionnent qu'avec certaines versions particuli&egrave;res. A part &ccedil;a&nbsp;: je les
trouve super. J'utilise ALSA depuis d&eacute;j&agrave; 10 mois et je ne retournerai jamais
aux temps anciens des gestionnaires sonores non libres ;)
La page Web du projet ALSA se trouve en 
<A HREF="http://www.alsa-project.org/">http://www.alsa-project.org/</A></P>

<H2><A NAME="ss3.3">3.3 Mat&eacute;riel support&eacute;</A>
</H2>

<P>Les gestionnaires ALSA ne supportent qu'un sous-ensemble des cartes sonores
existantes. Au moment de la r&eacute;daction de ce document, les cartes suivantes sont
support&eacute;es (cependant, certaines ne le sont pas par ALSA 0.3.0-pre4, ce qui
vous obligera &agrave; utiliser ALSA 0.3.2 ou une version plus r&eacute;cente) &nbsp;:
<UL>
<LI> cartes &agrave; base de chipset Trident 4D Wave DX/NX, gr&acirc;ce &agrave; Trident
Microsystems qui a fourni au projet ALSA des gestionnaires de base sous GPL
(pour les p&eacute;riph&eacute;riques mixer et PCM seulement) ainsi qu'une documentation sur
leurs chipsets audio 4D Wave PCI. Reportez-vous &agrave;
<A HREF="http://www.tridentmicro.com/HTML/products%20folder/audio.htm">http://www.tridentmicro.com/HTML/products%20folder/audio.htm</A>
pour plus de d&eacute;tails. Ces gestionnaires sont fournis dans la version ALSA
0.3.2.
Parmi les cartes utilisant ce composant, on trouve&nbsp;: Best Union Miss Melody
4DWave PCI, HIS 4DWave PCI, Warpspeed ONSpeed 4DWave PCI, AzTech PCI 64-Q3D,
Addonics SV 750, CHIC True Sound 4DWave, Shark Predator4D-PCI et Jaton
SonicWave 4D&nbsp;;</LI>
<LI> Gravis Ultrasound (GUS)&nbsp;: «&nbsp;PnP&nbsp;», Extreme, Classic/ACE, MAX&nbsp;;</LI>
<LI> cartes &agrave; base de chipset GUS&nbsp;: Dynasonic 3-D, STB Sound Rage 32,
UltraSound 32-Pro (STB), ExpertColor MED3201 et d'autres utilisant le chipset
AMD InterWave&trade;&nbsp;;</LI>
<LI> Soundblaster&nbsp;: 1.0, 2.0, Pro, 16, AWE32/64, PCI64&nbsp;;</LI>
<LI> ESS AudioDrive ESx688&nbsp;;</LI>
<LI> chipsets ESS ES18xx. Notez que j'ai eu personnellement des probl&egrave;mes
insolubles avec un mod&egrave;le ES1888, malgr&eacute; tous les efforts du d&eacute;veloppeur du
gestionnaire&nbsp;;</LI>
<LI> ESS Solo-1 ES1938. Un seul des deux canaux fonctionne, ce qui emp&ecirc;che
l'enregistrement. L'auteur du gestionnaire est «&nbsp;au courant du probl&egrave;me 
et en train d'en chercher les causes&nbsp;»&nbsp;;</LI>
<LI> Yamaha&nbsp;: chipsets OPL3-SA2, OPL3-SA3&nbsp;;</LI>
<LI> OAK Mozart&nbsp;;</LI>
<LI> Schubert 32 PCI (PINE, chipset S3 SonicVibes PCI)&nbsp;;</LI>
<LI> Ensoniq AudioPCI ES1370/1371 PCI (Soundblaster PCI64)&nbsp;;</LI>
<LI> SonicVibes PCI (PINE Schubert 32 PCI)&nbsp;;</LI>
<LI> cartes &agrave; base de chipset ForteMedia FM801 (dans ALSA 0.3.2)&nbsp;;</LI>
<LI> cartes &agrave; base de chipset OPTI 82C9xx&nbsp;;</LI>
<LI> cartes &agrave; base de chipset AD1847, AD1848 et CS4248.</LI>
</UL>

Un grand nombre de cartes &agrave; base de Crystal Semiconductors sont &eacute;galement
support&eacute;es. Ces puces se trouvent dans bon nombre de mat&eacute;riels, sous forme de
carte s&eacute;par&eacute;e (certaines cartes Philips PCA) ou sur les cartes m&egrave;res (par
exemple IBM Aptiva, ordinateurs Dell). Les cartes utilisant les chipsets
suivants sont support&eacute;es&nbsp;:
<UL>
<LI> 4231</LI>
<LI> 4232</LI>
<LI> 4232A</LI>
<LI> 4235</LI>
<LI> 4236B</LI>
<LI> 4237B</LI>
<LI> 4238B</LI>
<LI> 4239</LI>
<LI> 4610 (dans ALSA 0.3.2)</LI>
<LI> 4612 (dans ALSA 0.3.2)</LI>
<LI> 4615 (dans ALSA 0.3.2)</LI>
<LI> 4680 (dans ALSA 0.3.2)</LI>
</UL>

Une liste plus r&eacute;cente se trouve dans les sources du gestionnaire lui-m&ecirc;me,
&agrave; savoir dans doc/SOUNDCARDS</P>
<H2><A NAME="ss3.4">3.4 Autres HOWTO</A>
</H2>

<P>Cet ALSA-sound-mini-HOWTO n'est qu'un mini-HOWTO. D'autres HOWTO peuvent vous
aider si celui-ci est trop concis. J'en indiquerai quelques-uns en essayant
d'installer les gestionnaires ALSA. Les HOWTO se trouvent en g&eacute;n&eacute;ral sur les
miroirs de Metalab (ex Sunsite). Allez donc voir sur 
<A HREF="http://metalab.unc.edu/LDP/mirrors.html">http://metalab.unc.edu/LDP/mirrors.html</A> quel est votre miroir le plus
proche. Vous trouverez les HOWTO dans le r&eacute;pertoire LDP/HOWTO/.
Notez que les liens dans ce document sont tous relatifs &agrave; /LDP/HOWTO/mini.
Si vous consultez ce document depuis un miroir suffisamment convenable, vous
trouverez les HOWTO indiqu&eacute;s.</P>
<P>Une note &agrave; propos des noyaux 2.2.x : avec cette s&eacute;rie, le support son est comme
toute autre support : il fonctionne, mais diff&eacute;remment de ce &agrave; quoi vous &eacute;tiez
habitu&eacute;. Ce HOWTO (comme tous les autres) se destine principalement aux noyaux
2.0, bien que j'essaierai d'indiquer les diff&eacute;rences.
Je serai heureux d'ajouter tout ce qui sera n&eacute;cessaire pour maintenir ce HOWTO
&agrave; jour vis-&agrave;-vis des noyaux 2.2.</P>
<H3>Cartes son</H3>

<P>Vous venez d'acheter une carte son, ou elle se trouve d&eacute;j&agrave; enferm&eacute;e dans votre
ordinateur depuis des lustres. Et maintenant vous allez vous en servir&nbsp;! Allez
voir le 
<A HREF="../Sound-HOWTO.html">Sound-HOWTO</A> pour voir si
cela en vaut la peine (Vous pr&eacute;f&eacute;rerez peut-&ecirc;tre acheter d'abord cette
nouvelle Mega-Rumble-Blaster, puis essayer les gestionnaires ALSA).</P>
<H3>Cartes Plug and Play</H3>

<P>La plupart des cartes son modernes pour la plateforme Intel sont des cartes
ISA PnP, une abr&eacute;viation de «&nbsp;Plug and Play&nbsp;», ce qui signifie que la carte doit
&ecirc;tre configur&eacute;e par le syst&egrave;me d'exploitation. Ceci a lieu via une routine
d'initialisation au d&eacute;marrage. Vous allez sans doute devoir configurer votre
carte avec le paquetage PnP-utils. Toutes les distributions Linux suffisamment
r&eacute;centes l'incluent. Pour vous en servir, jetez donc un oeil au 
<A HREF="../Plug-and-Play-HOWTO.html">Plug-and-Play-HOWTO</A>.</P>
<P>Les gestionnaires ALSA semblent disposer de leur propre support ISA-PnP pour
quelques cartes son. Malheureusement, tant que je ne trouve pas de documentation
&agrave; ce sujet, je ne peux pas vous expliquer comment il fonctionne. Si quelqu'un
souhaite essayer ALSA en &eacute;vitant sciemment les ISA-PnP-tools, qu'il m'envoie
un message.</P>
<H3>Modules</H3>

<P>Les gestionnaires ALSA sont construits en tant que modules. Vous pouvez trouver
plus d'informations sur les modules dans le 
<A HREF="../Kernel-HOWTO.html">Kernel-HOWTO</A>. Il existe aussi un module-HOWTO, mais il n'est plus
maintenu &agrave; l'heure actuelle&nbsp;; consultez la section «&nbsp;unmaintained&nbsp;» du
Howto-HOWTO. Il existe aussi un 
<A HREF="Modules.html">Modules-mini-HOWTO</A> qui peut &ecirc;tre utile.</P>
<H3>Kerneld</H3>

<P>Un autre HOWTO qui peut &ecirc;tre utile &agrave; certains est le 
<A HREF="Kerneld.html">Kerneld-mini-HOWTO</A>. Kerneld est un daemon qui
installe et retire les modules du noyau quand c'est n&eacute;cessaire (je n'en ai
aucune exp&eacute;rience, donc toute information &agrave; ce sujet est la bienvenue. La
documentation des gestionnaires ALSA contient quelques informations sur la
configuration de kerneld, qui ont &eacute;t&eacute; ajout&eacute;es &agrave; ce mini-HOWTO).</P>

<H2><A NAME="s4">4. Comment installer les gestionnaires sonores ALSA</A></H2>



<H2><A NAME="ss4.1">4.1 Ce dont vous avez besoin</A>
</H2>


<P>
<UL>
<LI> un syst&egrave;me Linux en &eacute;tat de fonctionnement (par exemple une distribution
Slackware), avec les paquetages de d&eacute;veloppement install&eacute;s (i.e. gcc, make,
etc.)&nbsp;;</LI>
<LI> une carte son support&eacute;e&nbsp;;</LI>
<LI> un minimum de connaissance de Linux (savoir utiliser "ls", "cd", "tar",
etc.)&nbsp;;</LI>
<LI> l'acc&egrave;s au compte administrateur (root).</LI>
</UL>

Si vous avez une carte PnP, vous aurez &eacute;galement besoin&nbsp;:
<UL>
<LI> du paquetage isapnptools.</LI>
</UL>

Le texte INSTALL dans le r&eacute;pertoire des gestionnaires laisse supposer que
pour certaines cartes, le support PnP est int&eacute;gr&eacute;. J'ai aussi re&ccedil;u une note
de Jaroslav &agrave; ce sujet. Lorsque j'aurai plus d'informations &agrave; ce sujet
je les ajouterai &agrave; ce mini-HOWTO.</P>
<P>Notez que vous ne devez pas avoir le moindre gestionnaire sonore actif quand
vous voulez utiliser les gestionnaires ALSA. Si votre noyau est compil&eacute; avec
les gestionnaires sonores "en dur", vous devrez le recompiler. Si vous avez le
vieux module "sound.o" actif, vous devez le d&eacute;sactiver. Si vous utilisez
kerneld, cela revient &agrave; effacer sound.o du r&eacute;pertoire
/lib/modules/&lt;version_du_noyau&gt;/misc. Les syst&egrave;mes RedHat r&eacute;cents ont une
configuration du son diff&eacute;rente, avec plusieurs modules actifs. Vous devrez
tous les d&eacute;sactiver.</P>
<P>Les noyaux 2.2 ont une autre approche du son. Vous devrez inclure le support
sonore ! H&eacute; oui, c'est vrai : vous ajoutez le support sonore au noyau, mais
sans la moindre carte son. Ensuite, compilez et installez le noyau et ensuite,
compilez les gestionnaires ALSA.</P>

<H2><A NAME="ss4.2">4.2 Obtenir les gestionnaires</A>
</H2>

<P>Les gestionnaires ALSA sont disponibles en 
<A HREF="ftp://ftp.alsa-project.org/pub/">ftp://ftp.alsa-project.org/pub/</A>,
et il en existe un miroir en 
<A HREF="ftp://linux.a2000.nl/alsa">ftp://linux.a2000.nl/alsa</A>. Pour une installation ALSA totalement
fonctionnelle, il vous faut les gestionnaires, la biblioth&egrave;que et les
utilitaires&nbsp;; par exemple, si vous avez choisi le miroir, vous allez r&eacute;cup&eacute;rer
<A HREF="ftp://linux.a2000.nl/alsa/driver/">ftp://linux.a2000.nl/alsa/driver/</A>alsa-driver-0.3.0-pre4.tar.gz,
<A HREF="ftp://linux.a2000.nl/alsa/lib/">ftp://linux.a2000.nl/alsa/lib/</A>alsa-lib-0.3.0pre4.tar.gz et 
<A HREF="ftp://linux.a2000.nl/alsa/utils/">ftp://linux.a2000.nl/alsa/utils/</A>
alsa-utils-0.3.0-pre3.tar.gz (et NON il ne s'agit pas de liens complets, vous
feriez mieux d'aller voir sur place quelles versions sont disponibles, cf. la
section suivante).</P>

<H2><A NAME="ss4.3">4.3 Les versions d'ALSA</A>
</H2>

<P>Les gestionnaires ALSA ont parcouru une longue route. Leur d&eacute;veloppement &agrave;
commenc&eacute; au temps des noyaux 2.0, puis les noyaux 2.2 sont apparus (avec leur
propre noyau sonore).</P>
<P>La version actuelle d'ALSA va subir une r&eacute;&eacute;criture de l'interface mixer.
L'ancienne interface &eacute;tait un classique volume, graves/aigus, tandis que la
nouvelle interface fournit des informations sur les entr&eacute;es et les sorties de
chaque &eacute;l&eacute;ment. En d'autres mots, un programme peut d&eacute;sormais demander &agrave; la
carte son si, par exemple, la sortie cd audio est connect&eacute;e &agrave; l'entr&eacute;e
enregistrement. Le mixer est pr&ecirc;t, mais les utilitaires associ&eacute;s sont encore en
d&eacute;veloppement.</P>
<P>Si vous souhaitez utiliser ALSA sans peine, vous devriez probablement choisir
alsa-driver-0.3.0-pre4, alsa-lib-0.3.0-pre4 et alsa-utils-0.3.0-pre3.</P>
<P>Les versions plus anciennes, 0.2.0-pre10p3 et plus anciennes fonctionnent sous
un noyau 2.0.x, mais je n'arrive pas &agrave; les faire fonctionner sous 2.2.x
(probablement parce qu'elles ne savent pas s'interfacer avec le module
soundcore du noyau).</P>
<P>La derni&egrave;re version (0.3.2) fonctionne tout aussi bien sous 2.0.x que sous
2.2.x. Veuillez noter que cette version sera la derni&egrave;re &agrave; supporter les noyaux
2.0.x, donc si une nouvelle version arrive, vous devrez migrer vers
le noyau 2.2.</P>
<P>Vous pouvez utiliser la version 0.3.2 s'il vous faut la toute derni&egrave;re version,
mais ce n'est pas recommand&eacute; &agrave; cause de la r&eacute;&eacute;criture de l'interface mixer.
J'ai rencontr&eacute; des probl&egrave;mes avec le mixer OSS et l'utilitaire amixer a une
toute nouvelle interface difficile d'emploi.</P>

<H2><A NAME="ss4.4">4.4 Extraction</A>
</H2>

<P>Vous devez extraire les sources des gestionnaires par toute commande
raisonnable, comme le bon vieux tar -zxf «&nbsp;fichier&nbsp;». Pour les d&eacute;butants et les
amn&eacute;siques&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
cd /usr/src
tar -zxf ~/alsa-driver-0.3.0-pre4.tar.gz
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(Si cela a fonctionn&eacute;, soit vous &ecirc;tes toujours logu&eacute; en root, ce qui est une
mauvaise id&eacute;e --&nbsp;arr&ecirc;tez votre lecture et allez consulter le
DOS/Win95-to-Linux-HOWTO&nbsp;--, soit vous avez d&eacute;j&agrave; pens&eacute; qu'il s'agissait du genre
de t&acirc;che n&eacute;cessitant les privil&egrave;ges administrateur. Donc&nbsp;: il vous faut les
privil&egrave;ges root, tapez "su" puis le mot de passe).
<BLOCKQUOTE><CODE>
<PRE>
tar -zxf ~/alsa-lib-0.3.0pre4.tar.gz
tar -zxf ~/alsa-utils-0.3.0pre3.tar.gz
</PRE>
</CODE></BLOCKQUOTE>

&Eacute;galement utilisable et plus amusant&nbsp;: find ~ -name alsa* -exec tar -zxf
{} \; (pas la peine d'essayer &ccedil;a, c'est juste un exemple). Notez que si
vous t&eacute;l&eacute;chargez les gestionnaires avec Netscape, vous risquez de r&eacute;cup&eacute;rer
les gestionnaires d&eacute;compact&eacute;s avec l'extension «&nbsp;.tar.gz&nbsp;». Si tar se plaint du
format de fichier, vous obtiendrez peut-&ecirc;tre de meilleurs r&eacute;sultats en retirant
la lettre "z" des options de tar.</P>
<H2><A NAME="ss4.5">4.5 Compilation</A>
</H2>

<P>Vous devez compiler les gestionnaires avant de pouvoir compiler et utiliser la
biblioth&egrave;que. Vous avez besoin de compiler la biblioth&egrave;que avant de pouvoir
compiler et utiliser les utilitaires. Commen&ccedil;ons&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
cd alsa-driver-0.3.0-pre4
./configure
</PRE>
</CODE></BLOCKQUOTE>

Si vous souhaitez utiliser le support PnP int&eacute;gr&eacute;, vous devriez utiliser
<BLOCKQUOTE><CODE>
<PRE>
./configure --with-isapnp=yes
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
make
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Maintenant vous avez besoin d'&ecirc;tre «&nbsp;root&nbsp;» pour installer tout &ccedil;a (mais vous
l'&eacute;tiez peut-&ecirc;tre d&eacute;j&agrave;)
<BLOCKQUOTE><CODE>
<PRE>
make install
</PRE>
</CODE></BLOCKQUOTE>

Si vous obtenez un message vous indiquant que «&nbsp;version.h&nbsp;» n'a pas pu &ecirc;tre
trouv&eacute;, cela vient probablement du fait que votre arborescence des sources du
noyau n'est pas correcte. Il vous faut quelques fichiers des sources du noyau
afin de compiler les gestionnaires ALSA. D&eacute;compactez votre linux-2.x.y
pr&eacute;f&eacute;r&eacute; dans /usr/src, et lancez un <CODE>make menuconfig</CODE>. (En fait,
<CODE>make symlinks</CODE> devrait suffire).</P>
<P>Au tour de la biblioth&egrave;que&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
cd ../alsa-lib-0.3.0-pre4
./configure
make
make install
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Vous avez compris le truc&nbsp;? Alors pour les utilitaires&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
cd ../alsa-utils-0.3.0-pre3
./configure
make
make install
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Note&nbsp;: vous pouvez laisser de c&ocirc;t&eacute; le «&nbsp;make install&nbsp;» des utilitaires pour
l'instant. Vous pouvez m&ecirc;me laisser tomber la compilation de la biblioth&egrave;que
et des utilitaires, pour voir tout de suite si les gestionnaires fonctionnent.</P>
<H2><A NAME="ss4.6">4.6 Pr&eacute;parer les p&eacute;riph&eacute;riques</A>
</H2>

<P>Il y a un script dans le r&eacute;pertoire des gestionnaires qui va installer les
fichiers de p&eacute;riph&eacute;riques ALSA dans votre r&eacute;pertoire /dev. Lancez
<BLOCKQUOTE><CODE>
<PRE>
./snddevices
</PRE>
</CODE></BLOCKQUOTE>

dans le r&eacute;pertoire alsa-driver. Il devrait maintenant y avoir un r&eacute;pertoire
/dev/snd (V&eacute;rifiez sa pr&eacute;sence. Si vous n'&ecirc;tes pas assez familier
avec la commande «&nbsp;ls&nbsp;», allez plut&ocirc;t consulter d'autres HOWTO avant. Vous devez
avoir un minimum de connaissances de Linux pour installer ces pilotes).</P>
<P>Maintenant vous &ecirc;tes pr&ecirc;t &agrave; ins&eacute;rer les gestionnaires, alors jetez-vous
donc sur le paragraphe qui suit.</P>
<H2><A NAME="s5">5. Charger les gestionnaires</A></H2>

<P>Il existe deux fa&ccedil;ons d'utiliser les modules ALSA. Je pr&eacute;f&egrave;re personnellement
utiliser la m&eacute;thode manuelle, &agrave; savoir ins&eacute;rer le gestionnaire au d&eacute;marrage.
Les gestionnaires ALSA sont con&ccedil;us pour &ecirc;tre chargeables et d&eacute;chargeables &agrave;
volont&eacute; --&nbsp;par exemple ils ne r&eacute;initialisent pas le mixer au chargement&nbsp;-- donc
vous pouvez facilement utiliser l'approche kerneld.</P>
<P>Veuillez lire la section 
<A HREF="#backw-compat">compatibilit&eacute; OSS</A>.
Vous en aurez besoin pour avoir un support sonore «&nbsp;&agrave; l'ancienne&nbsp;».</P>
<H2><A NAME="ss5.1">5.1 Ins&eacute;rer avec modprobe</A>
</H2>

<P>Note&nbsp;: si vous avez une carte son PnP, vous devez tout d'abord la configurer
aux bons param&egrave;tres IO/IRQ/DMA (ou au moins &agrave; des valeurs connues). Consultez le
Plug-and-Play-HOWTO. Avez-vous configur&eacute; votre carte PnP&nbsp;? Bien, alors
poursuivons. Le plus dur est de faire «&nbsp;modprobe snd-«&nbsp;carte son&nbsp;»&nbsp;». Cela devrait
faire l'affaire. Notez que toutes les distributions ne mettent pas /sbin dans
le PATH. Si vous obtenez «&nbsp;bash: modprobe: command not found&nbsp;», cela signifie
probablement que modprobe n'est pas dans votre path. Essayez «&nbsp;/sbin/modprobe
snd-sb16&nbsp;», ou t&acirc;chez de trouver l'utilitaire modprobe quelque part.</P>
<P>La plus grosse difficult&eacute; vient des chipsets Crystal, que les gestionnaires ALSA
ne d&eacute;tectent pas automatiquement. Des informations plus r&eacute;centes peuvent &ecirc;tre
trouv&eacute;es dans le fichier INSTALL du r&eacute;pertoire alsa-driver. Deux exemples, puis
une liste&nbsp;:</P>
<P>Gravis UltraSound (GUS) et compatibles&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
/sbin/modprobe snd-gusclassic
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Pour toutes les cartes 16 bit compatibles Soundblaster (SoundBlaster 16 (PnP),
SoundBlaster AWE 32 (PnP), SoundBlaster AWE 64 (PnP)&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
/sbin/modprobe snd-sb16
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="which-module"></A> <A NAME="ss5.2">5.2 Quel module pour quelle carte&nbsp;?</A>
</H2>



<H3>Gravis UltraSound Extreme</H3>

<P><CODE>modprobe snd-gusextreme</CODE></P>

<H3>Gravis UltraSound MAX</H3>

<P><CODE>modprobe snd-gusmax</CODE></P>

<H3>ESS AudioDrive ES-1688 et ES-688</H3>

<P><CODE>modprobe snd-audiodrive1688</CODE></P>

<H3>ESS AudioDrive ES-18xx</H3>

<P>Pour les cartes &agrave; base d'ESS AudioDrive 18xx</P>
<P><CODE>modprobe snd-audiodrive18xx</CODE></P>

<H3>Gravis UltraSound PnP</H3>

<P>Gravis UltraSound PnP, Dynasonic 3-D/Pro, STB Sound Rage 32, ExpertColor
MED3201 et toute autre carte son bas&eacute;e sur un chipset AMD InterWave&trade;.</P>
<P><CODE>modprobe snd-interwave</CODE></P>

<H3>UltraSound 32-Pro</H3>

<P>UltraSound 32-Pro (carte produite par STB, utilis&eacute;e par Compaq) et toute autre
carte son bas&eacute;e sur un chipset AMD InterWave&trade; avec un circuit TEA6330T pour
un contr&ocirc;le &eacute;tendu des volumes grave, aigu et principal.</P>
<P><CODE>modprobe snd-interwave-stb</CODE></P>

<H3>Soundblaster</H3>

<P>Cartes Soundblaster 8 bits (SoundBlaster 1.0, SoundBlaster 2.0, SoundBlaster
Pro)</P>
<P><CODE>modprobe snd-sb8</CODE></P>

<H3>Soundblaster 16</H3>

<P>Cartes SoundBlaster 16 bits (SoundBlaster 16 (PnP), SoundBlaster AWE
32 (PnP), SoundBlaster AWE 64 (PnP). Attention, ce module ne supporte pas la
carte SoundBlaster VibraX16.</P>
<P><CODE>modprobe snd-sb16</CODE></P>

<H3>OAK Mozart</H3>

<P><CODE>modprobe snd-mozart</CODE></P>

<H3>OPTi 82C9xx</H3>

<P>Cartes &agrave; base de chipset OPTi 82C9xx.</P>
<P><CODE>modprobe snd-opti9xx</CODE></P>

<H3>AD1847/48 et CS4248</H3>


<P><CODE>modprobe snd-card-ad1848</CODE></P>

<H3>Yamaha OPL3-SA2/SA3</H3>

<P>Un "modprobe snd-opl3sa" ne fonctionnera pas, ce gestionnaire ne faisant pas de
d&eacute;tection automatique. Voyez plus loin.</P>

<H3>S3 SonicVibes</H3>

<P>Cartes S3 SonicVibes PCI (PINE Schubert 32 PCI).</P>
<P><CODE>modprobe snd-sonicvibes</CODE></P>

<H3>Ensoniq/Soundblaster PCI64</H3>

<P>Cartes Ensoniq AudioPCI ES1370/1371 PCI (SoundBlaster PCI 64)</P>
<P><CODE>modprobe snd-audiopci</CODE></P>

<H3>CS4231</H3>

<P>Un «&nbsp;modprobe snd-card-cs4231&nbsp;» ne fonctionnera pas, ce gestionnaire ne faisant
pas de d&eacute;tection automatique. Voyez plus loin.</P>

<H3>CS4232/4232A</H3>

<P>Toutes les cartes &agrave; base de chipset CS4232/CS4232A.
Un «&nbsp;modprobe snd-card-cs4232&nbsp;» ne fonctionnera pas, ce gestionnaire ne faisant
pas de d&eacute;tection automatique. Voyez plus loin.</P>

<H3>CS4235 et sup&eacute;rieur</H3>

<P>Toutes les cartes &agrave; base de chipset
CS4235/CS4236/CS4236B/CS4237B/CS4238B/CS4239. Un «&nbsp;modprobe snd-card-cs4236&nbsp;» ne
fonctionnera pas, ce gestionnaire ne faisant pas de d&eacute;tection automatique.
Voyez plus loin.</P>

<H3>CS 4610/4612/4615 et 4680</H3>


<P><CODE>modprobe snd-card-cs461x</CODE></P>

<H3>ESS Solo 1</H3>

<P>Cartes ESS Solo-1, 128iPCI (es1938, ESS-SOLO-1). Ces cartes ne figurent pas
dans le fichier INSTALL des gestionnaires. Jonas Lofwander m'a communiqu&eacute; un
lien vers un document expliquant comment configurer ces cartes -- en gros, rien
de plus qu'un <CODE>modprobe snd-esssolo1</CODE> mais... 
<A HREF="http://195.163.39.4/~dice/alsa-solo1.txt">http://195.163.39.4/~dice/alsa-solo1.txt</A> peut vous &ecirc;tre utile si vous
utilisez ALSA 0.3.2. Si vous avez un IBM Thinkpad 1412 vous pouvez aussi
consulter 
<A HREF="http://www.geocities.com/SiliconValley/Peaks/3649/1412.html">http://www.geocities.com/SiliconValley/Peaks/3649/1412.html</A>, merci &agrave;
Kumar Sankaran.</P>

<H3>Trident 4DWave DX/NX</H3>

<P>Cartes Best Union Miss Melody 4DWave PCI, HIS 4DWave PCI, Warpspeed ONSpeed
4DWave PCI, AzTech PCI 64-Q3D, Addonics SV 750, CHIC True Sound 4Dwave, Shark
Predator 4D-PCI, Jaton SonicWave 4D. Ces cartes sont support&eacute;es par ALSA 0.3.2.</P>
<P><CODE>modprobe snd-trid4dwave</CODE></P>

<H3>ForteMedia FM801</H3>

<P>Cartes PCI &agrave; base de FM801.</P>
<P><CODE>modprobe snd-card-fm801</CODE></P>

<H2><A NAME="ss5.3">5.3 Chargement par modprobe pour les pilotes sans d&eacute;tection automatique</A>
</H2>

<P>Si vous avez un gestionnaire n'effectuant pas de d&eacute;tection automatique, vous
devez fournir des informations suppl&eacute;mentaires pour que le gestionnaire
fonctionne. Vous pourrez trouver plus d'informations dans le fichier INSTALL
du r&eacute;pertoire alsa-driver.</P>
<H3>OPL3-SA2 et OPL3-SA3</H3>

<P>D'apr&egrave;s le fichier INSTALL, vous devez fournir toutes les informations
suivantes pour ce gestionnaire. Si vous avez initialis&eacute; la carte avec les
isapnptools, vous pouvez probablement trouver ces informations dans le fichier
/etc/isapnp.conf&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
snd_port - port de contr&ocirc;le de l'OPL3-SA
snd_wss_port - port WSS de l'OPL3-SA (0x530,0xe80,0xf40,0x604)
snd_midi_port - port de l'UART MPU-401 (0x300,0x330), -1 pour d&eacute;sactiver
snd_fm_port - port FM de l'OPL3-SA (0x388), -1 pour d&eacute;sactiver
snd_irq - IRQ de l'OPL3-SA (5,7,9,10)
snd_dma1 - canal DMA 1 de l'OPL3-SA (0,1,3)
snd_dma1_size - taille de la m&eacute;moire tampon du DMA 1 en Ko (4-64Ko)
snd_dma2 - canal DMA 2 de l'OPL3-SA (0,1,3), -1 si aucun
snd_dma2_size - taille de la m&eacute;moire tampon du DMA 2 en Ko (4-64Ko)
</PRE>
</CODE></BLOCKQUOTE>

Lancez un "modprobe snd-opl3sa snd_port=0xNNN snd_wss_port=0x530 snd_midi_port=-1
snd_fm_port=0x388 snd_irq=5 snd_dma1=0 snd_dma1_size=NN snd_dma2=1 snd_dma2_size=NN"
pour charger ce gestionnaire (sans support midi). Je reste convaincu que le
support midi n'est n&eacute;cessaire que pour connecter des synth&eacute;tiseurs etc. &agrave; une
machine Linux. Je n'ai jamais eu besoin du support midi, m&ecirc;me pour jouer des
fichiers midi).</P>
<P>Notez que les valeurs "NN" doivent &ecirc;tre pr&eacute;cis&eacute;es, mais je ne sais pas quelles
valeurs sont les plus raisonnables. Je ne sais d'ailleurs pas si la
sp&eacute;cification d'une taille DMA est r&eacute;ellement n&eacute;cessaire.</P>
<P>Si vous avez un IBM Thinkpad avec ce composant, la lecture de 
<A HREF="http://www.cirs.org/patrick/index.html">http://www.cirs.org/patrick/index.html</A> peut vous &ecirc;tre utile.</P>

<H3>CS4231</H3>

<P>D'apr&egrave;s le fichier INSTALL, vous devez fournir le port de la carte. Cependant,
pour le gestionnaire CS 4235/6/7/8/9 qui suit, il m'a fallu fournir toutes les
informations (&agrave; l'exception des tailles DMA) pour que le gestionnaire
fonctionne.
Si vous avez initialis&eacute; la carte avec les isapnptools, vous pouvez probablement
trouver ces informations dans le fichier /etc/isapnp.conf&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
snd_port - port du CS4231 (PnP, par d&eacute;faut 0x534)
snd_mpu_port - port de l'UART MPU-401 (PnP, par d&eacute;faut 0x300), -1 pour d&eacute;sactiver
snd_irq - IRQ du CS4231 (5,7,9,11,12,15)
snd_mpu_irq - IRQ de l'UART MPU-401 (9,11,12,15)
snd_dma1 - canal DMA 1 du CS4231 (0,1,3)
snd_dma1_size - taille de la m&eacute;moire tampon du DMA 1 en Ko (4-64Ko)
snd_dma2 - canal DMA 2 du CS4231 (0,1,3), -1 si aucun
snd_dma2_size - taille de la m&eacute;moire tampon du DMA 2 en Ko (4-64Ko)
</PRE>
</CODE></BLOCKQUOTE>

Lancez un "modprobe snd-card-cs4231 snd_port=0x534
snd_mpu_port=-1 snd_irq=5 snd_dma1=0
snd_dma1_size=NN snd_dma2=1
snd_dma2_size=NN"
pour charger ce gestionnaire pour une carte configur&eacute;e avec ses valeurs par
d&eacute;faut (sans le support midi, cf la note pour l'OPL-3, ni le support manette
de jeu). Si vous utilisez d'autres valeurs dans /etc/isapnp.conf, reportez-les
ici aussi.</P>
<P>Notez que les valeurs "NN" doivent &ecirc;tre pr&eacute;cis&eacute;es, mais je ne sais pas quelles
valeurs sont les plus raisonnables. Je ne sais d'ailleurs pas si la
sp&eacute;cification d'une taille DMA est r&eacute;ellement n&eacute;cessaire.</P>

<H3>CS4232 et CS4232A</H3>

<P>D'apr&egrave;s le fichier INSTALL, vous devez fournir le port de la carte. Cependant,
pour ce gestionnaire et le suivant, il m'a fallu fournir toutes les informations
(&agrave; l'exception des tailles DMA) pour que le gestionnaire fonctionne.
Si vous avez initialis&eacute; la carte avec les isapnptools, vous pouvez probablement
trouver ces informations dans le fichier /etc/isapnp.conf&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
snd_port - port du CS4232 (PnP, par d&eacute;faut 0x534)
snd_cport - port de contr&ocirc;le du CS4232 (PnP, par d&eacute;faut 0x120)
snd_mpu_port - port de l'UART MPU-401 (PnP, par d&eacute;faut 0x300), -1 pour d&eacute;sactiver
snd_fm_port - port FM du CS4232 (PnP, par d&eacute;faut 0x388), -1 pour d&eacute;sactiver
snd_jport - port manette de jeu du CS4232 (PnP, par d&eacute;faut 0x200), -1 pour d&eacute;sactiver
snd_irq - IRQ du CS4232 (5,7,9,11,12,15)
snd_mpu_irq - IRQ de l'UART MPU-401 (9,11,12,15)
snd_dma1 - canal DMA 1 du CS4232 (0,1,3)
snd_dma1_size - taille de la m&eacute;moire tampon du DMA 1 en Ko (4-64Ko)
snd_dma2 - canal DMA 2 du CS4232 (0,1,3), -1 si aucun
snd_dma2_size - taille de la m&eacute;moire tampon du DMA 2 en Ko (4-64Ko)
</PRE>
</CODE></BLOCKQUOTE>

Lancez un "modprobe snd-card-cs4232 snd_port=0x534 snd_cport=0x120
snd_mpu_port=-1 snd_fm_port=0x388 snd_jport=-1 snd_irq=5 snd_dma1=0 snd_dma1_size=NN
snd_dma2=1 snd_dma2_size=NN"
pour charger ce gestionnaire pour une carte configur&eacute;e avec ses valeurs par
d&eacute;faut (sans le support midi, cf la note pour l'OPL-3, ni le support manette
de jeu). Si vous utilisez d'autres valeurs dans /etc/isapnp.conf, reportez-les
ici aussi.</P>
<P>Notez que les valeurs "NN" doivent &ecirc;tre pr&eacute;cis&eacute;es, mais je ne sais pas quelles
valeurs sont les plus raisonnables. Je ne sais d'ailleurs pas si la
sp&eacute;cification d'une taille DMA est r&eacute;ellement n&eacute;cessaire.</P>

<H3>CS4235/CS4236/CS4236B/CS4237B/CS4238B/CS4239</H3>

<P>D'apr&egrave;s le fichier INSTALL, vous devez fournir le port de la carte. Cependant,
pour une carte &agrave; base de CS4237B, il m'a fallu fournir toutes les informations
(&agrave; l'exception des tailles DMA) pour que le gestionnaire fonctionne.
Si vous avez initialis&eacute; la carte avec les isapnptools, vous pouvez probablement
trouver ces informations dans le fichier /etc/isapnp.conf&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
snd_port - port du CS423x (PnP, par d&eacute;faut 0x534)
snd_cport - port de contr&ocirc;le du CS423x (PnP, par d&eacute;faut 0x120)
snd_mpu_port - port de l'UART MPU-401 (PnP, par d&eacute;faut 0x300), -1 pour d&eacute;sactiver
snd_fm_port - port FM du CS423x (PnP, par d&eacute;faut 0x388), -1 pour d&eacute;sactiver
snd_jport - port manette de jeu du CS423x (PnP, par d&eacute;faut 0x200), -1 pour d&eacute;sactiver
snd_irq - IRQ du CS423x (5,7,9,11,12,15)
snd_mpu_irq - IRQ de l'UART MPU-401 (9,11,12,15)
snd_dma1 - canal DMA 1 du CS423x (0,1,3)
snd_dma1_size - taille de la m&eacute;moire tampon du DMA 1 en Ko (4-64Ko)
snd_dma2 - canal DMA 2 du CS423x (0,1,3), -1 si aucun
snd_dma2_size - taille de la m&eacute;moire tampon du DMA 2 en Ko (4-64Ko)
</PRE>
</CODE></BLOCKQUOTE>

Lancez un "modprobe snd-card-cs4236 snd_port=0x534 snd_cport=0x120
snd_mpu_port=-1 snd_fm_port=0x388 snd_jport=-1 snd_irq=5 snd_dma1=0 snd_dma1_size=NN
snd_dma2=1 snd_dma2_size=NN"
pour charger ce gestionnaire pour une carte configur&eacute;e avec ses valeurs par
d&eacute;faut (sans le support midi, cf la note pour l'OPL-3, ni le support manette
de jeu).
Notes&nbsp;:
<UL>
<LI>les valeurs "NN" doivent &ecirc;tre pr&eacute;cis&eacute;es, mais je ne sais pas quelles
valeurs sont les plus raisonnables&nbsp;;</LI>
<LI>mon CS4237B fonctionne parfaitement sans utiliser les options de taille DMA.</LI>
</UL>
</P>
<H2><A NAME="ss5.4">5.4 Chargement par kerneld</A>
</H2>

<P><CODE>kerneld</CODE> est un <CODE>daemon</CODE> qui charge les modules chaque fois que
n&eacute;cessaire, et les d&eacute;charge quand ils ne sont plus utilis&eacute;s. N'ayant aucune
exp&eacute;rience de kerneld, je ne sais pas si les renseignements que je donne ici
sont fiables. Ils proviennent du fichier INSTALL des gestionnaires ALSA. Une
excellente source d'informations sur kerneld est le Kerneld-mini-HOWTO.</P>
<P>Proc&eacute;dez ainsi&nbsp;:
<UL>
<LI>Modifiez votre /etc/conf.modules (des exemples sont donn&eacute;s plus loin)&nbsp;;</LI>
<LI>Lancez 'modprobe snd-<CODE>carte</CODE>' o&ugrave; <CODE>carte</CODE> est le nom de votre carte.
[Ce que je trouve &eacute;tonnant, vu que kerneld est cens&eacute; le charger lui-m&ecirc;me&nbsp;?
VS]</LI>
</UL>

Exemple de /etc/conf.modules pour une carte Gravis UltraSound PnP&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
alias char-major-14 snd
alias snd-minor-oss-0 snd-interwave
alias snd-minor-oss-3 snd-pcm1-oss
alias snd-minor-oss-4 snd-pcm1-oss
alias snd-minor-oss-5 snd-pcm1-oss
alias snd-minor-oss-12 snd-pcm1-oss
alias snd-card-0 snd-interwave
options snd snd_major=14 snd_cards_limit=1
options snd-interwave snd_index=1 snd_id="guspnp" snd_port=0x220 snd_irq=5
snd_dma1=5 snd_dma2=6
</PRE>
</CODE></BLOCKQUOTE>

Exemple pour utiliser plus d'une carte son sur votre machine (ici pour une
Sound Blaster&nbsp;16 et une Gravis UltraSound Classic)&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
alias char-major-14 snd
alias snd-minor-oss-0 snd-mixer
alias snd-minor-oss-3 snd-pcm1-oss
alias snd-minor-oss-4 snd-pcm1-oss
alias snd-minor-oss-5 snd-pcm1-oss
alias snd-minor-oss-12 snd-pcm1-oss
alias snd-card-0 snd-sb16
alias snd-card-1 snd-gusclassic
options snd snd_major=14 snd_cards_limit=2
options snd-sb16 snd_index=1 snd_port=0x220 snd_irq=5 snd_dma8=1 snd_dma16=5
options snd-gusclassic snd_index=2 snd_irq=11 snd_dma1=6 snd_dma2=7
</PRE>
</CODE></BLOCKQUOTE>

Exemple si deux cartes Gravis UltraSound Classic sont install&eacute;es&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
alias char-major-14 snd
alias snd-minor-oss-0 snd-mixer
alias snd-minor-oss-3 snd-pcm1-oss
alias snd-minor-oss-4 snd-pcm1-oss
alias snd-minor-oss-5 snd-pcm1-oss
alias snd-minor-oss-12 snd-pcm1-oss
alias snd-card-0 snd-gusclassic
alias snd-card-1 snd-gusclassic
options snd snd_major=14 snd_cards_limit=2
options snd-gusclassic snd_index=1,2 snd_port=0x220,0x260 snd_irq=5,11
snd_dma1=5,6 snd_dma2=7,3
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="backw-compat"></A> <A NAME="ss5.5">5.5 Compatibilit&eacute; OSS</A>
</H2>

<P>Si vous souhaitez avoir une compatibilit&eacute; avec OSS/Free ou OSS/Linux, il vous
faut charger un gestionnaire de plus&nbsp;: le gestionnaire de compatibilit&eacute;
snd-pcm1-oss. Lancez 
<BLOCKQUOTE><CODE>
<PRE>
modprobe snd-pcm1-oss
</PRE>
</CODE></BLOCKQUOTE>

Cela vous donnera le support de /dev/audio et /dev/dsp, comme le font les
gestionnaires OSS/Free (ceux du noyau) et OSS/Linux (ceux vendus s&eacute;par&eacute;ment).
Notez qu'il ne s'agit que d'une &eacute;mulation.</P>

<H2><A NAME="s6">6. Tester et utiliser</A></H2>

<P>Maintenant vous &ecirc;tes pr&ecirc;t &agrave; tester si le gestionnaire sonore est r&eacute;ellement
disponible, avant de l'utiliser.</P>
<H2><A NAME="ss6.1">6.1 Le syst&egrave;me de fichiers /proc</A>
</H2>

<P>Vous pouvez trouver beaucoup de renseignements sur votre syst&egrave;me dans le
r&eacute;pertoire /proc. /proc est un syst&egrave;me de fichiers "virtuel", ce qui signifie
qu'il n'existe pas r&eacute;ellement, mais fournit grosso modo une vue d'ensemble sur
les processus de votre ordinateur. Pour que /proc soit accessible, votre noyau
doit &ecirc;tre compil&eacute; avec le support de /proc, ce qui est le cas dans la plupart
des distributions, mais si vous avez compil&eacute; votre propre noyau sans /proc,
vous n'aurez bien &eacute;videmment rien dans /proc.</P>
<P>/proc/modules recense les modules charg&eacute;s. Une fois les gestionnaires ALSA
charg&eacute;s, en tapant cat /proc/modules vous devriez avoir quelque chose de ce
genre&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
snd-pcm1-oss      4            0
snd-sb16          1            1
snd-sb-dsp        4    [snd-sb16]      0
snd-pcm1          4    [snd-pcm1-oss snd-sb-dsp]      0
snd-pcm           3    [snd-pcm1-oss snd-sb16 snd-sb-dsp snd-pcm1]    0
snd-mixer         3    [snd-pcm1-oss snd-sb16 snd-sb-dsp]      1
snd-mpu401-uart   1    [snd-sb16]      0
snd-midi          4    [snd-sb16 snd-sb-dsp snd-mpu401-uart]   0
snd-opl3          1    [snd-sb16]      0
snd-synth         1    [snd-sb16 snd-opl3]     0
snd-timer         1    [snd-opl3]      0
snd               8    [snd-pcm1-oss snd-sb16 snd-sb-dsp snd-pcm1 snd-pcm snd-mixer snd-mpu401-uart snd-midi snd-opl3 snd-synth snd-timer]    0
</PRE>
</CODE></BLOCKQUOTE>

Si quelque chose s'est mal pass&eacute; pendant l'installation du gestionnaire, vous
aurez quand m&ecirc;me quelques gestionnaires «&nbsp;snd&nbsp;», mais pas de support audio.</P>
<P>Par exemple (note&nbsp;: ne vous amusez surtout pas &agrave; entrer les commandes suivantes,
le gestionnaire cs4236 a besoin de param&egrave;tres)&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
win3:~# modprobe snd-card-cs4236
/lib/modules/2.0.35/misc/snd-card-cs4236.o: init_module: Device or resource busy
snd-mixer: Device or resource busy
win3:~# cat /proc/modules
snd-cs4236        2           0
snd-cs4231        3    [snd-cs4236]    0
snd-timer         1    [snd-cs4231]    0
snd-pcm1          4    [snd-cs4236 snd-cs4231] 0
snd-mixer         3    [snd-cs4236 snd-cs4231] 0
snd-pcm           3    [snd-cs4236 snd-cs4231 snd-pcm1]       0
snd-mpu401-uart   1           0
snd-midi          4    [snd-mpu401-uart]       0
snd-opl3          1           0
snd-synth         1    [snd-opl3]      0
snd-timer         1    [snd-cs4231 snd-opl3]   0
snd               8    [snd-cs4231 snd-timer snd-pcm1 snd-mixer snd-pcm]     0
</PRE>
</CODE></BLOCKQUOTE>

Vous pouvez v&eacute;rifier l'existence d'une carte son en regardant /proc/asound/cards.
Par exemple&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
bash$ cat /proc/asound/cards
0 [card1          : SB16 - Sound Blaster 16
                    Sound Blaster 16 at 0x220, irq 5, dma 1&amp;5
</PRE>
</CODE></BLOCKQUOTE>

Dans l'exemple pr&eacute;c&eacute;dent (o&ugrave; j'ai oubli&eacute; les options) l'affichage aurait &eacute;t&eacute;&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
win3:~# cat /proc/asound/cards
--- no soundcards ---
</PRE>
</CODE></BLOCKQUOTE>

Une carte CS4236 fonctionnelle donnerait
<BLOCKQUOTE><CODE>
<PRE>
0 [card1         ]: CS4236 - CS4237B
                    CS4237B at 0x534, irq 7, dma 1&amp;0
</PRE>
</CODE></BLOCKQUOTE>

Si vous avez beau v&eacute;rifier et rev&eacute;rifier vos r&eacute;glages et que vous n'avez
toujours rien, allez faire un tour dans la section d&eacute;pannage.</P>
<P>Le r&eacute;pertoire virtuel <CODE>/proc/asound</CODE> fournit beaucoup d'autres
renseignements sur le gestionnaire. Notez cependant que /proc/asound n'existera
qu'une fois le premier module ALSA charg&eacute;. S'il n'y a pas de /proc/asound, cela
signifie simplement que le module <CODE>snd</CODE> n'a pas &eacute;t&eacute; charg&eacute; convenablement.
Vous pouvez trouver la liste des cartes install&eacute;es dans /proc/asound/cards,
puis des renseignements sur la premi&egrave;re dans /proc/asound/0, sur la suivante
dans /proc/asound/1, etc.</P>
<P>Si <CODE>cat /proc/asound/card1/pcm0</CODE> donne quelque chose du genre :
<BLOCKQUOTE><CODE>
<PRE>
      ES1370 DAC2/ADC
      Playback isn't active.
      Record isn't active.
</PRE>
</CODE></BLOCKQUOTE>

cela signifie que votre gestionnaire est pr&ecirc;t &agrave; l'emploi, mais ne fait
rien pour l'instant (donc tout s'est bien pass&eacute;).</P>
<P>Pour les utilisateurs de noyau 2.0.x, il existe une troisi&egrave;me fa&ccedil;on d'obtenir
des renseignements sur les gestionnaires sonores, si vous avez charg&eacute; le module
de compatibilit&eacute; OSS, &agrave; savoir le p&eacute;riph&eacute;rique /dev/sndstat. Les gestionnaires
ALSA vous demandent poliment de ne pas vous fier &agrave; cette source d'informations,
car elle n'est l&agrave; que pour la compatibilit&eacute; avec les gestionnaires OSS, et de
meilleurs renseignements sont facilement disponibles via /proc/asound. Sous
les noyaux 2.2.x, ALSA utilise le module soundcore du noyau et ne peut pas
&eacute;muler /dev/sndstat, car cela interf&eacute;rerait avec les gestionnaires OSS.</P>

<H2><A NAME="ss6.2">6.2 Le mixer</A>
</H2>

<P>Une fois les gestionnaires de votre carte son install&eacute;s, comme vous l'indique
/proc, vous pouvez essayer de faire du bruit. Tout d'abord, installez le
paquetage d'utilitaires, ou tout au moins placez la commande «&nbsp;amixer&nbsp;»
&agrave; un endroit raisonnable (comme /usr/local/bin).</P>
<P>Commencez par examiner les r&eacute;glages du mixer en lan&ccedil;ant «&nbsp;amixer&nbsp;». Cette
commande affiche les r&eacute;glages du mixer, &agrave; savoir les r&eacute;glages
de volume des diff&eacute;rentes parties de la carte son. Le r&eacute;sultat peut varier
&eacute;norm&eacute;ment d'une carte &agrave; l'autre. Ma Soundblaster 16 donne&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
Master         0  % (-14.00dB) : 0  % (-14.00dB)
Bass           0  % (-14.00dB) : 0  % (-14.00dB)
Treble         0  % (-14.00dB) : 0  % (-14.00dB)
Synth          0  % (-62.00dB) : 0  % (-62.00dB)
PCM            0  % (-62.00dB) : 0  % (-62.00dB)
Line-In        0  % (-62.00dB) : 0  % (-62.00dB) Mute
MIC            0  % (-62.00dB) : 0  % (-62.00dB) Mute
CD             0  % (-62.00dB) : 0  % (-62.00dB) Mute
In-Gain        0  % (-18.00dB) : 0  % (-18.00dB)
Out-Gain       0  % (-18.00dB) : 0  % (-18.00dB)
PC Speaker     0  % (-18.00dB) : 0  % (-18.00dB)
</PRE>
</CODE></BLOCKQUOTE>

Ma carte son &agrave; base de Crystal 4237B a beaucoup d'autres options&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
Master D       0  % (-22.00dB) : 0  % (-22.00dB) Mute
3D Center      0  % (-22.50dB) : 0  % (-22.50dB)
3D Space       0  % (-22.50dB) : 0  % (-22.50dB) Mute
Synth          0  % (-94.50dB) : 0  % (-94.50dB) Mute
FM             0  % (-94.50dB) : 0  % (-94.50dB) Mute
DSP            0  % (-94.50dB) : 0  % (-94.50dB) Mute
PCM            0  % (-94.50dB) : 0  % (-94.50dB) Mute
Line-In        0  % (-34.50dB) : 0  % (-34.50dB) Mute
MIC            0  % (-22.50dB) : 0  % (-22.50dB) Mute
CD             0  % (-34.50dB) : 0  % (-34.50dB) Mute
Record-Gain    0  % (  0.00dB) : 0  % (  0.00dB)
In-Gain        0  % (-18.00dB) : 0  % (-18.00dB)
Loopback       0  % (-94.50dB) : 0  % (-94.50dB) Mute
Mono           0  % (-45.00dB) : 0  % (-45.00dB) Mute
Aux A          0  % (-34.50dB) : 0  % (-34.50dB) Mute
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si vous ne recevez qu'un laconique «&nbsp;amixer: Specify command...&nbsp;», vous utilisez
les utilitaires d'ALSA 0.3.2. Vous en avez besoin pour utiliser les
gestionnaires 0.3.0+, mais il n'y a pas encore de documentation et comme la
nouvelle interface du mixer est encore en beta test, je vous recommande de vous
en tenir &agrave; ALSA 0.3.0-pre4. De plus, le nouvel amixer n'a pas encore de page
man, vous devrez vous d&eacute;brouiller tout seul.</P>

<H3>R&eacute;glage du mixer en lecture</H3>

<P>Vous aurez remarqu&eacute; les indications <CODE>Mute</CODE> (Muet) pour certains
p&eacute;riph&eacute;riques. Cela signifie que ces p&eacute;riph&eacute;riques n'&eacute;mettront pas de son, quel
que soit le r&eacute;glage du volume. Certaines cartes (comme ici le CS4237B) mettent
m&ecirc;me le canal principal en sourdine.
Ainsi, pour le CS4237B, il me faut lancer</P>
<P><CODE>amixer "master d" unmute</CODE></P>
<P>pour pouvoir entendre le moindre son. La Soundblaster n'a pas de sortie en
sourdine, mais</P>
<P><CODE>amixer master 100 unmute</CODE></P>
<P>r&eacute;glerait le volume &agrave; 100% et r&eacute;activerait le canal principal. Vous
pouvez utiliser un nombre, un des mots «&nbsp;mute&nbsp;» et «&nbsp;unmute&nbsp;», ou les deux.
Lancez</P>
<P><CODE>amixer "master d" 100; amixer pcm 100 unmute</CODE></P>
<P>pour r&eacute;gler le volume principal du CS4237B au maximum, activer le canal PCM et
r&eacute;gler son volume au maximum. Pour des r&eacute;glages s&eacute;par&eacute;s sur les canaux gauche
et droite, utilisez un signe «&nbsp;deux-points&nbsp;», par exemple</P>
<P><CODE>amixer CD 25:50</CODE></P>
<P>(et non, je ne sais pas lequel est le gauche et lequel est le droit, mais de
toute fa&ccedil;on cela d&eacute;pend aussi fortement de la position de vos haut-parleurs).</P>

<H3>&Eacute;l&eacute;ments du mixer</H3>

<P>Les diff&eacute;rentes parties du mixer peuvent &ecirc;tre d&eacute;routantes si vous n'avez pas de
connaissances sur la production du son num&eacute;rique. Le sound-HOWTO peut vous
aider un peu, mais voici ici une br&egrave;ve explication.</P>
<P>Vous aurez sans doute besoin de seulement quelques &eacute;l&eacute;ments&nbsp;: l'un d'entre eux
est le r&eacute;glage «&nbsp;CD&nbsp;» (le volume de votre lecteur de cd-rom, pourvu qu'il soit
connect&eacute; &agrave; la carte son par un c&acirc;ble &agrave; 3 ou 4 fils rouge,blanc et noir).</P>
<P>Le r&eacute;glage «&nbsp;PCM&nbsp;» est utilis&eacute; pour la plupart des applications. Les programmes
comme mpg123, xmms, speakfreely, realplayer et la plupart des autres utilisent
le canal PCM.</P>
<P>«&nbsp;MIC&nbsp;» repr&eacute;sente le micro, «&nbsp;line-in&nbsp;» est une entr&eacute;e suppl&eacute;mentaire (pas
toujours pr&eacute;sente) de votre carte son.</P>
<P>Les r&eacute;glages «&nbsp;gain&nbsp;» permettent un r&eacute;glage suppl&eacute;mentaire d'amplification.</P>

<H3>R&eacute;glage du mixer en enregistrement</H3>

<P>Vous pouvez r&eacute;gler le canal CD en enregistrement en entrant</P>
<P><CODE>amixer cd rec</CODE></P>
<P>puis le remettre en lecture avec</P>
<P><CODE>amixer cd norec</CODE>.</P>
<P>Si vous pr&eacute;f&eacute;rez enregistrer depuis un micro, vous devrez probablement utiliser</P>
<P><CODE>amixer record-gain 100; amixer mic 100 rec mute</CODE></P>
<P>(ne pas mettre l'entr&eacute;e micro en sourdine produit des parasites si le micro
capte son propre signal par les haut-parleurs). La plupart des micros ont un
r&eacute;glage de «&nbsp;gain&nbsp;» permettant d'amplifier le volume&nbsp;; vous allez probablement
devoir l'utiliser si vous ne recevez pas le moindre son du micro.</P>

<H3>Autres r&eacute;glages du mixer</H3>

<P>Malheureusement, je n'ai pas pu modifier le r&eacute;glage des canaux "3d center"
et "3d space" avec amixer. Si quelqu'un y parvient, faites-le moi savoir. Vous
pouvez cependant utiliser alsamixer pour cela.</P>
<P>La FAQ ALSA pr&eacute;tend qu'il est possible de restaurer les r&eacute;glages du mixer avec
<CODE>cat &lt;fichier> > /proc/asound/N/mixerC0D0</CODE>, o&ugrave; &lt;ficher contient une
pr&eacute;c&eacute;dente copie de /proc/asound/N/mixerC0D0. Je n'ai pas pu le faire sur mon
syst&egrave;me, il se plaint de p&eacute;riph&eacute;riques non existants.</P>
<H2><A NAME="ss6.3">6.3 Les p&eacute;riph&eacute;riques /dev/snd/</A>
</H2>

<P>Les gestionnaires ALSA ont des p&eacute;riph&eacute;riques associ&eacute;s dans le r&eacute;pertoire
/dev/snd.
Si vous avez une carte, vous devriez avoir les p&eacute;riph&eacute;riques suivants&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
/dev/snd/pcmC0D0 - la sortie PCM de la carte0
/dev/snd/mixerC0D0 - le mixer de la carte 0
/dev/snd/controlC0D0 - le contr&ocirc;leur de la carte 0
</PRE>
</CODE></BLOCKQUOTE>

Le premier chiffre est le num&eacute;ro de la carte son, le deuxi&egrave;me (s'il y a lieu)
&eacute;tant le num&eacute;ro du p&eacute;riph&eacute;rique. Une carte son ayant deux sorties PCM
aurait pcmC0D0 et pcmC0D1.
Note&nbsp;: les gestionnaires ALSA ont chang&eacute; de notation par rapport &agrave; la pr&eacute;c&eacute;dente
version, qui utilisait /dev/snd/pcm00 (premier chiffre pour la carte, deuxi&egrave;me
chiffre pour le p&eacute;riph&eacute;rique). Si ce HOWTO emploie l'ancienne notation,
pr&eacute;venez-moi pour que je le corrige.</P>
<P>Maintenant, vous &ecirc;tes pr&ecirc;t &agrave; envoyer un fichier son dans la sortie PCM de la
premi&egrave;re carte. Essayez de copier n'importe quel fichier texte dans
/dev/snd/pcmC0D0 ainsi&nbsp;: <CODE>cat &lt;fichier > /dev/snd/pcmC0D0</CODE>. Le fichier
peut &ecirc;tre quelconque, pourvu qu'il ne soit pas de longueur nulle. Si vous avez
un fichier son qui tra&icirc;ne quelque part, vous pouvez l'essayer. Vous pouvez aussi
r&eacute;cup&eacute;rer le fichier en 
<A HREF="http://www.ldp.org/sounds/english.au">http://www.ldp.org/sounds/english.au</A>, pour entendre Linus Torvalds
expliquer comment prononcer Linux.</P>
<P>La configuration par d&eacute;faut de votre p&eacute;riph&eacute;rique sonore est 8000 Hz, 8 bits.
Ce qui signifie que le fichier "english.au" mentionn&eacute; plus haut g&eacute;n&eacute;rera de
la voix, tandis que les autres fichiers g&eacute;n&eacute;reront probablement des parasites.
Si vous n'entendez rien, v&eacute;rifiez vos haut-parleurs, essayez de relancer
<CODE>amixer</CODE> ou consultez un m&eacute;decin.
(Plus loin vous pourrez utiliser les fonctionnalit&eacute;s 48 kHz, 16 bit de votre
carte son avec votre programme audio pr&eacute;f&eacute;r&eacute;, comme sox ou mpg123).</P>
<P>Si vous avez charg&eacute; le module «&nbsp;snd-pcm1-oss&nbsp;», vous pouvez &eacute;galement utiliser la
compatibilit&eacute; OSS pour acc&eacute;der &agrave; votre carte son. Les correspondances suivantes
sont alors effectu&eacute;es&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
/dev/snd/pcmC0D0 -> /dev/audio0 (/dev/audio) -> num&eacute;ro mineur 4
/dev/snd/pcmC0D0 -> /dev/dsp0 (/dev/dsp) -> num&eacute;ro mineur 3
/dev/snd/pcmC0D1 -> /dev/adsp0 (/dev/adsp) -> num&eacute;ro mineur 12
/dev/snd/pcmC1D0 -> /dev/audio1 -> num&eacute;ro mineur 4+16 = 20
/dev/snd/pcmC1D0 -> /dev/dsp1 -> num&eacute;ro mineur 3+16 = 19
/dev/snd/pcmC1D1 -> /dev/adsp1 -> num&eacute;ro mineur 12+16 = 28
/dev/snd/pcmC2D0 -> /dev/audio2 -> num&eacute;ro mineur 4+32 = 36
/dev/snd/pcmC2D0 -> /dev/dsp2 -> num&eacute;ro mineur 3+32 = 35
/dev/snd/pcmC2D1 -> /dev/adsp2 -> num&eacute;ro mineur 12+32 = 44
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss6.4">6.4 Informations compl&eacute;mentaires</A>
</H2>

<P>Le fichier INSTALL des gestionnaires ALSA mentionne quelques trucs et astuces
pour indiquer leurs r&eacute;glages aux gestionnaires. Leur utilit&eacute; d&eacute;pend des
applications sonores dont vous vous servez. Les applications classiques, comme
mpg123, sox (g&eacute;n&eacute;ralement utilis&eacute;e par la commande <CODE>play</CODE>), ou RealPlayer,
fonctionneront probablement parfaitement sans avoir recours &agrave; ces astuces.
Je n'en ai jamais eu besoin personnellement.</P>
<H3>/proc/asound/N/pcmN0</H3>


<P>
<BLOCKQUOTE><CODE>
<PRE>
"Playback erase" - efface toutes les informations sur les applications OSS
"Playback &lt;application> &lt;nombre de fragments> &lt;taille des fragments> [&lt;options>]"
"Record erase" - efface toutes les informations sur les applications OSS
"Record &lt;application> &lt;nombre de fragments> &lt;taille des fragments> [&lt;options>]"
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><CODE>application</CODE> - nom de l'application (avec ou sans chemin complet).</P>
<P><CODE>nombre de fragments</CODE> - nombre de fragments, ou z&eacute;ro pour laisser le choix &agrave; ALSA.</P>
<P><CODE>taille des fragments</CODE> - taille des fragments en octets, ou z&eacute;ro pour laisser le choix &agrave; ALSA.</P>
<P><CODE>options</CODE> - param&egrave;tres optionnels</P>
<P><CODE>WR_ONLY</CODE> - si l'application tente d'ouvrir le p&eacute;riph&eacute;rique PCM
en mode O_RDWR, modifier en O_WRONLY (pas d'enregistrement) -
pour Quake etc.</P>
<P>Exemples&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
echo "Playback x11amp 128 16384" > /proc/asound/0/pcm00
echo "Playback squake 0 0 WR_ONLY" > /proc/asound/0/pcm00
</PRE>
</CODE></BLOCKQUOTE>
</P>
<H3>/proc/asound/N/sb16</H3>


<P>
<BLOCKQUOTE><CODE>
<PRE>
"Playback 8" -> n'utiliser que le canal DMA 8 bits pour la lecture.
"Playback 16" -> n'utiliser que le canal DMA 16 bits pour la lecture.
"Playback auto" (par d&eacute;faut) -> choix automatique : la premi&egrave;re ouverture utilisera le canal DMA 16 bits.
"Record 8" -> n'utiliser que le canal DMA 8 bits pour l'enregistrement.
"Record 16" -> n'utiliser que le canal DMA 16 bits pour l'enregistrement.
"Record auto" (par d&eacute;faut) -> choix automatique : la premi&egrave;re ouverture utilisera le canal DMA 16 bits.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Exemple&nbsp;: <CODE>echo "Record 16" > /proc/asound/0/sb16</CODE></P>
<P>Pour plus d'informations, consultez le fichier INSTALL.</P>
<H2><A NAME="s7">7. Astuces et d&eacute;pannage</A></H2>

<P>Pensez &agrave; lire la FAQ dans le r&eacute;pertoire des gestionnaires sonores. Cette section
est toujours en construction.</P>
<H2><A NAME="ss7.1">7.1 Compilation des gestionnaires</A>
</H2>


<H3>Arborescence des sources du noyau</H3>

<P>Si vous n'arrivez pas &agrave; compiler vos gestionnaires ALSA, avec des messages
d'erreur mentionnant «&nbsp;version.h&nbsp;» ou d'autres fichiers d'en-t&ecirc;tes non trouv&eacute;s,
cela peut signifier que vous n'avez pas les fichiers d'en-t&ecirc;tes du noyau.
Allez consulter le kernel-HOWTO, d&eacute;compactez un noyau r&eacute;cent dans /usr/src
et lancez <CODE>make config</CODE>.</P>

<H2><A NAME="ss7.2">7.2 Chargement des gestionnaires</A>
</H2>

<P>Pensez &agrave; v&eacute;rifier les points suivants&nbsp;:</P>

<H3>Compatibilit&eacute; des cartes son</H3>

<P>&Ecirc;tes vous certain que votre carte EST support&eacute;e ? V&eacute;rifiez encore.
Il arrive qu'un mod&egrave;le X123 ne soit pas exactement un mod&egrave;le X123b, et vous
perdrez votre temps.
D'un autre c&ocirc;t&eacute;, m&ecirc;me une carte support&eacute;e peut vous poser probl&egrave;me - il m'a
fallu deux heures pour installer une carte CS4237B, ce qui, apr&egrave;s tout, n'&eacute;tait
qu'un excellent cas de RTFM.</P>

<H3>«&nbsp;P&eacute;riph&eacute;rique ou ressource occup&eacute;e&nbsp;» (device busy) ou «&nbsp;symboles non r&eacute;solus&nbsp;»(unresolved symbols)</H3>

<P>Il se peut que vous ayez un noyau 2.0.x avec le support son int&eacute;gr&eacute;, ou que le
gestionnaire OSS/Lite (celui du noyau) soit charg&eacute; (v&eacute;rifiez par
<CODE>cat /proc/modules</CODE>). Retirez le gestionnaire ou recompilez le noyau
(reportez-vous au Kernel-HOWTO). </P>
<P>Le module son des noyaux 2.0 est nomm&eacute; «&nbsp;sound.o&nbsp;» et <B>ne</B> doit <B>pas</B> &ecirc;tre
actif (contrairement au gestionnaire ALSA «&nbsp;snd.o&nbsp;», bien entendu).</P>
<P>Si vous avez un noyau 2.2.x sans support son, les gestionnaires ALSA ne
fonctionneront pas non plus.</P>

<H3>Noyaux 2.0.x</H3>

<P>Je sais que c'est un peu confus, mais laissez-moi expliquer une fois de plus. Si
vous avez un <B>noyau 2.0.x</B> (la commande «&nbsp;uname -a&nbsp;» renvoyant quelque chose
du genre
«&nbsp;Linux pingouin 2.0.35 #6 Wed Sep 23 10:19:16 CEST 1998 i686 unknown&nbsp;») alors
vous devez <B>d&eacute;sactiver tout support son</B> dans le noyau.</P>

<H3>Noyaux 2.2.x</H3>

<P>Si vous avez un <B>noyau 2.2.x</B> vous avez <B>besoin du support son</B>. Un noyau
2.2 doit &ecirc;tre compil&eacute; avec le support son, mais sans le moindre gestionnaire
de carte son. Il vous faut donc choisir le support son et v&eacute;rifier qu'aucun
autre gestionnaire sp&eacute;cifique n'est compil&eacute;.</P>

<H3>R&eacute;f&eacute;rences &agrave; d'autres gestionnaires</H3>

<P>Une autre raison pour laquelle le gestionnaire se plaint que le p&eacute;riph&eacute;rique
est occup&eacute; peut &ecirc;tre que le fichier /etc/conf.modules r&eacute;f&eacute;rence encore les
anciens gestionnaires. Vous devriez effacer ces r&eacute;f&eacute;rences et ne laisser que
des r&eacute;f&eacute;rences aux gestionnaires ALSA (bien s&ucirc;r, laissez les gestionnaires non
sonores tels quels).</P>

<H3>Symboles non r&eacute;solus, deuxi&egrave;me</H3>

<P>Une autre cause des messages «&nbsp;symboles non r&eacute;solus&nbsp;» peut &ecirc;tre un noyau
plus r&eacute;cent que les gestionnaires. Assurez-vous de recompiler les gestionnaires
ALSA apr&egrave;s chaque changement de noyau, de fa&ccedil;on &agrave; &ecirc;tre certain d'avoir des
gestionnaires correspondant &agrave; votre noyau.</P>

<H3>V&eacute;rifiez le r&eacute;glage PnP</H3>

<P>&Ecirc;tes-vous s&ucirc;r que votre carte son est activ&eacute;e&nbsp;? Relisez donc le PnP-HOWTO,
et v&eacute;rifiez que votre carte son est correctement activ&eacute;e.</P>

<H3>Vos param&egrave;tres sont-ils corrects&nbsp;?</H3>

<P>V&eacute;rifiez encore et toujours les param&egrave;tres de votre carte son. N'oubliez pas
que 534 n'est pas la m&ecirc;me chose que 543, pas plus que 0x534 n'est 534.</P>
<P>Pensez &eacute;galement que certaines cartes doivent &ecirc;tre charg&eacute;es avec un nom
diff&eacute;rent de celui suppos&eacute;. Faites une pause, allez boire une bi&egrave;re ou toute
autre boisson, et v&eacute;rifiez encore votre commande «&nbsp;modprobe&nbsp;». Par exemple,
le gestionnaire Crystal 4232 doit &ecirc;tre ins&eacute;r&eacute; par «&nbsp;modprobe snd-cs4232&nbsp;», pas
«&nbsp;snd-cs4231&nbsp;», et que celui de la SoundBlaster PCI64 se nomme
«&nbsp;snd-audiopci&nbsp;», pas «&nbsp;snd-es1370&nbsp;» (tout est dans la documentation, et bien que
je sois l'auteur du HOWTO, il m'est arriv&eacute; de passer une soir&eacute;e &agrave; essayer
de faire jouer du son &agrave; snd-cs4231).</P>

<H2><A NAME="ss7.3">7.3 Gestionnaire charg&eacute;... mais aucun son (ou &agrave; peine audible)</A>
</H2>



<H3>La sourdine</H3>

<P>Les gestionnaires ALSA exploitent les possibilit&eacute;s de «&nbsp;sourdine&nbsp;» dont
disposent la plupart des cartes son. Si vous avez charg&eacute; les gestionnaires
impeccablement mais qu'ils s'obstinent &agrave; rester silencieux, vous avez
probablement oubli&eacute; de d&eacute;sactiver la sourdine. Il vous faut «&nbsp;amixer&nbsp;» ou
«&nbsp;alsamixer&nbsp;» pour cela, tous deux pr&eacute;sents dans le paquetage alsa-utils.
Un simple
<BLOCKQUOTE><CODE>
<PRE>
amixer -c 1 master 70:70 unmute
amixer -c 1 pcm 70:70 unmute
amixer -c 1 cd 70:70 unmute
</PRE>
</CODE></BLOCKQUOTE>

devrait suffire &agrave; la plupart des applications.</P>

<H3>Amplification</H3>

<P>La plupart des cartes son ont un r&eacute;glage de mixer suppl&eacute;mentaire pour amplifier
le son en entr&eacute;e ou en sortie. Ce r&eacute;glage est commun&eacute;ment appel&eacute; «&nbsp;gain&nbsp;»,
«&nbsp;in-gain&nbsp;» pour l'entr&eacute;e et «&nbsp;out-gain&nbsp;» pour la sortie. Agir sur ce r&eacute;glage vous
aidera beaucoup &agrave; obtenir le niveau sonore maximum de vos haut-parleurs (mais
pensez &agrave; vos parents, voisins et &agrave; vos oreilles tout de m&ecirc;me).
Une commande comme
<BLOCKQUOTE><CODE>
<PRE>
amixer out-gain 100 unmute
</PRE>
</CODE></BLOCKQUOTE>

pourra probablement rendre service.</P>

<H3>Compatibilit&eacute; avec OSS/Linux</H3>

<P>S'il s'agit de votre premi&egrave;re utilisation des gestionnaires ALSA, vous
souhaiterez probablement utiliser le support son exactement comme vous le
faisiez avant, (i.e. &agrave; l'aide des gestionnaires /dev/pcmX). Il vous faut pour
cela le gestionnaire de compatibilit&eacute; OSS. Faites un <CODE>modprobe snd-pcm1-oss</CODE>
(reportez-vous &agrave; la fin de la section pour le chargement des modules).
Veuillez noter que snd-pcm1-oss est diff&eacute;rent de snd-pcm1, vous avez
<B>r&eacute;ellement besoin</B> de snd-pcm1-oss pour le support &agrave; l'ancienne.</P>

<H3>Impossible d'acc&eacute;der au mixer</H3>

<P>Si vous avez essay&eacute; d'installer plusieurs versions diff&eacute;rentes d'ALSA, il
arrive que le mixer ne puisse plus &ecirc;tre utilis&eacute;. Cela se produit quand vous
avez install&eacute; ALSA 0.3.2 puis &ecirc;tes revenu &agrave; ALSA 0.3.0-pre4 (si ma m&eacute;moire est
bonne). Dans ce cas, effacez tous les fichiers libasound et les liens dans
/usr/lib et recompiler les biblioth&egrave;ques et les utilitaires&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
rm /usr/lib/libasound.*
</PRE>
</CODE></BLOCKQUOTE>

Pour &ecirc;tre vraiment tranquille, effacez tous les gestionnaires ALSA ensuite,
puis recompilez et r&eacute;installez les gestionnaires.</P>

<H2><A NAME="ss7.4">7.4 Quelques suggestions</A>
</H2>



<H3>Essayez «&nbsp;insmod&nbsp;»</H3>

<P>Il est parfois utile de commencer avec insmod au lieu de kerneld. Comme &ccedil;a,
vous pourrez peut-&ecirc;tre voir un message d'erreur.</P>

<H3>Lisez le fichier INSTALL</H3>

<P>Le fichier INSTALL du r&eacute;pertoire des gestionnaires contient beaucoup
d'informations. Si votre gestionnaire ne fonctionne pas, regardez s'il n'y a
pas d'informations compl&eacute;mentaires.</P>

<H3>Messages de d&eacute;boguage</H3>

<P>En dernier ressort, vous pouvez recompiler les gestionnaires en leur indiquant
d'envoyer des informations de d&eacute;boguage dans /var/log/messages. Allez dans le
r&eacute;pertoire des gestionnaires (<CODE>cd /usr/src/alsa-driver-...</CODE> et lancez&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
./configure --with-debug=detect; make clean; make
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Retirez le gestionnaire (s'il est actif, voir plus bas pour une commande
pratique).
Puis relancez la commande "modprobe" que vous aviez utilis&eacute;e pr&eacute;c&eacute;demment, 
pour charger le gestionnaire fra&icirc;chement compil&eacute;.
Allez voir dans /var/log/messages s'il y a des messages.</P>

<H3>Si rien ne va plus...</H3>

<P>Si ces messages ne peuvent vous aider, envoyez un message &agrave; la liste de
diffusion des d&eacute;veloppeurs ALSA, 
<A HREF="mailto:alsa-devel@alsa-project.org">alsa-devel@alsa-project.org</A> en pr&eacute;cisant les informations suivantes&nbsp;:
<UL>
<LI>nom de votre carte son, ainsi que les noms des composants pr&eacute;sents sur la carte&nbsp;;</LI>
<LI>les sections appropri&eacute;es de votre fichier isapnp.conf si vous avez des cartes sons PnP&nbsp;;</LI>
<LI>votre fichier conf.modules ou la commande que vous utilisez pour activer
les gestionnaires ALSA&nbsp;;</LI>
<LI>tous les messages de /var/log/messages concernant les gestionnaires ALSA.</LI>
</UL>
</P>

<H2><A NAME="ss7.5">7.5 Rapports de bugs</A>
</H2>

<P>Si vous avez d&eacute;couvert un bug, les d&eacute;veloppeurs d'ALSA seraient heureux de
conna&icirc;tre les informations suivantes (au minimum)&nbsp;:
<OL>
<LI>versions de votre noyau et de vos gestionnaires&nbsp;: 'cat /proc/asound/version'&nbsp;;</LI>
<LI>informations sur la carte son&nbsp;:
<UL>
<LI>nom de la carte son&nbsp;;</LI>
<LI>liste des composants pr&eacute;sents sur la carte&nbsp;;</LI>
<LI>contenu de 'cat /proc/asound/cards'&nbsp;;</LI>
</UL>
</LI>
<LI>tous les messages de /var/log/messages concernant les gestionnaires
ALSA&nbsp;;</LI>
<LI>une description du probl&egrave;me.</LI>
</OL>
</P>

<H2><A NAME="ss7.6">7.6 Astuce&nbsp;: jouer des CD audio</A>
</H2>

<P>Si vous utilisez kmod ou kerneld et les gestionnaires ALSA pour jouer des CD
audio, ni kmod ni kerneld ne vont probablement charger les gestionnaires comme
attendu. Cela est d&ucirc; au fait que les lecteurs CD en ligne de commande ne font
que demander au lecteur de cd-rom de lancer la lecture audio, sans utiliser les
p&eacute;riph&eacute;riques sonores qui pourraient indiquer &agrave; kmod ou kerneld qu'une sortie
son va avoir lieu. L'utilisation de modprobe sera probablement votre seule
solution &agrave; ce probl&egrave;me.</P>

<H2><A NAME="ss7.7">7.7 Astuce&nbsp;: installation du gestionnaire s&eacute;rie MIDI</A>
</H2>

<P>Normalement, le port s&eacute;rie est g&eacute;r&eacute; par le gestionnaire s&eacute;rie standard. Avant
de pouvoir faire «&nbsp;modprobe snd-serial&nbsp;» il vous faut demander au gestionnaire
de ne plus s'occuper du port s&eacute;rie.</P>
<P>Voici comment faire :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
setserial /dev/ttyS0 none
modprobe snd-serial
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(en rempla&ccedil;ant /dev/ttyS0 par le gestionnaire /dev/ttySx correspondant &agrave; votre
p&eacute;riph&eacute;rique MIDI).</P>

<H2><A NAME="ss7.8">7.8 Astuce&nbsp;: &agrave; nouveau noyau, nouveaux modules !</A>
</H2>

<P>Apr&egrave;s chaque mise &agrave; jour de votre noyau, vous devrez probablement recompiler
les gestionnaires ALSA. S'ils se trouvent toujours dans le r&eacute;pertoire /usr/src,
n'oubliez pas de lancer un <CODE>make clean</CODE> avant de refaire la s&eacute;quence
./configure, make, make install.</P>
<P>Oh, et il ya aussi ce probl&egrave;me de num&eacute;rotation : le noyau «&nbsp;2.2.0ac1&nbsp;» est
vu comme un «&nbsp;not a number&nbsp;» (pas un nombre) par le script configure. Il me
semble que cela a &eacute;t&eacute; r&eacute;solu dans les scripts plus r&eacute;cents, sinon vous pouvez
peut-&ecirc;tre modifier le num&eacute;ro de version du noyau dans les sources.</P>

<H2><A NAME="ss7.9">7.9 Astuce&nbsp;: KDE et les gestionnaires ALSA</A>
</H2>

<P>Supposons que vous avez une installation de KDE en &eacute;tat de marche, mais que vous
n'arrivez pas &agrave; faire fonctionner les sons syst&egrave;me, comme pour l'ouverture des
fen&ecirc;tres, les changements de bureaux, etc. Le son fonctionne en g&eacute;n&eacute;ral. Si
votre lecteur de CD audio et votre lecteur mp3 fonctionnent, cela est
probablement d&ucirc; au fait que «&nbsp;kwmsound&nbsp;» est manquant.</P>
<P>Solution : v&eacute;rifiez que "kwmsound" figure dans votre script de d&eacute;marrage
($KDEDIR/bin/startkde)</P>

<H2><A NAME="ss7.10">7.10 Astuce&nbsp;: utilisez les p&eacute;riph&eacute;riques ALSA</A>
</H2>

<P>Si vous aviez le support son sous Linux pr&eacute;c&eacute;demment, vos applications se
r&eacute;f&egrave;rent probablement &agrave; /dev/pcm0, /dev/audio et /dev/mixer. C'est parfait si
vous utilisez la compatibilit&eacute; OSS &agrave; l'aide du module snd-pcm1-oss. Il serait
mieux, cependant, d'utiliser les v&eacute;ritables p&eacute;riph&eacute;riques ALSA, ceux de
/dev/snd.</P>

<H2><A NAME="ss7.11">7.11 Astuce&nbsp;: retirer tous les modules</A>
</H2>

<P>Retirer une dizaine de modules un par un est p&eacute;nible. Heureusement, tous les
modules commencent par le pr&eacute;fixe "snd-", et une petite ligne de commande fera
l'affaire.
Vous pouvez retirer facilement les modules ALSA &agrave; l'aide de la commande
suivante&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cat /proc/modules|gawk '/^snd-/{print $1}|xargs -i rmmod {}
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Juergen Kahrs ajoute&nbsp;: «&nbsp;J'ai &eacute;crit un script qui retire &eacute;galement soundcore et
soundlow s'ils sont pr&eacute;sents et que le son n'est plus utilis&eacute;. Ce script
traite trois fois /proc/modules afin de ne pas laisser tra&icirc;ner trop de
modules.&nbsp;» Cette solution est&nbsp;:
<BLOCKQUOTE><CODE>
<PRE>
awk '/^snd/||/^sound/&amp;&amp;($3==0){system("rmmod " $1)}' /proc/modules /proc/modules /proc/modules
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Note&nbsp;: si un module est d&eacute;pendant d'un autre, il n'est pas possible de commencer
par retirer le premier. Cela signifie qu'il se peut que vous deviez relancer
la commande de retrait une deuxi&egrave;me fois (je n'ai cependant jamais rencontr&eacute;
cette situation, il semble qu'il soit possible de retirer les modules ALSA dans
l'ordre dans lequel ils apparaissent dans /proc/modules).</P>

</BODY>
</HTML>
