<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Configuration HOWTO (en fran&ccedil;ais)</TITLE>
</HEAD>
<BODY>
<H1>Configuration HOWTO (en fran&ccedil;ais)</H1>

<H2>
<A HREF="mailto:guido@ibogfs.cineca.it">Guido Gonzato</A> (traduit en fran&ccedil;ais par 
<A HREF="mailto:basile.starynkevitch@cea.fr">Basile Starynk&eacute;vitch</A> et
<A HREF="mailto:gomesdv@mail.dotcom.fr">Arnaud Gomes-do-Vale</A>)</H2>v1.2.2, 10 avril 1998
traduction $R&eacute;vision: 1.2 $ du 18 d&eacute;cembre 1998
<HR>
<EM>Ce HOWTO vise &agrave; rendre plus faciles et plus rapides les
r&eacute;glages fins de votre syst&egrave;me Linux nouvellement
install&eacute;. Vous trouverez ici un jeu de configurations pour les
applications les plus courantes, de fa&ccedil;on &agrave; pouvoir bien
travailler sur un syst&egrave;me agr&eacute;able &agrave; utiliser.</EM>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>

<H2><A NAME="ss1.1">1.1 Pourquoi ce HOWTO</A>
</H2>

<P>J'ai install&eacute; Linux sur de nombreux PC, et j'ai not&eacute; que
les distributions actuelles sont formidables, mais, h&eacute;las,
manquent souvent de configurations m&ecirc;me les plus simples. La
plupart des programmes fonctionnent d&egrave;s le d&eacute;part, mais
pas tous. De plus, j'ai remarqu&eacute; que les m&ecirc;mes
questions reviennent sans cesse sur <CODE>comp.os.linux.setup</CODE>.</P>
<P>Pour essayer de rem&eacute;dier &agrave; cette situation, et pour
avoir un aide-m&eacute;moire pour les nouvelles installations, j'ai
&eacute;crit une liste des choses &agrave; faire, qui est ensuite
devenue ce HOWTO. Vous y trouverez donc un certain nombre d'exemples
de configurations pour les applications, les programmes et les
services les plus courants, qui devraient vous &eacute;conomiser pas
mal de temps et de travail.</P>
<P>Quelques uns des exemples d&eacute;crits dans ce HOWTO
d&eacute;pendent dans une certaine mesure de la distribution
utilis&eacute;e. Je n'ai acc&egrave;s qu'&agrave; des machines
tournant sous Red Hat et Caldera OpenLinux, donc ne prenez pas mes
conseils comme parole d'&eacute;vangile si vous avez une Slackware,
une Debian ou toute autre distribution. Dans tous les cas, lire la
documentation et les HOWTO est toujours payant, donc il est
conseill&eacute; de le faire de toute fa&ccedil;on.</P>

<H2><A NAME="ss1.2">1.2 Ce que nous allons configurer</A>
</H2>

<P>Il peut y avoir beaucoup de configurations mat&eacute;rielles pour un
PC, mais d'apr&egrave;s moi voici la plus fr&eacute;quente: un PC avec
un gros disque dur, divis&eacute; en trois partitions (une pour
DOS/Windows, une pour Linux, une pour la pagination [swap]), une carte
son, un modem, un lecteur de CD-ROM, une imprimante, une souris. Un
lecteur Zip sur port parall&egrave;le est &eacute;galement de plus en
plus courant.</P>
<P>C'est le mat&eacute;riel que je suppose que vous avez &agrave;
configurer, mais il est facile de l'adapter &agrave; d'autres
configurations. Il est sous-entendu que vous &ecirc;tes
super-utilisateur <CODE>root</CODE> lorsque vous &eacute;ditez,
configurez, bidouillez.</P>
<P>Et maintenant, les gars, au boulot!</P>

<H2><A NAME="s2">2. Configuration g&eacute;n&eacute;rale du syst&egrave;me</A></H2>

<H2><A NAME="ss2.1">2.1 Clavier</A>
</H2>

<P>D'abord, comment configurer le clavier. Si vous avez rat&eacute; cette
&eacute;tape &agrave; l'installation ou si vous avez chang&eacute; de clavier, vous devez :</P>
<P>
<UL>
<LI> Choisir une table de clavier ad&eacute;quate dans
/usr/lib/kbd/keytables/; par exemple, <CODE>fr-latin1.map</CODE>
y d&eacute;signe le clavier fran&ccedil;ais Azerty.
</LI>
<LI> Editer le fichier /etc/sysconfig/keyboard pour
qu'il contienne: 
<PRE>
KEYTABLE="/usr/lib/kbd/keytables/fr-latin1.map"
</PRE>

</LI>
<LI> Pour configurer le taux de r&eacute;p&eacute;tition et le
d&eacute;lai du clavier, ajouter cette ligne dans
/etc/rc.d/rc.sysinit ou, si vous &ecirc;tes sous Caldera, 
/etc/rc.d/rc.boot:

<BLOCKQUOTE><CODE>
<PRE>
/sbin/kbdrate -s -r 16 -d 500  # ce que vous voulez
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>

<P>Au prochain red&eacute;marrage, votre clavier fonctionnera
convenablement. Pour recharger la configuration du clavier sans avoir
&agrave; r&eacute;initialiser la machine, placez-vous dans
/etc/rc.d/init.d et tapez la commande <CODE>./keytable
start</CODE>.</P>




<H2><A NAME="ss2.2">2.2 &Agrave; propos du noyau</A>
</H2>

<P>&Agrave; mon avis, la premi&egrave;re chose &agrave; faire ensuite est
la fabrication d'un noyau bien adapt&eacute; &agrave; votre
syst&egrave;me. C'est tr&egrave;s simple &agrave; faire, mais, quoi
qu'il en soit consultez le fichier <CODE>README</CODE> dans 
<A HREF="/usr/src/linux/">/usr/src/linux/</A> ou le Kernel-HOWTO. Quelques conseils :</P>
<P>
<UL>
<LI> d&eacute;terminez pr&eacute;cis&eacute;ment vos besoins. C'est plus
productif de choisir un noyau appropri&eacute;, d'y appliquer les
rustines (patches) et de le recompiler une fois pour toutes,
plut&ocirc;t que de reconfigurer et recompiler tous les mois; ceci est
particuli&egrave;rement vrai si votre machine Linux est un
serveur. N'oubliez pas d'inclure le support de tout mat&eacute;riel
que vous envisagez d'ajouter plus tard (SCSI, Zip, cartes
r&eacute;seau, etc);
</LI>
<LI> si votre PC est &eacute;quip&eacute; d'un processeur Cyrix,
appliquez les rustines appropri&eacute;es pour en am&eacute;liorer les
performances. Voir 
<A HREF="http://www.linuxhq.com/patch/20-p0591.html">http://www.linuxhq.com/patch/20-p0591.html</A>&nbsp;;
</LI>
<LI> les utilisateurs de portables voudront am&eacute;liorer la
lisibilit&eacute; de leur &eacute;cran LCD en appliquant la rustine
<CODE>noblink</CODE>. La derni&egrave;re version s'appelle
<CODE>noblink-X.X.tar.gz</CODE> et est disponible sur <CODE> 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/kernel/patches/console">ftp://sunsite.unc.edu/pub/Linux/kernel/patches/console</A></CODE>.
Installez le paquetage, puis ajoutez la ligne suivante &agrave; votre
/etc/profile:

<BLOCKQUOTE><CODE>
<PRE>
/usr/local/bin/cursor bgreen  # ou une autre couleur
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI> sur un portable, si vous pensez utiliser un modem/fax PCMIA, ne
compilez pas le pilote s&eacute;rie en module, mais directement dans
le noyau, sinon votre modem PCMIA ne fonctionnera pas;
</LI>
<LI>Rappelez-vous que Linux ne verra votre carte son que si vous la
configurez correctement. Dans la plupart des cas, c'est facile, mais
pensez bien &agrave; activer toutes les options n&eacute;cessaires
(n'oubliez pas /dev/dsp et /dev/audio);
</LI>
<LI>Si vous voyez ces ennuyeux messages de <CODE>modprobe</CODE> qui
indiquent que certains modules n'ont pas pu &ecirc;tre trouv&eacute;s,
&ccedil;a veut dire que votre /etc/conf.modules a besoin
d'un rafistolage. Si vous n'utilisez pas les modules Appletalk et IPX,
ajoutez ces lignes:

<BLOCKQUOTE><CODE>
<PRE>
alias net-pf-4 off
alias net-pf-5 off
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Pour gagner du temps la prochaine fois que vous recompilerez le
noyau, une bonne id&eacute;e est de sauvegarder votre configuration
dans un fichier que vous garderez dans un endroit s&ucirc;r.
</LI>
</UL>
</P>


<H2><A NAME="ss2.3">2.3 Blocage de <CODE>sendmail</CODE></A>
</H2>

<P>Sur certains syst&egrave;mes, <CODE>sendmail</CODE> bloque la machine au
d&eacute;marrage. V&eacute;rifiez que votre fichier
/etc/hosts contient une ligne </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
127.0.0.1 localhost
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss2.4">2.4 Optimisation des disques durs</A>
</H2>

<P>Vous pouvez &eacute;norm&eacute;ment am&eacute;liorer les performances
de votre disque dur en utilisant <EM>prudemment</EM> <CODE>hdparm(8)</CODE>. S'il
n'est pas fourni avec votre distribution de Linux, vous pouvez le
trouver sur 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/hardware">ftp://sunsite.unc.edu/pub/Linux/system/hardware</A>; cherchez un
fichier appel&eacute; hdparm-X.Y.tar.gz.</P>


<H2><A NAME="ss2.5">2.5 Lecteur Zip sur port parall&egrave;le</A>
</H2>

<P>Pour utiliser la version sur port parall&egrave;le du lecteur Zip,
vous pouvez utiliser le pilote par d&eacute;faut qui se trouve dans
les noyaux 2.x.x r&eacute;cents. Pendant la configuration du noyau,
n'oubliez pas de valider le support du SCSI et des disques SCSI
(dans le noyau ou en tant que modules). Attention, il peut y avoir des
conflits entre l'imprimante et le lecteur Zip s'ils se trouvent sur le
m&ecirc;me port parall&egrave;le.</P>
<P>Les disquettes Zip sont vendues pr&eacute;-format&eacute;es sur la
partition /dev/sda4. Pour faire fonctionner le Zip, il
suffit de taper les commandes suivantes:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
~# chmod 666 /dev/sda4  # tout le monde peut utiliser le lecteur Zip
~# insmod ppa
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Le Zip peut maintenant &ecirc;tre mont&eacute; normalement (le mieux
est de mettre la deuxi&egrave;me ligne dans
/etc/rc.d/rc.sysinit). Vous pouvez aussi y acc&eacute;der
avec les <CODE>mtools</CODE> en ajoutant la ligne suivante &agrave; votre
/etc/mtools.conf:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
drive z: file="/dev/sda4" exclusive
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Cependant, il existe un meilleur pilote <CODE>ppa</CODE>: jetez un coup d'oeil
&agrave; 
<A HREF="http://www.torque.net/~campbell">http://www.torque.net/~campbell</A></P>


<H2><A NAME="ss2.6">2.6 Pilotes de p&eacute;riph&eacute;riques</A>
</H2>

<P>Il peut manquer des p&eacute;riph&eacute;riques en <CODE>/dev/</CODE> (ou
des liens vers les v&eacute;ritables
p&eacute;riph&eacute;riques). V&eacute;rifiez &agrave; quoi
correspondent vos souris, modems, et lecteur de CDROM, puis
proc&eacute;dez comme suit :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
~#  cd /dev
/dev#  ln -s /dev/cua0 mouse
/dev#  ln -s /dev/cua1 modem
/dev#  ln -s /dev/hdb cdrom
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>et si vous le d&eacute;sirez, faites un <CODE>chmod 666</CODE> sur ces
p&eacute;riph&eacute;riques (les vrais p&eacute;riph&eacute;riques,
pas les liens!) pour les rendre accessibles &agrave; tous. Truc: sur
certains portables, la souris est <CODE>/dev/psaux</CODE>; tenez en compte
en configurant X11.</P>
<P>De plus, vous aurez envie de rendre le lecteur de disquettes
accessible &agrave; tous par la commande <CODE>chmod 666 /dev/fd*</CODE>.
Ceci peut entrainer des probl&egrave;mes de s&eacute;curit&eacute;,
mais j'en ignore les d&eacute;tails. Tout commentaire &agrave; ce
propos est bienvenu.</P>


<H2><A NAME="ss2.7">2.7 Messages de d&eacute;marrage</A>
</H2>

<P>Si vous souhaitez personnaliser ces messages, v&eacute;rifiez si votre
script /etc/rc.d/rc.local &eacute;crase les fichiers
/etc/issue et /etc/motd; dans ce cas,
&eacute;ditez-le convenablement.</P>


<H2><A NAME="ss2.8">2.8 Nom de machine</A>
</H2>

<P>La commande <CODE>hostname nouveau_nom</CODE> ne suffit pas. Pour
&eacute;viter le blocage de <CODE>sendmail</CODE>, respectez les &eacute;tapes
suivantes:</P>
<P>
<UL>
<LI>&eacute;ditez <CODE>/etc/sysconfig/network</CODE> et changez-y le 
nom de la machine (par exemple <CODE>nouveau_nom.localdomain</CODE>).
</LI>
<LI>modifiez convenablement /etc/HOSTNAME
</LI>
<LI>rajoutez le nouveau nom dans la ligne suivante de
/etc/hosts:

<BLOCKQUOTE><CODE>
<PRE>
127.0.0.1            localhost   nouveau_nom.localdomain
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>


<H2><A NAME="ss2.9">2.9 La souris</A>
</H2>

<P>Le serveur de souris <CODE>gpm</CODE> est utile pour le copier/coller en
mode console, et pour utiliser la souris dans certaines
applications. V&eacute;rifiez que vous avez un fichier
/etc/sysconfig/mouse qui contient :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
MOUSETYPE="Microsoft"
XEMU3=yes
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>De plus, vous devez avoir un fichier
/etc/rc.d/init.d/gpm. Bien s&ucirc;r, il faut vous
assurer que cette configuration correspond bien &agrave; votre souris.
Attention, sur certains portables <CODE>MOUSETYPE</CODE> vaut
<CODE>PS/2</CODE>.</P>
<P>Sous Caldera, tout ce que vous avez &agrave; faire est d'ajouter la
ligne suivante &agrave; /etc/rc.d/rc.boot:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/bin/gpm
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss2.10">2.10 R&eacute;pertoires de montage</A>
</H2>

<P>Il est pratique d'avoir des points de montage pour la disquette et
d'autres p&eacute;riph&eacute;riques. Par exemple, vous pouvez
proc&eacute;der comme suit :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
~#  cd /mnt
/mnt#  mkdir a: ; mkdir floppy ; mkdir cdrom ; mkdir win ; mkdir zip
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ceci cr&eacute;e des points de montage pour une disquette
format&eacute;e DOS, une disquette format&eacute;e Ext2, un CDROM, la
partition DOS, et le lecteur Zip du port parall&egrave;le.</P>

<P>Puis &eacute;ditez le fichier /etc/fstab et ajoutez y les
entr&eacute;es suivantes :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/dev/fd0        /mnt/a:         msdos           user,noauto 0 1
/dev/fd0        /mnt/floppy     ext2            user,noauto 0 1
/dev/cdrom      /mnt/cdrom      iso9660         ro,user,noauto 0 1
/dev/sda4       /mnt/zip        vfat            user,noauto 0 1
/dev/hda1       /mnt/win        vfat            user,noauto 0 1
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>Bien &eacute;videmment, vous devez mettre le bon
p&eacute;riph&eacute;rique dans le premier champ. Pour acc&eacute;der
aux partitions fat32, vous trouverez une rustine pour le noyau et des
informations a 
<A HREF="http://bmrc.berkeley.edu/people/chaffee/fat32.html">http://bmrc.berkeley.edu/people/chaffee/fat32.html</A>. NdT: La
rustine n'est plus n&eacute;cessaire depuis le noyau 2.0.34.</P>


<H2><A NAME="ss2.11">2.11 <CODE>lilo</CODE>(8) et LoadLin</A>
</H2>

<P>Beaucoup d'utilisateurs veulent que leur PC puisse faire tourner
&agrave; la fois Linux et DOS/Windows, et veulent choisir au
d&eacute;marrage quel syst&egrave;me utiliser. Supposons que
<CODE>/dev/hda1</CODE> contienne DOS/Windows, tandis que
<CODE>/dev/hda2</CODE> contienne Linux.</P>
<P>Proc&eacute;dez alors comme suit :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
~#  fdisk
Using /dev/hda as default device!

Command (m for help):a
Partition number (1-4): 2

Command (m for help):w

~#
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ceci rend amor&ccedil;able (bootable) la partition Linux. Cette &eacute;tape
devrait &ecirc;tre effectu&eacute;e par <CODE>activate</CODE> quand on utilise le
<CODE>QuickInst</CODE> de LILO, mais ne marche pas avec ma RedHat.</P>

<P>Puis entrez le fichier /etc/lilo.conf suivant :
<BLOCKQUOTE><CODE>
<PRE>
boot = /dev/hda2
compact
delay = 50
# message = /boot/bootmesg.txt  # &eacute;crivez le votre
root = current
image = /boot/vmlinuz  # la premi&egrave;re entr&eacute;e lance Linux par d&eacute;faut
  label = linux
other = /dev/hda1
  table = /dev/hda
  label = dos
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>Maintenant lancez <CODE>/sbin/lilo</CODE> et c'est tout!  LILO
&eacute;tant une <EM>partie critique</EM> de votre installation, je
vous invite vivement &agrave; en consulter la documentation.</P>

<P>Pour d&eacute;marrer Linux depuis DOS sans un arr&ecirc;t explicite, mettez
<CODE>LOADLIN.EXE</CODE> dans un r&eacute;pertoire (de la partition DOS)
inclus dans le chemin (path) du DOS, puis copiez votre noyau en
<CODE>C:\DOS\VMLINUZ</CODE> par exemple. Le fichier de commandes
<CODE>LINUX.BAT</CODE> suivant d&eacute;marrera Linux :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
rem   linux.bat
smartdrv /C
loadlin c:\dos\vmlinuz root=/dev/hda2 r
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si vous utilisez Windows 95, modifiez les propri&eacute;t&eacute;s de
ce fichier pour qu'il s'ex&eacute;cute en mode MS-DOS.</P>

<H3>Un conseil de prudence</H3>

<P>Faire une copie de votre MBR avant d'installer Linux peut vous sauver
la mise. Utilisez <CODE>restorrb</CODE> (inclus dans le paquetage <CODE>FIPS</CODE>)
avant l'installation, ou utilisez une disquette de secours Linux et
lancez cette commande:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
rescue:~# dd if=/dev/hda of=MBR bs=512 count=1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>puis faites au moins deux copies du fichier MBR sur des
disquettes. En cas de désastre, vous pourrez r&eacute;installer votre
ancien MBR avec la commande:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
rescue:~# dd if=/mnt/MBR of=/dev/hda bs=446 count=1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>en supposant que la disquette contenant le fichier MBR est
mont&eacute;e sous /mnt. Vous pouvez &eacute;galement
utiliser la commande <CODE>FDISK /MBR</CODE> depuis une disquette de
secours DOS.</P>


<H2><A NAME="ss2.12">2.12 Configuration d'imprimante</A>
</H2>

<P>Les distributions RedHat et Caldera contiennent un bon outil de
configuration, <CODE>printtool</CODE>; si vous n'utilisez pas ces
distributions, voici la configuration manuelle.</P>

<P>On suppose que vous avez une imprimante non-PostScript que vous
utilisez pour imprimer du texte brut (par exemple du source en C) et
des fichiers PostScript avec <EM>GhostScript</EM> qui est suppos&eacute;
&ecirc;tre d&eacute;j&agrave; install&eacute;.</P>

<P>Installer votre imprimante demande quelques &eacute;tapes :
<UL>
<LI> V&eacute;rifiez sur quel port parall&egrave;le elle se trouve;
essayez

<BLOCKQUOTE><CODE>
<PRE>
 
 ~# echo "hello, world" > /dev/lp0
 ~# echo "hello, world" > /dev/lp1
</PRE>
</CODE></BLOCKQUOTE>


et notez laquelle de ces 2 commandes marche.
</LI>
<LI>Cr&eacute;er deux r&eacute;pertoires-tampons
<BLOCKQUOTE><CODE>
<PRE>
 
~#  cd /var/spool/lpd
/var/spool/lpd/#  mkdir raw ; mkdir postscript
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Si votre imprimante imprime en escalier (comme la plupart
des jets d'encre) vous avez besoin d'un filtre. Essayez d'imprimer
deux lignes avec :

<BLOCKQUOTE><CODE>
<PRE>
 
 ~# echo "premiere ligne" > /dev/lp1 ; echo "deuxieme ligne" > /dev/lp1
</PRE>
</CODE></BLOCKQUOTE>


Si la sortie est de la forme 
<BLOCKQUOTE><CODE>
<PRE>
 
premiere ligne
              deuxieme ligne
</PRE>
</CODE></BLOCKQUOTE>

c'est que vous avec besoin du filtre. Cr&eacute;ez alors un fichier
/var/spool/lpd/raw/filter contenant 

<BLOCKQUOTE><CODE>
<PRE>
 
#!/bin/sh
# fichier /var/spool/lpd/raw/filter
# Ce filtre d'impression supprime l'effet d'escalier
awk '{print $0, "\r"}'
</PRE>
</CODE></BLOCKQUOTE>


puis rendez-le ex&eacute;cutable par <CODE>chmod 755
/var/spool/lpd/raw/filter</CODE>.
</LI>
<LI>Faites un filtre pour l'&eacute;mulation
PostScript. Cr&eacute;ez le fichier
/var/spool/lpd/postscript/filter contenant :
<BLOCKQUOTE><CODE>
<PRE>
 
#!/bin/sh
# fichier /var/spool/lpd/postscript/filter
DEVICE=djet500
RESOLUTION=300x300
PAPERSIZE=a4
SENDEOF=

nenscript -TUS -ZB -p- |
if [ "$DEVICE" = "PostScript" ]; then
        cat -
else
        gs -q -sDEVICE=$DEVICE \
                -r$RESOLUTION \
                -sPAPERSIZE=$PAPERSIZE \
                -dNOPAUSE \
                -dSAFER \
                -sOutputFile=- -
fi

if [ "$SENDEOF" != "" ]; then
        printf "\004"
fi
</PRE>
</CODE></BLOCKQUOTE>


(dans cet exemple on suppose une imprimante HP DeskJet. Adaptez-le &agrave;
la v&ocirc;tre).
</LI>
<LI>Enfin, ajoutez les entr&eacute;es suivantes dans
/etc/printcap&nbsp;:

<BLOCKQUOTE><CODE>
<PRE>
 
# entr&eacute;es dans /etc/printcap
lp|ps|PS|PostScript|djps:\
        :sd=/var/spool/lpd/postscript:\
        :mx#0:\
        :lp=/dev/lp1:\
        :if=/var/spool/lpd/postscript/filter:\
        :sh:
raw:\
        :sd=/var/spool/lpd/raw:\
        :mx#0:\
        :lp=/dev/lp1:\
        :if=/var/spool/lpd/raw/filter:\
        :sh:
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>
<P>Pour des configurations d'imprimante plus complexes ou plus exotiques, 
le <CODE>Printing-HOWTO</CODE> vous attend.</P>

<P>Utilisateurs de RedHat: sachez que le <CODE>GSDEVICE</CODE> choisi par
<CODE>printtool</CODE> fonctionne, mais n'est pas forc&eacute;ment le meilleur pour 
votre imprimante. Vous pouvez envisager de bricoler le fichier
<CODE>postscript.cfg</CODE>; j'y ai chang&eacute; <CODE>GSDEVICE</CODE> de
<CODE>cdj500</CODE>en <CODE>djet500</CODE> et mes impressions sont maintenant beaucoup 
plus rapides.</P>


<H2><A NAME="s3">3. Configuration des logiciels</A></H2>

<P>Voici la liste des fichiers de configuration que nous allons modifier: 
/etc/profile /etc/bashrc <CODE>.bashrc</CODE>
<CODE>.bash_profile .inputrc .less .lessrc .xinitrc .fvwmrc .fvwm2rc95</CODE>
<CODE>.Xmodmap .Xdefaults .jedrc. .abbrevs.sl .joerc .emacs</CODE>. N'ajoutez pas d'utilisateurs avant d'avoir termin&eacute; la
configuration. Les fichiers dont le nom commence par un point iront
dans /etc/skel.</P>

<H2><A NAME="ss3.1">3.1 bash(1)</A>
</H2>

<P>Pour affiner le comportement de <CODE>bash</CODE>, voici les fichiers &agrave;
&eacute;diter :</P>
<P>
<UL>
<LI> <CODE>/etc/bashrc</CODE> contient les alias et fonctions
globales au syst&egrave;me;
</LI>
<LI> <CODE>/etc/profile</CODE> positionne globalement les variables
d'environnement et lance les programmes de d&eacute;marrage communs;
</LI>
<LI> <CODE>$HOME/.bashrc</CODE> contient les alias et fonctions
propres &agrave; l'utilisateur;
</LI>
<LI> <CODE>$HOME/.bash_profile</CODE> positionne les variables
d'environnement de l'utilisateur et lance ses programmes de d&eacute;marrage
propres;
</LI>
<LI> <CODE>$HOME/.inputrc</CODE> contient les liaisons du clavier et 
autres bricoles.
</LI>
</UL>
</P>

<P>Voici des exemples de ces fichiers. D'abord le plus important :
/etc/profile qui configure beaucoup de
propri&eacute;t&eacute;s de votre syst&egrave;me, comme
illustr&eacute; ci-dessous :</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
 
# /etc/profile

# Environnement global au syst&egrave;me et programmes de d&eacute;marrage
# Les fonctions et alias vont dans /etc/bashrc

# Ce fichier configure globalement
#
#   o le chemin d'ex&eacute;cution (path)
#   o les invites (prompts)
#   o quelques variables d'environnement
#   o ls en couleurs
#   o comportement de less
#
# Les utilisateurs peuvent &eacute;craser ces configurations et en ajouter 
# d'autres dans leur $HOME/.bash_profile

# mettre un chemin d'ex&eacute;cution d&eacute;cent

echo $PATH | grep X11R6 > /dev/null
if [ $? = 1 ] ; then   # ajouter des entr&eacute;es au chemin
  PATH="$PATH:/usr/X11R6/bin:$HOME/bin:."
fi

# indiquer &agrave; l'utilisateur les shells de login. En login, l'invite
# (prompt) est en bleu, autrement en magenta. L'invite de root est rouge

USER=`whoami`
if [ $LOGNAME = $USER ] ; then
  COLOUR=44
else
  COLOUR=45
fi

if [ $USER = 'root' ] ; then
  COLOUR=41
fi

# mettez un vrai caract&egrave;re &eacute;chappement (Escape) au lieu de ^[
# Pour cela: sous emacs: ^Q ESC   sous vi: ^V ESC   sous joe: ` 0 2 7
# sous jed: `ESC
# Enlevez ";1" si vous n'aimez pas l'attribut "gras".
ESC=^[
PS1='$ESC[$COLOUR;37;1m$USER:$ESC[37;40;1m\w\$ '
PS2="Continue> "

# pas de core dump svp
ulimit -c 0

# positionner le umask (permission par d&eacute;faut des nouveaux fichiers)

if [ `id -gn` = `id -un` -a `id -u` -gt 14 ]; then
        umask 002
else
        umask 022
fi

# quelques variables

USER=`id -un`
LOGNAME=$USER
MAIL="/var/spool/mail/$USER"
EDITOR=jed
HOSTNAME=`/bin/hostname`
HISTSIZE=1000
HISTFILESIZE=1000
export PATH PS1 PS2 USER LOGNAME MAIL EDITOR HOSTNAME HISTSIZE HISTFILESIZE

# ls en couleurs

eval `dircolors /etc/DIR_COLORS -b`
export LS_OPTIONS='-F -s -T 0 --color=tty'

# configuration de less

LESS='-M-Q'
LESSEDIT="%E ?lt+%lt. %f"
LESSOPEN="| lesspipe.sh %s"
VISUAL=jed
LESSCHARSET=latin1
export LESS LESSEDIT LESSOPEN VISUAL LESSCHARSET

# configurer globalement d autres programmes
for i in /etc/profile.d/*.sh ; do
        if [ -x $i ]; then
                . $i
        fi
done
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>

<P>Voici le fichier /etc/bashrc :</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
   
# /etc/bashrc
# Fonctions et alias globaux au syst&egrave;me
# les variables d'environnement vont en /etc/profile
alias which="type -path"
alias d="ls"
alias dir="d"
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>

<P>Et voici un exemple de <CODE>.bashrc</CODE> :</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
    
# Sourcer les definitions globales

if [ -f /etc/bashrc ]; then
        . /etc/bashrc
fi

# Ceci est n&eacute;cessaire pour notifier les utilisateurs qu'ils se trouvent dans un shell sans login

if [ "$GET_PS1" = "" ] ; then
  COLOUR=45
# mettre un vrai caract&egrave;re &eacute;chappement (Escape) au lieu de ^[
  ESC=^[
  PS1='$ESC[$COLOUR;37m`whoami`:$ESC[37;40m\w\$ '
  export PS1
fi

# alias

alias cp='cp -i'
alias l=less
alias lyx='lyx -width 900 -height 700'
alias mv='mv -i'
alias rm='rm -i'
alias x=startx

# Quelques fonctions utiles

inst() # Installer une archive .tar.gz dans le repertoire courant
{ gzip -dc $1 | tar xvf - }

cz() # Lister le contenu d'une archive .zip
{ unzip -l $* }

ctgz() # Lister le contenu d'une archive .tar.gz
{
  for file in $* ; do
    gzip -dc ${file} | tar tf -
  done
}

tgz() # Cr&eacute;er une archive .tgz &agrave; la zip.
{
  name=$1 ; tar -cvf $1 ; shift
  tar -rf ${name} $*
  gzip -S .tgz ${name}
}
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>

<P>Voici un exemple de <CODE>.bash_profile</CODE> :</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
 
# fichier $HOME/.bash_profile

# Environment et programmes de d&eacute;marrage propres &agrave; l'utilisateur
# Ce fichier contient des configurations d&eacute;finies par l'utilisateur
# &eacute;crasant celles dans /etc/profile

# configurer les alias et fonctions propres &agrave; l'utilisateur
if [ -f ~/.bashrc ]; then
        GET_PS1="NO"  # Ne pas changer la couleur de l'invite
        . ~/.bashrc
fi

# quelques r&eacute;pertoires "par d&eacute;faut"
export CDPATH="$CDPATH:$HOME:$HOME/text:$HOME/text/geology"

# pour r&eacute;parer l'espace arri&egrave;re sous rxvt 2.45
if [ "$COLORTERM" != "" ] ; then
  stty erase ^?
  ESC=^[  # put a real escape character instead of ^[
  echo -n "$ESC[36l"
fi
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>

<P>Voici un fichier <CODE>~/.inputrc</CODE> :</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
 
# fichier $HOME/.inputrc

# liaison des touches du clavier

"\e[1~": beginning-of-line
"\e[3~": delete-char
"\e[4~": end-of-line
# les touches (F1 .. F5) sont "\e[[A" ... "\e[[E"
"\e[[A": "info \C-m"

set bell-style visible         # sans bip sonore
set meta-flag On               # permettre les caract&egrave;res &agrave; 8 bits (accentu&eacute;s)
set convert-meta Off           # .. ne pas les convertir
set output-meta On             # .. les afficher correctement
set horizontal-scroll-mode On  # parcourir les longues lignes de commandes
set show-all-if-ambiguous On   # apr&egrave;s avoir press&eacute; TAB
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>

<P>Pour que les touches arri&egrave;re (backspace) et suppr (delete)
fonctionnent correctement dans <CODE>xterm</CODE> et d'autres applications
X11, il vous faut &eacute;galement :</P>
<P>
<UL>
<LI> ins&eacute;rer ce qui suit dans votre <CODE>.xinitrc</CODE> :
<BLOCKQUOTE><CODE>
<PRE>
 
# dans $HOME/.xinitrc d&eacute;finir le clavier X11
usermodmap=$HOME/.Xmodmap
xmodmap $usermodmap
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI> mettre ce qui suit dans votre <CODE>.Xmodmap</CODE> :
<BLOCKQUOTE><CODE>
<PRE>
! dans $HOME/.Xmodmap
keycode 22 = BackSpace
keycode 107 = Delete
</PRE>
</CODE></BLOCKQUOTE>

ce qui r&eacute;pare votre console.</LI>
</UL>
</P>
<P>Pour corriger <CODE>xterm</CODE> :
<UL>
<LI> ins&eacute;rer ce qui suit dans votre <CODE>~/.Xdefaults</CODE> :
<BLOCKQUOTE><CODE>
<PRE>
xterm*VT100.Translations: #override &lt;Key>BackSpace: string(0x7F)\n\
        &lt;Key>Delete:        string(0x1b) string("[3~")\n\
        &lt;Key>Home:          string(0x1b) string("[1~")\n\
        &lt;Key>End:           string(0x1b) string("[4~")\n\
        Ctrl&lt;Key>Prior:     string(0x1b) string("[40~")\n\
        Ctrl&lt;Key>Next:      string(0x1b) string("[41~")

nxterm*VT100.Translations: #override &lt;Key>BackSpace: string(0x7F)\n\
        &lt;Key>Delete:        string(0x1b) string("[3~")\n\
        &lt;Key>Home:          string(0x1b) string("[1~")\n\
        &lt;Key>End:           string(0x1b) string("[4~")\n\
        Ctrl&lt;Key>Prior:     string(0x1b) string("[40~")\n\
        Ctrl&lt;Key>Next:      string(0x1b) string("[41~")
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>
<P>Pour <CODE>rxvt</CODE>, c'est un peu plus compliqu&eacute;, vu que certaines
options de compilation influent sur son comportement. Voyez le fichier
<CODE>.bash_profile</CODE> ci-dessus.</P>
<P>Voir les pages du manuel (commande <CODE>man</CODE>) de <CODE>bash(1)</CODE>
et <CODE>readline(3)</CODE> pour plus de d&eacute;tails.</P>
<P>N'esp&eacute;rez pas voir toutes les applications fonctionner
correctement. Si vous lancez <CODE>joe</CODE> sous <CODE>xterm</CODE> par
exemple, certaines touches ne fonctionnent pas; c'est vrai aussi pour
les versions de <CODE>rxvt</CODE> ant&eacute;rieures &agrave; la 2.21.</P>

<H2><A NAME="ss3.2">3.2 ls(1)</A>
</H2>

<P>La commande <CODE>ls</CODE> peut afficher les r&eacute;pertoires avec des
couleurs pour diff&eacute;rencier les types de fichiers. Pour
configurer cette option, ajoutez les lignes suivantes dans
/etc/profile:
<BLOCKQUOTE><CODE>
<PRE>
eval `dircolors /etc/DIR_COLORS -b`
export LS_OPTIONS='-F -T 0 --color=tty'
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(Si vous n'avez pas de fichier /etc/DIR_COLORS, enlevez
la r&eacute;f&eacute;rence &agrave; ce fichier de la premi&egrave;re
ligne).  Ceci positionne la variable d'environnement <CODE>LS_COLORS</CODE>
selon les listes de couleurs d&eacute;finies dans
<CODE>/etc/DIR_COLORS</CODE>. <EM>Note:</EM> ne me demandez pas pourquoi,
mais &ccedil;a ne marche pas dans certaines anciennes versions de
<CODE>rxvt</CODE> (ant&eacute;rieures &agrave; 2.21); utilisez alors
<CODE>xterm</CODE> ou un programme similaire. Il semble que <CODE>rxvt</CODE> ait un
bogue l'emp&ecirc;chant dans certains cas d'h&eacute;riter
correctement des variables d'environnement.</P>
<P>Le <CODE>ls</CODE> de Caldera n'a pas de couleurs, mail il existe un
&eacute;quivalent: <CODE>color-ls</CODE>. Ajoutez ceci &agrave;
/etc/bashrc:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
alias ls="color-ls $LS_OPTIONS"
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss3.3">3.3 less(1)</A>
</H2>

<P>Avec cet excellent pagineur, vous pouvez visualiser non seulement
des fichiers de texte ordinaires, mais aussi des fichiers
comprim&eacute;s par <CODE>gzip</CODE>, des archives <CODE>tar</CODE> ou <CODE>zip</CODE>, des
pages de manuel (commande <CODE>man</CODE>), etc. Sa configuration prend
quelques &eacute;tapes :</P>
<P>
<UL>
<LI> pour l'utiliser avec les touches de mouvement, ayez ce fichier
<CODE>~/.lesskey</CODE> en ASCII dans votre r&eacute;pertoire domestique:
<BLOCKQUOTE><CODE>
<PRE>
^[[A   back-line
^[[B   forw-line
^[[C   right-scroll
^[[D   left-scroll
^[OA   back-line
^[OB   forw-line
^[OC   right-scroll
^[OD   left-scroll
^[[6~  forw-scroll
^[[5~  back-scroll
^[[1~  goto-line
^[[4~  goto-end
^[[7~  goto-line
^[[8~  goto-end
</PRE>
</CODE></BLOCKQUOTE>


puis lancez la commande <CODE>lesskey</CODE>. Celle-ci cr&eacute;e un fichier binaire 
<CODE>.less</CODE> contenant les liaisons des touches.
</LI>
<LI> Ecrivez le fichier suivant dans /usr/bin/lesspipe.sh:

<BLOCKQUOTE><CODE>
<HR>
<PRE>
#!/bin/sh
# fichier /usr/bin/lesspipe.sh

# Pr&eacute;processeur pour 'less' utilis&eacute; quand la variable d'environnement suivante est d&eacute;finie
# LESSOPEN="|lesspipe.sh %s"

lesspipe() {
  case "$1" in
  *.tar) tar tf $1 2>/dev/null ;; # Pour voir le contenu d'archives .tar ou .tgz
  *.tgz|*.tar.gz|*.tar.Z|*.tar.z) tar ztf $1 2>/dev/null ;;
  *.Z|*.z|*.gz) gzip -dc $1  2>/dev/null ;; # Pour voir les fichiers comprim&eacute;s correctement (.gz)
  *.zip) unzip -l $1 2>/dev/null ;; # Pour voir les archives (.zip)
  *.arj) unarj -l $1 2>/dev/null ;;
  *.rpm) rpm -q -p -i -l $1 2>/dev/null ;;
  *.1|*.2|*.3|*.4|*.5|*.6|*.7|*.8|*.9|*.n|*.man) FILE=`file -L $1`
    FILE=`echo $FILE | cut -d ' ' -f 2`
    if [ "$FILE" = "troff" ]; then
      groff -s -p -t -e -Tascii -mandoc $1
    fi ;;
  *) FILE=`file -L $1` ; # V&eacute;rification pour le cas d'un fichier binaire
    FILE1=`echo $FILE | cut -d ' ' -f 2`
    FILE2=`echo $FILE | cut -d ' ' -f 3`
    if [ "$FILE1" = "Linux/i386" -o "$FILE2" = "Linux/i386" \
         -o "$FILE1" = "ELF" -o "$FILE2" = "ELF" ]; then
      strings $1
    fi ;;
  esac
}

lesspipe $1
</PRE>
<HR>
</CODE></BLOCKQUOTE>


et n'oubliez pas de le rendre ex&eacute;cutable par 
<CODE>chmod 755 lesspipe.sh</CODE>.
</LI>
<LI> ajoutez ces lignes dans /etc/profile :
<BLOCKQUOTE><CODE>
<HR>
<PRE>
LESS="-M-Q"                     # invite longue, silencieuse
LESSEDIT="%E ?lt+%lt. %f"       # &eacute;diter  ligne du haut
LESSOPEN="| lesspipe.sh %s"     # filtre
VISUAL=jed                      # &eacute;diteur par d&eacute;faut- mettez votre pr&eacute;f&eacute;r&eacute;
LESSCHARSET=latin1              # afficher les caract&egrave;res accentu&eacute;s
export LESS LESSEDIT LESSOPEN VISUAL LESSCHARSET
</PRE>
<HR>
</CODE></BLOCKQUOTE>


La variable <CODE>LESSCHARSET</CODE> d&eacute;pend du fait qu'on habite en
Europe Occidentale, o&ugrave; est utilis&eacute; le jeu de
caract&egrave;res ISO 8859-1. Les coll&egrave;gues Am&eacute;ricains,
Japonais, Russes, etc.. devraient la configurer autrement.
</LI>
</UL>
</P>

<H2><A NAME="ss3.4">3.4 emacs(1)</A>
</H2>

<P>Je n'utilise pas <CODE>emacs</CODE>, donc je n'ai qu'un seul conseil &agrave;
vous donner. Certaines distributions d'<CODE>emacs</CODE> ne sont pas
pr&eacute;configur&eacute;es pour les couleurs et la d&eacute;coration
syntaxique. Ajoutez ce qui suit dans votre <CODE>~/.emacs</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
;; dans fichier $HOME/.emacs
(global-font-lock-mode t)
(setq font-lock-maximum-decoration t)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ceci ne marche qu'avec X11. Je vous laisse lire attentivement toute la
documentation d'<CODE>emacs</CODE> pour d&eacute;couvrir comment l'adapter
&agrave; vos besoins. Cela peut prendre des mois de bidouillage!</P>

<H2><A NAME="ss3.5">3.5 joe(1)</A>
</H2>

<P>Certaines personnes rapportent que <CODE>joe</CODE> fonctionne en couleurs
sous X11, mais pas sur la console. De plus, certaines touches
sp&eacute;ciales ne fonctionnent pas. &Agrave; ma connaissance,
personne n'a r&eacute;ussi &agrave; r&eacute;soudre le premier
probl&egrave;me; certains ont sugg&eacute;r&eacute; de bidouiller 
/etc/termcap.</P>
<P>Si vous rencontrez ce probl&egrave;me, voici une solution rapide (et
peu &eacute;l&eacute;gante):</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
~$ export TERM=vt100
~$ joe monfichier
   (&eacute;ditez votre fichier)
~$ export TERM=linux
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss3.6">3.6 jed(1)</A>
</H2>

<P>C'est mon &eacute;diteur favori; il fait ce dont j'ai besoin, mais est
plus l&eacute;ger et plus facile &agrave; configurer qu'
<CODE>emacs</CODE>, et &agrave; mon humble avis &eacute;mule mieux les
autres &eacute;diteurs. Beaucoup d'utilisateurs de mon
universit&eacute; veulent <CODE>jed</CODE> pour &eacute;muler
<CODE>EDT</CODE>, l'&eacute;diteur de <CODE>VMS</CODE>.</P>
<P>Les fichiers de configuration sont <CODE>.jedrc</CODE> et
/usr/lib/jed/lib/*. Le premier est adapt&eacute; du
fichier <CODE>jed.rc</CODE> de ce r&eacute;pertoire-l&agrave;.</P>
<P>
<UL>
<LI>pour que <CODE>jed</CODE> utilise correctement certaines touches,
cr&eacute;ez un fichier /usr/lib/jed/lib/defaults.sl dont
la seule ligne est :
<BLOCKQUOTE><CODE>
<PRE>
() = evalfile("linux");
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>&eacute;ditez /usr/lib/jed/lib/linux.sl :
d&eacute;commentez la ligne contenant <CODE>Info_Directory =
"/usr/info"</CODE> et ajoutez <CODE>/bin/mail</CODE> apr&egrave;s
<CODE>UCB_Mailer =</CODE>
</LI>
<LI>il est tr&egrave;s simple de configurer <CODE>jed</CODE> pour qu'il
&eacute;mule <CODE>EDT</CODE> (ou d'autres &eacute;diteurs). Vous devez
juste &eacute;diter quelques lignes dans <CODE>.jedrc</CODE>. Si vous
souhaitez utiliser la touche <CODE>+</CODE> du pav&eacute;
num&eacute;rique pour supprimer des mots entiers au lieu d'un seul
caract&egrave;re, ajouter ceci dans <CODE>.jedrc</CODE> :

<BLOCKQUOTE><CODE>
<PRE>
unsetkey("\eOl");
unsetkey("\eOP\eOl");
setkey("edt_wdel", "\eOl");
setkey("edt_uwdel", "\eOP\eOl");
</PRE>
</CODE></BLOCKQUOTE>


apr&egrave;s la ligne contenant <CODE>() = evalfile("edt");</CODE>.
</LI>
<LI> Pour que <CODE>xjed</CODE> utilise le pav&eacute; num&eacute;rique
en &eacute;mulation <CODE>EDT</CODE> il vous faut ajouter ce qui suit dans
votre <CODE>.Xmodmap</CODE> :

<BLOCKQUOTE><CODE>
<PRE>
keycode 77  = KP_F1
keycode 112 = KP_F2
keycode 63  = KP_F3
keycode 82  = KP_F4
keycode 86  = KP_Separator
</PRE>
</CODE></BLOCKQUOTE>


De plus, assurez-vous que votre /etc/X11/XF86Config
contient les lignes suivantes :

<BLOCKQUOTE><CODE>
<PRE>
     
#    ServerNumLock  # doit &ecirc;tre comment&eacute;
XkbDisable
</PRE>
</CODE></BLOCKQUOTE>


Ceci s'applique &agrave; <CODE>XFree 3.2</CODE>. &Agrave; moins que vous
n'utilisiez un clavier standard am&eacute;ricain (Qwerty), notez que
<CODE>XkbDisable</CODE> pose quelques petits probl&egrave;mes. Vous les
d&eacute;couvrirez par vous-m&ecirc;me.
</LI>
<LI>La personnalisation des couleurs pour <CODE>xjed</CODE> se fait en
ajoutant des lignes comme suit dans <CODE>.Xdefaults</CODE>
<BLOCKQUOTE><CODE>
<PRE>
xjed*Geometry: 80x32+150+50
xjed*font: 10x20
xjed*background: midnight blue  
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>la possibilit&eacute; d'"abr&eacute;viation" permet de gagner un
temps fou. Mettez ce qui suit dans un fichier
<CODE>$HOME/.abbrevs.sl</CODE>:

<BLOCKQUOTE><CODE>
<PRE>
create_abbrev_table ("Global", "");
define_abbrev ("Global", "GG", "Guido Gonzato");
create_abbrev_table ("TeX", "\\A-Za-z0-9");
define_abbrev ("TeX", "\\beq", "\\begin{equation}");
define_abbrev ("TeX", "\\eeq", "\\end{equation}");
% et ainsi de suite...
</PRE>
</CODE></BLOCKQUOTE>


puis tapez <CODE>ESC x abbrev_mode</CODE> pour que <CODE>jed</CODE> en tienne
compte. Pour que les abr&eacute;viations fonctionnent par
d&eacute;faut, ajoutez ceci dans votre <CODE>.jedrc</CODE>:

<BLOCKQUOTE><CODE>
<PRE>
define text_mode_hook ()
{
  set_abbrev_mode (1);
}
%
define fortran_hook ()
{
  set_abbrev_mode (1);
  use_abbrev_table ("Fortran");
}
% et ainsi de suite...
</PRE>
</CODE></BLOCKQUOTE>


</LI>
</UL>
</P>


<H2><A NAME="ss3.7">3.7 <CODE>efax</CODE>(1)</A>
</H2>

<P>Ce paquetage est probablement le plus pratique pour envoyer et
recevoir simplement des fax. Vous allez devoir adapter le script
/usr/bin/fax; c'est facile, mais quelques
particularit&eacute;s m'ont caus&eacute; un gros mal de cr&acirc;ne:</P>
<P>
<UL>
<LI> DIALPREFIX: la simple indication de "T" ou "P" risque de ne pas
fonctionner dans pas mal de pays. Mettez plut&ocirc;t "ATDT" ou
"ATDP":
</LI>
<LI> INIT et RESET: ces cha&icirc;nes de caract&egrave;res
contiennent les s&eacute;quences d'initialisation "-i" et "-k",
n&eacute;cessaires &agrave; <CODE>efax</CODE>. Si vous voulez ajouter une
commande AT, ajoutez la &agrave; la bonne cha&icirc;ne en
enlevant "AT" et en faisant pr&eacute;c&eacute;der le reste de "-i" ou
"-k". Par exemple, pour ajouter la commande "ATX3" &agrave; INIT,
rajoutez "-iX3".
</LI>
</UL>
</P>


<H2><A NAME="ss3.8">3.8 TeX et compagnie</A>
</H2>

<P>Je suppose que vous avez la distribution <CODE>TeTeX</CODE>. Quelques
trucs ici :</P>
<P>
<UL>
<LI>pour configurer les motifs de c&eacute;sure pour votre langue,
&eacute;ditez le fichier
/usr/lib/texmf/texmf/tex/generic/config/language.dat puis
lancez :
<BLOCKQUOTE><CODE>
<PRE>
~#  texconfig init ; texconfig hyphen
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>pour installer un paquetage <CODE>LaTeX</CODE>, apr&egrave;s avoir
ajout&eacute; les fichiers sous
<CODE>/usr/lib/texmf/texmf/tex/latex/</CODE> lancez la commande
<CODE>texhash</CODE> pour que <CODE>TeTeX</CODE> reconnaisse le nouveau
paquetage.
</LI>
<LI>pour configurer <CODE>dvips</CODE>, le fichier &agrave;
&eacute;diter est
<CODE>/usr/lib/texmf/texmf/dvips/config/config.ps</CODE>. Soyez conscient
que les champs concernant la r&eacute;solution par d&eacute;faut
d&eacute;terminent aussi le comportement de <CODE>xdvi</CODE>. Si vous
remarquez des cr&eacute;ations intempestives de polices (fonts)
&agrave; chaque ex&eacute;cution, ajoutez dans votre
<CODE>.Xdefaults</CODE> une ligne

<BLOCKQUOTE><CODE>
<PRE>
XDvi*mfmode:
</PRE>
</CODE></BLOCKQUOTE>


Cela peut aider.
</LI>
</UL>
</P>


<H2><A NAME="ss3.9">3.9 PPP</A>
</H2>

<P>Je suppose que votre noyau est compil&eacute; avec le support de
<CODE>PPP</CODE> et <CODE>TCP/IP</CODE>, avec support du <CODE>loopback</CODE> et
que votre logiciel <CODE>pppd</CODE> est correctement install&eacute;
et setuid root. Bien s&ucirc;r, votre FAI doit utiliser PPP.</P>
<P>Il y a dor&eacute;navant deux fa&ccedil;ons de faire fonctionner
<CODE>PPP</CODE> : a) une configuration manuelle, et b) utiliser un
programme de configuration "auto-magique". Que vous choisissiez l'un
ou l'autre moyen, vous aurez besoin des informations suivantes:</P>
<P>
<UL>
<LI>le num&eacute;ro de t&eacute;l&eacute;phone de votre FAI;</LI>
<LI>son serveur de noms;</LI>
<LI>ses serveurs de news et de courrier &eacute;lectronique;</LI>
<LI>son nom de domaine;</LI>
<LI>votre nom d'utilisateur et votre mot de passe.</LI>
</UL>
</P>
<P>La configuration manuelle est un casse-t&ecirc;te. Il s'agit
d'&eacute;diter des fichiers et d'&eacute;crire des scripts; pas trop
de travail, mais les erreurs sont faciles &agrave; faire, et les
nouveaux utilisateurs sont souvent intimid&eacute;s. Si vous voulez
vous y lancer, le PPP HOWTO est l&agrave; pour vous. Sinon, il existe
des logiciels qui vous demandent les informations ci-dessus et qui
font tout le travail eux-m&ecirc;mes.</P>
<P>Le mieux est certainement de trouver un ami d&eacute;j&agrave;
connect&eacute; et de t&eacute;l&eacute;charger les outils suivants:</P>
<P>
<UL>
<LI>EzPPP, un utilitaire sous X11, dont le site Internet se trouve
&agrave; l'adresse 
<A HREF="http://www.serv.net/~cameron/ezppp/index.html">http://www.serv.net/~cameron/ezppp/index.html</A>. Tr&egrave;s
simple &agrave; utiliser, se passe de commentaires;
</LI>
<LI>pour les connexions en mode console, essayez les outils
disponibles &agrave; 
<A HREF="ftp://sunsite.unc.edu/pub/linux/system/network/serial/ppp">ftp://sunsite.unc.edu/pub/linux/system/network/serial/ppp</A>. Un
des meilleurs est pppsetup-X.XX.tar.gz.
</LI>
<LI>l'utilitaire le plus simple &agrave; configurer &agrave; l'heure
actuelle est certainement <CODE>wvdial</CODE>. Vous lui donnez le
num&eacute;ro de t&eacute;l&eacute;phone de votre FAI, votre nom
d'utilisateur et votre mot de passe, et c'est parti. Extrait du
fichier README: "There is a (currently cheesy) web page for wvdial at:
<CODE>
<A HREF="http://www.worldvisions.ca/wvdial">http://www.worldvisions.ca/wvdial</A></CODE>" ("Il y a une
page web (plut&ocirc;t naze pour l'instant) &agrave; l'adresse:
<A HREF="http://www.worldvisions.ca/wvdial">http://www.worldvisions.ca/wvdial</A>). Tr&egrave;s
sympathique.
</LI>
</UL>
</P>


<H2><A NAME="ss3.10">3.10 Client POP</A>
</H2>

<P>Pour aller chercher votre courrier &eacute;lectronique sur un serveur
<CODE>POP</CODE>, utilisez un client <CODE>POP</CODE> tel que
<CODE>fetchpop</CODE> ou <CODE>fetchmail</CODE>. Ce dernier est plus
avanc&eacute;, et c'est probablement la seule alternative si le
serveur <CODE>PPP</CODE> de votre fournisseur a des probl&egrave;mes avec
la commande <CODE>LAST</CODE>.</P>
<P>Pour configurer ces clients :</P>
<P>
<UL>
<LI><CODE>fetchpop</CODE>: la premi&egrave;re fois que vous le lancez,
il vous demandera quelques informations. R&eacute;pondez &agrave; ses
questions et c'est tout.
</LI>
<LI><CODE>fetchmail</CODE>: adaptez cet exemple de
<CODE>.fetchmailrc</CODE>: 

<BLOCKQUOTE><CODE>
<PRE>
# fichier $HOME/.fetchmailrc
poll mbox.monfai.com with protocol pop3;
  user jean there with password  _Biz%_ar  is jean here
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>
<P>Vous devez mettre les permissions de ce fichier avec <CODE>chmod 600
.fetchmailrc</CODE> autrement <CODE>fetchmail</CODE> refusera avec raison de
d&eacute;marrer. Cet exemple est tr&egrave;s rudimentaire, et suppose
que <CODE>sendmail</CODE> tourne chez vous; les possibilit&eacute;s de
configuration sont infinies. Reportez-vous &agrave; 
<A HREF="http://www.ccil.org/~esr/fetchmail">http://www.ccil.org/~esr/fetchmail</A>.</P>


<H2><A NAME="ss3.11">3.11 Syst&egrave;me de Fen&ecirc;trage X</A>
</H2>

<P>Une fois que vous avez r&eacute;ussi &agrave; faire marcher X11 (bonne
carte graphique, etc.), il existe d'inombrables possibilit&eacute;s de
configuration; cela d&eacute;pend de votre gestionnaire de
fen&ecirc;tres (window manager). Dans tous les cas, il s'agit
d'&eacute;diter un ou des fichier[s] textuel[s] de votre
r&eacute;pertoire utilisateur. Selon le gestionnaire de fen&ecirc;tres:</P>
<P>
<UL>
<LI><CODE>fvwm</CODE>: copiez /etc/X11/fvwm/system.fvwmrc
dans votre r&eacute;pertoire comme <CODE>.fvwmrc</CODE>; visualisez-le et
commencez &agrave; exp&eacute;rimenter. Le fichier <CODE>system.fvwmrc</CODE>
fourni est &agrave; mon avis un peu trop simple et ne rend pas justice
&agrave; <CODE>fvwm</CODE>.
</LI>
<LI><CODE>fvwm95-2</CODE>: copiez
/etc/X11/fvwm95-2/fvwm2rc95 dans votre r&eacute;pertoire
comme <CODE>.fvwm2rc95</CODE> puis &eacute;ditez-le. L'exemple fourni est
fort bon.
</LI>
<LI><CODE>TheNextLevel</CODE>: c'est un peu plus dur &agrave;
configurer. Copiez les fichiers /etc/X11/TheNextLevel/.*
dans votre r&eacute;pertoire. Parcourez-les attentivement, puis
essayez de les adapter. Le premier &agrave; regarder est
<CODE>.fvwm2rc.defines</CODE>.
</LI>
</UL>
</P>

<P>De plus, soyez certain d'avoir un <CODE>.xinitrc</CODE> correct. Par
exemple:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#! /bin/sh
# fichier $HOME/.xinitrc

# configurer le clavier correctement
usermodmap=$HOME/.Xmodmap
xmodmap $usermodmap

xset s noblank  # turn off the screen saver
xset s 300 2    # screen saver start after 5 min
xsetroot -solid "medium blue" &amp;

# rxvt est &eacute;conome en m&eacute;moire, mais les versions
# ant&eacute;rieures &agrave; la 2.21 souffrent de bogues affectant
# les couleurs et la r&eacute;cup&eacute;ration de l'environnement.
# Prenez une version plus r&eacute;cente ou utilisez xterm

xterm -ls -bg black -fg white -sb -sl 500 -j -ls -fn 10x20 -fb 10x20bold \
-title "xterm en Couleurs" -geometry 80x25+150+0 &amp;

fvwm95-2
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss3.12">3.12 Fortran</A>
</H2>


<P>D'apr&egrave;s moi, une bonne alternative &agrave; <CODE>g77</CODE> est le
traducteur Fortran vers C <CODE>f2c</CODE> et son interface
<CODE>yaf77</CODE>.</P>
<P>Vous pouvez obtenir <CODE>yaf77-X.Y.tgz</CODE> depuis 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/devel/languages/fortran">ftp://sunsite.unc.edu/pub/Linux/devel/languages/fortran</A> et ses
miroirs (NdT: notamment
<A HREF="ftp://ftp.lip6.fr/pub/linux/sunsite/devel/languages/fortran">ftp://ftp.lip6.fr/pub/linux/sunsite/devel/languages/fortran</A>
en France).</P>


<H2><A NAME="ss3.13">3.13 Configurations utilisateurs</A>
</H2>

<P>C'est une bonne id&eacute;e de fournir aux nouveaux utilisateurs
quelques fichiers de configurations d&eacute;j&agrave; pr&ecirc;ts
&agrave; leur premi&egrave;re connexion. Pour cela, mettez dans
<CODE>/etc/skel/</CODE> : <CODE>.bashrc</CODE>, <CODE>.bash_profile</CODE>,
<CODE>.bash_logout</CODE>, <CODE>.inputrc</CODE>, <CODE>.less</CODE>,
<CODE>.xinitrc</CODE>, <CODE>.fvwmrc</CODE>, <CODE>.fvwm2rc95</CODE>,
<CODE>.Xmodmap</CODE>, <CODE>.Xdefaults</CODE>, <CODE>.jedrc</CODE>,
<CODE>.abbrevs.sl</CODE>, <CODE>.joerc</CODE>, et <CODE>.emacs</CODE>.</P>
<P>Remarquez que <CODE>.pinerc</CODE> n'est pas compl&egrave;tement
adaptable. V&eacute;rifiez toutefois que les champs
<CODE>user-domain</CODE>, <CODE>smtp-server</CODE> et <CODE>nntp-server</CODE> y
sont corrects.</P>


<H2><A NAME="ss3.14">3.14 Mise &agrave; jour</A>
</H2>

<P>Si vous faites une mise &agrave; jour compl&egrave;te de votre
machine, pensez &agrave; sauvegarder quelques autres fichiers
auparavant, par exemple /etc/X11/XF86Config et
/usr/bin/fax.</P>


<H2><A NAME="s4">4. Fin</A></H2>

<H2><A NAME="ss4.1">4.1 Copyright</A>
</H2>

<P>Sauf indication contraire, les documents HOWTO Linux sont sous le
copyright de leurs auteurs respectifs. Les documents HOWTO Linux
peuvent &ecirc;tre reproduits et distribu&eacute;s en tout ou en
partie, sur tout medium physique ou &eacute;lectronique, tant que
cette notice de copyright y figure intacte dans tout copie. La
redistribution commerciale est permise et encourag&eacute;e;
toutefois, l'auteur souhaiterait &ecirc;tre averti de ces
distributions.</P>
<P>Toutes les traductions et oeuvres d&eacute;riv&eacute;es ou
compilations contenant tout document HOWTO Linux doivent &ecirc;tre
couvertes par cette clause de copyright. C'est-&agrave;-dire que vous
ne pouvez pas produire une oeuvre d&eacute;riv&eacute;e de ces HOWTO
et imposer des restrictions suppl&eacute;mentaires &agrave; leur
distribution; pour toute exception, veuillez contacter le coordinateur
Linux HOWTO &agrave; l'adresse ci-dessous.</P>
<P>En r&eacute;sum&eacute;, nous souhaitons promouvoir la
diffusion de cette information par tous les
canaux. N&eacute;anmoins, nous souhaitons conserver le copyright sur
les documents HOWTO, et voulons &ecirc;tre pr&eacute;venus de tous
projets de redistributions.</P>
<P>Si vous avez des questions, contacter Tim Bynum, le coordinateur 
des HOWTO Linux par courrier &eacute;lectronique &agrave;
<CODE>linux-howto@sunsite.unc.edu</CODE>.</P>


<H2><A NAME="ss4.2">4.2 R&eacute;actions</A>
</H2>

<P>Ce document n&eacute;cessite encore plus que les autres HOWTO vos
souhaits, vos suggestions, critiques et contributions. Les
r&eacute;actions sont non seulement utiles, mais
n&eacute;cessaires. Si vous pensez que quelque chose manque ici,
envoyez moi un courrier &eacute;lectronique. Si vous avez une
distribution autre que RedHat ou Caldera et que vos fichiers de
configuration sont diff&eacute;rents ou situ&eacute;s dans d'autres
r&eacute;pertoires, faites-le moi savoir et j'ajouterai vos
astuces. Mon but est de rendre Linux aussi facilement utilisable que
possible.</P>
<P>Linux comportant un tr&egrave;s grand nombre de logiciels, il est donc
impossible d'en indiquer tous les pointeurs. Veuillez restreindre vos
requ&ecirc;tes et suggestions aux programmes les plus raisonnables,
selon votre bon sens.</P>

<H2><A NAME="ss4.3">4.3 D&eacute;charge</A>
</H2>

<P>Ce <CODE>Config-HOWTO</CODE> a &eacute;t&eacute; r&eacute;dig&eacute; en
anglais par Guido Gonzato <CODE>guido@ibogfs.cineca.it</CODE> puis traduit
en fran&ccedil;ais par Basile Starynk&eacute;vitch
<CODE>Basile.Starynkevitch@cea.fr</CODE> et Arnaud Gomes-do-Vale
<CODE>gomesdv@mail.dotcom.fr</CODE>. Merci beaucoup aux autres auteurs de
HOWTO et pages de manuel, dont j'ai chapard&eacute; sans vergogne le
travail.</P>
<P>Ce document est fourni tel quel. Je l'ai &eacute;crit aussi
pr&eacute;cisement que possible, mais vous en utilisez l'information
&agrave; vos risques et p&eacute;rils. En aucun cas je ne peux
&ecirc;tre rendu responsable des dommages r&eacute;sultant de son
utilisation.</P>
<P>J'esp&egrave;re que vous trouverez ce travail utile. Quand j'installe
un nouveau syst&egrave;me Linux, il me sert!</P>

<P>Profitez-en bien!</P>

<P>Guido (l'auteur) [et Basile et Arnaud, les traducteurs].</P>

</BODY>
</HTML>
