<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Guide pratique de cryptoloop</title><link href="style.css" rel="stylesheet" type="text/css"><meta content="DocBook XSL Stylesheets V1.68.1" name="generator"><meta name="description" content="
    
        Ce document explique comment cr&eacute;er un syst&egrave;me de fichiers 
        chiffr&eacute; en utilisant les fonctionnalit&eacute;s de cryptoloop. 
        Cryptoloop est une partie du CryptoAPI des versions 2.6 des 
        noyaux Linux.
        
    "></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article" lang="fr"><div class="titlepage"><div><div><h1 class="title"><a name="Cryptoloop-HOWTO"></a>Guide pratique de cryptoloop</h1></div><div><h3 class="subtitle"><i>Version fran&ccedil;aise du guide pratique <span class="foreignphrase" lang="en"><em class="foreignphrase">Cryptoloop HOWTO</em></span></i></h3></div><div><div class="author"><h3 class="author"><span class="firstname">Ralf</span> <span class="surname">H&ouml;lzer</span></h3><code class="email">&lt;<a href="mailto:cryptoloop CHEZ ralfhoelzer POINT com">cryptoloop CHEZ ralfhoelzer POINT com</a>&gt;</code></div></div><div><p class="othercredit"><span class="contrib">Adaptation fran&ccedil;aise</span>&nbsp;: <span class="firstname">&Eacute;ric</span> <span class="surname">Madesclair</span></p></div><div><p class="othercredit"><span class="contrib">Relecture de la version fran&ccedil;aise</span>&nbsp;: <span class="firstname">Encolpe</span> <span class="surname">Degoute</span>, <span class="firstname">Bernard</span> <span class="surname">Gisbert</span></p></div><div></div><div><p class="othercredit"><span class="contrib">Pr&eacute;paration de la publication de la v.f.</span>&nbsp;: <span class="firstname">Jean-Philippe</span> <span class="surname">Gu&eacute;rard</span></p></div><div><p class="releaseinfo">Version&nbsp;: 1.2.fr.1.1</p></div><div><p class="pubdate">15 ao&ucirc;t 2005</p></div><div><div class="revhistory"><table summary="Revision history" width="100%" border="1"><tr><th colspan="3" valign="top" align="left"><b>Historique des versions</b></th></tr><tr><td align="left">Version 1.2.fr.1.1</td><td align="left">2005-08-15</td><td align="left">EM, ED, BG, JPG</td></tr><tr><td colspan="3" align="left">
      
          Quelques mises &agrave; jour mineures de pr&eacute;sentation.
      
      </td></tr><tr><td align="left">Version 1.2.fr.1.0</td><td align="left">2005-03-14</td><td align="left">EM, ED, BG, JPG</td></tr><tr><td colspan="3" align="left">
      
          Premi&egrave;re traduction fran&ccedil;aise
      
      </td></tr><tr><td align="left">Version 1.2</td><td align="left">2004-03-12</td><td align="left">RH</td></tr><tr><td colspan="3" align="left">
      
          Ajout d'information sur dm-crypt et sur la s&eacute;curit&eacute;, mise &agrave; 
          jour des informations sur loop-AES.
          
          
          
          <span class="emphasis"><em>
          
            Added information on dm-crypt, updated loop-AES info, added 
            more info on security.
          
          </em></span>
     
      </td></tr><tr><td align="left">Version 1.1</td><td align="left">2004-01-24</td><td align="left">RH</td></tr><tr><td colspan="3" align="left">
	
          Mise &agrave; jour des informations sur util-linux, Loop-AES, Best
          Crypt.
	    
          <span class="emphasis"><em>
          
            Updated information on patching util-linux, Loop-AES, Best 
            Crypt.
          
          </em></span>
     
        </td></tr><tr><td align="left">Version 1.0</td><td align="left">2004-01-17</td><td align="left">RH</td></tr><tr><td colspan="3" align="left">
        
          Premi&egrave;re version, relu par TM du LDP.

          <span class="emphasis"><em>
          
            Initial release, reviewed by TM at LDP.
            
          </em></span>
        
        </td></tr><tr><td align="left">Version 0.9</td><td align="left">2004-01-15</td><td align="left">RH</td></tr><tr><td colspan="3" align="left">
        
          Mise &agrave; jour et conversion au format DocBook XML.

          <span class="emphasis"><em>
          
            Updated and converted to DocBook XML.
          
          </em></span>
        
        </td></tr></table></div></div><div><div class="abstract"><p class="title"><b>R&eacute;sum&eacute;</b></p><p>
    
        Ce document explique comment cr&eacute;er un syst&egrave;me de fichiers 
        chiffr&eacute; en utilisant les fonctionnalit&eacute;s de cryptoloop. 
        Cryptoloop est une partie du CryptoAPI des versions 2.6 des 
        noyaux Linux.
        
    </p></div></div></div><hr></div><div class="toc"><p><b>Table des mati&egrave;res</b></p><dl><dt><span class="sect1"><a href="#about">1. &Agrave; propos de ce guide</a></span></dt><dd><dl><dt><span class="sect2"><a href="#copyright">1.1. 

Droits d'utilisation et licence

<span class="foreignphrase" lang="en"><em class="foreignphrase">

(Copyright and License)

</em></span></a></span></dt><dt><span class="sect2"><a href="#disclaimer">1.2. 

Limitations de responsabilit&eacute;

<span class="foreignphrase" lang="en"><em class="foreignphrase">

(Disclaimer)

</em></span></a></span></dt><dt><span class="sect2"><a href="#credits">1.3. Remerciements / Contributeurs</a></span></dt><dt><span class="sect2"><a href="#feedback">1.4. 

Commentaires et corrections

</a></span></dt></dl></dd><dt><span class="sect1"><a href="#cryptoloop-introduction">2. 

Introduction

</a></span></dt><dt><span class="sect1"><a href="#kernel-configuration">3. 

Configurer le noyau

</a></span></dt><dt><span class="sect1"><a href="#userspace-tools">4. 

Obtenir les outils utilisateurs

</a></span></dt><dt><span class="sect1"><a href="#loopdevice-setup">5. Configurer le p&eacute;riph&eacute;rique de boucle</a></span></dt><dt><span class="sect1"><a href="#mounting-filesystem">6. 
Monter le syst&egrave;me de fichiers chiffr&eacute;
</a></span></dt><dt><span class="sect1"><a href="#filebased">7. 
Utiliser un fichier au lieu d'une partition
</a></span></dt></dl></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="about"></a>1.&nbsp;&Agrave; propos de ce guide</h2></div></div></div><p>
        
Ce guide pratique explique comment utiliser le p&eacute;riph&eacute;rique de boucle de 
chiffrement cryptoloop avec les versions 2.6 des noyaux Linux. 
Cryptoloop permet de cr&eacute;er un syst&egrave;me de fichiers chiffr&eacute; &agrave; l'int&eacute;rieur 
d'une partition ou d'un fichier dans un autre syst&egrave;me de fichiers. Ce 
fichier chiffr&eacute; peut &ecirc;tre d&eacute;plac&eacute; sur un CD-ROM, un DVD, une clef 
m&eacute;moire USB, et c&aelig;tera. Cryptoloop utilise le p&eacute;riph&eacute;rique de boucle. Ce 
p&eacute;riph&eacute;rique est un pseudo-p&eacute;riph&eacute;rique qui sert comme une 
&laquo;&nbsp;<span class="quote">boucle</span>&nbsp;&raquo; &agrave; travers duquel chaque appel au syst&egrave;me de 
fichier doit passer. De cette fa&ccedil;on, les donn&eacute;es peuvent &ecirc;tre trait&eacute;es 
afin d'&ecirc;tre chiffr&eacute;es et d&eacute;chiffr&eacute;es. Depuis les noyaux 2.6, l'interface 
de programmation Crypto a &eacute;t&eacute; int&eacute;gr&eacute;e directement dans le noyau, et 
donc la configuration d'un syst&egrave;me de fichiers chiffr&eacute; en est rendue 
plus facile. Aucun correctif du noyau n'est n&eacute;cessaire. Par contre une 
mise &agrave; jour de certains utilitaires est requise. Malheureusement, 
l'utilisation de cryptoloop n'est pas encore bien document&eacute;e. Ce guide 
est un essai pour rendre plus facile pour tout le monde la cr&eacute;ation d'un 
syst&egrave;me de fichiers chiffr&eacute; utilisant les fonctionnalit&eacute;s standards de 
cryptoloop. Cryptoloop est bas&eacute; sur l'API Crypto des noyaux Linux 2.6. 
Il ne faut pas confondre avec Loop-AES qui est un projet totalement 
diff&eacute;rent. Cryptoloop est similaire &agrave; l'API Crypto qui &eacute;tait disponible 
comme un correctif s&eacute;par&eacute; pour les versions 2.4 du noyau. Cette nouvelle 
version n'est pas compatible avec l'ancienne.
  
</p><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="copyright"></a>1.1.&nbsp;

Droits d'utilisation et licence

<span class="foreignphrase" lang="en"><em class="foreignphrase">

(Copyright and License)

</em></span></h3></div></div></div><p>

Copyright &copy; 2004 <span class="emphasis"><em>Ralf H&ouml;lzer</em></span> pour la 
version originale.

</p><p><span class="foreignphrase" lang="en"><em class="foreignphrase">

This document, <span class="emphasis"><em>Cryptoloop HOWTO</em></span>, is copyrighted 
&copy; 2004 by <span class="emphasis"><em>Ralf H&ouml;lzer</em></span>.

</em></span></p><p>

Copyright &copy; 2005 <span class="emphasis"><em>&Eacute;ric Madesclair</em></span>, 
<span class="emphasis"><em>Encolpe Degoute</em></span> et <span class="emphasis"><em>Bernard 
Gisbert</em></span> pour la version fran&ccedil;aise.

</p><p>

Permission est donn&eacute;e de copier, distribuer ou modifier ce document 
selon les termes de la Licence de documentation libre GNU [GFDL], 
version 1.1 ou suivante, telle que publi&eacute; par la Free Software 
Foundation&nbsp;; sans sections invariables, sans texte de premi&egrave;re de 
couverture, ni texte de quatri&egrave;me de couverture. Une copie de la licence 
est disponible sur <a href="http://www.gnu.org/copyleft/fdl.html" target="_top">http://www.gnu.org/copyleft/fdl.html</a>.

</p><p><span class="foreignphrase" lang="en"><em class="foreignphrase">

Permission is granted to copy, distribute and/or modify this document 
under the terms of the GNU Free Documentation License, Version 1.1 or 
any later version published by the Free Software Foundation; with no 
Invariant Sections, with no Front-Cover Texts, and with no Back-Cover 
Texts. A copy of the license is available at <a href="http://www.gnu.org/copyleft/fdl.html" target="_top">http://www.gnu.org/copyleft/fdl.html</a>.

</em></span></p><p>

Linux est une marque d&eacute;pos&eacute;e de Linus Torvalds.

</p><p><span class="foreignphrase" lang="en"><em class="foreignphrase">

Linux is a registered trademark of Linus Torvalds.

</em></span></p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="disclaimer"></a>1.2.&nbsp;

Limitations de responsabilit&eacute;

<span class="foreignphrase" lang="en"><em class="foreignphrase">

(Disclaimer)

</em></span></h3></div></div></div><p>

Aucune responsabilit&eacute; pour le contenu de ces documents ne pourra &ecirc;tre 
accept&eacute;e. Utilisez les concepts, exemples et autre contenu &agrave; vos propres 
risques. Il peut y avoir des erreurs et des impr&eacute;cisions, qui peuvent 
bien entendu endommager votre syst&egrave;me. Proc&eacute;dez avec pr&eacute;caution, et bien 
que ce soit hautement improbable, l'auteur n'en acceptera aucune 
responsabilit&eacute;.

</p><p><span class="foreignphrase" lang="en"><em class="foreignphrase">

No liability for the contents of this document can be accepted. Use the 
concepts, examples and information at your own risk. There may be errors 
and inaccuracies, that could be damaging to your system. Proceed with 
caution, and although this is highly unlikely, the author(s) do not take 
any responsibility.

</em></span></p><p>

Tous les droits d'auteur sont d&eacute;tenus par leurs propri&eacute;taires 
respectifs, sauf mention contraire expresse. L'utilisation d'un terme 
dans ce document ne doit pas &ecirc;tre vue comme affectant la valeur d'une 
marque de fabrique ou d'une marque de service. La mention de produits 
particuliers ou de marques ne doit pas &ecirc;tre consid&eacute;r&eacute;e comme un acte 
d'approbation.

</p><p><span class="foreignphrase" lang="en"><em class="foreignphrase">

All copyrights are held by their by their respective owners, unless 
specifically noted otherwise. Use of a term in this document should not 
be regarded as affecting the validity of any trademark or service mark. 
Naming of particular products or brands should not be seen as 
endorsements. 

</em></span></p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="credits"></a>1.3.&nbsp;Remerciements / Contributeurs</h3></div></div></div><p>

Je remercie les personnes suivantes pour l'aide qu'elles m'ont apport&eacute; 
dans la r&eacute;daction de ce guide&nbsp;:

</p><div class="itemizedlist"><ul type="disc"><li><p>Dennis Kaledin</p></li><li><p>Binh Nguyen</p></li><li><p>David Lawyer</p></li><li><p>Tabatha Marshall</p></li><li><p>Kian Spongsveen</p></li></ul></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="feedback"></a>1.4.&nbsp;

Commentaires et corrections

</h3></div></div></div><p>

Les r&eacute;actions sur ce document sont les bienvenues. Envoyez en anglais 
vos ajouts, commentaires et critiques &agrave; l'adresse suivante&nbsp;:

<code class="email">&lt;<a href="mailto:cryptoloop CHEZ ralfhoelzer POINT com">cryptoloop CHEZ ralfhoelzer POINT com</a>&gt;</code>.

</p><p>

N'h&eacute;sitez pas &agrave; faire parvenir tout commentaire relatif &agrave; la version 
fran&ccedil;aise de ce document &agrave;

<code class="email">&lt;<a href="mailto:commentaires CHEZ traduc POINT org">commentaires CHEZ traduc POINT org</a>&gt;</code>

en pr&eacute;cisant son titre, sa date et sa version.

</p></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="cryptoloop-introduction"></a>2.&nbsp;

Introduction

</h2></div></div></div><p>

Il existe plusieurs alternatives &agrave; l'utilisation de cryptoloop. Loop-AES 
(<a href="http://loop-aes.sourceforge.net" target="_top">http://loop-aes.sourceforge.net</a>) est probablement le 
plus connu. Il fournit des fonctions similaires &agrave; cryptoloop. Aes-loop 
est probablement plus mature que cryptoloop et est aussi plus rapide 
(environ deux fois plus rapide, selon l'auteur de loop-AES) parce qu'il 
utilise une impl&eacute;mentation hautement optimis&eacute;e d'un assembleur pour AES. 
Cela ne veut pas dire que cryptoloop est lent. Je n'ai pas not&eacute; de 
diff&eacute;rence significative de vitesse entre une partition chiffr&eacute;e avec 
cryptoloop et une partition non chiffr&eacute;e durant mon travail avec un 
nombre normal d'entr&eacute;e/sortie (I/O). A moins que les performances I/O 
soient extr&ecirc;mement importantes pour vous, cryptoloop est suffisant. 
Loop-AES offre certaines fonctionnalit&eacute;s qui ne sont pas encore 
pr&eacute;sentes dans l'impl&eacute;mentation noyau de cryptoloop. Loop-AES demande de 
modifier certains utilitaires utilisateur (mount, losetup) et ces 
modifications sont incompatibles avec une utilisation de cryptoloop. 
Vous ne pouvez pas utiliser cryptoloop et Loop-AES en m&ecirc;me temps.

</p><p>

En terme de s&eacute;curit&eacute;, cryptoloop est bon. La clef est g&eacute;n&eacute;ralement cr&eacute;&eacute;e 
depuis un mot de passe et un hachage de cette clef est utilis&eacute; comme 
pour les clefs AES. Ce qui laisse la possibilit&eacute; d'une <a href="http://lwn.net/Articles/67216/" target="_top">attaque &agrave; texte clair connu</a> 
(&laquo;&nbsp;<span class="quote"><span class="foreignphrase" lang="en"><em class="foreignphrase">known-plaintext 
attack</em></span></span>&nbsp;&raquo;). Loop-AES est de ce point de vue 
sup&eacute;rieur, parce qu'il g&eacute;n&egrave;re une clef al&eacute;atoire et chiffre cette cl&eacute; 
s&eacute;par&eacute;ment, rendant une attaque par texte clair connu plus difficile. 
Loop-AES utilise aussi un mode &agrave; plusieurs clefs, o&ugrave; chaque secteur est 
chiffr&eacute; avec 64 clefs AES diff&eacute;rentes. En g&eacute;n&eacute;ral, une attaque sur votre 
mot de passe peut r&eacute;ussir, si vous choisissez un mot de passe trop 
simple. Pour &ecirc;tre s&eacute;curis&eacute;, votre mot de passe doit avoir au moins 20 
caract&egrave;res. Cependant une attaque par force brute sur votre mot de passe 
sera sans doute plus facile que d'essayer directement sur les donn&eacute;es 
chiffr&eacute;es par AES.

</p><p>

Les fonctionnalit&eacute;s de cryptoloop dans le noyau standard fournissent une 
impl&eacute;mentation stable et propre	sans avoir besoin de rajouter des 
correctifs. Puisqu'il est encore r&eacute;cent, il peut ne pas avoir 
suffisamment de critique en terme de s&eacute;curit&eacute;. Vous devez d&eacute;cider par 
vous-m&ecirc;me ce qui vous convient.

</p><div class="important" style="margin-left: 0.5in; margin-right: 0.5in;"><table border="0" summary="Important"><tr><td valign="top" align="center" rowspan="2" width="25"><img alt="[Important]" src="images/important.png"></td><th align="left">Important</th></tr><tr><td valign="top" align="left"><p>

Cryptoloop est consid&eacute;r&eacute; comme obsol&egrave;te dans les derniers noyaux 2.6. Il 
semble qu'il ne sera plus maintenu encore longtemps. Le successeur de 
cryptoloop sera <a href="http://www.saout.de/misc/dm-crypt/" target="_top"> 
dm-crypt</a>. Dm-crypt est disponible dans le noyau principal 2.6.4. 
Cryptoloop sera encore disponible dans le noyau pendant encore quelque 
temps, mais dm-crypt devrait devenir la m&eacute;thode choisit pour le 
chiffrement des disques durs dans le futur. Dm-crypt est bas&eacute; sur le 
device mapper et offre plus ou moins les m&ecirc;me fonctionnalit&eacute;s que 
cryptoloop. Il est encore tr&egrave;s r&eacute;cent et il existe encore peu d'outils 
utilisateur simples, disponibles. Le code de dm-crypt est consid&eacute;r&eacute; 
comme plus propre que celui de cryptoloop, il existe des diff&eacute;rences 
notables entre les deux. Par exemple, la cr&eacute;ation d'un syst&egrave;me de 
fichiers chiffr&eacute; autrement que dans un fichier, n&eacute;cessite encore de 
passer par un p&eacute;riph&eacute;rique de boucle, mais la gestion est encore en 
d&eacute;veloppement.

</p></td></tr></table></div><p>

Il existe d'autres outils vous permettant de cr&eacute;er un syst&egrave;me de 
fichiers chiffr&eacute;s. BestCrypt est un produit commercial de Jetico. Il 
vous permet de cr&eacute;er un r&eacute;cipient chiffr&eacute; et d'utiliser un large 
&eacute;ventail d'algorithme de chiffrement. Il offre &eacute;galement certains 
dispositifs ing&eacute;nieux tels que les r&eacute;cipients cach&eacute;s. Il est disponible 
pour les syst&egrave;mes Windows et Linux, ce qui fait qu'il est pr&eacute;f&eacute;rable 
pour l'&eacute;change de r&eacute;cipient chiffr&eacute; entre Window et Linux. BestCrypt se 
compile maintenant tr&egrave;s bien sur les noyaux 2.6. Cryptoloop peut 
&eacute;galement cr&eacute;er des r&eacute;cipients pouvant &ecirc;tre d&eacute;plac&eacute;s, en cr&eacute;ant un 
syst&egrave;me de fichiers chiffr&eacute; dans un fichier comme d&eacute;crit ci-dessous. Je 
ne sais pas comment acc&eacute;der &agrave; un fichier chiffr&eacute; avec cryptoloop depuis 
un autre syst&egrave;me d'exploitation comme Windows. Dans ce cas, BestCrypt 
est peut &ecirc;tre votre seul choix.

</p><p>

Il existe d'autres outils commerciaux de chiffrement de disque comme 
PGP, mais &agrave; ma connaissance il n'y a pas de support Linux pour eux.

</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="kernel-configuration"></a>3.&nbsp;

Configurer le noyau

</h2></div></div></div><p>

Avant de pouvoir utiliser cryptoloop, vous devez activer certaines 
options dans le noyau. Vous avez la possibilit&eacute; de compiler cryptoloop 
comme module ou alors directement dans le noyau. Les &eacute;tapes suivantes 
activeront cryptoloop en tant que module. Si vous n'&ecirc;tes pas familiaris&eacute; 
avec la compilation d'un noyau 2.6, vous devriez consulter le <a href="http://www.traduc.org/docs/howto/lecture/Kernel-HOWTO.html" target="_top">Guide pratique du noyau 
Linux</a><sup>[<a href="#ftn.N1013C" name="N1013C">1</a>]</sup>. Les instructions suivantes pr&eacute;sentent seulement les 
principales &eacute;tapes de la compilation du noyau.

</p><div class="orderedlist"><ol type="1"><li><p>

Allez dans le r&eacute;pertoire contenant l'arborescence des sources du noyau 
(g&eacute;n&eacute;ralement <code class="filename">/usr/src/linux/</code>) et commencez la 
configuration&nbsp;:

</p><pre class="screen">
make menuconfig
</pre></li><li><p>

Activez la gestion du p&eacute;riph&eacute;rique de boucle. Cochez &laquo;&nbsp;<span class="quote">Loopback 
device support</span>&nbsp;&raquo; sous&nbsp;:

</p><pre class="screen">
Device Drivers -&gt; Block Devices -&gt; Loopback device support
</pre></li><li><p>

Dans la m&ecirc;me section activez la gestion de cryptoloop. Cette option 
devient accessible d&egrave;s que vous avez activ&eacute; la gestion du p&eacute;riph&eacute;rique 
de bouclage.

</p></li><li><p>

Activez l'API cryptographic en allant dans le menu &laquo;&nbsp;<span class="quote">Cryptographic 
options</span>&nbsp;&raquo; depuis le menu principal. Vous pouvez sans risque 
choisir la plupart des algorithmes ici. Je vous recommande d'activer les 
suivants&nbsp;:

</p><pre class="screen">
-- Cryptographic API
 &lt;*&gt;   HMAC support  
 &lt; &gt;   Null algorithms
 &lt;*&gt;   MD4 digest algorithm
 &lt;*&gt;   MD5 digest algorithm
 &lt;*&gt;   SHA1 digest algorithm
 &lt;*&gt;   SHA256 digest algorithm
 &lt;*&gt;   SHA384 and SHA512 digest algorithms
 &lt;*&gt;   DES and Triple DES EDE cipher algorithms
 &lt;*&gt;   Blowfish cipher algorithm
 &lt;*&gt;   Twofish cipher algorithm
 &lt;*&gt;   Serpent cipher algorithm 
 &lt;*&gt;   AES cipher algorithms
 &lt;*&gt;   CAST5 (CAST-128) cipher algorithm
 &lt;*&gt;   CAST6 (CAST-256) cipher algorithm 
 &lt;*&gt;   Deflate compression algorithm
 &lt; &gt;   Testing module
</pre><p>

Si vous avez d&eacute;cid&eacute; de les compiler en module, assurez-vous de charger 
les modules appropri&eacute;s (cryptoloop, aes, et c&aelig;tera) au d&eacute;marrage avant de 
continuer.

</p></li><li><p>

Construisez le noyau et les modules et installez les. Par exemple, si 
vous utilisez lilo sur une machine x86, vous pouvez tapez les commandes 
suivantes&nbsp;:

</p><pre class="screen">
make
make modules_install
cp arch/i386/boot/bzImage /boot/kernel-2.6.1
lilo
</pre></li><li><p>

Chargez les modules n&eacute;cessaires au d&eacute;marrage. Cela peut &ecirc;tre fait de 
diff&eacute;rente fa&ccedil;on suivant les distributions. Par exemple sur la 
distribution Gentoo, les modules peuvent &ecirc;tre ajout&eacute;s dans le fichier 
<code class="filename">/etc/modules.autoload/kernel-2.6</code>. Si vous avez 
compil&eacute; cryptoloop en tant que module, il doit &ecirc;tre charg&eacute; en premier. 
Le module du p&eacute;riph&eacute;rique de boucle sera alors automatiquement charg&eacute;. 
Vous pouvez aussi charger manuellement le module avec la commande 
suivante&nbsp;:

</p><pre class="screen">
modprobe cryptoloop
</pre></li></ol></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="userspace-tools"></a>4.&nbsp;

Obtenir les outils utilisateurs

</h2></div></div></div><p>

Le pilote cryptoloop demande une mise &agrave; jour des outils utilisateur pour 
pouvoir cr&eacute;er et monter le syst&egrave;me de fichiers chiffr&eacute;. Une mise &agrave; jour 
du paquet util-linux est n&eacute;cessaire et peut &ecirc;tre obtenu &agrave; l'adresse 
suivante&nbsp;: <a href="http://ftp.cwi.nl/aeb/util-linux/util-linux-2.12.tar.gz" target="_top">http://ftp.cwi.nl/aeb/util-linux/util-linux-2.12.tar.gz</a>. La 
version la plus r&eacute;cente est la version 2.12. Il y aura s&ucirc;rement de 
nouvelles versions introduisant probablement des changements majeurs. 
Pour &ecirc;tre s&ucirc;r vous devriez v&eacute;rifier les mises &agrave; jours de ce guide 
pratique avant de mettre &agrave; jour vers une version plus r&eacute;cente. 
Malheureusement, il existe plusieurs correctifs pour le paquet 
util-linux. Il y a diff&eacute;rentes fa&ccedil;ons de cr&eacute;er et de monter une 
partition chiffr&eacute;e. Afin d'utiliser la version 2.12 de l'utilitaire 
util-linux avec un noyau 2.6, les deux correctifs suivants doivent &ecirc;tre 
appliqu&eacute;s&nbsp;:

</p><div class="orderedlist"><ol type="1"><li><p>

<a href="http://www.paranoiacs.org/~sluskyb/hacks/util-linux/losetup-combined.patch" target="_top">Correctif 
combin&eacute; losetup&nbsp;: 
<code class="filename">losetup-combined.patch</code></a>

</p></li><li><p>

<a href="http://www.ece.cmu.edu/~rholzer/cryptoloop/util-linux-2.12-kernel-2.6.patch" target="_top">Correctif 
util-linux 2.6&nbsp;: 
<code class="filename">util-linux-2.12-kernel-2.6.patch</code></a>

</p></li></ol></div><p>

T&eacute;l&eacute;chargez le paquetage util-linux et les deux correctifs disponibles.	
Premi&egrave;rement extraire l'archive util-linux et appliquez les 
correctifs&nbsp;:

</p><pre class="screen">
tar xvfz util-linux-2.12.tar.gz

cd util-linux-2.12

patch -p1 &lt; /chemin_vers_le_correctif/losetup-combined.patch

patch -p1 &lt; /chemin_vers_le_correctif/util-linux-2.12-kernel-2.6.patch
</pre><p>

Apr&egrave;s avoir appliqu&eacute; les correctifs, compilez et installez util-linux en 
suivant les instructions du fichier <code class="filename">INSTALL</code>.

</p><p>

Je recommande d'utiliser le <a href="http://gentoo.org" target="_top">Linux 
Gentoo</a>, car ces correctifs sont automatiquement appliqu&eacute;s quand 
apparaissent les correctifs pour util-linux. D'autres distributions 
peuvent avoir aussi des versions de util-linux disponibles et avoir 
aussi appliqu&eacute; ces correctifs.

</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="loopdevice-setup"></a>5.&nbsp;Configurer le p&eacute;riph&eacute;rique de boucle</h2></div></div></div><p>

Cryptoloop peut aussi bien &ecirc;tre utilis&eacute; sur un fichier que sur un 
syst&egrave;me de fichiers entier. La suite d&eacute;crit la fa&ccedil;on de le configurer 
sur une partition particuli&egrave;re. cette partition peut &ecirc;tre n'importe 
quelle partition que vous d&eacute;sirez, l'exemple utilis&eacute; dans la suite est 
<code class="filename">/dev/sda1</code>. J'ai choisit d'utiliser l'algorithme de 
chiffrement AES, mais vous pouvez le remplacer par n'importe quel autre 
algorithme activ&eacute; dans votre noyau. Vous pouvez obtenir une liste de 
tous les algorithmes g&eacute;r&eacute;s par votre noyau actuel en &eacute;ditant le fichier 
<code class="filename">/proc/crypto</code>. Le livre de Bruce Scheier, 
<span class="foreignphrase" lang="en"><em class="foreignphrase">Applied Cryptography and Practical 
Cryptography</em></span>, est un excellent ouvrage pr&eacute;sentant les 
diff&eacute;rents algorithmes de chiffrement. Les algorithmes AES et Serpent 
sont probablement le choix le plus raisonnable. AES a &eacute;t&eacute; beaucoup 
utilis&eacute; pour le chiffrement et aucune vuln&eacute;rabilit&eacute; s&eacute;rieuse n'a &eacute;t&eacute; 
trouv&eacute;e depuis longtemps. Serpent n'a pas encore &eacute;t&eacute; beaucoup analys&eacute;, 
mais il est consid&eacute;r&eacute; &ecirc;tre un peu plus s&eacute;curis&eacute; que AES. Cependant, 
Serpent est par contre plus lent que AES. N'utilisez pas DES, il est le 
plus lent et le moins s&eacute;curis&eacute;. Triple-Des peut aussi &ecirc;tre une 
possibilit&eacute;, mais AES est probablement plus s&eacute;curis&eacute; et plus rapide, 
donc il n'existe pas r&eacute;ellement de raison d'utiliser triple-DES.

</p><div class="orderedlist"><ol type="1"><li><p>

Il est recommand&eacute; de formater la partition et de la remplir avec des 
donn&eacute;es al&eacute;atoires avant de cr&eacute;er le syst&egrave;me de fichiers chiffr&eacute; dessus. 
Ce qui rendra plus difficile &agrave; un pirate la d&eacute;tection des signatures 
dans votre partition chiffr&eacute;e.

</p><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><table border="0" summary="Warning: Attention&nbsp;!"><tr><td valign="top" align="center" rowspan="2" width="25"><img alt="[Avertissement]" src="images/warning.png"></td><th align="left">Attention&nbsp;!</th></tr><tr><td valign="top" align="left"><p>

Faite tr&egrave;s attention au nom de la partition que vous inscrivez. Si vous 
faites une erreur, vous pouvez facilement &eacute;craser une autre partition 
avec des donn&eacute;es al&eacute;atoires.

</p></td></tr></table></div><p>

Une partition remplie avec des donn&eacute;es al&eacute;atoires peut &ecirc;tre obtenue 
gr&acirc;ce &agrave; la commande suivante&nbsp;:

</p><pre class="screen">
dd if=/dev/urandom of=/dev/sda1 bs=1M
</pre><p>

Vous pouvez avoir un message d'erreur indiquant que le p&eacute;riph&eacute;rique est 
plein. Vous pouvez l'ignorer.

</p></li><li><p>

S&eacute;lectionnez un algorithme et une taille de clef. Une liste 
d'algorithmes g&eacute;r&eacute;e par votre noyau peut &ecirc;tre obtenu depuis	le 
fichier <code class="filename">/proc/crypto</code>. Je recommande l'utilisation 
de AES avec une clef de 256 bits.

</p></li><li><p>

Configurez le p&eacute;riph&eacute;rique de boucle. Vous pouvez utiliser la commande 
<span><strong class="command">losetup</strong></span> provenant du paquet util-linux. La commande 
suivante cr&eacute;e un syst&egrave;me de fichiers chiffr&eacute; sur le p&eacute;riph&eacute;rique de 
boucle	0 en utilisant l'algorithme de chiffrage AES avec une clef 
de 256 bits sur le p&eacute;riph&eacute;rique <code class="filename">/dev/sda1</code>&nbsp;:

</p><pre class="screen">
losetup -e aes-256 /dev/loop0 /dev/sda1
</pre><p>

La commande vous demandera un mot de passe. Choisissez un mot de passe 
robuste et essayez de vous en souvenir sans utiliser un post-it coll&eacute; &agrave; 
votre moniteur. C'est le mauvais c&ocirc;t&eacute; de l'utilisation de cryptoloop. 
Puisque le mot de passe est hach&eacute; pour cr&eacute;er la clef de chiffrement, il 
n'est pas facile apr&egrave;s de changer de mot de passe. La meilleur mani&egrave;re 
de changer un mot de passe est de cr&eacute;er une nouvelle partition ou un 
nouveau fichier chiffr&eacute; et de d&eacute;placer toute les donn&eacute;es dessus. Pour 
cette raison, soyez s&ucirc;r de choisir un mot de passe robuste d&egrave;s le d&eacute;but. 
AES peut &ecirc;tre un algorithme de chiffrement tr&egrave;s robuste, mais si vous 
choisissez un mauvais mot de passe, alors la s&eacute;curit&eacute; ne sera pas bonne.

</p><p>

Si la commande <span><strong class="command">losetup</strong></span> &eacute;choue avec le message 
d'erreur <code class="computeroutput">INVALID ARGUMENT</code>, le probl&egrave;me 
vient du paquet util-linux. Assurez-vous d'avoir suivi les instructions 
pr&eacute;c&eacute;dentes sur la fa&ccedil;on d'installer le correctif pour util-linux. Les 
anciennes versions ainsi que les versions non corrig&eacute;s utilisent une 
m&eacute;thode diff&eacute;rente pour passer la taille de la clef et ne fonctionnent 
pas avec l'API Crypto 2.6.

</p></li><li><p>

Cr&eacute;ez un syst&egrave;me de fichier. Vous pouvez choisir le type de syst&egrave;me de 
fichier que vous souhaitez. L'exemple suivant cr&eacute;e un syst&egrave;me de 
fichiers ext3 sur le p&eacute;riph&eacute;rique de boucle&nbsp;:

</p><pre class="screen">
mkfs.ext3 /dev/loop0
</pre></li><li><p>

Montez le syst&egrave;me de fichiers chiffr&eacute;. Premi&egrave;rement vous devez cr&eacute;er un 
point de montage, par exemple <code class="filename">/mnt/crypto</code>&nbsp;:
	
</p><pre class="screen">
mkdir /mnt/crypto
</pre><p>

Ensuite vous devez monter le syst&egrave;me de fichiers. &Agrave; ce niveau, vous 
devez indiquer explicitement &agrave; la commande mount le p&eacute;riph&eacute;rique de 
boucle utilis&eacute;&nbsp;:

</p><pre class="screen">
mount -t ext3 /dev/loop0 /mnt/crypto
</pre></li><li><p>

Vous pouvez maintenant jouer avec votre fichier chiffr&eacute; jusqu'&agrave; l'ennui.

</p></li><li><p>

D&eacute;montez le syst&egrave;me de fichiers. Apr&egrave;s avoir suffisamment jou&eacute; avec, 
d&eacute;montez le syst&egrave;me de fichiers&nbsp;:

</p><pre class="screen">
umount /mnt/crypto
</pre></li><li><p>

D&eacute;tachez le p&eacute;riph&eacute;rique de boucle. Le p&eacute;riph&eacute;rique de boucle est encore 
attach&eacute; &agrave; votre partition, d&eacute;tachez le avec la commande&nbsp;:

</p><pre class="screen">
losetup -d /dev/loop0
</pre></li></ol></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="mounting-filesystem"></a>6.&nbsp;
Monter le syst&egrave;me de fichiers chiffr&eacute;
</h2></div></div></div><p>

Pour toutes les op&eacute;rations sur le p&eacute;riph&eacute;rique cryptoloop, il est 
important que les modules n&eacute;cessaires soient charg&eacute;s. Vous avez besoin 
de charger au moins le module cryptoloop et les modules pour chaque 
algorithme de chiffrement avec la commande <span><strong class="command">modprobe</strong></span>. 
Si les options ont &eacute;t&eacute; compil&eacute;es directement dans le noyau, alors ce 
n'est pas n&eacute;cessaire.

</p><p>

Afin de monter le syst&egrave;me de fichiers chiffr&eacute; cr&eacute;&eacute; ci-dessus, vous 
pouvez employer la commande <span><strong class="command">mount</strong></span> du paquet 
util-linux.

</p><pre class="screen">
mount -t ext3 /dev/sda1 /mnt/crypto/ -o encryption=aes-256
</pre><p>

Le mot de passe vous sera demand&eacute; et ensuite le syst&egrave;me de fichiers sera 
mont&eacute; comme n'importe quel autre. L'option &laquo;&nbsp;<span class="quote">encryption</span>&nbsp;&raquo; 
indique que le p&eacute;riph&eacute;rique contient un syst&egrave;me de fichiers chiffr&eacute;, la 
s&eacute;lection du p&eacute;riph&eacute;rique de boucle se fera automatiquement parmi les 
p&eacute;riph&eacute;riques disponibles.

</p><p>

Quand vous aurez fini de travailler, vous pouvez le d&eacute;monter avec la 
commande&nbsp;:

</p><pre class="screen">
umount /mnt/crypto
</pre><p>

Vous pouvez ajouter la ligne suivante dans le fichier 
<code class="filename">/etc/fstab</code>&nbsp;:

</p><pre class="screen">
/dev/sda1               /mnt/crypto     ext3            noauto,encryption=aes-256       0 0
</pre><p>

Maintenant vous pouvez simplement monter le p&eacute;riph&eacute;rique avec&nbsp;:

</p><pre class="screen">
mount /mnt/crypto
</pre><p>

C'est tout. Amusez-vous.

</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="filebased"></a>7.&nbsp;
Utiliser un fichier au lieu d'une partition
</h2></div></div></div><p>

Il est tr&egrave;s facile de cr&eacute;er un syst&egrave;me de fichiers chiffr&eacute; directement &agrave; 
l'int&eacute;rieur d'un fichier. Ceci est particuli&egrave;rement int&eacute;ressant, si vous 
souhaitez sauvegarder ce fichier sur un DVD, ou sur tout autre m&eacute;dia. Il 
vous sera aussi tr&egrave;s facile de d&eacute;placer ce fichier sur d'autres 
machines.

</p><p>

Pour commencer, cr&eacute;ez un fichier de 100&nbsp;Mo contenant des donn&eacute;es 
al&eacute;atoires en utilisant la commande suivante&nbsp;:

</p><pre class="screen">
dd if=/dev/urandom of=/mestrucs.aes bs=1k count=100000
</pre><p>

Si vous souhaitez changer la taille du fichier, changez la valeur de 
<code class="varname">count</code>. La commande pr&eacute;c&eacute;dente cr&eacute;e 
100&nbsp;000&nbsp;blocs d'une taille de 1&nbsp;ko, mais vous pouvez 
mettre la valeur que vous d&eacute;sirez. Assurez-vous juste qu'elle ne soit 
pas trop petite et qu'il pourra contenir le syst&egrave;me de fichiers que vous 
avez choisi. Vous pouvez remplacer <code class="filename">/mestrucs.aes</code> 
par n'importe quel nom de fichier du moment que vous avez suffisamment 
de place libre sur la partition.

</p><p>

Vous pouvez cr&eacute;er le syst&egrave;me de fichiers chiffr&eacute; dans ce fichier, de la 
m&ecirc;me fa&ccedil;on que nous l'avons fait pr&eacute;c&eacute;demment&nbsp;:

</p><pre class="screen">
losetup -e aes-256 /dev/loop0 /mestrucs.aes
</pre><p>

Maintenant cr&eacute;ez le syst&egrave;me de fichiers&nbsp;:

</p><pre class="screen">
mkfs.ext3 /dev/loop0
</pre><p>

et montez le&nbsp;:

</p><pre class="screen">
mount -t ext3 /dev/loop0 /mnt/crypto
</pre><p>

Pour finir, d&eacute;montez et d&eacute;tachez le p&eacute;riph&eacute;rique de boucle&nbsp;

</p><pre class="screen">
umount /mnt/crypto
losetup -d /dev/loop0
</pre><p>

Vous pourrez alors monter le syst&egrave;me de fichiers plus tard avec la 
commande&nbsp;:

</p><pre class="screen">
mount /mestrucs.aes /mnt/crypto -oencryption=aes-256
</pre><p>

Si vous souhaitez d&eacute;placer le fichier ou le graver sur un CD-ROM ou un 
DVD, assurez-vous qu'il ait bien &eacute;t&eacute; <span class="emphasis"><em>d&eacute;mont&eacute;</em></span> avant.

</p></div><div class="footnotes"><br><hr align="left" width="100"><div class="footnote"><p><sup>[<a href="#N1013C" name="ftn.N1013C">1</a>] </sup>



N.D.T.&nbsp;: ce document est obsol&egrave;te. Un document de remplacement est 
en cours de pr&eacute;paration par le Projet de documentation Linux (LDP).

En attendant, vous pouvez consulter l'article de la Gazette Linux 
&laquo;&nbsp;<span class="quote">Compiler le noyau Linux</span>&nbsp;&raquo; ou le <a href="http://www.digitalhermit.com/~kwan/kernel.html" target="_top">Guide pratique de 
reconstruction du noyau Linux</a> (en anglais) de Kwan Lowe.



</p></div></div></div></body></html>