<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>ftape-HOWTO</TITLE>
</HEAD>
<BODY>
<H1>ftape-HOWTO</H1>

<H2>Kai Harrekilde-Petersen, <CODE>khp@login.dkuug.dk</CODE></H2>Derni&egrave;re mise &agrave; jour 17 juillet 1994 pour ftape-1.13b
<HR>
<EM>Ce HOWTO pr&eacute;sente l'essentiel de ce qu'il faut faire et ne pas faire
pour utiliser avec succ&egrave;s le pilote ("driver") <CODE>ftape</CODE> sous
Linux. Le pilote <CODE>ftape</CODE> g&egrave;re uniquement les lecteurs
compatibles aux normes QIC-80 et QIC-40. Ces lecteurs de bandes se
connectent au contr&ocirc;leur du lecteur de disquettes (par exemple &agrave; la
place d'un second lecteur). En revanche, il ne g&egrave;re
<B>pas</B> les lecteurs de bandes SCSI ou QIC-02, ni les lecteurs de
type DAT qui se connectent en g&eacute;n&eacute;ral (toujours?) &agrave; un contr&ocirc;leur
SCSI.
Ceci n'est qu'un des diff&eacute;rents HOWTOs disponibles pour
Linux. Vous pouvez obtenir la s&eacute;rie compl&egrave;te &agrave; partir de 
<A HREF="http://sunsite.unc.edu/mdw/linux.hmtl">The Linux Documentation home page</A>.
Ce HOWTO a &eacute;t&eacute; traduit de l'anglais par Lo&iuml;c
PRYLLI, <CODE>lprylli@lip.ens-lyon.fr</CODE>, derni&egrave;re mise &agrave; jour 2 septembre 1994.</EM>
<HR>
<H2><A NAME="s1">1. Droits de diffusion</A></H2>

<P>Ceci constitue le `Frequently Asked Questions' (FAQ) / HOWTO guide
pour l'interface <CODE>ftape</CODE> (ftape-HOWTO), Copyright (C) 1993,1994 Kai
Harrekilde-Petersen.</P>
<P><B>Copyright&nbsp;:</B></P>
<P>Ce document peut &ecirc;tre librement diffus&eacute; <B>en entier</B>, sous
n'importe quelle forme et gratuitement. Une diffusion partielle est
autoris&eacute;e, &agrave; condition de conserver le message de copyright, et
d'inclure une note pr&eacute;cisant que ce n'est pas la version int&eacute;grale et
indiquant o&ugrave; obtenir le guide complet. Sous les m&ecirc;mes conditions, ce
document peut &ecirc;tre inclus dans une distribution commerciale, sans
accord pr&eacute;alable. L'auteur aimerait cependant &ecirc;tre inform&eacute; d'un tel
usage.</P>
<P>Ce HOWTO peut &ecirc;tre traduit dans n'importe quel langage, &agrave; condition
que la notice de copyright et les r&eacute;serves d'utilisation soient
pr&eacute;serv&eacute;es intactes, et qu'une note stipulant le traducteur soit
ajout&eacute;e.</P>
<P><B>R&eacute;serves pour l'utilisation&nbsp;:</B></P>
<P>Bien que des efforts aient &eacute;t&eacute; faits pour fournir une information
aussi correcte et &agrave; jour que possible, il est possible que
l'usage des informations de ce document puisse conduire &agrave; une perte
de donn&eacute;es. AUCUNE GARANTIE n'est fournie en ce qui concerne
l'information fournie par ce guide, et l'auteur ne peut pas &ecirc;tre tenu
pour responsable de quelque cons&eacute;quence que ce soit pour tout dommage
r&eacute;sultant de l'utilisation de ce guide.</P>


<H2><A NAME="s2">2. Pr&eacute;liminaires</A></H2>



<H2><A NAME="ss2.1">2.1 La version la plus r&eacute;cente de ftape - et o&ugrave; l'obtenir</A>
</H2>


<P>A l'&eacute;criture de ce guide, ftape-1.13b est la version plus r&eacute;cente du
pilote ftape, et peut &ecirc;tre rapatri&eacute;e &agrave; partir des sites suivants&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    tsx-11.mit.edu   [18.172.1.2]: /pub/linux/ALPHA/QIC-80/
    sunsite.unc.edu [152.2.22.81]: /pub/Linux/kernel/tapes/
    ftp.funet.fi  [128.214.248.6]: /pub/OS/Linux/BETA/QIC-80/
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Vous devez obtenir les fichiers suivants&nbsp;: <CODE>ftape-1.13b.tar.gz</CODE>,
<CODE>ftape-1.13b.lsm</CODE> et <CODE>modules.tar.gz</CODE>.  Le fichier
<CODE>ftape-1.13b</CODE> est le pilote proprement dit, le fichier
<CODE>.lsm</CODE> est un fichier "Linux Software Map (LSM)" utilis&eacute; dans
le cadre du projet LSM, et le fichier <CODE>modules</CODE> contient un
ensemble d'utilitaires permettant de charger des pilotes
dynamiquement.
Note&nbsp;: si vous poss&eacute;dez une version ancienne des modules, par exemple
les utilitaires <CODE>modutils-0.99.14.tar.gz</CODE> ou
<CODE>modutils-0.99.15.tar.gz</CODE>, vous allez probablement avoir besoin de
vous mettre &agrave; jour.</P>



<H2><A NAME="ss2.2">2.2 D&eacute;veloppement du pilote ftape</A>
</H2>

<P>Si vous voulez suivre le d&eacute;veloppement du pilote ftape, envisagez de
souscrire &agrave; la rubrique TAPE sur la liste de distribution
(mailing-list) Linux-activists. Pour ce faire, envoyez un courrier
&eacute;lectronique (e-mail) &agrave;
<CODE>&lt;linux-activists-request@niksula.hut.fi&gt;</CODE>, en mettant sur
la premi&egrave;re ligne (ou dans l'en-t&ecirc;te) `<CODE>X-Mn-Admin: join
tape</CODE>'. Si vous envoyez un message vide (ou si le syst&egrave;me
automatique de r&eacute;ponse ne peut interpr&eacute;ter votre message), vous
recevrez un guide sur comment &eacute;crire une requ&ecirc;te.</P>
<P>Pour diffuser un courrier technique sur cette liste, &eacute;crivez &agrave;
<CODE>&lt;linux-activists@niksula.hut.fi&gt;</CODE>, et n'oubliez pas que la
premi&egrave;re ligne (ou une ligne d'en-t&ecirc;te) doit contenir `<CODE>X-Mn-Key:
TAPE</CODE>'.</P>

<H2><A NAME="ss2.3">2.3 Lecteurs support&eacute;s</A>
</H2>

<P>Tous les lecteurs qui sont &agrave; la fois compatibles QIC-117 et soit
QIC-40, soit QIC-80 doivent fonctionner avec le pilote ftape.  Pour
l'instant, les lecteurs suivants ont &eacute;t&eacute; utilis&eacute;s avec succ&egrave;s&nbsp;:</P>
<P>
<UL>
<LI> Colorado DJ-10 / DJ-20 (Jumbo 120 / Jumbo 250)</LI>
<LI> Archive 5580i / XL9250i</LI>
<LI> Insight 80Mb</LI>
<LI> Conner C250MQ</LI>
<LI> Wangtek 3080F</LI>
<LI> Iomega 250 (seulement un fichier par bande, malheureusement)</LI>
<LI> Escom / Archive (Hornet) 31250Q</LI>
<LI> Summit SE 150 / SE 250</LI>
<LI> Mountain FS8000</LI>
<LI> Colorado FC-10 High-Speed Controller</LI>
</UL>
</P>
<P>La gestion du contr&ocirc;leur FC-10 a &eacute;t&eacute; int&eacute;gr&eacute; dans le pilote
ftape &agrave; partir de la version 1.12. Vous pouvez vous r&eacute;f&eacute;rer aux
fichiers (en anglais) <CODE>RELEASE-NOTES</CODE> et <CODE>Makefile</CODE> dans
la distribution ftape pour avoir plus de pr&eacute;cisions.</P>
<P>Quelques lecteurs de bande (Iomega) mettent &agrave; tort l'indicateur
`nouvelle-cartouche-charg&eacute;e' (new-cartridge-loaded) &agrave; l'&eacute;tat actif
chaque fois que le fichier de p&eacute;riph&eacute;rique est ouvert. Ces
lecteurs ne fonctionneront pas correctement avec les marques de
fichiers du fait qu'apr&egrave;s chaque fichier on se retrouve au d&eacute;but de la
bande.</P>
<P>NOTE&nbsp;: Si jamais vous poss&eacute;dez un lecteur qui fonctionne correctement,
et qui n'est pas list&eacute; ci-dessus, envoyez s'il vous pla&icirc;t un courrier
au responsable de ce guide (<CODE>khp@login.dkuug.dk</CODE>).</P>


<H2><A NAME="ss2.4">2.4 Lecteurs NON-g&eacute;r&eacute;s</A>
</H2>

<P>
<UL>
<LI> Tous les lecteurs qui se connectent via le port parall&egrave;le (par exemple&nbsp;:
Colorado Trakker) </LI>
<LI> Contr&ocirc;leur &agrave; haute-vitesse. (par exemple&nbsp;: Colorado TC-15
&amp; FC-20) </LI>
<LI> Irwin AX250L / Accutrak 250. (pas un lecteur QIC-80)</LI>
<LI> IBM Internal Tape Backup Unit (identique au lecteur Irwin AX250L) </LI>
<LI> COREtape light</LI>
</UL>
</P>

<P>De mani&egrave;re g&eacute;n&eacute;rale, AUCUN lecteur se connectant au port parall&egrave;le
n'est g&eacute;r&eacute;, en effet ces lecteurs utilisent plusieurs interfaces
propri&eacute;taires diff&eacute;rentes, qui sont tr&egrave;s &eacute;loign&eacute;s du standard QIC-117.</P>
<P>Le contr&ocirc;leur Colorado TC-15 (et ses sosies) ne sont pas
g&eacute;r&eacute;s par l'interface ftape. Le Colorado FC-10 est le seul
contr&ocirc;leur qui peut &ecirc;tre utilis&eacute;. Le support pour celui-ci a &eacute;t&eacute;
int&eacute;gr&eacute; dans ftape version 1.12.</P>
<P>Le Irwin AX250L (et l'unit&eacute; de sauvegarde interne IBM) ne fonctionne
pas avec ftape. En effet, ils utilisent bien le standard QIC-117 mais
pas le standard QIC-80 (ils utilisent &agrave; la place le format
propri&eacute;taire servoe (Rhomat) de Irwin). L'auteur n'a aucune
information sur le format Rhomat, ni o&ugrave; l'on peut la trouver. D&eacute;sol&eacute;.</P>
<P>Le COREtape light ne fonctionne pas (encore). Quelques
caract&eacute;ristiques sont connues sur ce lecteur, mais on n'a pas encore
r&eacute;ussi &agrave; lui faire accepter les donn&eacute;es d'initialisation. Il n'est pas
s&ucirc;r qu'on arrive un jour &agrave; le faire marcher avec ftape.</P>

<H2><A NAME="ss2.5">2.5 Compilation et installation de l'interface <CODE>ftape</CODE></A>
</H2>

<P>Un guide d'installation est fourni dans la distribution ftape (le fichier
<CODE>Install-guide</CODE> en anglais), lisez-le s'il vous pla&icirc;t.</P>

<H2><A NAME="ss2.6">2.6 O&ugrave; obtenir les sources du noyau (kernel) ?</A>
</H2>


<P>Vous pouvez obtenir les sources du noyau &agrave; l'endroit o&ugrave; vous avez
eu les sources de ftape. Ces sources sont disponibles dans les sites
suivants (et n'importe quelle site miroir).</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    tsx-11.mit.edu [18.172.1.2]: /pub/linux/sources/system/
    sunsite.unc.edu [152.2.22.81]: /pub/Linux/kernel/
    ftp.funet.fi [128.214.248.6]: /pub/OS/Linux/PEOPLE/Linus
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Vous trouverez un certain nombre de sous-r&eacute;pertoires, dont deux nomm&eacute;s
respectivement <CODE>v1.0</CODE> et <CODE>v1.1</CODE>. Ils contiennent (bien
&eacute;videmment) les versions <CODE>v1.0</CODE> et <CODE>v1.1</CODE> du noyau. Il
est sugg&eacute;r&eacute; de choisir la version <CODE>1.1.</CODE>&lt; <CODE>... &gt;</CODE>.</P>

<H2><A NAME="ss2.7">2.7 Peut-on formater des bandes sous Linux ?</A>
</H2>


<P>Pour le moment, non&nbsp;! Cela est &agrave; l'&eacute;tude, mais mieux vaut ne pas
attendre que ce soit termin&eacute;. En attendant, vous allez devoir utiliser
MessyDos (arghhh&nbsp;!)  ou acheter des bandes pr&eacute;format&eacute;es. Cependant, la
pr&eacute;sence de secteurs d&eacute;fectueux n'est <EM>PAS</EM> v&eacute;rifi&eacute;e
sur certaines bandes pr&eacute;format&eacute;es. Par s&eacute;curit&eacute;, si le pilote ftape
rencontre une bande sans blocs d&eacute;fectueux, un message d'avertissement
sera &eacute;mis.</P>

<H2><A NAME="ss2.8">2.8 Quels programmes de formatage peut-on utiliser sous DOS?</A>
</H2>

<P>Les suivants ont &eacute;t&eacute; utilis&eacute;s avec succ&egrave;s&nbsp;:</P>
<P>
<UL>
<LI> logiciels de Colorado Memory System (<CODE>tape.exe</CODE>)</LI>
<LI> Connor Backup Basics v1.1 et toutes les versions Windows.</LI>
<LI> Norton Backup</LI>
<LI> QICstream version 2</LI>
</UL>
</P>
<P>Les programmes suivants  sont connus pour &ecirc;tre plus ou moins bogu&eacute;s.</P>
<P>
<UL>
<LI> CONNER Backup Basics  1.0</LI>
<LI> CP Backup (fonctionne OK mis &agrave; part un gaspillage de place)</LI>
</UL>
</P>
<P>En fait, la plupart des logiciels sous DOS devraient marcher. Le
Conner Backup Basics v1.0 a un param&egrave;tre erron&eacute; (quelqu'un a d&ucirc; mal
lire les sp&eacute;cifications QIC-80&nbsp;!), ce qui est corrig&eacute; dans la version
1.1. Dennis T. Flaherty (<CODE>dennisf@denix.elk.miles.com</CODE>) a
rapport&eacute; que les propri&eacute;taires d'un Conner C250MQ peuvent obtenir la
nouvelle version 1.1 en appelant au 1-800-230-5638 (aux Etats-unis)
pour demander une mise &agrave; jour (en &eacute;change du prix correspondant &agrave; la
disquette). Signalons que les versions pour Windows fonctionnent tr&egrave;s
bien.</P>

<P>On peut utiliser Central Point Backup, mais il gaspille de la place
quand il rencontre un point d&eacute;fectueux sur la bande.</P>
<P>NOTE&nbsp;: Si vous utilisez un logiciel de formatage sous DOS, qui n'est
pas mentionn&eacute; ci-dessus, pri&egrave;re d'&eacute;crire au responsable du guide
(<CODE>khp@login.dkuug.dk</CODE>) de mani&egrave;re &agrave; rajouter l'information
pertinente.</P>

<H2><A NAME="s3">3. Sauvegarde et Restauration</A></H2>



<H2><A NAME="write-backup"></A> <A NAME="ss3.1">3.1 </A>
 Stocker une archive sur une bande</H2>

<P>Les programmes classiques que vous pouvez utiliser sont
`<CODE>tar</CODE>', `<CODE>dd</CODE>' et `<CODE>cpio</CODE>'.  Vous devrez
aussi utiliser `<CODE>mt</CODE>' pour exploiter compl&egrave;tement le potentiel
de vos bandes et de l'interface ftape. Pour commencer, il est
recommand&eacute; de choisir `<CODE>tar</CODE>', qui permet d'archiver un
ensemble de r&eacute;pertoires et de r&eacute;cup&eacute;rer de mani&egrave;re isol&eacute;e des fichiers
d'une sauvegarde pr&eacute;c&eacute;dente. Il para&icirc;trait que <CODE>cpio</CODE> cr&eacute;e
des archives plus compactes, et soit plus souple que <CODE>tar</CODE>,
mais l'auteur n'a pas essay&eacute;. Pour effectuer par exemple, une
sauvegarde des sources de votre noyau en utilisant <CODE>tar</CODE>, vous
devez faire (en supposant que les sources soient dans
<CODE>/usr/src/linux</CODE>)&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        cd /usr/src
        tar cf /dev/ftape linux
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Dans ce cas, les fichiers ne seront pas compress&eacute;s, mais l'&eacute;criture
sur la bande en sera plus continue. Si vous voulez cette fois utiliser
la compression (et que vous poss&eacute;dez tar 1.11.2), il suffit d'inclure
le drapeau(*) <CODE>-z</CODE>, par exemple&nbsp;: `<CODE>tar czf /dev/ftape linux</CODE>'</P>
<P>Pour plus d'informations sur l'utilisation de <CODE>tar</CODE>, <CODE>dd</CODE> et
<CODE>mt</CODE>, regardez dans les pages de r&eacute;f&eacute;rences (man pages) et dans
les fichiers texinfo qui sont fournis avec les distributions
correspondantes.</P>
<P>(*) <CODE>tar</CODE> suppose que le premier argument se constitue
d'options, donc le `<CODE>-</CODE>' n'est pas vraiment n&eacute;cessaire,
autrement dit les deux commandes suivantes sont identiques&nbsp;: `<CODE>tar xzf
/dev/ftape</CODE>' et `<CODE>tar -xzf /dev/ftape</CODE>'</P>

<H2><A NAME="ss3.2">3.2 Restaurer une archive</A>
</H2>

<P>Maintenant, restaurons la sauvegarde des sources du noyau que nous
venons de faire dans la section 
<A HREF="#write-backup">write-backup</A>
 ci-dessus.
Pour cela tapez simplement&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        tar xf /dev/ftape
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si lors de la sauvegarde vous avez utilis&eacute; la compression, tapez
plut&ocirc;t&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        tar xzf /dev/ftape
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Lorsque vous utilisez la compression, gzip va se plaindre de
donn&eacute;es superflues &agrave; la fin de l'archive (et cela va produire un
message `broken pipe'). Ceci peut &ecirc;tre ignor&eacute; sans probl&egrave;me.</P>
<P>Pour les autres programmes utilitaires, lisez le manuel correspondant
s'il vous pla&icirc;t.</P>

<H2><A NAME="ss3.3">3.3 Tester une archive</A>
</H2>

<P>tar a une option (<CODE>-d</CODE>) qui permet de d&eacute;tecter les diff&eacute;rences
entre deux archives. Pour tester votre sauvegarde des sources du noyau,
tapez</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        tar df /dev/ftape
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si vous n'avez pas la page de manuel de <CODE>tar</CODE>, vous n'&ecirc;tes pas
(forc&eacute;ment) perdu. tar poss&egrave;de une aide en ligne&nbsp;: essayez
`<CODE>tar --help 2>&amp;1 | more</CODE>'</P>

<H2><A NAME="ss3.4">3.4 Comment stocker plus d'un fichier <CODE>tar</CODE> sur une bande</A>
</H2>

<P>Pour stocker plus d'un fichier tar sur une bande, vous devez utiliser
l'utilitaire <CODE>mt</CODE>. Vous l'avez s&ucirc;rement d&eacute;j&agrave;, si vous poss&eacute;dez
l'une des distributions de Linux, par exemple Slackware ou Debian.</P>
<P><CODE>tar</CODE> g&eacute;n&egrave;re une seule archive sur la bande et ne sait pas
comment naviguer entre plusieurs archives sur une m&ecirc;me bande, il se
contente de faire des lectures ou des &eacute;critures sur le fichier de
p&eacute;riph&eacute;rique. <CODE>mt</CODE> est d&eacute;di&eacute; aux manipulations de bande,
embobiner ou rembobiner pour se positionner sur une archive
sp&eacute;cifique, mais ne sait pas lire ou &eacute;crire des donn&eacute;es sur la
bande. Comme vous l'avez sans doute devin&eacute;, c'est l'association de
<CODE>tar</CODE> et <CODE>mt</CODE> qui permet d'obtenir la fonctionnalit&eacute;
d&eacute;sir&eacute;e.</P>
<P>En utilisant le fichier sp&eacute;cial <CODE>nrft[0-3]</CODE> (<CODE>nftape</CODE>),
vous pouvez vous servir de `<CODE>mt</CODE>' pour positionner la bande &agrave; la place
d&eacute;sir&eacute;e (par exemple `<CODE>mt -f /dev/nftape fsf 2</CODE>' pour embobiner
jusqu'&agrave; passer deux ``marques de fichiers'', autrement dit sauter deux fichiers
tar), et ensuite de <CODE>tar</CODE> pour lire ou &eacute;crire les donn&eacute;es appropri&eacute;es.</P>


<H2><A NAME="ss3.5">3.5 Ajouter des fichiers &agrave; une archive</A>
</H2>

<P>"Est-il possible d'&eacute;tendre une archive (un fichier tar), c'est &agrave; dire
sauvegarder une archive, puis plus tard, de lui rajouter des fichiers"</P>
<P>La r&eacute;ponse est NON. La documentation de <CODE>tar</CODE> vous dira
d'utiliser `<CODE>tar -Ar</CODE>', mais &ccedil;a ne fonctionnera pas &agrave; cause de
limitations du pilote ftape actuel.</P>

<H2><A NAME="ss3.6">3.6 Monter/d&eacute;monter (Mount/unmounting) des bandes.</A>
</H2>

<P>Dans la mesure o&ugrave; une bande ne contient pas un ``syst&egrave;me de
fichiers'', il n'y a aucune raison pour &agrave; vouloir monter/d&eacute;monter une bande
pour restaurer le contenu de la bande, vous l'ins&eacute;rez dans le lecteur
et ex&eacute;cutez la commande `<CODE>tar</CODE>' (ou la commande que vous
utilisez d'habitude pour acc&eacute;der au lecteur).</P>
<P>"Y a t-il une commande explicite de (d&eacute;)montage de la bande ?"</P>
<P>Aucune.  Le p&eacute;riph&eacute;rique (device) /dev/ftape est de type
`caract&egrave;re', et ne peut donc &ecirc;tre appliqu&eacute; &agrave; la commande
<CODE>[u]mount</CODE>. Seuls les p&eacute;riph&eacute;riques de type `bloc' le peuvent.</P>

<H2><A NAME="s4">4. Questions fr&eacute;quemment pos&eacute;es</A></H2>



<H2><A NAME="ss4.1">4.1 Peut-on &eacute;changer des bandes avec un utilisateur de DOS?</A>
</H2>

<P>Ce n'est pas possible pour l'instant. Ce probl&egrave;me <EM>est</EM>
cependant &agrave; l'&eacute;tude. Les logiciels DOS se conforment aux
sp&eacute;cifications QIC-80 en ce qui concerne la disposition du syst&egrave;mes de
fichiers DOS, et ce doit &ecirc;tre a priori facile d'&eacute;crire un programme
capable de lire le format DOS. En fait, cr&eacute;er une interface
utilisateur agr&eacute;able est s&ucirc;rement un probl&egrave;me plus compliqu&eacute;.</P>


<H2><A NAME="ss4.2">4.2 Comment faire `....' avec <CODE>tar</CODE>?</A>
</H2>

<P>Ces questions concernent le programme <CODE>tar</CODE>&nbsp;: lisez s'il vous
pla&icirc;t la page de manuel (<CODE>man</CODE> page) et la page <CODE>info</CODE>
correspondante. Si vous ne les poss&eacute;dez pas, essayez `<CODE>tar --help -->
--2>&amp;1 | more</CODE>'.</P>
<P>Si votre version de <CODE>tar</CODE> est v1.11.1 ou ant&eacute;rieure, consid&eacute;rez
la mise &agrave; jour &agrave; v1.11.2. Cette version peut appeler <CODE>GNU zip</CODE>
directement (autrement dit&nbsp;: elle supporte l'option de compression <CODE>-z</CODE>)
et a de plus une aide int&eacute;gr&eacute;e &eacute;labor&eacute;e. D'autre part, elle compile
sans probl&egrave;me pour Linux.</P>

<H2><A NAME="ss4.3">4.3 Les transferts de DMA <CODE>ftape</CODE> donnent lieu &agrave; des erreurs ECC.</A>
</H2>

<P>Malheureusement il y a quelques cartes graphiques SVGA qui ne d&eacute;codent
pas correctement leurs adresses. Ceci se produit typiquement quand les
zones tampons de ftape sont dans la r&eacute;gion <CODE>0x1a0000</CODE> &agrave;
<CODE>0x1c0000</CODE>. Il arrive alors que les cycles d'&eacute;criture DMA soient
fauss&eacute;s et qu'un octet &eacute;crit sur deux ait une valeur fausse
(<CODE>0xff</CODE>). Ces probl&egrave;mes ont &eacute;t&eacute; rapport&eacute;s avec &agrave; la fois des
cartes SVGA et des cartes ethernet. Nous connaissons au moins une
carte (d&eacute;ficiente?) ATI 16bit VGA qui cause ce probl&egrave;me.</P>
<P>La solution la plus simple est de mettre la carte dans un emplacement
8bit (ce n'est souvent pas suffisant pour reconfigurer la carte en 8bit).
D&eacute;placer la zone tampon ftape n'est qu'une solution partielle, a
priori toutes les zones tampons DMA utilis&eacute;es dans Linux peuvent avoir
ce probl&egrave;me&nbsp;! Mettons nous bien d'accord&nbsp;: ce comportement n'a rien &agrave;
voir avec le pilote ftape.</P>

<H2><A NAME="ss4.4">4.4 <CODE>insmod</CODE> indique que la version du noyau est erron&eacute;e</A>
</H2>

<P>Le programme <CODE>insmod</CODE> v&eacute;rifie que la version du noyau courant
est la m&ecirc;me que celle m&eacute;moris&eacute;e dans le pilote ftape lors de la
compilation. C'est une cha&icirc;ne de caract&egrave;res dans
<CODE>kernel-version.h</CODE>, (par exemple&nbsp;: <CODE>char kernel_version[] =
"1.0.4";</CODE>) qui est extraite du noyau au moment o&ugrave; vous ex&eacute;cutez
`<CODE>make dep</CODE>'.  Si vous avez cette erreur lorsque vous essayer
d'ins&eacute;rer le pilote ftape, supprimer le fichier
`<CODE>kernel-version.h</CODE>' (dans la distribution ftape), tapez
`<CODE>make dep ; make</CODE>' &agrave; nouveau pour recompiler et vous devez
alors avoir une version &agrave; jour de
<CODE>kernel-version.h</CODE>. Souvenez-vous que cette op&eacute;ration doit &ecirc;tre
renouvel&eacute;e chaque fois que vous passez &agrave; une version diff&eacute;rente du
noyau.</P>

<H2><A NAME="ss4.5">4.5 Le noyau 1.1.0 ne compile plus avec l'option de support pour ftape.</A>
</H2>


<P>(Bien que ce probl&egrave;me ne soit pas &eacute;t&eacute; report&eacute; fr&eacute;quemment, je le cite
quand m&ecirc;me au cas o&ugrave;&nbsp;!)</P>
<P>Cela vient d'une erreur typographique (et d'un hacker (programmeur)
qui n'utilisait pas ftape lui-m&ecirc;me de sorte qu'il ne lui est jamais
arriv&eacute; de tester le code qu'il &eacute;crivait). Cela a &eacute;t&eacute; corrig&eacute; dans
<CODE>patch1.gz</CODE> qui peut &ecirc;tre trouv&eacute; sur les sites ftp usuels.)</P>

<H2><A NAME="ss4.6">4.6 O&ugrave; sont les ex&eacute;cutables/sources/man-pages pour</A>
<CODE>tar</CODE>/<CODE>mt</CODE>/<CODE>cpio</CODE>/<CODE>dd</CODE> ?</H2>

<P>Tous ces outils sont d&eacute;velopp&eacute;s dans le cadre du projet GNU, et les
sources (ainsi que les pages de manuel) peuvent &ecirc;tre r&eacute;cup&eacute;r&eacute;es &agrave;
partir de pratiquement n'importe quel site ftp dans le monde entier (y
compris ftp.funet.fi, tsx-11.mit.edu, et sunsite.unc.edu).  Dans tous
les cas on peut les r&eacute;cup&eacute;rer &agrave; partir du site officiel GNU&nbsp;:
<CODE>prep.ai.mit.edu [18.71.0.38]:/pub/gnu</CODE>.  Les versions les plus
r&eacute;centes (au 26 mars 94) sont&nbsp;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        cpio:   2.3 (cpio-2.3.tar.gz
        dd:     3.9 (fileutils-3.9.tar.gz)
        mt:     2.3 (cpio-2.3.tar.gz)
        tar:    1.11.2 (tar-1.11.2.tar.gz)
        gzip:   1.2.4 (gzip-1.2.4.tar.gz)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ils compilent tous sans modifications sur Linux <CODE>v1.0.4</CODE> / <CODE>libc
v4.5.19</CODE> / <CODE>gcc v2.5.8</CODE> (Le programme <CODE>rmt</CODE>
n&eacute;cessite quelques adaptations, mais n'est pas indispensable puisqu'il
est seulement utilis&eacute; pour acc&eacute;der &agrave; distance &agrave; un lecteur de bande).</P>

<H2><A NAME="s5">5. D&eacute;boguer le pilote ftape</A></H2>



<H2><A NAME="ss5.1">5.1 Le noyau/ftape se plante lorsque je fais  `...' - est-ce un</A>
bogue&nbsp;?</H2>

<P>Non, c'est une caract&eacute;ristique voulue  ;-) </P>
<P>Plus s&eacute;rieusement, un logiciel fiable ne doit pas se planter. C'est
particuli&egrave;rement vrai pour le noyau qui ne peut pas ou plut&ocirc;t ne
<B>devrait</B> pas planter. Si le noyau se plante lorsque vous
utilisez ftape, et que vous pouvez montrer que c'est le pilote ftape
qui en est responsable, alors consid&eacute;rez cela comme une erreur
importante qui Doit Etre Corrig&eacute;e. Ecrivez les d&eacute;tails de votre situation
aux responsables du d&eacute;veloppement (voir section 
<A HREF="#email-addrs">email-addrs</A>

ci-dessous).</P>

<H2><A NAME="ss5.2">5.2 ftape n'arr&ecirc;te pas de dire `... new tape' (nouvelle bande),</A>
que doit-on faire&nbsp;?</H2>


<P>[Note&nbsp;: cette m&eacute;thode ne marche plus; l'auteur ne sait pas pour l'instant
rem&eacute;dier &agrave; cette situation]</P>
<P>Pour arr&ecirc;ter cela, fa&icirc;tes (de m&eacute;moire)&nbsp;: loggez vous en tant que root
et faites `<CODE>rmmod ftape</CODE>'. ftape doit faire quelques `rat&eacute;s',
donner a peu pr&egrave;s trois `segmentations fault', et expirer
d&eacute;finitivement.</P>
<P>Observez le t&eacute;moin (LED) de votre lecteur de disquettes (vous en avez
bien un, n'est ce pas?). Si il reste allum&eacute; de mani&egrave;re permanente,
vous avez mis dans le mauvais sens le c&acirc;ble du lecteur de
disquettes. V&eacute;rifiez le c&acirc;ble entre le contr&ocirc;leur, le lecteur de bande
<EM>et</EM> le lecteur de disquettes. En g&eacute;n&eacute;ral, l'un (ou plusieurs)
d'un des connecteurs a &eacute;t&eacute; mis dans le mauvais sens (dessus dessous),
de sorte que l'emplacement 1 (broche 1) d'une extr&eacute;mit&eacute; se connecte &agrave;
l'emplacement 34 (broche 34) de l'autre c&ocirc;t&eacute; de la connexion. (Tous les
emplacements pairs sont mis &agrave; la terre, donc votre lecteur de
disquettes devrait aussi &ecirc;tre inutilisable). Ne vous inqui&eacute;tez pas;
cela ne peut pas ab&icirc;mer votre mat&eacute;riel.</P>

<H2><A NAME="ss5.3">5.3 OK il y a bel et bien un bogue .... euhh.... une caract&eacute;ristique</A>
- Comment soumettre un rapport ?</H2>

<P>Premi&egrave;rement, assurez-vous que le probl&egrave;me est reproductible. Les
erreurs al&eacute;atoires sont tr&egrave;s emb&ecirc;tantes, du fait qu'elles sont
impossibles &agrave; isoler :-/
Voil&agrave; une liste rapide &agrave; v&eacute;rifier/reporter&nbsp;:</P>
<P>
<UL>
<LI> La version du noyau, et les mises &agrave; jour appliqu&eacute;es (patches),
y compris celles de ftape.</LI>
<LI> la version de ftape.</LI>
<LI> Le mod&egrave;le et le fabriquant du lecteur de bande.</LI>
<LI> Ce que vous avez fait pour d&eacute;clencher le probl&egrave;me.</LI>
<LI> Un fichier de traces (log) de l'ex&eacute;cution avec un niveau de
tra&ccedil;age &eacute;gal &agrave; 7.</LI>
<LI> Quelles anomalies se sont produites sur votre syst&egrave;me.</LI>
<LI> Ne supprimez pas le noyau et le fichier <CODE>ftape.o</CODE> . Nous
voudrons peut-&ecirc;tre essayer quelques modifications ou ex&eacute;cuter des
tests diff&eacute;rents sur votre syst&egrave;me.</LI>
</UL>
</P>
<P>Augmenter le niveau de tra&ccedil;age jusqu'&agrave; 7 (juste en-dessous du niveau
maximum) et ex&eacute;cuter la commande fautive de nouveau. R&eacute;cup&eacute;rer les
donn&eacute;es de tra&ccedil;age &agrave; partir du `journal' du noyau ou de
<CODE>/proc/kmsg</CODE>, cela d&eacute;pendant d'o&ugrave; vous abritez vos messages
d'erreur.  N'essayez pas de `filtrer' les traces obtenues. Vous
pourriez consid&eacute;rer certaines choses superflues alors qu'elles sont
essentielles pour retrouver le bogue. D&eacute;crivez exactement ce que vous
avez fait, et ce qui s'est pass&eacute; sur votre syst&egrave;me. En effet, il est
possible que nous ne puissions pas reproduire l'erreur parce que nous
utilisons un lecteur diff&eacute;rent ou une autre version du noyau.</P>

<H2><A NAME="ss5.4">5.4 Comment changer le niveau de tra&ccedil;age ?</A>
</H2>

<P>Il y a deux mani&egrave;res de le faire&nbsp;: soit vous pouvez changer le niveau
de tra&ccedil;age par d&eacute;faut (la variable `<CODE>tracing</CODE>' dans le fichier
`<CODE>ftape-rw.c</CODE>') et recompiler, soit tapez</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        mt /dev/ftape fsr &lt;tracing-level>
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>L'utilisation de la commande `fsr' avec mt est <EM>une sorte de
bidouille</EM>, et est destin&eacute;e &agrave; dispara&icirc;tre.</P>

<H2><A NAME="ss5.5">5.5 Lors de l'utilisation de <CODE>/dev/nftape</CODE>, il y a beaucoup</A>
de message superflus ... pourquoi ?</H2>

<P>Cela vient d'un probl&egrave;me `historique', avant la version 0.9.10. De
nos jours, les p&eacute;riph&eacute;riques `non-rembobinants' fonctionnent
correctement. Si votre version est ancienne, il est vivement
recommand&eacute; de se mettre &agrave; jour avec la version 1.13b.</P>

<H2><A NAME="s6">6. Aide au d&eacute;veloppement de ftape.</A></H2>


<H2><A NAME="ss6.1">6.1 J'<B>ADORE</B> tout simplement ce pilote ftape, comment</A>
puis-je aider les d&eacute;veloppeurs.</H2>

<P>Vous pouvez aider les d&eacute;veloppeurs de ftape en r&eacute;pondant aux questions
des utilisateurs sur les `newsgroups'. Il y a beaucoup d'utilisateurs
d&eacute;butants, qui ont juste besoin d'une r&eacute;ponse tr&egrave;s simple &agrave; leur
question, par exemple `O&ugrave; puis-je trouver le ftape-HOWTO'. En g&eacute;n&eacute;ral postez
s'il vous pla&icirc;t votre r&eacute;ponse directement sur le `newsgroup', de
mani&egrave;re &agrave; en faire profiter d'autres utilisateurs.</P>
<P>C'est la meilleure mani&egrave;re d'apporter votre contribution, avec bien
s&ucirc;r le fait de tester le pilote et d'&eacute;crire des rapports de
disfonctionnements pr&eacute;cis.</P>

<H2><A NAME="email-addrs"></A> <A NAME="ss6.2">6.2 </A>
Je voudrais aider &agrave; d&eacute;velopper `...'Qui dois-je contacter?</H2>

<P>Vous trouverez une liste des d&eacute;veloppeurs ci-dessous. Si quelqu'un
travaille d&eacute;j&agrave; sur un projet similaire ou identique, contactez cette
personne directement. Si au contraire, vous avez un programme o&ugrave; des
ajouts sur lesquels personne ne travaille, contactez
<CODE>&lt;khp@login.dkuug.dk&gt;</CODE> (et <EM>NON</EM> Bas, du fait qu'il
est surcharg&eacute; de travail et a peu de temps pour r&eacute;pondre aux
questions.</P>
<P>
<DL>
<DT><B>Programme de formatage&nbsp;: (pas encore commenc&eacute;)</B><DD><P>Kai Harrekilde-Petersen, <CODE>khp@login.dkuug.dk</CODE></P>
<P>Cesare Mastroianni, <CODE>cece@dist.dist.unige.it</CODE></P>

<DT><B>le pilote ftape proprement dit&nbsp;:</B><DD><P>Bas Laarhoven, <CODE>bas@vimec.nl</CODE></P>

<DT><B>ECC code&nbsp;: (ne vous joignez pas &agrave; nous, nous sommes d&eacute;j&agrave; assez nombreux)</B><DD><P>Kai Harrekilde-Petersen, <CODE>khp@login.dkuug.dk</CODE></P>
<P>Bas Laarhoven, <CODE>bas@vimec.nl</CODE></P>
<P>David Mosberger-Tang, <CODE>davidm@cs.arizona.edu</CODE></P>
<P>Ning Mosberger-Tang, <CODE>tn@cs.arizona.edu</CODE></P>

<DT><B>ftape-HOWTO&nbsp;:</B><DD><P>Kai Harrekilde-Petersen, <CODE>khp@login.dkuug.dk</CODE>
version fran&ccedil;aise&nbsp;: <CODE>lprylli@lip.ens-lyon.fr</CODE></P>

<DT><B>format logique QIC-80 (lecture/&eacute;criture au format DOS)&nbsp;:</B><DD><P>Guido Muench, <CODE>odiug@pool.Informatik.RWTH-Aachen.de</CODE></P>
<P>Kai Harrekilde-Petersen, <CODE>khp@login.dkuug.dk</CODE></P>
</DL>
</P>

</BODY>
</HTML>
