<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE> Linux IPX-HOWTO</TITLE>
</HEAD>
<BODY>
<H1> Linux IPX-HOWTO</H1>

<H2>Kevin Thorpe, <CODE>kevin@pricetrak.com</CODE><BR>
Version Fran&ccedil;aise par Gr&eacute;gory Lajon <CODE>glajon@mail.dotcom.fr</CODE></H2>v2.3, 06 Mai 1998
<HR>
<EM>Ce document tente de d&eacute;crire comment obtenir, installer et configurer diff&eacute;rents outils existant pour le syst&egrave;me d'exploitation
Linux utilisant le support du protocole IPX du noyau.</EM>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>

<P>Ceci est l'IPX-HOWTO. Il est conseill&eacute; de lire le NET-3-HOWTO de Linux
en parall&egrave;le avec ce document.</P>

<H2><A NAME="ss1.1">1.1 Changements par rapport &agrave; la version pr&eacute;c&eacute;dente</A>
</H2>

<P><CODE>Changement d'auteur: <BR>
Un grand merci &agrave; Terry Dawson pour avoir transmis ce document et f&eacute;licitations pour &ecirc;tre devenu papa.<BR>
Ajouts : <BR> Ajout d'une br&egrave;ve explication sur IPX en r&eacute;ponse &agrave;
beaucoup de questions d&eacute;routantes sur la liste de diffusion.<BR>
Corrections, mises &agrave; jour : <BR>
La nouvelle version de ncpfs supporte maintenant les logins NDS. C'est en beta test et peut &ecirc;tre interdit dans votre pays &agrave;
cause de l'utilisation de technologies brevet&eacute;es.
Ajout du support des droits d'acc&egrave;s dans mars_nwe. Toujours
en beta test.</CODE></P>

<H2><A NAME="ss1.2">1.2 Introduction</A>
</H2>

<P>Compar&eacute; aux autres syst&egrave;mes d'exploitation de la famille Un*x,
le noyau de Linux poss&egrave;de une toute nouvelle impl&eacute;mentation de la partie
r&eacute;seau. 
Cette nouvelle approche de d&eacute;veloppement des logiciels
r&eacute;seau du noyau ont permis &agrave; Linux de pouvoir supporter des protocoles 
autres que TCP/IP. Le protocole IPX fait partie de ceux-l&agrave;.</P>
<P>Le noyau de Linux supporte le protocole IPX seulement. Il ne prend pas encore 
en compte les protocoles tels que IPX/RIP, SAP ou NCP. Ces derniers sont 
g&eacute;r&eacute;s par d'autres logiciels comme nous le verrons plus loin dans ce
document.</P>
<P>La gestion du protocole IPX a &eacute;t&eacute; initialement d&eacute;velopp&eacute;e par Alan Cox 
<CODE>&lt;alan@lxorguk.ukuu.org.uk&gt;</CODE>, puis a &eacute;t&eacute; am&eacute;lior&eacute; par Greg Page 
<CODE>&lt;greg@caldera.com&gt;</CODE>.</P>


<H2><A NAME="s2">2. Responsabilit&eacute; vis &agrave; vis de ce document</A> </H2>

<P>Je ne sais et ne peux conna&icirc;tre tout ce qu'il y a &agrave; savoir sur la partie
logiciel r&eacute;seau de Linux. Je vous prie donc d'accepter le fait qu'il puisse y
avoir des erreurs dans ce document et d'&ecirc;tre vigilant. Je vous conseille de 
lire tout fichier README inclus dans chacun des logiciels dont il sera
question dans ce document pour de plus amples informations. Je tenterai de
mon c&ocirc;t&eacute; de conserver ce document &agrave; jour et sans erreurs autant que possible.
Les versions des logiciels sont les versions disponibles au moment o&ugrave; ce
document a &eacute;t&eacute; &eacute;crit.</P>
<P>En aucun cas les auteurs des logiciels cit&eacute;s dans ce document ou moi-m&ecirc;me
n'offrons de protection contre ce que vous faites. Si vous utilisez ce 
logiciel, m&ecirc;me de la fa&ccedil;on d&eacute;crite dans ce document, et que cela cause 
des probl&egrave;mes sur votre r&eacute;seau, alors vous seul en endosserez la responsabilit&eacute;.
J'ai inclus cet avertissement parce que la mise en oeuvre et la configuration
d'un r&eacute;seau IPX n'est pas toujours ais&eacute;e et que cela peut engendrer 
d'ind&eacute;sirables interactions avec les autres routeurs ou serveurs de fichiers
si vous ne faites pas attention. J'ai &eacute;galement inclus cet avertissement
parce qu'une personne suffisamment malchanceuse pour avoir appris cette le&ccedil;on
de la mani&egrave;re douloureuse me l'a demand&eacute;.</P>
<P>NdT : Le traducteur, qui n'est pas un sp&eacute;cialiste des r&eacute;seaux Netware(tm), &eacute;met 
les m&ecirc;mes r&eacute;serves que l'auteur. </P>



<H2><A NAME="s3">3. Documentation sur le m&ecirc;me sujet</A> </H2>

<P>Ce document pr&eacute;sume que vous savez compiler un noyau Linux avec les options 
r&eacute;seau appropri&eacute;es et que vous savez vous servir des outils de configuration
de base des r&eacute;seaux comme <CODE>ifconfig</CODE> et <CODE>route</CODE>. Si ce n'est pas
le cas, je vous conseille de lire le 
<A HREF="NET-3-HOWTO.html">NET-3-HOWTO</A>
lorsque le pr&eacute;sent document y fait r&eacute;f&eacute;rence.</P>
<P>Les autres documents HOWTO de Linux qui pourraient vous &ecirc;tre utiles sont :</P>
<P>L'
<A HREF="Ethernet-HOWTO.html">Ethernet-HOWTO</A> qui d&eacute;crit 
en d&eacute;tail la mani&egrave;re 
de configurer un port Ethernet pour Linux.</P>
<P>Le 
<A HREF="PPP-HOWTO.html">PPP-HOWTO</A> puisque la gestion d'IPX est impl&eacute;ment&eacute;e 
&agrave; partir de la version 2.2.0d de PPP pour Linux.</P>


<H2><A NAME="ss3.1">3.1 Nouvelles versions de ce document</A>
</H2>

<P>Si votre copie de ce document date de plus de deux mois, je vous
recommande fortement d'obtenir une version plus r&eacute;cente. Les supports
r&eacute;seau pour Linux changent tr&egrave;s rapidement avec de nouvelles
fonctions et am&eacute;liorations, en cons&eacute;quence de quoi ce document change lui aussi fr&eacute;quemment. La
derni&egrave;re version de ce document est disponible en version anglaise par le
biais d'un ftp anonyme sur :</P>
<P><CODE>&lt;ftp://metalab.unc.edu/pub/Linux/docs/HOWTO/IPX-HOWTO&gt;</CODE>
ou :
<CODE>&lt;ftp://metalab.unc.edu/pub/Linux/docs/HOWTO/other-formats/IPX-HOWTO{-html.tar,ps,dvi}.gz&gt;</CODE></P>


<P>ou</P>
<P>sur le serveur du 
<A HREF="http://metalab.unc.edu/LDP/linux.html">Linux Documentation Project</A> &agrave; la page :
<A HREF="http://metalab.unc.edu/LDP/HOWTO/IPX-HOWTO.html">IPX-HOWTO</A>
ou sinon aupr&egrave;s de l'auteur,
<CODE>&lt;kevin@pricetrak.com&gt;</CODE>.
Il peut aussi &ecirc;tre post&eacute; dans les 
forums de discussion <CODE>comp.os.linux.networking</CODE>,
<CODE>comp.os.linux.answers</CODE> et
<CODE>news.answers</CODE> de temps &agrave; autre.</P>
<P>NdT :
La version fran&ccedil;aise initialement traduite par Jean-Christophe Arnu 
est disponible de la m&ecirc;me mani&egrave;re :</P>
<P>
<A HREF="ftp://ftp.lip6.fr/pub/Linux/french/docs/HOWTO/IPX-HOWTO.gz">lip6</A></P>

<H2><A NAME="ss3.2">3.2 Votre avis</A>
</H2>

<P>Envoyez-moi tout commentaire, am&eacute;liorations ou suggestions :
<CODE>&lt;kevin@pricetrak.com></CODE>. Si j'obtiens des retours
d'informations rapidement je pourrai am&eacute;liorer ou corriger ce document 
dans les plus brefs d&eacute;lais. Si
vous rencontrez un quelconque probl&egrave;me avec ce document, veuillez m'en faire
part directement par courrier électronique car je peux rater des informations post&eacute;es dans les
forums de discussion.</P>

<H2><A NAME="ss3.3">3.3 Liste de diffusion</A>
</H2>

<P>Il existe une liste dans laquelle on discute des diff&eacute;rents logiciels IPX
pour Linux d&eacute;crits dans ce document. Vous pouvez vous y abonner en 
envoyant un courrier &agrave; <CODE>&lt;listserv@sh.cvut.cz&gt;</CODE> avec <CODE>add
linware</CODE> dans le corps du message. Vous envoyez vos contributions
par courrier &agrave; <CODE>&lt;linware@sh.cvut.cz&gt;</CODE>. Je consulte
r&eacute;guli&egrave;rement cette liste.</P>
<P>Cette liste est archiv&eacute;e
sur le site 
<A HREF="http://www.kin.vslib.cz/hypermail/linware/">www.kin.vslib.cz</A></P>


<H2><A NAME="s4">4. Quelques termes utilis&eacute;s dans ce document</A></H2>

<P>Vous rencontrerez souvent au cours de ce document les termes <CODE>client</CODE> et
<CODE>serveur</CODE>. Ce sont des termes sp&eacute;cifiques dont la d&eacute;finition est bien
connue mais j'ai un peu g&eacute;n&eacute;ralis&eacute; leur d&eacute;finition :
<DL>
<DT><B>client</B><DD><P>C'est la machine ou le programme qui initie une
action ou une connexion dans le but de pouvoir utiliser des 
services ou des donn&eacute;es.</P>

<DT><B>serveur</B><DD><P>C'est la machine ou le programme qui accepte des 
connexions d'une ou plusieurs machines distantes et qui leur fournit 
un service ou des donn&eacute;es.</P>
</DL>
</P>
<P>Ces d&eacute;finitions ne sont pas tr&egrave;s compl&egrave;tes, mais elles
permettent de distinguer les participants des protocoles de
bout en bout tels que <EM>PPP</EM> et <EM>SLIP</EM> qui n'ont pas
r&eacute;ellement de client et de serveur.</P>
<P>Vous lirez aussi les termes suivants :
<DL>
<DT><B>Bindery</B><DD><P>La <EM>bindery</EM> est une base de donn&eacute;es sp&eacute;cialis&eacute;e qui 
stocke sur un serveur de fichiers Novell des informations 
concernant la configuration du r&eacute;seau. Les clients Netware
peuvent interroger la <EM>bindery</EM> pour obtenir de 
l'information sur les services disponibles, sur le routage
et sur les utilisateurs.</P>
<DT><B>Type de Trame (Frame type)</B><DD><P>d&eacute;crit le protocole utilis&eacute; pour transporter
les paquets de donn&eacute;es IPX (et IP) &agrave; travers vos segments Ethernet.
On en rencontre couramment quatre :
<DL>
<DT><B>Ethernet_II</B><DD><P>C'est une version raffin&eacute;e du standard Ethernet original DIX.
Novell s'est vu attribuer un identifiant de protocole (protocol
id) formel. Cela signifie que IPX et IP peuvent coexister
joyeusement dans un environnement Ethernet_II.
Ce type de trame est g&eacute;n&eacute;ralement utilis&eacute; dans les environnements
Novell et c'est un bon choix.</P>
<DT><B>802.3</B><DD><P>C'est un protocole IEEE d&eacute;finissant un m&eacute;canisme &agrave; d&eacute;tection
de porteuse et acc&egrave;s multiple avec d&eacute;tection des collisions
(Carrier Sense Multiple Access with Collision Detection
(CSMA/CD)). Il est bas&eacute; sur le standard Ethernet original DIX,
avec une importante modification. Le champ de type (protocol id)
a &eacute;t&eacute; transform&eacute; en champ de longueur &agrave; la place. C'est pour cette
raison que l'on ne devrait pas utiliser IPX avec ce type de trame.
IEEE 802.3 a &eacute;t&eacute; con&ccedil;u pour transporter des trames IEEE 802.2
<B>seulement</B>, mais il existe des impl&eacute;mentations qui
l'utilisent pour transporter des trames IPX directement et
cela fonctionne quand m&ecirc;me. Evitez-le &agrave; moins de vouloir vous
connecter &agrave; un r&eacute;seau d&eacute;j&agrave; configur&eacute; pour l'utiliser.</P>
<DT><B>802.2</B><DD><P>C'est un protocole IEEE qui d&eacute;finit un ensemble de proc&eacute;dures
de contr&ocirc;le de la couche liaison logique. Il fournit une
fa&ccedil;on simple de faire coexister plusieurs protocoles mais
reste limit&eacute; dans ce sens. Novell utilise un SAP (Service
Address Point, &eacute;quivalent d'un identifiant de protocole) non
officiel. Mais comme tout le monde fait pareil, cela n'a 
encore jamais pos&eacute; de probl&egrave;mes.</P>
<DT><B>SNAP</B><DD><P>SNAP est le protocole d'acc&egrave;s au sous-r&eacute;seau (Sub Network
Access Protocol). Ce protocole est impl&eacute;ment&eacute; au-dessus de
802.3 et 802.2. Il &eacute;tend les capacit&eacute;s multiprotocole de
802.2 et pr&eacute;sente une certaine compatibilit&eacute; avec les trames
Ethernet et Ethernet_II existantes.</P>
</DL>
</P>
<DT><B>IPX</B><DD><P>Internet Packet eXchange est un protocole utilis&eacute; par la soci&eacute;t&eacute;
Novell fournissant un support d'interconnexion pour leur produit
NetWare(tm). IPX a une fonction similaire au protocole IP
utilis&eacute; par la communaut&eacute; TCP/IP.</P>

<DT><B>Adresse IPX d'un r&eacute;seau (IPX network address)</B><DD><P>Il s'agit d'un nombre qui identifie de mani&egrave;re unique un r&eacute;seau 
IPX particulier. La notation courante de cette adresse est
exprim&eacute;e en hexad&eacute;cimal. On peut donner comme exemple : 0x23a91002</P>

<DT><B>R&eacute;seau IPX interne (IPX Internal network)</B><DD><P>C'est un r&eacute;seau IPX virtuel. Il est virtuel car il ne correspond &agrave;
aucun r&eacute;seau physique. Il est utilis&eacute; pour fournir un moyen unique
d'identifier et d'adresser une machine IPX. 
Cette adresse est cod&eacute;e de la m&ecirc;me mani&egrave;re qu'une adresse IPX 
de r&eacute;seau. En g&eacute;n&eacute;ral, ce n'est utile que pour les machines IPX
qui sont physiquement connect&eacute;es &agrave; plusieurs r&eacute;seaux IPX comme 
les serveurs de fichiers. </P>

<DT><B>RIP</B><DD><P>Routing Information Protocol est un protocole utilis&eacute; pour
informer automatiquement  les diff&eacute;rents ordinateurs
pr&eacute;sents sur un r&eacute;seau IPX des
diff&eacute;rentes routes qui lui sont applicables. Il est
fonctionnellement identique au RIP utilis&eacute; au sein de la communaut&eacute;
TCP/IP.</P>

<DT><B>NCP</B><DD><P>Netware Core Protocol est un protocole de syst&egrave;me de fichiers
r&eacute;seau cr&eacute;&eacute; par la soci&eacute;t&eacute; Novell pour leur produit NetWare(tm). On
peut comparer les fonctionnalit&eacute;s de NCP &agrave; NFS utilis&eacute; par la
communaut&eacute; TCP/IP.</P>

<DT><B>SAP</B><DD><P>Service Advertisement Protocol est un protocole cr&eacute;&eacute; par la soci&eacute;t&eacute;
Novell. Il est utilis&eacute; pour avertir des services fournis sur le
r&eacute;seau dans un environnement NetWare(tm).</P>

<DT><B>Adresse Physique (hardware address)</B><DD><P>C'est un nombre qui identifie de mani&egrave;re unique une machine sur un
r&eacute;seau physique au niveau de la couche media (couche MAC).
L'adresse Ethernet en est un exemple.
Une adresse Ethernet est g&eacute;n&eacute;ralement cod&eacute;e par six valeurs 
hexad&eacute;cimales s&eacute;par&eacute;es par deux points : ex. 00:60:8C:C3:3C:0F.</P>

<DT><B>route</B><DD><P>La <EM>route</EM> est le chemin emprunt&eacute; par les paquets 
de donn&eacute;es au travers d'un r&eacute;seau pour atteindre leur destination.</P>
</DL>
</P>

<H2><A NAME="s5">5. Une br&egrave;ve discussion sur la topologie des r&eacute;seaux IPX</A></H2>

<P>C'est une explication tr&egrave;s simplifi&eacute;e pour les personnes qui d&eacute;couvrent IPX.
Les grands r&eacute;seaux mettront probablement &agrave; mal beaucoup des r&egrave;gles 
expliqu&eacute;es ici. Dans les r&eacute;seaux IPX complexes, l'administrateur devrait toujours
&ecirc;tre consult&eacute;.</P>
<P>Les r&eacute;seaux IPX s'appuient sur un proc&eacute;d&eacute; de <EM>r&eacute;seaux</EM> 
num&eacute;rot&eacute;s, &agrave; la diff&eacute;rence de IP qui insiste plus sur les adresses
d'<EM>interface</EM>. Un r&eacute;seau est un ensemble d'&eacute;quipements connect&eacute;s &agrave; un
m&ecirc;me segment de r&eacute;seau local (LAN) et <EM>utilisant le m&ecirc;me type de trame</EM>.
Des types de trame diff&eacute;rents sur le m&ecirc;me segment de r&eacute;seau local sont 
trait&eacute;s comme des r&eacute;seaux s&eacute;par&eacute;s.</P>
<P>Chaque r&eacute;seau doit recevoir un num&eacute;ro qui soit unique au travers de toute l'interconnexion 
de r&eacute;seaux (internetwork). Ceci est habituellement r&eacute;alis&eacute; par un serveur
Netware(tm), mais peut facilement &ecirc;tre r&eacute;alis&eacute; par Linux. Les clients IPX
recoivent ce num&eacute;ro du serveur lors de leur d&eacute;marrage, ils ont juste besoin de
conna&icirc;tre le type de trame correct.</P>
<P>Le routage entre les r&eacute;seaux est habituellement r&eacute;alis&eacute; en mettant deux
cartes r&eacute;seaux dans un serveur. Ce serveur fait tourner le protocole RIP qui maintient
une table de routage pour l'interconnexion de r&eacute;seaux. P&eacute;riodiquement, cette table
de routage est &eacute;chang&eacute;e entre les serveurs. En peu de temps, chaque serveur
'd&eacute;couvre' la topologie de l'interconnexion de r&eacute;seaux.</P>
<P>Si vous souhaitez uniquement utiliser les services d'un serveur NetWare existant, vous pouvez
utiliser <CODE>ipx_configure</CODE> (section 7.1) pour d&eacute;finir automatiquement les interfaces
en utilisant des requ&ecirc;tes de "broadcast" pour rechercher un serveur. Si cela &eacute;choue
ou que vous voulez fournir des services IPX, vous devrez d&eacute;finir les interfaces 
manuellement en utilisant <CODE>ipx_interface</CODE> ou <CODE>mars_nwe</CODE>.</P>


<H2><A NAME="s6">6. Les fichiers relatifs &agrave; IPX dans le r&eacute;pertoire <CODE>/proc</CODE></A></H2>

<P>Il existe un certain nombre de fichiers relatifs au support d'IPX par
Linux dans le r&eacute;pertoire <CODE>/proc</CODE> :</P>
<P>
<DL>
<DT><B>/proc/net/ipx_interface</B><DD><P>Ce fichier contient des informations au sujet des interfaces IPX
configur&eacute;es sur votre machine. Elles peuvent avoir &eacute;t&eacute; configur&eacute;es
manuellement par commande ou automatiquement d&eacute;tect&eacute;es et 
configur&eacute;es.</P>

<DT><B>/proc/net/ipx_route</B><DD><P>Ce fichier contient une liste de routes existantes dans la table de
routage IPX. Ces routes peuvent avoir &eacute;t&eacute; ajout&eacute;es &agrave; la main par
l'interm&eacute;diaire de commandes ou automatiquement par le d&eacute;mon de
routage IPX.</P>

<DT><B>/proc/net/ipx</B><DD><P>Ce fichier contient la liste des sockets IPX qui sont ouverts sur la
machine au moment de l'&eacute;dition du fichier.</P>
</DL>
</P>

<H2><A NAME="s7">7. Les outils IPX de Greg Page</A></H2>

<P>Greg Page <CODE>&lt;greg@caldera.com&gt;</CODE> de la soci&eacute;t&eacute; Caldera 
Incorporated a &eacute;crit un ensemble d'outils de configuration pour IPX et a 
am&eacute;lior&eacute; le support IPX du noyau Linux.</P>
<P>Les am&eacute;liorations du noyau permettent de configurer un syst&egrave;me Linux comme 
pont ou routeur IPX parfaitement fonctionnel. Le support
d'IPX am&eacute;lior&eacute; a d&eacute;j&agrave; &eacute;t&eacute; incorpor&eacute; dans le corps du noyau de distribution. 
Vous en &ecirc;tes donc certainement &eacute;quip&eacute;.</P>
<P>Ces outils de configuration  vous permettent de
param&eacute;trer vos p&eacute;riph&eacute;riques r&eacute;seau pour le
support d'IPX et de mettre en place le routage pour ce protocole. D'autres
fonctionnalit&eacute;s sont aussi incluses dans ce paquetage.
Ces outils sont disponibles sur
<A HREF="ftp://metalab.unc.edu/pub/Linux/system/filesystems/ncpfs/ipx.tgz">metalab.unc.edu</A>.</P>
<P>NdT : les lecteurs connectés en France pourront utiliser un site miroir
comme 
<A HREF="ftp://ftp.lip6.fr/">ftp.lip6.fr</A></P>

<H2><A NAME="ss7.1">7.1 Les outils IPX en d&eacute;tails</A>
</H2>

<P>
<DL>
<DT><B>ipx_interface</B><DD><P>Cette commande est utilis&eacute;e pour ajouter, enlever ou contr&ocirc;ler 
manuellement des propri&eacute;t&eacute;s d'IPX sur un p&eacute;riph&eacute;rique r&eacute;seau donn&eacute;. Ce dernier
est souvent un p&eacute;riph&eacute;rique Ethernet comme <CODE>eth0</CODE>. 
Au moins une interface IPX doit &ecirc;tre d&eacute;clar&eacute;e comme 
interface <EM>primaire</EM> par le param&egrave;tre <CODE>-p</CODE> suivi du nom
de l'interface. Par exemple, l'attribution des
capacit&eacute;s IPX au p&eacute;riph&eacute;rique eth0, en tant que premi&egrave;re interface
utilisant le type de trame IEEE 802.2 et l'adresse r&eacute;seau
<CODE>39ab0222</CODE> se fera ainsi :
<BLOCKQUOTE><CODE>
<PRE>
                # ipx_interface add -p eth0 802.2 0x39ab0222
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>Si le type de trame diff&egrave;re des serveurs NetWare(tm) sur ce r&eacute;seau, ils
vous ignoreront d&eacute;lib&eacute;rement. Si le type de trame est correct, mais que
le num&eacute;ro de r&eacute;seau diff&egrave;re, ils vous ignoreront encore, mais 
afficheront des messages sur la console du serveur Netware(tm). Ce dernier cas vous
promet d'avoir des probl&egrave;mes avec votre administrateur NetWare et peut perturber
les clients NetWare en cours d'utilisation.</P>

<P>Si vous obtenez une erreur en faisant tourner ce programme et que vous
n'avez pas encore configur&eacute; TCP/IP, alors vous allez devoir d&eacute;marrer
manuellement l'interface <CODE>eth0</CODE> en utilisant la commande :
<BLOCKQUOTE><CODE>
<PRE>
                # ifconfig eth0 up
</PRE>
</CODE></BLOCKQUOTE>
</P>


<DT><B>ipx_configure</B><DD><P>Cette commande permet ou interdit la configuration automatique de
l'interface et la mise en oeuvre de l'interface primaire.
<DL>
<DT><B><CODE>--auto_interface</CODE></B><DD><P>vous permet de d&eacute;cider si de nouveaux p&eacute;riph&eacute;riques r&eacute;seau doivent 
&ecirc;tre automatiquement configur&eacute;s comme des p&eacute;riph&eacute;riques IPX ou pas. </P>
<DT><B><CODE>--auto_primary</CODE></B><DD><P>vous accorde le droit de d&eacute;cider si les logiciels IPX doivent 
s&eacute;lectionner une interface primaire ou non. Des probl&egrave;mes ont &eacute;t&eacute;
report&eacute;s sur l'utilisation de ceci avec des clients Windows 95 sur le r&eacute;seau.</P>
</DL>

Par exemple si l'on d&eacute;sire une configuration automatique des
interfaces et une mise en oeuvre automatique de l'interface primaire on
utilisera la ligne suivante 
<BLOCKQUOTE><CODE>
<PRE>
        # ipx_configure --auto_interface=on --auto_primary=on
</PRE>
</CODE></BLOCKQUOTE>
</P>

<DT><B>ipx_internal_net</B><DD><P>Cette commande permet de mettre en place, de configurer
ou retirer une
adresse de r&eacute;seau interne. Cette adresse de r&eacute;seau interne est
optionnelle, mais lorsqu'elle est configur&eacute;e elle est toujours
consid&eacute;r&eacute;e comme interface primaire. Pour configurer une adresse
r&eacute;seau IPX ayant le num&eacute;ro <CODE>ab000000</CODE> sur le noeud IPX
<CODE>1</CODE> vous devez utiliser:
<BLOCKQUOTE><CODE>
<PRE>
# ipx_internal_net add 0xab000000 1
</PRE>
</CODE></BLOCKQUOTE>
</P>

<DT><B>ipx_route</B><DD><P>Cette commande permet de modifier manuellement la table de routage
IPX. On peut prendre comme exemple l'ajout d'une route vers le r&eacute;seau IPX
<CODE>39ab0222</CODE> via un routeur ayant le num&eacute;ro de noeud
<CODE>00608CC33C0F</CODE> sur le r&eacute;seau
IPX 39ab0108 :
<BLOCKQUOTE><CODE>
<PRE>
# ipx_route add 0x39ab0222 0x39ab0108 0x00608CC33C0F
</PRE>
</CODE></BLOCKQUOTE>
</P>
</DL>
</P>

<H2><A NAME="s8">8. Configurer votre machine Linux comme routeur IPX</A></H2>

<P>Si vous avez un certain nombre de segments IPX que vous souhaitez
interconnecter, vous aurez besoin d'un routeur. Dans l'environnement Novell,
la propagation d'au moins deux types d'informations est absolument
primordiale sur le r&eacute;seau : d'un c&ocirc;t&eacute;, les informations de routage sur le r&eacute;seau
qui sont propag&eacute;es en utilisant le RIP Novell, de l'autre c&ocirc;t&eacute;, les informations
d'avertissement du syst&egrave;me qui sont v&eacute;hicul&eacute;es par le SAP Novell. Tout routeur
doit pouvoir traiter et comprendre ces deux types de protocoles pour &ecirc;tre
utilis&eacute; dans toutes les situations.</P>
<P>Linux poss&egrave;de un support pour ces deux protocoles et peut donc &ecirc;tre 
ais&eacute;ment configur&eacute; pour r&eacute;aliser un routeur IPX compl&egrave;tement compatible
Novell. </P>
<P>Le support IPX du noyau de Linux g&egrave;re r&eacute;ellement le routage des paquets
entre les interfaces, mais il le fait selon les r&egrave;gles donn&eacute;es dans une table
de routage. Linux n&eacute;cessite un programme impl&eacute;mentant les protocoles RIP et SAP de
Novell afin que la table de routage soit correctement construite et maintenue
p&eacute;riodiquement, pour qu'elle refl&egrave;te bien les changements d'&eacute;tat du
r&eacute;seau. </P>
<P>Volker Lendecke <CODE>&lt;lendecke@namu01.gwdg.de&gt;</CODE> a d&eacute;velopp&eacute;
un d&eacute;mon de routage <EM>ipxrid</EM> qui fera tout &ccedil;a pour vous.
Le paquetage <EM>mars_nwe</EM> mentionn&eacute; plus loin inclut un autre d&eacute;mon de routage.</P>

<P>Vous pouvez trouver <EM>ipxrid</EM>  sur :
<A HREF="ftp://metalab.unc.edu/pub/Linux/system/filesystems/ncpfs/ipxripd-0.7.tgz">metalab.unc.edu</A></P>
<P>ou directement chez Volker :</P>
<P>
<A HREF="ftp://ftp.gwdg.de/pub/linux/misc/ncpfs/ipxripd-0.7.tgz">ftp.gwdg.de</A></P>

<P>Configurer une machine Linux en routeur IPX est une op&eacute;ration tr&egrave;s
lin&eacute;aire. Proc&eacute;dez comme suit :
<OL>
<LI>Construisez le noyau avec les supports d'IPX, d'Ethernet et le syst&egrave;me
de fichiers <CODE>/proc</CODE></LI>
<LI>Procurez-vous, compilez et installez le d&eacute;mon <EM>ipxd</EM>.</LI>
<LI>Red&eacute;marrez la machine avec son nouveau noyau et assurez-vous que  chacune
des cartes Ethernet ont &eacute;t&eacute; correctement d&eacute;tect&eacute;es et qu'il n'y a pas de
conflits mat&eacute;riels.</LI>
<LI>Mettez en place le protocole IPX sur chacune des interfaces en utilisant la
commande <CODE>ipx_interface</CODE> d&eacute;crite ci-dessus.</LI>
<LI>Lancez le d&eacute;mon <EM>ipxd</EM>.</LI>
</OL>

En consid&eacute;rant le simple r&eacute;seau suivant :</P>
<P>
<PRE>
   IPX Addr: 0x01000000  802.2
  |--------------------------|
                |
                \_________________________
                                          \         Routeur Linux
   IPX Addr: 0x02000000  802.2             \
  |--------------------------|              \   eth0/-----------\
                |                            \--====|           |
                \_________________________          | IPX route |
                                          \     eth1|  Table    |
   IPX Addr: 0x03000000  etherII           \----====|    ^      |
  |--------------------------|                      |    |      |
                |                               eth2|  IPXd     |
                \______________________________/====|           |
                                                    |  SAPd     |
   IPX Addr: 0x04000000  etherII                eth3|           |
  |--------------------------|                 /====|           |
                |                              |    \___________/
                \______________________________/
</PRE>
</P>
<P>La configuration pour le r&eacute;seau ci-dessus ressemblera &agrave; :
<BLOCKQUOTE><CODE>
<PRE>
       # ipx_interface add eth0 802.2 0x0100000000
       # ipx_interface add eth1 802.2 0x0200000000
       # ipx_interface add eth2 etherii 0x0300000000
       # ipx_interface add eth3 etherii 0x0400000000
       # ipxd
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Vous devrez attendre un petit moment pour v&eacute;rifier le fichier
<CODE>/proc/net/ipx_route</CODE> (<CODE>cat /proc/net/ipx_route</CODE>). Vous devriez retrouver
les routes IPX inh&eacute;rentes &agrave; votre configuration du syst&egrave;me et toutes les
configurations apprises par le contact avec les autres routeurs sur le r&eacute;seau
le cas &eacute;ch&eacute;ant.</P>

<H2><A NAME="ss8.1">8.1 Dois-je utiliser un r&eacute;seau interne ?</A>
</H2>

<P>Novell a une fonctionnalit&eacute; appel&eacute;e r&eacute;seau interne, qui est utilis&eacute;e pour
simplifier le routage lorsqu'une machine est connect&eacute;e &agrave; plus d'un p&eacute;riph&eacute;rique
r&eacute;seau. C'est utile dans le cas d'un serveur de fichiers connect&eacute; &agrave; plusieurs
r&eacute;seaux, en ce sens qu'une seule route doit &ecirc;tre utilis&eacute;e pour atteindre le
serveur, quel que soit le r&eacute;seau &agrave; partir duquel on op&egrave;re.</P>

<P>Dans le cas d'une configuration o&ugrave; vous ne fa&icirc;tes pas tourner un serveur
de fichiers mais seulement un routeur IPX, il n'est pas simple de r&eacute;pondre.
Des t&eacute;moignages rapportent que l'utilisation de IPX/PPP marche "mieux"
si vous utilisez &eacute;galement un r&eacute;seau interne.</P>

<P>Dans tous les cas, c'est facile &agrave; faire, mais cela peut n&eacute;cessiter de 
recompiler le noyau. Lorsque vous en &ecirc;tes au <CODE>make config</CODE>
du noyau, vous devez r&eacute;pondre Oui (<CODE>y</CODE>) &agrave; la question
<CODE>Full internal IPX network</CODE> comme suit :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
      ...
      ...
      Full internal IPX network (CONFIG_IPX_INTERN) [N/y/?] y
      ...
      ...
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Pour configurer le r&eacute;seau interne, utilisez la commande
<EM>ipx_internal_net</EM> d&eacute;j&agrave; d&eacute;crite dans la section outils IPX.
La principale pr&eacute;caution &agrave; prendre est de s'assurer que l'adresse IPX
r&eacute;seau que vous choisissez est unique sur votre r&eacute;seau et qu'aucune
autre machine ou r&eacute;seau ne l'utilise.</P>

<H2><A NAME="s9">9. Configurer votre machine Linux en client NCP</A></H2>


<P>Si vous &ecirc;tes un utilisateur d'un r&eacute;seau
h&eacute;t&eacute;rog&egrave;ne o&ugrave; les protocoles IP et
IPX sont utilis&eacute;s, il est probable que vous ayez &agrave; un moment ou &agrave; un autre,
besoin d'acc&eacute;der &agrave; partir de votre machine Linux, &agrave; des donn&eacute;es stock&eacute;es sur
un serveur de fichier Novell de ce r&eacute;seau. Novell a longtemps propos&eacute; un
ensemble logiciel NFS pour leurs serveurs de fichiers qui permettaient cet
acc&egrave;s. Cependant si le site auquel vous &ecirc;tes connect&eacute; est petit, le nombre de
personnes n&eacute;cessitant cet type d'acc&egrave;s ne justifie peut-&ecirc;tre pas l'achat de ces
outils logiciels commerciaux.</P>
<P>Volker Lendecke <CODE>&lt;lendecke@namu01.gwdg.de&gt;</CODE> a &eacute;crit un module
du syst&egrave;me de
fichiers du noyau Linux supportant un sous-ensemble limit&eacute; du protocole Novell
NCP qui permet de monter une partition Novell dans votre syst&egrave;me de
fichiers
Linux sans avoir recours &agrave; quelque produit additionnel sur votre
serveur de fichiers. </P>
<P>Volker a appel&eacute; cet ensemble <EM>ncpfs</EM>. Ce dernier a &eacute;t&eacute; 
r&eacute;alis&eacute; &agrave; partir des
informations tir&eacute;es principalement du livre "Netzwerkprogrammierung in C" de
Manfred Hill et Ralf Zessin (de plus amples informations sont donn&eacute;es dans le
fichier README contenu dans l'ensemble <EM>ncpfs</EM>). </P>
<P>Ce logiciel permet &agrave; Linux d'&eacute;muler une station de travail Novell normale
pour ce qui concerne la partie fichiers. Un petit utilitaire d'impression
est &eacute;galement inclus pour vous permettre d'imprimer dans les queues 
d'impression Novell (ceci est document&eacute; plus loin dans la section client
d'impression). Le paquetage <EM>ncpfs</EM> fonctionne avec les serveurs
de fichier Novell version 3.x et sup&eacute;rieurs, il ne fonctionne pas avec les
serveurs de fichier Novell version 2.x . Le client <EM>ncpfs</EM> ne
fonctionne qu'avec les produits r&eacute;ellement compatibles Novell, mais
malheureusement, certains produits qui se disent compatibles ne le sont
pas suffisamment. Pour utiliser <EM>ncpfs</EM> avec Novell 4.x, 
il est pr&eacute;f&eacute;rable d'utiliser le serveur Novell en mode d'emulation
de <EM>bindery</EM>. Le support de la NDS est un ajout tr&egrave;s r&eacute;cent
de <EM>ncpfs</EM> et est toujours en version bêta. De plus son utilisation
peut &ecirc;tre interdite dans votre pays en raison de l'inclusion
de technologie soumise &agrave; brevet. </P>


<H2><A NAME="ss9.1">9.1  Comment r&eacute;cup&eacute;rer <B><EM>ncpfs</EM></B></A>
</H2>

<P>L'ensemble <EM>ncpfs</EM> a &eacute;t&eacute; d&eacute;velopp&eacute; afin d'&ecirc;tre compil&eacute; avec les noyaux de
Linux version <CODE>1.2.13</CODE> ou plus r&eacute;cents que <CODE>1.3.71</CODE> (ce qui
inclut <CODE>2.x.x</CODE>). Si vous n'utilisez pas
un de ces noyaux vous devrez vous en procurer et l'utiliser. 
Le 
<A HREF="kernel-HOWTO.html">Kernel-HOWTO</A> d&eacute;crit comment faire cela en d&eacute;tail.</P>

<P>Vous pouvez vous procurer l'ensemble <EM>ncpfs</EM> par ftp anonyme sur le site
de Volker, 
<A HREF="ftp://ftp.gwdg.de/pub/ncpfs/">ftp.gwdg.de</A>, 
sur 
<A HREF="ftp://metalab.unc.edu/pub/Linux/system/Filesystems/ncpfs">metalab.unc.edu</A> 
ou sur un site miroir. La version &agrave; jour au moment o&ugrave; j'&eacute;cris ces lignes est
<CODE>ncpfs-2.0.11.tgz</CODE> ou <CODE>ncpfs-2.2.0.tgz</CODE> pour le support de la NDS.</P>

<H2><A NAME="ss9.2">9.2  Compiler <B><EM>ncpfs</EM></B> pour les noyaux 1.2.13</A>
</H2>

<P>
<DL>
<DT><B>Compiler un noyau Linux avec les supports d'Ethernet et IPX</B><DD><P>La premi&egrave;re chose que vous ayez &agrave; faire est de v&eacute;rifier que votre
noyau a &eacute;t&eacute; compil&eacute; avec l'option IPX. Dans la version <CODE>1.2.13</CODE> du
noyau, vous vous assurerez que la r&eacute;ponse &agrave; la question '<CODE>The IPX
Protocol</CODE>' est <CODE>Y</CODE> (yes) comme illustr&eacute; :
<PRE>
         ...
         ...
        Assume subnets are local (CONFIG_INET_SNARL) [y]
        Disable NAGLE algorithm (normally enabled) (CONFIG_TCP_NAGLE_OFF) [n]
        The IPX protocol (CONFIG_IPX) [n] y
        *
        * SCSI support
         ...
         ...
</PRE>

Vous devez aussi v&eacute;rifier que vous avez inclus le gestionnaire appropri&eacute;
pour votre carte Ethernet. Si vous ne savez pas comment proc&eacute;der, je vous
conseille de lire l'Ethernet-HOWTO
<A HREF="Ethernet-HOWTO.html">Ethernet-HOWTO</A>.</P>
<P>  
Vous pourrez alors proc&eacute;der &agrave; la compilation. Je vous rappelle que le
lancement de <EM>lilo</EM> pour installer le nouveau noyau est obligatoire une fois
la compilation termin&eacute;e.</P>

<DT><B>D&eacute;compresser les programmes <EM>ncpfs</EM></B><DD><P>
<PRE>
        # cd /usr/src
        # tar xvfz ncpfs-2.0.11.tgz
        # cd ncpfs
</PRE>
</P>
<DT><B>V&eacute;rifier le Makefile</B><DD><P>Si vous avez l'intention d'utiliser <EM>kerneld</EM> pour charger automatiquement
le module noyau <EM>ncpfs</EM>, alors vous devez d&eacute;commenter la ligne du 
<CODE>Makefile</CODE> qui fait r&eacute;f&eacute;rence &agrave; <CODE>KERNELD</CODE>. Si vous n'&ecirc;tes pas
certain de comprendre tout ce que cela signifie, vous devriez lire le
<A HREF="Kernel-HOWTO.html">Kernel-HOWTO</A> pour vous familiariser avec la configuration des 
modules noyau.</P>

<DT><B>Compiler les outils <EM>ncpfs</EM></B><DD><P>Le logiciel doit se compiler proprement sans qu'une configuration ne
soit n&eacute;cessaire :
<PRE>
        # make
</PRE>
</P>

<DT><B>Copier les outils IPX &agrave; un endroit utile de votre arborescence</B><DD><P>Apr&egrave;s cette compilation, vous trouverez tous les outils dont vous
aurez besoin dans le r&eacute;pertoire <CODE>ncpfs/bin</CODE>. 
Vous pouvez utiliser</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
         # make install
</PRE>
</CODE></BLOCKQUOTE>

pour installer les outils dans le choix de r&eacute;pertoires de Volker.
Si votre syst&egrave;me est bas&eacute; sur ELF, alors vous devrez taper <CODE>ldconfig -v</CODE>
pour vous assurer que la biblioth&egrave;que partag&eacute;e est accessible.</P>

<DT><B>Copier le module <EM>npfs.o</EM> &agrave; un endroit appropri&eacute; si n&eacute;cessaire.</B><DD><P>Apr&egrave;s la compilation d'un noyau <CODE>1.2.x</CODE>, vous trouverez aussi dans le 
r&eacute;pertoire <CODE>ncpfs/bin</CODE> le fichier <CODE>ncpfs.o</CODE>
Il s'agit du module <EM>ncpfs</EM> du
noyau. Je vous conseille de copier ce fichier &agrave; un endroit utile. Par
exemple sur ma distribution <EM>Debian</EM> de Linux, je l'ai copi&eacute; 
dans le r&eacute;pertoire <CODE>/lib/modules/1.2.13/fs</CODE> et j'ai ajout&eacute; ncpfs dans
le fichier <CODE>/etc/modules</CODE> de mani&egrave;re &agrave; ce qu'il soit automatiquement
charg&eacute; lors du d&eacute;marrage de Linux. Si vous utilisez d'autres distributions,
vous devrez trouver o&ugrave; les modules sont g&eacute;n&eacute;ralement plac&eacute;s et copier
le fichier <CODE>ncpfs.o</CODE> &agrave; cet endroit, ou sinon, copiez-le dans le
r&eacute;pertoire <CODE>/etc</CODE>. Utilisez la commande suivante afin de charger le
module en m&eacute;moire manuellement :
<PRE>
        # insmod ncpfs.o
        
</PRE>
</P>
</DL>
</P>

<H2><A NAME="ss9.3">9.3 Compiler <B><EM>ncpfs</EM></B> pour des noyaux 1.3.71++/2.0.*</A>
</H2>

<P>Pour la derni&egrave;re version de <EM>ncpfs</EM>, vous devez utiliser un noyau 1.3.71 
ou sup&eacute;rieur, ce qui inclut les noyaux 2.0.* .</P>
<P>Le code noyau de <EM>ncpfs</EM> a &eacute;t&eacute; inclus dans la distribution noyau standard,
ainsi vous n'aurez qu'&agrave; r&eacute;pondre oui (<CODE>Y</CODE>)
&agrave; la question suivante
lors de la configuration de la compilation :
<BLOCKQUOTE><CODE>
<PRE>
Networking options  --->
    ...
    ...
    &lt;*> The IPX protocol
    ...
Filesystems  --->
    ...
    ...
    &lt;*> NCP filesystem support (to mount NetWare volumes)
    ...
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>Vous devez suivre les instructions pour la compilation des noyaux <CODE>1.2.*</CODE>
afin de cr&eacute;er les outils IPX, mais il n'y aura pas de module &agrave; installer.</P>


<H2><A NAME="ss9.4">9.4 Configurer et utiliser <B><EM>ncpfs</EM></B></A>
</H2>

<P>
<DL>
<DT><B>Configurer les logiciels de r&eacute;seau IPX</B><DD><P>Deux moyens sont possibles pour configurer ceux-ci. Vous pouvez tout
faire manuellement ou vous pouvez laisser le logiciel d&eacute;terminer lui-m&ecirc;me 
ses param&egrave;tres en utilisant
<PRE>
        # ipx_configure --auto_interface=on --auto_primary=on
</PRE>

Cela devrait fonctionner dans la plupart des situations, mais si ce n'est
pas votre cas, lisez la section "les outils IPX" situ&eacute;e plus loin dans
ce document pour configurer manuellement les logiciels. Des probl&egrave;mes ont
&eacute;t&eacute; rapport&eacute;s concernant cette utilisation au sein de r&eacute;seaux
contenant des clients Windows95.</P>

<DT><B>Tester la configuration</B><DD><P>Maintenant que votre r&eacute;seau IPX est configur&eacute;, vous devriez &ecirc;tre 
capable d'ex&eacute;cuter la commande <EM>slist</EM> qui vous renverra la liste 
de tous les serveurs de fichiers Novell de votre r&eacute;seau :</P>
<P>
<PRE>
        # slist
</PRE>

Si la commande slist affiche un message du type :
<CODE>ncp_connect: Invalid argument</CODE>, cela signifie que votre noyau ne 
supporte pas IPX. V&eacute;rifiez que vous
avez d&eacute;marr&eacute; votre ordinateur avec le noyau appropri&eacute;.
Au d&eacute;marrage du syst&egrave;me, vous devriez voir des messages concernant
"IPX" et "ncpfs".
Si la commande <EM>slist</EM> ne
renvoie pas la liste de tous les serveurs de fichiers, vous devrez utiliser la
m&eacute;thode de configuration manuelle.</P>

<DT><B>Monter un volume ou un serveur Novell(tm)</B><DD><P>Si votre logiciel r&eacute;seau IPX fonctionne correctement, vous devriez
pouvoir monter un volume du serveur de fichiers dans votre syst&egrave;me
de fichiers Linux.
La commande <EM>ncpmount</EM> est utilis&eacute;e &agrave; ces fins et n&eacute;cessite que vous
sp&eacute;cifiez au moins les informations suivantes :
<OL>
<LI>le nom du serveur de fichiers ;</LI>
<LI>(&eacute;ventuellement) le r&eacute;pertoire du serveur de fichier &agrave; monter ;</LI>
<LI>l'identifiant de login du serveur de fichiers. Dans le cas o&ugrave; il
a un mot de passe, vous devrez aussi le donner &agrave; cette commande ;</LI>
<LI> le point de montage, c'est-&agrave;-dire l'endroit o&ugrave; vous voulez que le 
syst&egrave;me de fichiers du serveur Novell soit mont&eacute; dans votre syst&egrave;me de fichiers.
Ce doit &ecirc;tre un r&eacute;pertoire d&eacute;j&agrave; existant.</LI>
</OL>

De la m&ecirc;me mani&egrave;re, il existe une commande <EM>ncpumount</EM> pour d&eacute;monter
un syst&egrave;me de fichiers NCP mont&eacute;. Le syst&egrave;me de fichiers NCP sera d&eacute;mont&eacute;
proprement si vous &eacute;teignez votre machine normalement. Vous n'avez donc pas
&agrave; vous tracasser pour <EM>ncpumount</EM>er manuellement vos syst&egrave;mes de
fichiers avant un halt ou un shutdown.</P>
<P>Par exemple si l'on veut monter le serveur de fichiers <CODE>ACCT_FS01</CODE> sous
l'identifiant <CODE>guest</CODE> qui ne poss&egrave;de pas de mot de passe, dans le
r&eacute;pertoire <CODE>/mnt/Accounts</CODE>, la commande devrait ressembler &agrave; :
<PRE>
     # ncpmount -S ACCT_FS01 /mnt/Accounts -U guest -n
</PRE>

Notez que l'utilisation de l'option <CODE>-n</CODE> indique qu'aucun mot de passe
n'est n&eacute;cessaire pour se loguer. Le m&ecirc;me login avec le mot de
passe <CODE>secret</CODE> ressemblera &agrave; :
<PRE>
     # ncpmount -S ACCT_FS01 /mnt/Accounts -U guest -P secret
</PRE>

Si vous ne sp&eacute;cifiez ni l'option <CODE>-n</CODE> ni l'option <CODE>-P</CODE>, 
le syst&egrave;me vous demandera un mot de passe.</P>


<DT><B>V&eacute;rifier le montage</B><DD><P>Si le montage est r&eacute;ussi, vous pourrez acc&eacute;der &agrave; tous les 
volumes auxquels l'utilisateur que vous avez sp&eacute;cifi&eacute; a acc&egrave;s. 
Cet acc&egrave;s se fait de mani&egrave;re
transparente comme si le volume se trouvait directement dans le r&eacute;pertoire
sp&eacute;cifi&eacute; lors du montage.  Vous devez &ecirc;tre capable de naviguer
au travers des r&eacute;pertoires de ce volume et d'y trouver des fichiers. 
Vous pouvez &eacute;galement utiliser l'option <CODE>-V</CODE> pour monter un seul volume.</P>
<P>NCP ne fournit pas d'identificateur d'utilisateur (uid) ni d'identificateur de
groupe (gid) pour les fichiers. Tous les fichiers auront les permissions
donn&eacute;es au r&eacute;pertoire de montage, restreints par les droits de permissions
sur le serveur Novell. Gardez ce point &agrave; l'esprit
lorsque vous partagerez des montages avec des utilisateurs Linux.</P>


<DT><B>Configurer le montage automatique des volumes ncp</B><DD><P>Si vous avez besoin de monter de mani&egrave;re permanente vos partitions
ncp, vous aurez &agrave; mettre les commandes de configuration ci-dessus dans vos
fichiers <EM>rc</EM> de mani&egrave;re &agrave; ce que le montage soit op&eacute;r&eacute; &agrave; chaque 
d&eacute;marrage de Linux.
Si votre distribution ne fournit pas d&eacute;j&agrave; un moyen de configurer IPX comme
le propose Debian, alors je vous recommande de les placer dans le fichier 
<CODE>/etc/rc.local</CODE> si vous en avez un.
Vous devrez utiliser un script du type suivant :
<BLOCKQUOTE><CODE>
<PRE>

          #
          # Démarrer le systéme de fichiers NCP
          /sbin/insmod /lib/modules/1.2.13/fs/ncpfs.o

          # Configurer le reseau IPX
          ipx_configure --auto_interface=on --auto_primary=on

          # Accéder au volume réservé à l'utilisateur guest sur le serveur de fichiers
          ncpmount -S ACCT_FS01 /mnt/Accounts -U guest -n

          
</PRE>
</CODE></BLOCKQUOTE>

Il existe un autre moyen de configurer les montages NCP. Cela se
fait au moyen du fichier <CODE>$HOME/.nwclient</CODE>. Ce fichier
contient les informations sp&eacute;cifiques &agrave; l'utilisateur qui seront
appliqu&eacute;es sur des montages NCP r&eacute;guliers. Vous pourrez
ainsi les monter sans avoir &agrave; sp&eacute;cifier tous les param&egrave;tres &agrave; chaque fois.</P>
<P>Le format de ce fichier est assez simple :
<BLOCKQUOTE><CODE>
<PRE>
     # Le premier paramètre est le 'serveur préféré'
     # utilisé même si vous ne spécifiez pas de serveur lors du
     # lancement du script.
     #
     # L'utilisateur TERRY se loguant sur le serveur de fichiers DOCS_FS01 
     # avec le mot de passe 'password' 
     DOCS_FS01/TERRY password
     #
     # Login Guest sur le serveur de fichiers ACCT_FS01 sans mot de passe.
     ACCT_FS01/GUEST -
</PRE>
</CODE></BLOCKQUOTE>

Vous pourrez, par la suite,  utiliser :
<BLOCKQUOTE><CODE>
<PRE>

          $ ncpmount /home/terry/docs
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>afin de monter la partition <CODE>DOCS_FS1</CODE> avec le login 
<CODE>TERRY</CODE> sous le r&eacute;pertoire <CODE>/home/terry/docs</CODE>. 
Vous remarquerez que cette commande a &eacute;t&eacute;
choisie car aucun serveur de fichiers n'a &eacute;t&eacute; sp&eacute;cifi&eacute; dans la commande de
montage. Si la commande suivante avait &eacute;t&eacute; utilis&eacute;e :
<BLOCKQUOTE><CODE>
<PRE>
          $ ncpmount -S ACCT_FS01 /home/terry/docs
</PRE>
</CODE></BLOCKQUOTE>

vous seriez entr&eacute; sur le serveur de fichiers <CODE>ACCT_FS01</CODE> avec le compte 
<CODE>GUEST</CODE>.</P>
<P><B>Note :</B> Pour que ce m&eacute;canisme fonctionne, il faut que la permission de
<CODE>$HOME/.nwclient</CODE> soit de <CODE>0600</CODE>, vous devrez utiliser la commande suivante :
<BLOCKQUOTE><CODE>
<PRE>
           $ chmod 0600 $HOME/.nwclient
</PRE>
</CODE></BLOCKQUOTE>
           </P>
<P>Si des utilisateurs non-root ont la permission
d'utiliser ce m&eacute;canisme, la commande <EM>ncpmount</EM> doit utiliser 
un Set Userid Root, vous aurez donc &agrave; donner ces permissions :
<BLOCKQUOTE><CODE>
<PRE>
        # chmod 4755 ncpmount
</PRE>
</CODE></BLOCKQUOTE>
      </P>

<DT><B>Tester l'utilitaire nsend</B><DD><P><EM>nsend</EM> est un utilitaire pour envoyer des messages &agrave; des utilisateurs
Novell qui est &eacute;galement inclus dans le paquetage. Il s'utilise de la
mani&egrave;re suivante :
<BLOCKQUOTE><CODE>
<PRE>
        # nsend pierre coucou ici
</PRE>
</CODE></BLOCKQUOTE>

qui va envoyer le message "coucou ici" &agrave; un utilisateur "pierre" d&eacute;j&agrave; logu&eacute;
sur votre serveur de fichiers "primaire" (le premier qui appara&icirc;t dans votre
fichier <CODE>.nwclient</CODE>). Vous pouvez sp&eacute;cifier un autre serveur de 
fichiers avec la m&ecirc;me syntaxe que la commande <EM>ncpumount</EM>.</P>
</DL>
</P>


<H2><A NAME="s10">10. Configurer votre machine Linux en serveur NCP</A></H2>

<P>Il existe deux paquetages permettant &agrave; Linux de fournir les
fonctions d'un serveur de fichiers Novell. Tous deux permettent de partager
des fichiers de la machine Linux entre les utilisateurs utilisant un client
Novell Netware. Les utilisateurs peuvent attacher et utiliser des syst&egrave;mes de
fichiers Novell comme des volumes locaux &agrave; leurs machines juste comme s'ils
provenaient d'un serveur de fichiers Novell. Je vous propose d'essayer les deux
paquetages afin de voir celui qui correspond le mieux &agrave; vos besoins.</P>


<H2><A NAME="ss10.1">10.1 L'ensemble <B><EM>mars_nwe</EM></B></A>
</H2>

<P>Martin Stover <CODE>&lt;mstover@freeway.de&gt;</CODE> a d&eacute;velopp&eacute;
<EM>mars_nwe</EM> pour permettre &agrave;
Linux de fournir des services fichiers et impression pour des clients NetWare.</P>
<P><EM>mars_nwe</EM> signifie "Martin Stover's Netware Emulator".</P>

<H3>Possibilit&eacute;s offertes par <B><EM>mars_nwe</EM></B></H3>

<P><EM>mars_nwe</EM> fournit un sous-ensemble de la sp&eacute;cification Novell NCP pour les
services fichiers, pour les connexions aux disques et aussi pour les services
d'impressions. Il est probable qu'il contient des bogues mais beaucoup de
personnes l'utilisent et le nombre de bogues diminue avec les nouvelles 
versions.</P>

<H3>Obtenir <B><EM>mars_nwe</EM></B></H3>

<P>Vous pouvez r&eacute;cup&eacute;rer <EM>mars_nwe</EM> sur le serveur 
<A HREF="ftp://ftp.gwdg.de/pub/linux/misc/ncpfs/">ftp.gwdg.de</A>. 
ou sur
<A HREF="ftp://metalab.unc.edu/pub/linux/filesystems/ncpfs/">metalab.unc.edu</A>. <BR>
La version &agrave; jour lors de l'&eacute;criture de
ce document est : <CODE>mars_nwe-0.99.pl10.tgz</CODE>.</P>

<H3>Compiler l'ensemble <EM>mars_nwe</EM></H3>

<P>
<DL>
<DT><B>Compiler un noyau Linux supportant Ethernet et IPX.</B><DD><P>Dans la version <CODE>1.2.13</CODE> du noyau, vous devrez juste v&eacute;rifier que vous
avez r&eacute;pondu oui (<CODE>Y</CODE>) &agrave; '<CODE>The
IPX Protocol</CODE>' et non (<CODE>N</CODE>) &agrave; '<CODE>Full internal IPX network</CODE>'
comme illustr&eacute; :
<PRE>
 ...
 ...
The IPX protocol (CONFIG_IPX) [n] y
 ...
 ...
Full internal IPX network (CONFIG_IPX_INTERN) [N/y/?] n
 ...
 ...
</PRE>

Pour les noyaux plus r&eacute;cents, un proc&eacute;d&eacute; similaire est utilis&eacute; lors de
la construction du noyau. La question pos&eacute;e peut l&eacute;g&egrave;rement changer.</P>
<P>     
Assurez-vous aussi d'un choix appropri&eacute; pour votre carte Ethernet. Si
vous ne savez pas comment proc&eacute;der, vous devriez lire
l'Ethernet-HOWTO,
<A HREF="Ethernet-HOWTO.html">Ethernet-HOWTO</A>.</P>
<P>     
Vous pouvez maintenant proc&eacute;der &agrave; la compilation de votre
noyau. Une fois cette &eacute;tape finie, n'oubliez pas de lancer
<EM>lilo</EM> afin d'installer le nouveau noyau.</P>

<DT><B>D&eacute;compresser le paquetage <EM>mars_nwe</EM>.</B><DD><P>
<BLOCKQUOTE><CODE>
<PRE>
          # cd /usr/src
          # tar xvfz mars_nwe-0.99.pl10.tgz
</PRE>
</CODE></BLOCKQUOTE>
</P>

<DT><B>Compiler <EM>mars_nwe</EM>.</B><DD><P>Cette op&eacute;ration est tr&egrave;s simple.
La premi&egrave;re &eacute;tape consiste simplement &agrave; lancer <CODE>make</CODE>, cela va vous 
cr&eacute;er un fichier <CODE>config.h</CODE>. Ensuite, vous devez regarder et modifier
le fichier <CODE>config.h</CODE> si n&eacute;cessaire. Cela vous permet de configurer
des choses comme le r&eacute;pertoire d'installation ou le nombre maximum de
sessions et de volumes que le serveur pourra supporter. Les lignes importantes
&agrave; regarder sont :
<PRE>
FILENAME_NW_INI       l'emplacement des fichiers d'initialisation
PATHNAME_PROGS        l'emplacement du programme exécutable
PATHNAME_BINDERY      l'endroit où iront les fichiers de la 'bindery'
PATHNAME_PIDFILES     le répertoire où les fichiers PID seront écrits
MAX_CONNECTIONS       le nombre maxi de connexions simultanées autorisées
MAX_NW_VOLS           le nombre maxi de volumes supportés par mars_nwe
MAX_FILE_HANDLES_CONN le nombre maxi de fichiers ouverts par connexion
WITH_NAME_SPACE_CALLS si vous voulez supporter les clients ncpfs
INTERNAL_RIP_SAP      si vous voulez que mars_nwe fasse le routage rip/sap
SHADOW_PWD            selon que vous utilisez les 'shadow passwords' ou non
</PRE>

Les options par d&eacute;faut devraient vous convenir mais v&eacute;rifiez quand m&ecirc;me.</P>
<P>Une fois ceci termin&eacute; tapez :
<BLOCKQUOTE><CODE>
<PRE>
          # make
          # make install
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ces commandes compileront les diff&eacute;rents serveurs et les
installeront dans un r&eacute;pertoire appropri&eacute;. Le script
d'installation installe aussi le fichier de configuration
<CODE>/etc/nwserv.conf</CODE>.</P>

<DT><B>Configuration du serveur.</B><DD><P>Celle-ci est simple. Il faut &eacute;diter le fichier<CODE>/etc/nwserv.conf</CODE>.
Le format de ce fichier peut vous sembler assez &eacute;nigmatique au
premier abord,
mais il est en fait bel et bien ordonn&eacute;. Chaque ligne de ce fichier
correspond &agrave; un point de configuration. Chacune de ces lignes est
d&eacute;limit&eacute;e par le caract&egrave;re espace et d&eacute;bute par un nombre qui indique
le contenu de la ligne. Tous les
caract&egrave;res pr&eacute;c&eacute;d&eacute;s du caract&egrave;re '<CODE>#</CODE>' sont consid&eacute;r&eacute;s comme &eacute;tant un
commentaire et de ce fait sont ignor&eacute;s. Martin fournit un fichier
d'exemple de configuration dans son paquetage, cependant, je vous
donne ce que je consid&egrave;re comme &eacute;tant une version simplifi&eacute;e de ce
fichier, et ce, afin que vous puissiez mieux le comprendre. 
<BLOCKQUOTE><CODE>
<PRE>

     # VOLUMES (max. 5)
     # Seul le volume SYS est obligatoire. Le répertoire contenant le volume
     # SYS doit contenir les répertoires : LOGIN, PUBLIC, SYSTEM, MAIL.
     # l'option 'i' ignore la casse (majuscules/minuscules)
     # l'option 'k' convertit toutes les requêtes de nom de fichier en 
     # minuscules
     # l'option 'm' indique que le volume est amovible (cdrom par ex.)
     # l'option 'r' positionne le volume en lecture seule
     # l'option 'o' indique le volume est un système de fichiers monté unique
     # l'option 'P' permet aux commandes d'être utilisées comme des fichiers
     # l'option 'O' permet l'utilisation de l'espace de noms (namespace) OS/2
     # l'option 'N' permet l'utilisation de l'espace de noms (namespace) NFS
     #
     # Par défaut les noms de fichiers sont en majuscules.
     # Syntaxe :
     #    1 &lt;Nom du volume> &lt;Chemin du volume>   &lt;Options>

     1   SYS         /home/netware/SYS/                 # SYS
     1   DATA        /home/netware/DATA/   k            # DATA
     1   CDROM       /cdrom                kmr          # CDROM

     # NOM DU SERVEUR
     # Si cette option n'est pas mise le nom du serveur Linux sera converti
     # en majuscule et utilisé
     # Syntaxe :
     #    2 &lt;Nom du serveur>

     2   LINUX_FS01

     # ADRESSE DE RESEAU INTERNE 
     # l'adresse de réseau interne est une fonctionnalité qui simplifie
     # le routage IPX pour les machines reliées à plusieurs réseaux IPX.
     # Syntaxe :
     #    3 &lt;adresse interne du réseau> [&lt;Numéro de noeud>]
     # ou
     #    3 auto
     # si vous utilisez 'auto' alors l'adresse IP de la machine sera 
     # utilisée. NOTE : cela peut être dangereux, assurez-vous de prendre
     # un nombre unique sur votre réseau. Les adresses sont codées en
     # hexadécimal sur 4 octets (le préfixe 0x est obligatoire).
     3 0x49a01010 1

     # PERIPHERIQUES RESEAU
     # Cette option configure votre réseau IPX. Si votre réseau IPX est déjà
     # configuré, vous n'en aurez pas besoin.
     # Syntaxe
     #    4 &lt;Numéro de reseau IPX> &lt;Nom de périphérique> &lt;Type de trame> [&lt;ticks>]
     #                         Types de trames : ethernet_ii, 802.2, 802.3, SNAP

     4  0x39a01010  eth0  802.3  1

     # SAUVEGARDE DES ROUTES IPX APRES EXTINCTION DU SERVEUR.
     # Syntaxe :
     #    5 &lt;drapeau>
     #       0 = ne pas sauver les routes, 1 = sauver les routes.

     5 0

     # VERSION DE NETWARE
     # Syntaxe :
     #    6 &lt;version>
     #      0 = 2.15, 1 = 3.11

     6 1

     # GESTION DES MOTS DE PASSE
     # les clients DOS de Novell supportent une fonctionnalité qui chiffre
     # votre mot de passe (mdp) lorsque vous le changez. Vous pouvez
     # configurer votre serveur mars pour supporter cette fonctionnalité.
     # Syntaxe :
     #    7 &lt;drapeau>
     # avec &lt;drapeau> =
     #    0 force chiffrage du mdp (les clients ne peuvent pas changer de mdp).
     #    1 force chiffrage du mdp, permet les changements de mdp non chiffrés.
     #    7 permet les mdp non chiffrés mais pas les mdp nuls.
     #    8 permet les mdp non chiffrés ainsi que les mdp nuls.
     #    9 seulement les mdp non chiffrés (ne marche pas avec OS/2).

     7 1

     # DROITS MINIMUM EN FONCTION DES GID ET UID
     # Les permissions qui sont appliquées lors de connexions sans login
     # Ces permissions seront utilisées pour les fichiers 
     # de votre serveur primaire.
     # Syntaxe :
     #    10 &lt;gid>
     #    11 &lt;uid>
     #    &lt;gid> &lt;uid> sont ceux donnés dans /etc/passwd et /etc/group

     10  200
     11  201

     # MOT DE PASSE DU SUPERVISEUR
     # Doit etre enlevé après le premier démarrage du serveur. Le serveur 
     # cryptera cette information dans le fichier de bindery après son     
     # lancement. Vous devriez éviter d'utiliser le compte 'root' et en choisir
     # un autre pour administrer le serveur mars.
     #
     # Cette entrée est lue et chiffrée dans le fichier de bindery du serveur,
     # elle n'a donc besoin d'être présente que la première fois que vous
     # démarrez le serveur, pour s'assurer que le mot de passe ne soit pas volé
     # Syntaxe :
     #    12 &lt;Login du superviseur> &lt;Nom d'utilisateur UNIX> [&lt;mot de passe>]

     12  SUPERVISOR  terry  secret

     # COMPTES DES UTILISATEURS
     # Permet d'associer les comptes NETWARE aux comptes UNIX. Les mots de
     # passe sont en option.
     # Syntaxe :
     #    13 &lt;Login utilisateur> &lt;Nom d'utilisateur UNIX> [&lt;mot de passe>]

     13  MARTIN martin
     13  TERRY  terry

     # ADMINISTRATION SYSTEME PARESSEUSE
     # Si vous avez beaucoup d'utilisateurs et ne pouvez/voulez utiliser
     # le champ 13 pour chaque utilisateur, vous pouvez faire correspondre
     # automatiquement les logins mars_nwe aux logins des utilisateurs Linux
     # MAIS il n'y a pour le moment aucun moyen d'utiliser les mots de passe
     # des comptes Linux si bien que tous les utilisateurs configurés de cette
     # façon devront utiliser le mot de passe fourni ici.
     # Je vous déconseille de l'utiliser à moins que la sécurité ne fasse pas
     # partie de vos préoccupations.
     # Syntaxe :
     #    15 &lt;drapeau> &lt;mot de passe commun>
     # avec &lt;drapeau> :
     #    0  - ne configure aucun utilisateur automatiquement.
     #    1  - configure automatiquement les utilisateurs non encore configurés.
     #    99 - configure automatiquement tous les utilisateurs. 

     15 0 duzzenmatta

     # VERIFICATION SIMPLE
     # mars_nwe s'assurera automatiquement que certains répertoires existent
     # si vous positionnez ce drapeau.
     # Syntaxe :
     #    16 &lt;drapeau>
     # avec &lt;drapeau> à 0 pour non, ne fait rien et 1 pour oui, vérifie.

     16 0
     
     # QUEUES D'IMPRESSION
     # Permet d'associer des imprimantes Netware à des imprimantes UNIX. Les
     # répertoires de files d'impression doivent être crées manuellement
     # avant de tenter toute impression.
     # Syntaxe :
     #    21 &lt;Nom de queue> &lt;répertoire de queue> &lt;commande d'impression UNIX>

     21  EPSON  SYS:/PRINT/EPSON lpr -h
     21  LASER  SYS:/PRINT/LASER lpr -Plaser

     # DRAPEAUX DE DEBOGAGE 
     # normalement, ils ne sont pas nécessaires, mais ils peuvent être utiles
     # pour la résolution de problèmes.
     # Syntaxe :
     #    &lt;élément de débogage> &lt;drapeau de debogage>
     #
     #    100 = IPX KERNEL
     #    101 = NWSERV
     #    102 = NCPSERV
     #    103 = NWCONN
     #    104 = démarrage NWCLIENT
     #    105 = NWBIND
     #    106 = NWROUTED
     #                 0 = supprime le débogage, 1 = active le débogage

     100 0
     101 0
     102 0
     103 0
     104 0
     105 0
     106 0

     # LANCER LE SERVEUR NETWARE EN TACHE DE FOND ET UTILISER UN FICHIER DE LOG
     # Syntaxe :
     #    200 &lt;drapeau>
     #        0 = Lance NWSERV en avant-plan et pas de fichier de log
     #        1 = Lance NWSERV en tâche de fond et utiliser le fichier de log

     200  1

     # NOM DU FICHIER DE LOG
     # Syntaxe :
     #    201 &lt;Fichier de log>

     201  /tmp/nw.log

     # AJOUT/ECRASEMENT DU FICHIER DE LOG
     # Syntaxe :
     #    202 &lt;drapeau>
     #        0 = ajouter dans le fichier de log existant
     #        1 = écraser le fichier de log existant

     202  1

     # EXTINCTION DU SERVEUR
     # Ce point modifie le délai entre l'affichage d'extinction du serveur et
     # l'extinction réelle du serveur
     # Syntaxe :
     #    210 &lt;temps>
     #        en secondes (par défaut 10)

     210  10

     # INTERVALLE ENTRE LES DIFFUSIONS DE ROUTAGE
     # la durée en secondes entre les diffusions (broadcast) de serveurs
     # Syntaxe :
     #    211 &lt;temps>
     #        en secondes (par défaut : 60)
     
     211 60

     # INTERVALLE ENTRE LES LOGS DE ROUTAGE
     # configure le nombre de diffusions après lesquelles les informations
     # de routage sont écrites dans les fichiers de log.
     # Syntaxe :
     #    300 &lt;nombre>

     300 5

     # FICHIER DE LOG DE ROUTAGE
     # configure le nom du fichier de log des informations de routage
     # Syntaxe :
     #    301 &lt;nom de fichier>
     
     301 /tmp/nw.route

     # AJOUT/ECRASEMENT DU FICHIER DE LOG DE ROUTAGE
     # configure si vous voulez ajouter les nouveaux logs à la fin du
     # fichier existant ou bien le réecrire.
     # Syntaxe :
     #    302 &lt;drapeau>
     #    avec &lt;drapeau> à 0 pour l'ajout et à 1 pour création/écrasement

     302 1

     # MINUTAGE DU CHIEN DE GARDE (watchdog)
     # Configure les intervalles de temps entre les messages de garde pour
     # s'assurer que le réseau est toujours vivant. 
     # Syntaxe :
     #    310 &lt;valeur>
     # avec &lt;valeur> =
     #      0  - toujours envoyer des messages de garde.
     #      &lt;0 - ne jamais envoyer de message de garde.
     #      >0 - envoyer des messages quand le trafic réseau chute en dessous
     #           de 'n' ticks.

     310 7

     # FICHIER DE STATIONS
     # configure le nom du fichier qui détermine les machines pour lesquelles
     # ce serveur de fichiers sera le serveur primaire.
     # La syntaxe de ce fichier est décrite dans le répertoire 'examples'
     # du code source.
     # Syntaxe :
     #    400 &lt;nom de fichier>

     400 /etc/nwserv.stations

     # OBTENTION DU SERVEUR DE FICHIERS LE PLUS PROCHE
     # Configure la manière dont sont gerées les requêtes SAP 'obtention
     # du serveur le plus proche' (Get Nearest Fileserver).
     # Syntaxe :
     #    401 &lt;drapeau>
     # avec &lt;drapeau> =
     #      0 : désactive cette requête
     #      1 : le fichier de stations liste les stations à exclure
     #      2 : le fichier de stations liste les station à inclure

     401 2
</PRE>
</CODE></BLOCKQUOTE>
</P>

<DT><B>D&eacute;marrer le serveur</B><DD><P>Si vous avez configur&eacute; le serveur de telle sorte que d'autres programmes
configurent le r&eacute;seau et/ou fournissent les fonctions de routage, alors
vous devez lancer ces programmes avant de d&eacute;marrer le serveur.
Si vous avez configur&eacute; le serveur pour qu'il configure vos interfaces
et fournisse des services de routage, alors pour d&eacute;marrer le serveur, 
il n'y a qu'&agrave; taper :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
                
        # nwserv
</PRE>
</CODE></BLOCKQUOTE>
</P>

<DT><B>Tester le serveur</B><DD><P>Pour tester le serveur vous devrez tout d'abord essayer de vous connecter et
entrer par login gr&acirc;ce &agrave; un client Netware sur votre r&eacute;seau. Vous pouvez
alors faire un <CODE>CAPTURE</CODE> &agrave; partir de votre client et essayer 
d'imprimer. Si ces
deux actions sont couronn&eacute;es de succ&egrave;s, votre serveur fonctionne.</P>
</DL>
</P>

<H2><A NAME="ss10.2">10.2 L'ensemble <B><EM>lwared</EM></B></A>
</H2>

<P>Ales Dryak <CODE>&lt;A.Dryak@sh.cvut.cz&gt;</CODE> a
d&eacute;velopp&eacute; <EM>lwared</EM> pour permettre &agrave;
Linux de fonctionner comme un serveur de fichiers bas&eacute; sur NCP.</P>
<P><EM>Lwared</EM> est l'abr&eacute;viation de <EM>LinWare Daemon</EM>.</P>

<H3>Possibilit&eacute;s offertes par <B><EM>lwared</EM></B></H3>

<P>Le serveur <EM>lwared</EM> est capable de fournir un sous-ensemble de 
services d'un
serveur Novell NCP. Le syst&egrave;me de messageries a &eacute;t&eacute; inclus mais il ne fournit pas
de facilit&eacute;s d'impression. De plus il ne fonctionne pas bien avec des clients
pour Windows 95 ou Windows NT. Ce serveur s'appuie sur des programmes
ext&eacute;rieurs pour construire et maintenir le routage IPX et les tables SAP. Le
mauvais comportement d'un client peut causer le "plantage" du serveur. Il est
aussi important de savoir que la retranscription des noms de fichiers
(minuscules/majuscules) n'a pas non plus &eacute;t&eacute; incluse.</P>
<P>Ce serveur fonctionne avec les shells Netware NETX et VLM.</P>

<H3>R&eacute;cup&eacute;rer <B><EM>lwared</EM></B></H3>

<P>Le paquetage <EM>lwared</EM> peut &ecirc;tre construit pour n'importe quel noyau
sup&eacute;rieur  &agrave; la version <CODE>1.2.0</CODE>, je vous recommande
d'utiliser la version <CODE>1.2.13</CODE> pour laquelle aucun patch sur le noyau
n'est n&eacute;cessaire. Certaines fonctionnalit&eacute;s ont chang&eacute; avec
la version <CODE>1.3.*</CODE> du noyau, ce qui signifie que des patchs sont n&eacute;cessaires
pour ces versions afin de faire fonctionner ce serveur de mani&egrave;re
correcte. Des patchs appropri&eacute;s sont inclus pour les nouvelles versions de
noyau, ainsi si vous devez absolument utiliser un de ces noyaux, vous serez
toujours en mesure de faire fonctionner <EM>lwared</EM> correctement.</P>
<P>On trouve <EM>lwared</EM> sur
<A HREF="ftp://klokan.sh.cvut.cz/pub/linux/linware/">klokan.sh.cvut.cz</A>,
<A HREF="ftp://metalab.unc.edu/pub/Linux/system/Network/daemons">Metalab</A>,
ou sur un site miroir. La version &agrave; jour lors de l'&eacute;criture de ce document &eacute;tait :
<CODE>lwared-0.95.tar.gz</CODE></P>

<H3>Compiler et installer <B><EM>lwared</EM></B></H3>

<P>
<DL>
<DT><B>D&eacute;compresser l'ensemble <EM>lwared</EM></B><DD><P>Ce qui devrait ressembler &agrave; :
<PRE>
# cd /usr/src
# tar xvpfz lwared-0.95.tar.gz
</PRE>
</P>

<DT><B>Compiler le noyau avec le support Ethernet et IPX</B><DD><P>Si vous utilisez un noyau alpha <CODE>1.3.*</CODE> vous devriez essayer d'utiliser
la version <CODE>1.3.17</CODE> ou une plus r&eacute;cente car les patchs
fournis ont &eacute;t&eacute; faits
pour celles-l&agrave;. Les noyaux <CODE>1.3.*</CODE> plus anciens que
<CODE>1.3.17</CODE> n&eacute;cessiteront d'&ecirc;tre
modifi&eacute;s &agrave; la main pour pouvoir installer lwared (<EM> quelques indications sur
la mani&egrave;re d'op&eacute;rer ce genre de modifications sont donn&eacute;es dans le fichier
<CODE>INSTALL</CODE> du paquetage</EM>). Pour installer les patchs pour la
version <CODE>1.3.17</CODE> du
noyau ou plus r&eacute;cent, vous devrez essayer la commande suivante :
<PRE>
        
        # make patch
</PRE>
</P>
<P>La chose suivante que vous devrez faire apr&egrave;s avoir appliqu&eacute; le patch, le cas
&eacute;ch&eacute;ant, sera de v&eacute;rifier que votre noyau a bien &eacute;t&eacute; compil&eacute; avec le support
IPX actif. Dans la version <CODE>1.2.13</CODE>, vous n'aurez qu'&agrave;
r&eacute;pondre oui (<CODE>Y</CODE>) &agrave; la question
'<CODE>The IPX protocol</CODE>' de la mani&egrave;re suivante :
<PRE>

      ...
      ...
     Assume subnets are local (CONFIG_INET_SNARL) [y]
     Disable NAGLE algorithm (normally enabled) (CONFIG_TCP_NAGLE_OFF) [n]
     The IPX protocol (CONFIG_IPX) [n] y
     *
     * SCSI support
      ...
      ...

</PRE>

Pour les noyaux plus r&eacute;cents, la question peut varier un peu, mais le
proc&eacute;d&eacute; reste fondamentalement le m&ecirc;me.</P>
<P>Vous devrez &eacute;galement vous assurer du choix appropri&eacute; du pilote de votre carte 
Ethernet. Si vous ne savez pas comment proc&eacute;der, je vous conseille vivement de
vous reporter &agrave; 
<A HREF="Ethernet-HOWTO.html">Ethernet-HOWTO</A>.</P>
<P>Vous pouvez maintenant proc&eacute;der &agrave; la compilation de votre noyau. N'oubliez pas
de lancer <EM>lilo</EM> une fois la compilation finie, pour que le nouveau noyau soit
correctement install&eacute;.</P>

<DT><B>Compiler et installer <EM>lwared</EM></B><DD><P>Pour compiler <EM>lwared</EM> vous devez en premier lieu v&eacute;rifier et &eacute;diter si
n&eacute;cessaire le fichier <CODE>server/config.h</CODE>. Ce fichier contient les
&eacute;l&eacute;ments n&eacute;cessaires pour piloter votre serveur et d&eacute;terminer son
comportement lorsqu'il fonctionnera. Le fichier par d&eacute;faut est
raisonnablement bien &eacute;crit mais vous pourrez tout de m&ecirc;me v&eacute;rifier si
les r&eacute;pertoires de fichiers de log et le fichier de configuration
conviennent &agrave; votre syst&egrave;me.
<PRE>
        # make depend
        # make
        # make install
</PRE>
</P>
<P>Le '<CODE>make depend</CODE>' se plaint de ne pas trouver le fichier <CODE>float.h</CODE> sur
mon syst&egrave;me mais cela semble fonctionner tout de m&ecirc;me. J'ai aussi
d&eacute;couvert que lors des compilations avec gcc <CODE>2.6.3</CODE>, il fallait
modifier la ligne :
<PRE>
        
     #include &lt;net/route.h>
</PRE>

en
<PRE>
     #include &lt;net/if_route.h>
</PRE>
</P>
<P>dans le fichier <CODE>lib/ipxkern.c</CODE>. Ceci &eacute;tant d&ucirc; au fait que le fichier
change parfois de nom.</P>
<P>     
Le '<CODE>make install</CODE>' tentera d'installer le serveur et les d&eacute;mons de
routage dans le r&eacute;pertoire <CODE>/usr/sbin</CODE>, le programme
<EM>lwpasswd</EM> dans le
r&eacute;pertoire <CODE>/usr/bin</CODE>, les programmes utilitaires IPX seront copi&eacute;s dans
le r&eacute;pertoire <CODE>/sbin</CODE> et les pages de manuel dans la structure de
r&eacute;pertoire <CODE>/usr/man</CODE>. Si un de ces endroits ne correspond pas &agrave; votre
syst&egrave;me, vous devrez &eacute;diter et modifier les fichiers
<CODE>Makefile</CODE> correspondants.</P>
</DL>
</P>

<H3>Configurer et utiliser <B><EM>lwared</EM></B></H3>

<P>Voici la partie la plus amusante !</P>
<P>
<DL>
<DT><B>Configurer le r&eacute;seau IPX</B><DD><P>La premi&egrave;re chose &agrave; faire est de configurer vos cartes Ethernet
pour qu'elles puissent supporter les r&eacute;seaux IPX connect&eacute;s &agrave; votre 
serveur. Vous devez conna&icirc;tre les adresses
des r&eacute;seaux IPX pour chacun des segments du r&eacute;seau, quel
p&eacute;riph&eacute;rique Ethernet (<CODE>eth0</CODE>, <CODE>eth1</CODE>,
etc.) est en relation avec quel segment,
quel type de trame est utilis&eacute; pour chacun des segments (<CODE>802.3</CODE>,
<CODE>EtherII</CODE>, etc.) et quelle adresse de r&eacute;seau interne votre serveur
doit utiliser (ce qui est vraiment n&eacute;cessaire si votre serveur
doit fournir des services sur plusieurs segments). Par exemple, une
configuration plausible d'un serveur &eacute;tant sur deux segments IPX
ayant pour adresse r&eacute;seau <CODE>23a91300</CODE> et <CODE>23a91301</CODE> et ayant une adresse
de r&eacute;seau interne <CODE>bdefaced</CODE> ressemblera &agrave; :
<PRE>
         
        # ipx_internal_net add BDEFACED 1
        # ipx_interface add eth0 802.3 23a91300
        # ipx_interface add eth1 etherii 23a91301
</PRE>
</P>


<DT><B>D&eacute;marrer les d&eacute;mons de routage</B><DD><P>Le logiciel du noyau permet de faire du renvoi de paquet
IPX comme il le fait pour les paquets IP, cependant le noyau
requiert un programme additionnel pour g&eacute;rer la mise &agrave; jour des
tables de routage. Dans le cas d'IPX, deux d&eacute;mons sont
n&eacute;cessaires et tous deux sont fournis avec <EM>lwared</EM> :
<EM>ipxripd</EM> g&egrave;re l'information de routage IPX et 
<EM>ipxsapd</EM> g&egrave;re les
informations SAP. Pour faire d&eacute;marrer les d&eacute;mons vous n'aurez
qu'&agrave; sp&eacute;cifier l'endroit o&ugrave; vous voulez qu'ils &eacute;crivent les
messages de log :
<PRE>
           # ipxripd /var/adm/ipxrip
           # ipxsapd /var/adm/ipxsap
           
</PRE>
</P>

<DT><B>Configurer le serveur <EM>lwared</EM></B><DD><P>Deux fichiers sont &agrave; configurer manuellement pour que les
utilisateurs puissent se loguer sur votre serveur. Il s'agit de :</P>

<P>
<DL>
<DT><B><CODE>/etc/lwpasswd</CODE></B><DD><P>Il s'agit du fichier dans lequel les informations sur les
comptes utilisateurs de LinWare sont gard&eacute;es. Le programme
<EM>lwpasswd</EM>
permet de le maintenir &agrave; jour. Dans sa forme la plus simple, le
fichier <CODE>/etc/lwpasswd</CODE> ressemble &agrave; :
<PRE>
            
            ales:
            terryd:
            guest:
</PRE>
            
Son format est une simple liste de noms de login suivis du
caract&egrave;re ':' puis de la version encrypt&eacute;e du mot de passe de
login. Il faut cependant noter deux choses importantes : si les
mots de passe ne sont pas chiffr&eacute;s cela signifie qu'il n'y a
pas de mot de passe. D'autre part, les utilisateurs de <EM>LinWare</EM>
doivent avoir un compte Linux, c'est-&agrave;-dire que chaque utilisateur 
de <EM>LinWare</EM>
pr&eacute;sent dans <CODE>/etc/lwpasswd</CODE> doit aussi &ecirc;tre pr&eacute;sent dans
<CODE>/etc/passwd</CODE>. Seul l'utilisateur <CODE>root</CODE> peut changer 
le mot de
passe d'un autre utilisateur <EM>LinWare</EM>. Si vous &ecirc;tes logu&eacute; en tant
<CODE>root</CODE>, vous pourrez par exemple taper la commande suivante pour
changer le mot de passe d'un utilisateur :
<PRE>
            
        # lwpasswd rodg
        Changing password for RODG
        Enter new password:
        Re-type new password:
        Password changed.
</PRE>
</P>


<DT><B><CODE>/etc/lwvtab</CODE></B><DD><P>Il s'agit des tables des volumes LinWare o&ugrave; sont stock&eacute;es les
informations sur les r&eacute;pertoires &agrave; partager entre les utilisateurs
de  LinWare (ce fichier comporte des similitudes avec le fichier
<CODE>/etc/exports</CODE> pour NFS). Un exemple simple de son format est :
<PRE>
                 
           SYS             /lwfs/sys
           DATA            /lwfs/data
           HOME            /home
</PRE>

Ce format est simple : nom du volume puis le r&eacute;pertoire Linux &agrave;
exporter s&eacute;par&eacute;s par le caract&egrave;re espace. Vous devez avoir, 
<B>au moins</B>,
une entr&eacute;e dans ce fichier pour le volume <CODE>SYS</CODE> afin que le
serveur puisse d&eacute;marrer. Si vous voulez que vos utilisateurs 
DOS puissent acc&eacute;der &agrave; votre serveur LinWare  comme serveur primaire, 
vous devrez installer une arborescence de volume <CODE>SYS</CODE> standard
sous le r&eacute;pertoire que vous exportez comme volume <CODE>SYS</CODE>.
Les
fichiers devant &ecirc;tre pr&eacute;sents dans ces r&eacute;pertoires sont ceux de
Novell et sont soumis &agrave; leurs copyrights. Vous devez avoir une licence
pour les utiliser. Si vos utilisateurs
utilisent un serveur de fichiers Novell comme serveur primaire,
vous n'aurez pas besoin du volume <CODE>SYS</CODE>.</P>
</DL>
         </P>

<DT><B>D&eacute;marrer le serveur <EM>lwared</EM></B><DD><P>
<PRE>
         
         # lwared
</PRE>
         
Plut&ocirc;t simple n'est-ce pas ? Mais il reste une question.
Quel est le nom du serveur de fichiers ? Si vous
avez d&eacute;marr&eacute; le serveur LinWare  de la fa&ccedil;on expos&eacute;e ci-dessus, son 
nom sera celui retourn&eacute; par la commande <EM>hostname</EM> de Linux
(le nom d'h&ocirc;te). Si vous voulez
un autre nom, il suffit de le sp&eacute;cifier dans
la ligne de lancement de lwared comme ci-dessous par exemple :
<PRE>
         
         # lwared -nlinux00
</PRE>

Ici le nom du serveur LinWare sera <CODE>linux00</CODE>.</P>

<DT><B>Tester le serveur <EM>lwared</EM></B><DD><P>La premi&egrave;re chose &agrave; faire est de v&eacute;rifier que votre serveur LinWare
appara&icirc;t bien dans une <EM>slist</EM> d'un client DOS sur votre r&eacute;seau. Le
programme <EM>slist</EM> est stock&eacute; dans le volume <CODE>SYS</CODE> d'un serveur de
fichier Novell donc il vous faudra r&eacute;aliser cette op&eacute;ration &agrave;
partir d'une machine d&eacute;j&agrave; logu&eacute;e sur un serveur. Si &ccedil;a ne marche pas,
v&eacute;rifiez que
<EM>ipxsapd</EM> et <EM>lwared</EM> tournent en 
m&ecirc;me temps sur la machine Linux. Si la slist est bonne
vous pouvez essayer de connecter et de mapper un volume :
<PRE>
         C:> attach linux00/ales
         ...
         ...
         C:> map l:=linux00/data:
         C:> l:
        
</PRE>

Vous devriez maintenant &ecirc;tre en mesure d'utiliser le nouveau volume
comme tout autre volume Novell. Les permissions des fichiers sont
bas&eacute;es sur celles donn&eacute;es par le serveur <EM>Linux</EM> en fonction de
votre compte utilisateur.</P>
</DL>
</P>


<H2><A NAME="s11">11. Configurer votre machine Linux en client d'impression Novell</A></H2>


<P>Le paquetage <EM>ncpfs</EM> inclut deux petits utilitaires qui vous permettent
d'imprimer depuis votre machine Linux sur une imprimante reli&eacute;e &agrave; un serveur
d'impression Novell.
La commande <EM>nprint</EM> vous permet d'imprimer un fichier vers une
queue d'impression NetWare. La commande <EM>pqlist</EM> liste les queues
d'impression disponibles sur un serveur NetWare.</P>

<P>Pour obtenir et installer ces commandes, vous n'avez qu'&agrave; suivre les
instructions relatives au client NCP d&eacute;crites pr&eacute;c&eacute;demment.</P>

<P>Ces deux commandes n&eacute;cessitent que vous fournissiez le nom d'utilisateur 
et le mot de passe. Vous devriez normalement penser &agrave; &eacute;crire des
scripts pour simplifier les t&acirc;ches d'impression.</P>

<P>Exemple :
<BLOCKQUOTE><CODE>
<PRE>
# pqlist -S ACCT_FS01 -U guest -n
# nprint -S ACCT_FS01 -q LASER -U guest -n filename.txt
</PRE>
</CODE></BLOCKQUOTE>

La syntaxe concernant le login est similaire &agrave; celle de la commande 
<EM>ncpmount</EM>. Les exemples ci-dessus font l'hypoth&egrave;se qu'un serveur
de fichiers <CODE>ACCT_FS01</CODE> a un compte <CODE>guest</CODE> sans mot de
passe, qu'une queue d'impression appel&eacute;e <CODE>LASER</CODE> existe et que
<CODE>guest</CODE> a le droit d'imprimer dessus.</P>
<P>Sur mes machines Linux, j'ai un court script en shell pour chaque imprimante Novell.
Il peut alors &ecirc;tre utilis&eacute; comme un filtre d'impression afin de pouvoir
imprimer en utilisant le spooler Linux standard.</P>

<H2><A NAME="s12">12. Configurer votre machine Linux en serveur d'impression Novell</A></H2>

<P>Un programme permettant &agrave; votre machine Linux d'agir comme serveur d'impression
sur un r&eacute;seau NetWare est inclus dans le paquetage <EM>ncpfs</EM>. Pour
l'installer et le compiler, se reporter &agrave; la section 'client NetWare' 
au-dessus. Il y a &eacute;galement un autre support dans le paquetage <EM>mars_nwe</EM>.</P>


<H2><A NAME="ss12.1">12.1 Pr&eacute;requis</A>
</H2>

<P>La configuration est relativement simple mais vous devez avoir une imprimante
compl&egrave;tement configur&eacute;e et fonctionnant sous Linux. Cette partie est couverte
dans le 
<A HREF="Printing-HOWTO.html">Printing-HOWTO</A> en d&eacute;tail.</P>

<H2><A NAME="ss12.2">12.2 Configuration</A>
</H2>

<P>Une fois que vous avez une configuration imprimante qui fonctionne et que
vous avez compil&eacute; et install&eacute; l'utilitaire <EM>pserver</EM>, vous 
devez ajouter des commandes dans vos fichiers <CODE>rc</CODE>.</P>
<P>La commande exacte &agrave; utiliser va d&eacute;pendre de ce que vous voulez exactement
qu'il fasse, mais dans sa fa&ccedil;on la plus simple, quelque chose comme cela
devrait fonctionner :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# pserver -S ACCT_01 -U LASER -P secret -q LASERJET
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Cet exemple demande &agrave; l'utilitaire <EM>pserver</EM> de se loguer sur le 
serveur <CODE>ACCT_O1</CODE> avec le nom <CODE>LASER</CODE> et le mot de passe
<CODE>secret</CODE> et de r&eacute;cup&eacute;rer les travaux d'impression dans la queue
<CODE>LASERJET</CODE>. Lorsqu'un nouveau travail d'impression est re&ccedil;u, la
commande d'impression par d&eacute;faut de <EM>lpr</EM> sera utilis&eacute;e pour
fournir ce travail d'impression au d&eacute;mon d'impression Linux.
La queue d'impression doit &ecirc;tre d&eacute;j&agrave; d&eacute;finie sur le serveur
de fichiers et le nom d'utilisateur doit avoir les privil&egrave;ges du serveur
pour la queue.</P>

<P>Vous auriez pu, si vous aviez voulu, utiliser une autre commande Linux
pour accepter et imprimer les travaux d'impressions. l'argument <CODE>-c</CODE>
vous permet de sp&eacute;cifier la commande exacte &agrave; utiliser. Par exemple :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# pserver -S ACCT_01 -U LASER -P secret -q LASERJET -c "lpr -Plaserjet"
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>fera exactement la m&ecirc;me chose que l'exemple pr&eacute;c&eacute;dent sauf qu'il enverra
le travail d'impression &agrave; la configuration <EM>printcap</EM> <CODE>laserjet</CODE>
au lieu de celle par d&eacute;faut.</P>

<H2><A NAME="s13">13. Un aper&ccedil;u des commandes utilisateur et d'administration de</A><EM>ncpfs</EM></H2>

<P>Les derni&egrave;res versions du paquetage <EM>ncpfs</EM> de Volker incluent toute
une s&eacute;rie de commandes d'utilisation et d'administration que vous pourriez
avoir envie d'utiliser. Ces outils sont compil&eacute;s et install&eacute;s dans le 
processus d'installation de <EM>ncpfs</EM>. Si vous ne l'avez pas encore
fait, suivez les instructions fournies dans la section sur le client Novell
au-dessus pour les compiler et les installer.</P>

<P>L'information d&eacute;taill&eacute;e est disponible dans les pages de <EM>man</EM>
fournies, mais voici un bref r&eacute;sum&eacute; des commandes.</P>

<H2><A NAME="ss13.1">13.1 Commandes utilisateur</A>
</H2>

<P>
<DL>
<DT><B>ncopy</B><DD><P>Network Copy (copie r&eacute;seau) - permet de copier efficacement
des fichiers en utilisant une fonction NetWare plut&ocirc;t que de copier &agrave; travers
le r&eacute;seau.</P>
<DT><B>nprint</B><DD><P>Network Print (impression r&eacute;seau) - permet d'imprimer un
fichier vers une queue d'impression Netware situ&eacute;e sur un serveur Netware.</P>
<DT><B>nsend</B><DD><P>Network Send (envoi r&eacute;seau) - permet d'envoyer des messages
&agrave; d'autres utilisateurs connect&eacute;s &agrave; un serveur NetWare.</P>
<DT><B>nwbols</B><DD><P>List Bindery Objects (liste les objets de la bindery) - permet
de lister le contenu de la bindery d'un serveur NetWare.</P>
<DT><B>nwboprops</B><DD><P>List properties of a Bindery Object (liste les propri&eacute;t&eacute;s
d'un objet de la bindery) - permet de voir les propri&eacute;t&eacute;s d'un objet de la
bindery</P>
<DT><B>nwbpset</B><DD><P>Set Bindery Property (Configure des propri&eacute;t&eacute;s de bindery) - 
permet de configurer les propri&eacute;t&eacute;s d'un objet de la bindery NetWare.</P>
<DT><B>nwbpvalues</B><DD><P>Print Netware Bindery Objects Property Contents 
(affiche le contenu propri&eacute;t&eacute; des Objets de la Bindery) - permet d'afficher
le contenu d'une propri&eacute;t&eacute; d'une bindery Netware.</P>
<DT><B>nwfsinfo</B><DD><P>Fileserver Information (information sur le serveur de
fichiers) - affiche un r&eacute;sum&eacute; d'informations sur un serveur Netware.</P>
<DT><B>nwpasswd</B><DD><P>NetWare Password (mot de passe NetWare) - permet de changer
le mot de passe d'un utilisateur NetWare.</P>
<DT><B>nwrights</B><DD><P>NetWare Rights (permissions NetWare) - affiche les droits
associ&eacute;s &agrave; un fichier ou r&eacute;pertoire particulier.</P>
<DT><B>nwuserlist</B><DD><P>User List (liste d'utilisateurs) - liste les utilisateurs
actuellement logu&eacute;s sur un serveur de fichiers NetWare.</P>
<DT><B>pqlist</B><DD><P>Print Queue List (Liste de queue d'impression) - affiche le
contenu d'une queue d'impression NetWare.</P>
<DT><B>slist</B><DD><P>Server List (liste de serveurs) - affiche une liste de serveurs
de fichiers NetWare connus.</P>
</DL>
</P>

<H2><A NAME="ss13.2">13.2 Outils d'administration</A>
</H2>

<P>
<DL>
<DT><B>nwbocreate</B><DD><P>Create a Bindery Object (cr&eacute;er un objet de la bindery) - 
permet de cr&eacute;er un objet de la bindery.</P>
<DT><B>nwborm</B><DD><P>Remove Bindery Object (enlever un objet de la bindery) - permet
d'effacer un objet de la bindery.</P>
<DT><B>nwbpadd</B><DD><P>Add Bindery Property (ajouter une propri&eacute;t&eacute; &agrave; la bindery) - 
permet de positionner la valeur d'une propri&eacute;t&eacute; existante d'un objet d'une
bindery Netware.</P>
<DT><B>nwbpcreate</B><DD><P>Create Bindery Property (cr&eacute;er une propri&eacute;t&eacute; de bindery) - 
permet de cr&eacute;er une nouvelle propri&eacute;t&eacute; pour un objet d&eacute;j&agrave; existant dans une
bindery NetWare.</P>
<DT><B>nwbprm</B><DD><P>Remove Bindery Property (enlever une propri&eacute;t&eacute; de bindery) - 
permet d'enlever une propri&eacute;t&eacute; sur un objet d'une bindery NetWare.</P>
<DT><B>nwgrant</B><DD><P>Grant Trustee Rights (attribuer les droits d'acc&egrave;s) - permet
d'assigner les droits d'acc&egrave;s &agrave; un r&eacute;pertoire sur un serveur de fichiers
NetWare.</P>
<DT><B>nwrevoke</B><DD><P>Revoke Trustee Rights (retirer les droits d'acc&egrave;s) - permet
de retirer les droits d'acc&egrave;s &agrave; un r&eacute;pertoire sur un serveur de fichiers NetWare.</P>
</DL>
</P>

<H2><A NAME="s14">14. Configurer PPP pour le support d'IPX</A></H2>

<P>Les nouvelles versions du d&eacute;mon PPP <EM>pppd</EM> pour Linux permettent de
transporter des paquets IPX &agrave; travers une liaison s&eacute;rie PPP. Il faut au moins
la version <CODE>ppp-2.2.0d</CODE> du d&eacute;mon. Voir le 
<A HREF="PPP-HOWTO.html">PPP-HOWTO</A> pour savoir o&ugrave; le trouver. Lorsque vous compilez <EM>pppd</EM>,
assurez-vous d'activer le support IPX en ajoutant les deux lignes suivantes au
fichier <CODE>/usr/src/linux/pppd-2.2.0f/pppd/Makefile.linux</CODE>
<BLOCKQUOTE><CODE>
<PRE>
IPX_CHANGE = 1
USE_MS_DNS = 1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Le <CODE>IPX_CHANGE</CODE> est ce qui active le support d'IPX dans PPP. La d&eacute;finition
de <CODE>USE_MS_DNS</CODE> permet aux machines Microsoft Windows 95 de faire de
la recherche de nom (name lookup).</P>

<P>Le vrai truc pour arriver &agrave; le faire marcher, c'est de savoir le configurer.</P>

<P>Il y a plein de fa&ccedil;ons de faire mais je ne d&eacute;crirai que les deux sur lesquelles
j'ai re&ccedil;u des informations. Je n'ai encore jamais essay&eacute;, donc consid&eacute;rez cette
section comme exp&eacute;rimentale et si vous arrivez &agrave; faire marcher quelque chose, 
faites-le moi savoir s'il vous plait.</P>

<H2><A NAME="ss14.1">14.1 Configurer un serveur IPX/PPP</A>
</H2>

<P>La premi&egrave;re chose &agrave; faire est de configurer votre machine Linux en serveur
IP/PPP. Pas de panique ! Ce n'est pas difficile. De nouveau, suivez les 
instructions dans le 
<A HREF="PPP-HOWTO.html">PPP-HOWTO</A> et &ccedil;a 
devrait aller. Une fois que vous avez fait ceci, il y a quelques modifications
pour faire fonctionner IPX avec la m&ecirc;me configuration.</P>

<H3>Premi&egrave;re &eacute;tape</H3>

<P>Une des premi&egrave;res choses &agrave; faire est de configurer votre machine Linux en
routeur IPX de la fa&ccedil;on d&eacute;crite plus haut dans ce document. Vous n'avez pas
besoin d'utiliser la commande <EM>ipx-route</EM> pour l'interface <CODE>PPP</CODE>
car <EM>pppd</EM> les configure pour vous comme il le fait pour IP.
Lorsque le d&eacute;mon <EM>ipxd</EM> tourne, il d&eacute;tecte automatiquement toute
nouvelle interface IPX et propage les routes pour elle. Ainsi, vos machines
connect&eacute;es en dialup seront vues par les autres machines automatiquement
lors de la connexion.</P>

<H3>Conception</H3>

<P>Lorsque l'on tourne en tant que serveur, c'est normalement de sa responsabilit&eacute;
d'assigner des adresses r&eacute;seau &agrave; chacune des liaisons PPP lorsqu'elles sont
&eacute;tablies. Ceci est un point important, chaque liaison PPP sera un r&eacute;seau IPX
et aura une adresse r&eacute;seau IPX unique. Cela signifie que vous devez
d&eacute;cider comment vous allez allouer les adresses et quelles adresses utiliser.
Une convention simple est d'allouer une adresse r&eacute;seau IPX &agrave; chaque 
p&eacute;riph&eacute;rique s&eacute;rie qui supporte IPX/PPP. Vous pourriez allouer une adresse
r&eacute;seau IPX bas&eacute;e sur le login de l'utilisateur connect&eacute;, mais je ne vois
pas de raison particuli&egrave;re de faire ainsi.</P>
<P>Je vais supposer pour la suite que vous avez choisi la premi&egrave;re convention
et qu'il y a deux p&eacute;riph&eacute;riques r&eacute;seau (modems) que nous utiliserons.
Les adresses utilis&eacute;es dans cet exemple sont :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Periph. Adresse reseau IPX
------- -------------------
ttyS0   0xABCDEF00
ttyS1   0xABCDEF01
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Configurer <EM>pppd</EM></H3>

<P>Configurez votre fichier <CODE>/etc/ppp/options.ttyS0</CODE> comme suit :
<BLOCKQUOTE><CODE>
<PRE>
ipx-network 0xABCDEF00
ipx-node 2:0
ipxcp-accept-remote
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>et votre fichier <CODE>/etc/ppp/options.ttyS1</CODE> :
<BLOCKQUOTE><CODE>
<PRE>
ipx-network 0xABCDEF01
ipx-node 3:0
ipxcp-accept-remote
</PRE>
</CODE></BLOCKQUOTE>
</P>


<P>Cela va demander &agrave; <EM>pppd</EM> d'allouer l'adresse r&eacute;seau IPX appropri&eacute;e
au lien lorsque la liaison est &eacute;tablie. Le num&eacute;ro de noeud local sera
positionn&eacute; &agrave; <CODE>2</CODE> ou <CODE>3</CODE> et le noeud distant pourra l'&eacute;craser
avec le num&eacute;ro de noeud qu'il pense &ecirc;tre le bon. Notez que toutes les 
adresses sont en hexad&eacute;cimal et que <CODE>0x</CODE> est obligatoire au d&eacute;but
de l'adresse r&eacute;seau mais pas n&eacute;cessaire au d&eacute;but de l'adresse de noeud.</P>

<P>Il y a d'autres endroits o&ugrave; l'on aurait pu stocker cette information.
Si vous avez seulement un modem pour les appels entrants, alors une
entr&eacute;e aurait pu &ecirc;tre ajout&eacute;e au fichier <CODE>/etc/ppp/options</CODE>. Cette
information aurait &eacute;galement pu &ecirc;tre pass&eacute;e sur la ligne de commande de
<EM>pppd</EM>.</P>

<H3>Tester la configuration du serveur</H3>

<P>Pour tester la configuration, vous aurez besoin d'un client fonctionnant
correctement. Quand l'utilisateur appelle, se logue et que <EM>pppd</EM> 
d&eacute;marre, celui-ci va attribuer l'adresse r&eacute;seau, avertir le client du
num&eacute;ro de noeud du serveur et n&eacute;gocier le num&eacute;ro de noeud du client.
Lorsque ceci est termin&eacute; et apr&egrave;s que <EM>ipxd</EM> a d&eacute;tect&eacute; la
nouvelle interface, le client doit pouvoir &eacute;tablir des connexions
IPX avec des h&ocirc;tes distants.</P>

<H2><A NAME="ss14.2">14.2 Configurer un client IPX/PPP</A>
</H2>

<P>Dans une configuration client, le fait de configurer ou non votre machine
Linux en routeur IPX d&eacute;pend de votre volont&eacute; d'agir en routeur IPX
sur le r&eacute;seau local de la machine. Si vous avez une machine isol&eacute;e qui se
connecte &agrave; un serveur IPX/PPP alors vous n'avez pas besoin d'utiliser
<EM>ipxd</EM>. En revanche, si vous avez un r&eacute;seau local et souhaitez
que toutes les machines du r&eacute;seau puissent utiliser la route IPX/PPP
alors vous devez configurer et faire tourner <EM>ipxd</EM> comme d&eacute;crit.
Cette configuration est plus simple car vous n'avez qu'un seul 
p&eacute;riph&eacute;rique s&eacute;rie &agrave; configurer.</P>

<H3>Configurer <EM>pppd</EM></H3>

<P>La configuration la plus simple est celle qui permet au serveur de fournir
toute l'information sur la configuration du r&eacute;seau IPX. Cette configuration
serait compatible avec la configuration du serveur d&eacute;crite au-dessus.</P>

<P>Vous avez &agrave; nouveau besoin d'ajouter des options dans votre fichier
<CODE>/etc/ppp/options</CODE> :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ipxcp-accept-network
ipxcp-accept-remote
ipxcp-accept-local
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Les options indiquent &agrave; <EM>pppd</EM> d'agir de mani&egrave;re compl&egrave;tement passive
et d'accepter tous les d&eacute;tails de configuration fournis par le serveur.
Vous pouvez fournir ici des valeurs par d&eacute;faut pour les serveurs qui ne
fournissent pas ces d&eacute;tails en ajoutant des lignes <CODE>ipx-network</CODE>
et <CODE>ipx-node</CODE> similaires &agrave; la configuration du serveur.</P>

<H3>Tester le client IPX/PPP</H3>

<P>Pour tester le client, vous avez besoin d'un serveur &agrave; appeler connu pour
fonctionner correctement. Une fois que vous avez appel&eacute; et que <EM>pppd</EM>
a d&eacute;marr&eacute;, vous devriez voir les d&eacute;tails de votre configuration IPX sur
votre p&eacute;riph&eacute;rique <CODE>ppp0</CODE> lorsque vous utilisez la commande
<EM>ifconfig</EM>. Vous devriez &eacute;galement &ecirc;tre capable d'utiliser
<EM>ncpmount</EM>.</P>

<P>Je ne sais pas si vous devrez ajouter les routes IPX manuellement pour
atteindre des serveurs distants ou non. Il semblerait que oui. Si
quelqu'un qui a cette configuration pouvait me le dire, je lui en
serais reconnaissant.</P>


<H2><A NAME="s15">15. Tunnel IPX sur IP</A></H2>

<P>Beaucoup d'entre vous doivent &ecirc;tre dans la situation o&ugrave; deux r&eacute;seaux
locaux IPX sont s&eacute;par&eacute;s par une simple connexion IP. Comment
pourra-t-on dans ce cas jouer un deathmatch &agrave; DOOM pour DOS dans cette
situation,
demanderiez-vous ? Andreas Godzinap <CODE>&lt;ag@agsc.han.de&gt;</CODE> a une 
r&eacute;ponse pour vous avec <EM>ipxtunnel</EM>.</P>
<P><EM>ipxtunnel</EM> fournit une sorte de pont pour IPX en permettant &agrave; des 
paquets IPX d'&ecirc;tre encapsul&eacute;s dans des paquets de donn&eacute;es TCP/IP de
mani&egrave;re &agrave; ce qu'ils soient transport&eacute;s par une connexion TCP/IP. Ce 
programme attend l'arriv&eacute;e de paquets IPX et lors de leur arriv&eacute;e, il 
les enferme dans un paquet de donn&eacute;es TCP/IP et le route vers l'adresse 
IP distante que vous aurez sp&eacute;cifi&eacute;e. Pour que cela fonctionne, la 
machine qui re&ccedil;oit le paquet de donn&eacute;es
encapsul&eacute; doit, elle aussi, faire tourner une version identique
d'<EM>ipxtunnel</EM>.</P>

<H2><A NAME="ss15.1">15.1 R&eacute;cup&eacute;rer <EM>ipxtunnel</EM></A>
</H2>

<P>Vous pouvez obtenir <EM>ipxtunnel</EM> sur
<A HREF="ftp://metalab.unc.edu/pub/Linux/system/network/daemons">Metalab</A> ou sur un site miroir.</P>

<H2><A NAME="ss15.2">15.2 Compiler <EM>ipxtunnel</EM></A>
</H2>

<P><EM>ipxtunnel</EM> se compile proprement chez moi en utilisant les commandes :
<BLOCKQUOTE><CODE>
<PRE>

       # cd /usr/src
       # tar xvfz .../ipxtunnel.tgz
       # cd ipxtunnel
       # make
</PRE>
</CODE></BLOCKQUOTE>
</P>




<H2><A NAME="ss15.3">15.3 Configurer <EM>ipxtunnel</EM></A>
</H2>

<P>La configuration d'<EM>ipxtunnel</EM> est ais&eacute;e. Admettons que la machine de
vos amis soit <CODE>gau.somewhere.com</CODE> et que votre machine soit appel&eacute;e
<CODE>gim.sw.edu</CODE>. <EM>ipxtunnel</EM> utilise un fichier de configuration appel&eacute;
<CODE>/etc/ipxtunnel.conf</CODE>. Ce fichier vous permet de sp&eacute;cifier le port UDP par 
d&eacute;faut &agrave; utiliser pour la connexion TCP/IP par laquelle les donn&eacute;es encapsul&eacute;es 
seront envoy&eacute;es ainsi que l'interface locale o&ugrave; ipxtunnel doit &eacute;couter et 
d&eacute;livrer les paquets IPX.</P>
<P>Un simple fichier de configuration ressemblera &agrave; :
<BLOCKQUOTE><CODE>
<PRE>
       #
       # /etc/ipxtunnel.conf pour gim.sw.edu
       #
       # Le port UDP à utiliser                (par défaut 7666)
       port 7777
       #
       # Le nom de la machine distante où les paquets IPX doivent être envoyés
       remote gau.somewhere.com
       #
       # Les interfaces IPX locales à écouter (par défaut eth0)
       interface eth0
       interface eth1
</PRE>
</CODE></BLOCKQUOTE>

Évidemment l'autre machine aura un fichier de configuration similaire
sp&eacute;cifiant votre machine comme h&ocirc;te distant (<CODE>remote</CODE>).</P>

<H2><A NAME="ss15.4">15.4 Tester et utiliser <EM>ipxtunnel</EM></A>
</H2>

<P>    
<EM>ipxtunnel</EM> se comporte <B>comme</B> un pont IPX, ainsi les 
r&eacute;seaux IPX &agrave; chaque extr&eacute;mit&eacute; de la liaison TCP/IP doivent probablement 
&ecirc;tre les m&ecirc;mes.
Andreas n'a jamais test&eacute; <EM>ipxtunnel</EM> dans un environnement qui utilise
r&eacute;ellement les serveurs de fichiers Novell, donc si vous l'essayez
dans un tel environnement, donnez-en le r&eacute;sultat &agrave; Andreas pour qu'il
sache si &ccedil;a marche ou pas.</P>
<P>Si <EM>ipxtunnel</EM> fonctionne, vous devriez &ecirc;tre en mesure de lancer DOOM
sur les machines &agrave; chaque bout de la connexion utilis&eacute;e en mode IPX et
vous devriez vous voir l'un l'autre.</P>
<P>Andreas n'a test&eacute; ce logiciel que sur de bonnes lignes rapides et ne
garantit pas sa performance si votre liaison est &agrave; faible vitesse. Une
fois de plus, dites-lui ce qui marche et ne marche pas.</P>

<H2><A NAME="s16">16. Support commercial IPX pour Linux</A></H2>


<H2><A NAME="ss16.1">16.1 Caldera's Network Desktop</A>
</H2>


<P>Caldera Inc. commercialise une distribution Linux poss&egrave;dant de
nombreuses fonctions et am&eacute;liorations. Elle inclut un support
totalement fonctionnel d'un client Novell Netware. La distribution de
base est la respect&eacute;e Red Hat Linux et Caldera y a ajout&eacute; son "Network
Desktop". Le support Netware inclut un client Novell Netware poss&eacute;dant
toutes les fonctionnalit&eacute;s requises, bâties sur une technologie
licenci&eacute;e par Novell Corporation. Ce client fournit un acc&egrave;s total &agrave;
des serveurs de fichiers Novell 3.x et 4.5 et inclut des
fonctionnalit&eacute;s comme le "Netware Directoy Service" (NDS) et 
l'encryptage RSA.</P>
<P>Vous pourrez obtenir plus d'informations et de d&eacute;tails sur le serveur
web 
<A HREF="http://www.caldera.com/">Caldera Inc</A>.</P>
<P>Si vous travaillez dans un environnement Netware 4.x et/ou NDS, alors le
client Netware de Caldera est la seule solution disponible.</P>
<P>Si vous devez mettre en oeuvre une solution Novell pour Linux critique de 
mani&egrave;re professionnelle, vous devriez regarder le produit de Caldera de pr&egrave;s.</P>

<H2><A NAME="s17">17. Foire Aux Questions</A></H2>

<P>
<DL>
<DT><B>O&ugrave; puis-je trouver des logiciels IPX pour Linux fournis avec un support
commercial ?</B><DD><P><EM>Caldera Corp.</EM> offre un client Netware 3.x et 4.x compl&egrave;tement
support&eacute; avec une licence compl&egrave;te. Pour de plus amples informations, consultez
le site web de 
<A HREF="http://www.caldera.com/">Caldera Inc</A>.</P>
<DT><B>Est-ce que les logiciels IPX fonctionnent avec Arcnet/Token Ring/etc. ?</B><DD><P>Les logiciels IPX pour Linux fonctionnent avec les interfaces Arcnet et
Token Ring. Je n'ai encore entendu personne essayer avec AX.25 . La configuration
se passe de la m&ecirc;me mani&egrave;re que pour l'Ethernet, sauf que vous devrez remplacer
'eth0' par le nom de p&eacute;riph&eacute;rique appropri&eacute; et mettre l'adresse mat&eacute;rielle
appropri&eacute;e lorsque n&eacute;cessaire.</P>
<DT><B>Comment est-ce que je configure plus d'une interface IPX ?</B><DD><P>Si vous avez plus d'une interface dans votre machine, vous devez utiliser 
la commande <EM>ipx_interface</EM> pour configurer manuellement chacune d'entre
elles. Vous ne devez pas utiliser la configuration "plug'n'play".</P>
<DT><B>Comment est-ce que je choisis les adresses IPX ?</B><DD><P>Les r&eacute;seaux IPX sont similaires mais non identiques aux r&eacute;seaux IP.
Une diff&eacute;rence majeure est la fa&ccedil;on dont les adresses sont utilis&eacute;es. IPX n'utilise
pas le concept de sous-r&eacute;seau. Le lien entre les adresses r&eacute;seau et les r&eacute;seaux
est diff&eacute;rent. Les r&egrave;gles sont relativement simples.
<UL>
<LI>Chaque adresse de r&eacute;seau IPX doit &ecirc;tre unique sur un r&eacute;seau &agrave; grande &eacute;chelle (WAN).
Ceci inclut les adresses de r&eacute;seau internes. Beaucoup d'organisations utilisant IPX
sur des r&eacute;seaux &agrave; grande &eacute;chelle ont une politique d'adressage que vous devriez suivre.</LI>
<LI>Chaque adresse d'h&ocirc;te sur un r&eacute;seau particulier doit &ecirc;tre unique. Cela signifie
que tous les h&ocirc;tes sur chaque r&eacute;seau IPX doivent avoir une adresse assign&eacute;e unique.
Dans le cas d'un r&eacute;seau Ethernet, ce n'est pas difficile, car les cartes ont chacune
une adresse unique. Dans le cas d'IPX/PPP, cela signifie que vous devez vous assurer
d'allouer une adresse unique pour tous les h&ocirc;tes du r&eacute;seau, quel que soit le bout
de la (des) liaison(s) auquel ils sont connect&eacute;s. Les adresses des h&ocirc;tes n'ont pas
besoin d'&ecirc;tre uniques &agrave; travers un WAN car l'adresse du r&eacute;seau est combin&eacute;e &agrave;
l'adresse de l'h&ocirc;te pour identifier l'h&ocirc;te de mani&egrave;re unique.</LI>
</UL>
</P>
<DT><B>Quels sont les types de trame que je devrais utiliser?</B><DD><P>Il y a plusieurs types de trames au-dessus desquelles vous pouvez faire fonctionner
IPX. Les plus utilis&eacute;es sont d&eacute;crites dans la section 'termes utilis&eacute;s dans ce document'
(sous l'entr&eacute;e <CODE>'type de trame'</CODE>).</P>
<P>Si vous installez votre machine sur un r&eacute;seau existant, alors vous devrez utiliser ce
qui est d&eacute;j&agrave; utilis&eacute; pour vous permettre de communiquer avec les autres machines du
r&eacute;seau. En revanche, si vous installez un r&eacute;seau tout neuf, il y a toute une vari&eacute;t&eacute;
de protocoles pour transporter votre trafic IPX que vous pouvez utiliser. Si vous 
installez un r&eacute;seau tout neuf et que vous envisagez d'y faire passer de l'IPX et
de l'IP, je vous recommande des trames de type <CODE>Ethernet_II</CODE>.</P>
<DT><B>Mes machines Windows95 brouillent la d&eacute;tection automatique du type de mes trames.</B><DD><P>Apparement, ils y arrivent, ouais. Je pourrais faire des commentaires pas 
gentils, mais &agrave; la place, je vous sugg&eacute;rerais de configurer manuellement le type
de trames plut&ocirc;t que d'utiliser la configuration automatique. C'est probablement la
meilleure fa&ccedil;on en tout cas.</P>
<DT><B>Pourquoi est-ce que j'obtiens le message 'invalid argument' quand je configure
IPX ?</B><DD><P>Vous n'avez probablement pas un noyau qui supporte IPX. Soit vous recompilez
votre noyau pour qu'il le fasse, soit vous v&eacute;rifiez que vous avez bien utilis&eacute;
lilo pour installer et utiliser le nouveau noyau.</P>
<DT><B>Pourquoi est-ce que j'obtiens le message 'package not installed' quand je
configure IPX ?</B><DD><P>Vous n'avez probablement pas un noyau qui supporte IPX. Soit vous recompilez
votre noyau pour qu'il le fasse, soit vous v&eacute;rifiez que vous avez bien utilis&eacute;
lilo pour installer et utiliser le nouveau noyau.</P>
<DT><B>Pourquoi est-ce que <EM>pppd</EM> m'envoie le message 'IPX support 
not in kernel' ?</B><DD><P>Vous avez probablement compil&eacute; IPX comme un module et vous ne vous &ecirc;tes pas
assur&eacute; qu'il &eacute;tait charg&eacute; avant de d&eacute;marrer <EM>pppd</EM>.</P>
<DT><B>Comment exporter en NFS un syst&egrave;me de fichiers NCP mont&eacute; ?</B><DD><P>Pour utiliser NFS pour exporter un syst&egrave;me de fichiers NCP, vous devez
le monter en utilisant l'option <CODE>-v</CODE> de <EM>ncpmount</EM>. Cette option
permet de monter un seul volume d'un serveur de fichiers au lieu de les monter
tous. Lorsque vous fa&icirc;tes ainsi, le d&eacute;mon NFS vous permet d'exporter ce syst&egrave;me
de fichiers de la mani&egrave;re habituelle.</P>
<DT><B>Pourquoi est-ce que slist ne marche pas quand j'ai un r&eacute;seau interne
avec <EM>mars_nwe</EM> ?</B><DD><P>Vous devez avoir la requ&ecirc;te 'get nearest server' activ&eacute;e. L'entr&eacute;e 401
dans <CODE>/etc/nwserv.conf</CODE> doit &ecirc;tre 0, &agrave; moins que vous ayez une raison
pour ne pas r&eacute;pondre &agrave; ces requ&ecirc;tes. Si vous voulez simplement que <EM>slist</EM>
fonctionne et ne pas r&eacute;pondre &agrave; chaque requ&ecirc;te 'get nearest server', ajoutez
votre r&eacute;seau interne et num&eacute;ro de noeud dans <CODE>/etc/nwserv.stations</CODE>
et positionnez l'entr&eacute;e 401 de <CODE>/etc/nwserv.conf</CODE> &agrave; 2.</P>
<DT><B>Est-ce que le paquetage ncpfs fonctionne avec mars_nwe ?</B><DD><P>Les codes de Martin et Volkers commencent lentement &agrave; converger. Les
versions r&eacute;centes de <EM>mars_nwe</EM> ont une option pour lui permettre de
marcher avec <EM>ncpfs</EM>. Vous devez activer <CODE>WITH_NAME_SPACE_CALLS</CODE>
dans le fichier <CODE>config.h</CODE> de <EM>mars_nwe</EM>.</P>
</DL>
</P>

<H2><A NAME="s18">18.  Copyright</A></H2>


<P>L'IPX-HOWTO est soumis au Copyright (c) 1995 Terry Dawson.</P>
<P>Cette documentation est libre, vous pouvez la redistribuer et/ou la
modifier selon les termes de la Licence Publique G&eacute;n&eacute;rale GNU publi&eacute;e
par la Free Software Foundation (version 2 ou bien toute autre
version ult&eacute;rieure choisie par vous).</P>
<P>Cette documentation est distribu&eacute;e car potentiellement utile, mais
<B>SANS AUCUNE GARANTIE</B>, ni explicite ni implicite, y compris
les garanties de <B>commercialisation</B> ou <B>d'adaptation dans
un but sp&eacute;cifique</B>. Reportez-vous &agrave; la Licence Publique G&eacute;n&eacute;rale
GNU pour plus de d&eacute;tails.</P>
<P>Vous pouvez obtenir une copie de la Licence Publique G&eacute;n&eacute;rale GNU en
&eacute;crivant &agrave; la 
<A HREF="http://www.fsf.org">Free Software Foundation</A>, Inc., 675 Mass Ave, Cambridge, MA 02139, &Eacute;tats-Unis.</P>
<P>Les marques d&eacute;pos&eacute;es sont propri&eacute;t&eacute;s de leurs
propri&eacute;taires respectifs.</P>



<H2><A NAME="s19">19. Remerciements</A></H2>

<P>Terry Dawson <CODE>&lt;terry@perf.no.itg.telstra.com.au></CODE> pour le document initial.</P>
<P>David E. Storey <CODE>&lt;dave@tamos.gmu.edu&gt;</CODE> et
Volker Lendecke <CODE>&lt;lendecke@namu01.gwdg.de&gt;</CODE>
qui m'ont assist&eacute; grandement en me fournissant
des informations pour ce document.
Gilbert Callaghan <CODE>&lt;gilbert@pokey.inviso.com&gt;</CODE>, 
David Higgins <CODE>&lt;dave@infra.com&gt;</CODE> et
Chad Robinson <CODE>&lt;chadr@brtgate.brttech.com&gt;</CODE> pour leur 
contribution sur la configuration de IPX/PPP.
Bennie Venter <CODE>&lt;bjv@Gil-galad.paradigm-sa.com></CODE> pour les informations
utiles sur les types de trames.
Christopher Wall <CODE>&lt;vergil@idir.net&gt;</CODE> pour ses suggestions utiles afin
d'am&eacute;liorer la lecture et l'agencement de ce document.
Axel Boldt <CODE>&lt;boldt@math.ucsb.edu></CODE> pour ses suggestions utiles et le
retour d'informations.
Erik D. Olson <CODE>&lt;eriko@wrq.com></CODE> pour son retour d'informations utile
et ses informations pour la configuration de PPP pour IPX.
Brian King <CODE>&lt;root@brian.library.dal.ca></CODE> pour sa contribution &agrave; une
question de la section FAQ</P>

<P>"NetWare" est une marque d&eacute;pos&eacute;e de 
<A HREF="http://www.novell.com/">Novell Corporation</A>.</P>
<P>"Caldera" est une marque d&eacute;pos&eacute;e de 
<A HREF="http://www.caldera.com/">Caldera Corporation</A>.</P>

<P>     </P>
<P><CODE>  Kevin Thorpe</CODE></P>
<P><CODE>&lt;kevin@pricetrak.com&gt;</CODE></P>
</BODY>
</HTML>
