<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Le Mini-HowTo RPM+Slackware</TITLE>
</HEAD>
<BODY>
<H1>Le Mini-HowTo RPM+Slackware</H1>

<H2>&Eacute;dit&eacute; par Dave Whitinger,
<CODE>
<A HREF="mailto:wolf@redhat.com">wolf@redhat.com</A></CODE><BR>
Traduit par Fran&ccedil;ois Jeanmougin
<CODE>
<A HREF="mailto:jeanmougin@igbmc.u-strasbg.fr">jeanmougin@igbmc.u-strasbg.fr</A></CODE></H2>v1.0, 29 Aout 1997
<HR>
<EM>Ce document d&eacute;crit comment installer et faire fonctionner
proprement le syst&egrave;me RPM avec la Slackware. Les informations pr&eacute;sent&eacute;es ici sont n&eacute;anmoins probablement valables pour n'importe quelle distribution de Linux.</EM>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>

<P>On m'a tr&egrave;s souvent demand&eacute; comment utiliser le RPM sur
la Slackware. Trop c'est trop, alors aujourd'hui, j'ai 
d&eacute;cid&eacute; que cr&eacute;er ce document pourrait &ecirc;tre
une bonne id&eacute;e.<BR></P>
<P>RPM signifie "Red Hat Package Manager" et constitue le coeur de la
distribution Red Hat. Sa fonction premi&egrave;re est d'installer et de
d&eacute;sinstaller des "suites" (package en anglais). Lire le RPM-HOWTO
ou se procurer une copie du "Maximum RPM" pour plus d'informations sur 
l'utilisation du RPM.<BR></P>
<P>Ce document tourne autour de l'installation et de l'usage du RPM sur une
distribution Slackware et processeur Intel, mais les informations donn&eacute;es
ici peuvent ais&eacute;ment &ecirc;tre utilis&eacute;es pour n'importe quelle
distribution et n'importe quelle architecture.</P>

<H2><A NAME="s2">2. O&ugrave; trouver le syt&egrave;me RPM</A></H2>


<P>La version la plus r&eacute;cente de RPM est disponible sur&nbsp;:
<CODE>
<A HREF="ftp://ftp.rpm.org/pub/rpm/dist/latest">ftp.rpm.org/pub/rpm/dist/latest</A></CODE><BR>
Au moment de la r&eacute;daction de ce document, la version la plus
r&eacute;cente &eacute;tait&nbsp;:<BR>
rpm-2.4.5-1.i386.tar.gz<BR></P>
<P>Notez bien l'indication i386. Ceci signifie que la suite binaire a
&eacute;t&eacute; compil&eacute;e pour une architecture Intel, pr&egrave;te
&agrave; l'emploi. Assurez-vous que le fichier que vous 
t&eacute;l&eacute;chargez contient ``i386'' dans son nom, dans le cas contraire,
les instructions suivantes ne seront pas valides.</P>

<H2><A NAME="s3">3. Installation du syst&egrave;me RPM</A></H2>

<P>Il faut &ecirc;tre administrateur (root) pour  r&eacute;aliser les &eacute;tapes
suivantes.<BR></P>
<P>Tout d'abord, d&eacute;sarchiver la suite &agrave; partir du r&eacute;epertoire
racine. Voici les instructions&nbsp;:
<PRE>
        cd /
        tar zxvpf /home/wolf/rpm-2.4.5-1.i386.tar.gz
</PRE>

Bien &eacute;videment, remplacez /home/wolf par le chemin correct du
fichier d'archive.<BR>
Ensuite, il faut cr&eacute;er un r&eacute;pertoire appel&eacute; "rpm" dans
l'arborescence /var/lib.
<PRE>
mkdir /var/lib/rpm
</PRE>

Ensuite, taper <CODE>'rpm --initdb'</CODE> pour initialiser la banque de 
donn&eacute;es rpm.<BR>
Si tout s'est bien pass&eacute; jusque l&agrave;, vous avez un syst&eacute;me
compatible rpm! Testez-le en chargeant n'importe quel fichier rpm et
en l'installant par <CODE>'rpm -Uvh filename.rpm'</CODE><BR></P>

</BODY>
</HTML>
