<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Le Linux UUCP HOWTO</TITLE>
</HEAD>
<BODY>
<H1>Le Linux UUCP HOWTO</H1>

<H2>Vince Skahan, <CODE>&lt;vince@victrola.wa.com></CODE>, version fran&ccedil;aise Ren&eacute; Cougnenc.</H2>v1.15, 29 Novembre 1995
<HR>
<EM>Ce document d&eacute;crit la configuration d'UUCP sous Linux.
Vous devez lire ce texte si vous avez l'intention de vous connecter &agrave;
des sites distants par UUCP, via un modem, une connexion directe ou
l'Internet. Si vous n'avez pas besoin d'UUCP, oubliez ce document,
il ne vous apportera rien.</EM>
<HR>
<H2><A NAME="s1">1. Introduction</A></H2>

<P>Le but de ce petit guide est de r&eacute;pondre &agrave; quelques questions revenant
fr&eacute;quemment &agrave; propos de l'utilisation d'UUCP sous Linux en g&eacute;n&eacute;ral,
et de certaines distributions de ce syst&egrave;me en particulier.</P>
<P>Ce document, associ&eacute; &agrave; ses &eacute;quivalents "Mail-HOWTO" et "News-HOWTO"
annule et remplace l'ancien fichier "UUCP-NEWS-MAIL-FAQ" qui &eacute;tait
auparavant post&eacute; dans le forum Usenet <EM>comp.os.linux.announce</EM>.</P>
<H2><A NAME="ss1.1">1.1 Mises &agrave; jour de ce document</A>
</H2>

<P>Les nouvelles versions de ce "Linux Installation HOWTO" seront
p&eacute;riodiquement post&eacute;es dans
<CODE>comp.os.linux</CODE>, <CODE>comp.os.linux.announce</CODE>,
et <CODE>news.answers</CODE>.
Elle seront aussi disponibles pour le t&eacute;l&eacute;chargement sur
diff&eacute;rents sites FTP, dont
<CODE>sunsite.unc.edu:/pub/Linux/docs/HOWTO</CODE>.</P>
<P>En ce qui concerne cette version fran&ccedil;aise, la politique de
mise &agrave; jour et de distribution reste encore &agrave; d&eacute;finir.
Vous devriez pouvoir trouver ce document sur <CODE>ftp.ibp.fr:/pub/linux/french/docs/HOWTO/</CODE>
ainsi que <CODE>ftp.loria.fr</CODE>, et les diff&eacute;rents miroirs accessibles
par modem. Une version HTML sera bient&ocirc;t install&eacute;e sur <CODE>http://www.freenix.fr</CODE>.</P>


<H2><A NAME="ss1.2">1.2 Vos r&eacute;actions</A>
</H2>

<P>Vos avis sur ce document, positifs ou n&eacute;gatifs, m'int&eacute;ressent.
Contactez-moi par courrier &eacute;lectronique si vous trouvez des erreurs
ou omissions.
<BLOCKQUOTE> Le traducteur n'est pas responsable du contenu, de la forme
et du style r&eacute;dactionnel de ce document. Seules les &eacute;ventuelles fautes
de frappe ou d'orthographe, ainsi que les possibles erreurs de
traduction, lui incombent.</BLOCKQUOTE>
</P>
<P>Je lis, mais ne r&eacute;ponds pas syst&eacute;matiquement au courrier que
je re&ccedil;ois. Les demandes d'am&eacute;lioration seront
consid&eacute;r&eacute;es et effectu&eacute;es en fonction de leur
int&eacute;r&ecirc;t, du temps disponible et de l'humeur du jour :-)</P>
<P>Les insultes sont directement dirig&eacute;es sur /dev/null, ne vous fatiguez
donc pas.</P>
<P>En particulier, l'arborescence de fichiers standard sous Linux est
en perp&eacute;tuelle &eacute;volution. Dans ce document, tout ce qui s'y r&eacute;f&egrave;re
tient compte de l'&eacute;tat actuel de ce "standard" au moment o&ugrave; il 
est r&eacute;dig&eacute;, et des chemins d'acc&egrave;s ou noms de fichiers que nous
avons rencontr&eacute;s le plus fr&eacute;quemment dans les distributions courantes
de Linux. Consultez la documentation de la distribution que vous utilisez
en cas de doute.</P>
<P>Tout ce qui concerne le format de ce document concerne le coordinateur
de l'&eacute;quipe : Greg Hankins, dont l'adresse &eacute;lectronique
est <CODE>gregh@sunsite.unc.edu</CODE>.</P>

<H2><A NAME="ss1.3">1.3 Informations l&eacute;gales</A>
</H2>

<P>Le "Linux UUCP-HOWTO" est copyright (c)1994 Vince Skahan.</P>
<P>Les copies conformes peuvent &ecirc;tre reproduites ou distribu&eacute;es sous
quelque forme que ce soit sans autorisation de l'auteur. Les traductions
sont &eacute;galement autoris&eacute;es sans accord pr&eacute;alable si elles comprennent
une note d&eacute;clarant qui a r&eacute;alis&eacute; l'adaptation.</P>
<P>De courts extraits peuvent &ecirc;tre utilis&eacute;s sans le consentement de l'auteur.
Les travaux d&eacute;riv&eacute;s ou distributions partielles doivent &ecirc;tre accompagn&eacute;s
soit d'une copie compl&egrave;te de ce document, soit d'une indication permettant
de se le procurer.</P>
<P>La diffusion commerciale est autoris&eacute;e, et m&ecirc;me encourag&eacute;e ; toutefois
l'auteur aimerait &ecirc;tre tenu au courant de tout ce qui se fait en
la mati&egrave;re.</P>
<P>En r&eacute;sum&eacute;, nous d&eacute;sirons promouvoir la diffusion de ces informations par
le plus de canaux possibles. Toutefois, nous voulons conserver un
copyright sur ces documents, et aimerions &ecirc;tre inform&eacute;s de tout projet
de distribution.</P>
<P>De plus, nous d&eacute;sirons que TOUTES les informations fournies par les
"HOWTO" soient largement diffus&eacute;es. Si vous avez des questions &agrave; poser,
contactez  Matt Welsh, le coordinateur du projet, &agrave; l'adresse
mdw@sunsite.unc.edu, ou au +1 607 256 7372.</P>

<H2><A NAME="ss1.4">1.4 Responsabilit&eacute;s</A>
</H2>

<P>Bien s&ucirc;r, je d&eacute;clare n'&ecirc;tre en aucun cas responsable des probl&egrave;mes
pouvant &ecirc;tre pos&eacute;s par l'utilisation de ce document. Tout ce que vous
faites &agrave; partir de ce guide est &agrave; vos risques et p&eacute;rils.</P>

<H2><A NAME="ss1.5">1.5 Autres sources d'information</A>
</H2>


<H3>Les documents "Linux HOWTO"</H3>


<P>Vous trouverez beaucoup d'informations de valeur dans les autres
documents "HOWTO" de Linux, ainsi que dans les livres du groupe
de documentation Linux ("Linux Doc Project"). En particulier,
vous devriez jeter un oeil &agrave; ceci:</P>
<P>
<UL>
<LI> Le <EM>Serial Communications HOWTO</EM> (communications par lignes s&eacute;ries)</LI>
<LI> L'<EM>Ethernet HOWTO</EM> (consacr&eacute; au r&eacute;seau Ethernet)</LI>
<LI> Le <EM>Linux Networking Administrators' Guide</EM> (un excellent livre
sur l'administration r&eacute;seau sous Linux).</LI>
</UL>
</P>


<H3>USENET</H3>

<P>Vous trouverez la r&eacute;ponse &agrave; la plupart des questions que vous vous
posez &agrave; propos de UUCP dans <CODE>comp.mail.uucp</CODE>.</P>
<H3>Listes de diffusion</H3>

<P>Il existe une liste de diffusion d&eacute;di&eacute;e &agrave; Taylor UUCP.</P>
<P>Pour y souscrire (ou s'y d&eacute;sabonner), envoyez un courrier &eacute;lectronique
&agrave;
<PRE>
              taylor-uucp-request@gnu.ai.mit.edu
</PRE>
</P>
<P>Cette requ&ecirc;te arrive &agrave; une personne physique, et non &agrave; un programme, aussi
assurez-vous d'avoir bien pr&eacute;cis&eacute; l'adresse &agrave; laquelle vous voulez
recevoir la liste dans le corps de votre message.</P>
<P>Pour envoyer un message &agrave; la liste, envoyez-le &agrave;
<PRE>
             taylor-uucp@gnu.ai.mit.edu
</PRE>
</P>

<H3>Publications</H3>

<P>Les versions V2 et HDB de UUCP sont document&eacute;es dans pratiquement
toute documentation sur le sujet, ainsi que dans tout ouvrage
traitant de la communication sous UNIX.</P>
<P>La configuration de type Taylor n'est pour l'instant d&eacute;crite que
dans les fichiers "Info" fournis avec les sources du programme.
Vous pouvez les lire gr&acirc;ce &agrave; tout utilitaire pr&eacute;vu
&agrave; cet effet, ou depuis l'&eacute;diteur de texte Emacs.</P>
<P>Voici une liste non exhaustive de quelques ouvrages pouvant vous aider:
<UL>
<LI>"Managing UUCP and USENET", chez <EM>O'Reilly and Associates</EM> est &agrave;
mon avis le meilleur livre pour comprendre les protocoles et les programmes
n&eacute;cessaires afin de devenir un site Usenet.</LI>
<LI>"Unix Communications" de <EM>Waite Group</EM> contient une excellente
description de chaque partie mise en jeu, et de leur interfa&ccedil;age entre
elles.</LI>
<LI>"Practical Unix Security" chez <EM>O'Reilly and Associates</EM> pr&eacute;sente parfaitement
les m&eacute;thodes permettant de s&eacute;curiser UUCP.</LI>
<LI>"The Internet Complete Reference", chez <EM>Osborne</EM>, est un tr&egrave;s bon manuel
de r&eacute;f&eacute;rence sur les diff&eacute;rents services offerts par l'Internet et
est une source d'informations tr&egrave;s compl&egrave;te sur le courrier, Usenet,
et les diff&eacute;rentes ressources Internet.</LI>
<LI>"The Linux Networking Administrators' Guide", par Olaf Kirch, du
groupe de documentation Linux (LDP) est disponible sur le Net et est
publi&eacute; par  O'Reilly et SSC, il sera d'ici quelques mois disponible en
version Fran&ccedil;aise. Il pr&eacute;sente une bonne vue d'ensemble de tout ce que
vous avez besoin de conna&icirc;tre en mati&egrave;re de r&eacute;seau sous Unix.</LI>
</UL>
</P>

<H2><A NAME="ss1.6">1.6 O&ugrave; NE PAS rechercher de l'aide</A>
</H2>

<P>UUCP sous Linux n'a rien de particulier, et fonctionne exactement
de la m&ecirc;me mani&egrave;re que sur tout autre syst&egrave;me UNIX. Par cons&eacute;quent
vous ne <EM>devez pas</EM> poser de questions g&eacute;n&eacute;rales sur UUCP dans
les forums Usenet <CODE>comp.os.linux.*</CODE>.</P>
<P>Sauf si votre question est vraiment relative &agrave; Linux (par exemple,
"quelles sont les options de compilation choisies dans le binaire
fourni dans la distribution ZGRBGX de Linux"), vous devez la poser
dans <CODE>comp.mail.uucp</CODE> ou dans la liste de diffusion cit&eacute;e plus haut.</P>
<P>Je r&eacute;p&egrave;te et j'insiste :</P>

<P>Il n'y a aucune raison de poser des questions relatives &agrave; UUCP dans
les groupes Usenet d&eacute;di&eacute;s &agrave; Linux. Usenet comporte des forums d&eacute;di&eacute;s
&agrave; chaque sujet comme le courrier, les News, UUCP. Utilisez-les.</P>
<P>SI VOUS POSEZ DES QUESTIONS NON RELATIVES A LINUX DANS LES GROUPES LINUX,
VOUS VOUS TROMPEZ D'ENDROIT. LES SPECIALISTES D'UUCP SE TROUVENT LA OU
NOUS VENONS DE LE DIRE, ET N'UTILISENT GENERALEMENT PAS LINUX.</P>
<P>LES QUESTIONS N'AYANT RIEN A VOIR AVEC LINUX DANS LES HIERARCHIES DEDIEES
A CE SYSTEME VOUS FERONT PERDRE VOTRE TEMPS, AINSI QUE CELUI DES AUTRES.</P>

<H2><A NAME="s2">2. Mat&eacute;riel n&eacute;cessaire</A></H2>

<P>Il n'y a rien de vraiment sp&eacute;cifique &agrave; poss&eacute;der pour utiliser UUCP sous
Linux. Tout modem compatible HAYES donnera satistaction.</P>
<P>D'une fa&ccedil;on g&eacute;n&eacute;rale, vous choisirez le mod&egrave;le le plus rapide que vous puissiez
vous payer. Il sera alors pr&eacute;f&eacute;rable de munir votre port s&eacute;rie d'un UART
16550 pour d&eacute;passer les vitesses de 9600 bauds sans encombre.</P>
<P>Si vous ne comprenez pas ce que nous venons de dire, lisez le groupe
Usenet comp.dcom.modems, les FAQ's sur les communications s&eacute;ries et
autres documentations, pour vous renseigner.</P>

<H2><A NAME="s3">3. Comment se procurer UUCP</A></H2>

<P>Taylor UUCP (dont la version courante est 1.05) est disponible sur
<CODE>prep.ai.mit.edu</CODE> sous sa forme originale, son code source, et diverses
distributions de Linux en proposent des versions binaires toutes
compil&eacute;es.</P>
<P>L'archive <CODE>newspak-2.4.tar.z</CODE> contient des fichiers de configuration et
de documentations relatifs &agrave; l'installation de UUCP, News, Mail sous
Linux, &agrave; partir des nombreuses sources disponibles. On peut en g&eacute;n&eacute;ral
trouver ce fichier sur <CODE>sunsite.unc.edu</CODE> dans le r&eacute;pertoire
<CODE> /pub/Linux/system/Mail/news</CODE>.</P>

<H2><A NAME="s4">4. Installation des programmes</A></H2>

<P>(L'essentiel de cette section est recopi&eacute;e du fichier README des sources
de  Taylor UUCP v1.05, pour vous permettre de vraiment "lire la
documentation" au lieu de nous contenter de vous le conseiller).</P>
<P>Le d&eacute;tail des instructions pour la compilation se trouve avec les
sources, dans le fichier  uucp.texi.</P>
<P>Vous pouvez r&eacute;cup&eacute;rer des fichiers <CODE>conf.h</CODE> et <CODE>policy.h</CODE>
"r&eacute;put&eacute;s corrects" pour Linux dans l'archive <EM>newspak</EM> cit&eacute;e plus
haut. Dans ce cas, vous pouvez sans doute directement taper <CODE>make</CODE>.</P>

<H2><A NAME="ss4.1">4.1 Extraction des archives compress&eacute;es</A>
</H2>

<P>Pour extraire une archive tar compress&eacute;e par gzip, je fais :
<PRE>
                gunzip -c fichier.tar.z | tar xvf -
</PRE>

Une version moderne de tar permet de faire :
<PRE>
               tar -zxvf fichier.tgz
</PRE>
</P>
<H2><A NAME="ss4.2">4.2 Edition de  Makefile.in pour sp&eacute;cifier les r&eacute;pertoires d'installation.</A>
</H2>

<P>Ici, j'initialise <CODE>prefix</CODE> &agrave; <CODE>/usr</CODE> plut&ocirc;t que la valeur par
d&eacute;faut de <CODE>/usr/local</CODE></P>

<H2><A NAME="ss4.3">4.3 Lancer "configure"</A>
</H2>

<P>Taper <CODE>sh configure</CODE>.</P>
<P>Le script <CODE>configure</CODE> va compiler un certain nombre de programmes
tests pour voir ce qu'il est possible de faire sur votre syst&egrave;me.</P>
<P>Il cr&eacute;era le fichier <CODE>conf.h</CODE> &agrave; partir de <CODE>conf.h.in</CODE> et le
Makefile depuis <CODE>Makefile.in</CODE>. Il g&eacute;n&eacute;rera &eacute;galement <CODE>config.status</CODE>,
qui est un shell-script qui permet de recr&eacute;er la configuration.</P>
<P>
<UL>
<LI>Plut&ocirc;t que d'&eacute;diter le fichier <CODE>Makefile.in</CODE> dans les sources comme
nous venons de l'indiquer, vous pouvez obtenir le m&ecirc;me r&eacute;sultat en
faisant <CODE>configure --prefix=/usr/lib</CODE>.</LI>
</UL>
</P>
<H2><A NAME="ss4.4">4.4 Configuration des options du programme</A>
</H2>


<H3>Examinez <CODE>conf.h</CODE> et <CODE>Makefile</CODE> pour v&eacute;rifier qu'ils sont corrects.</H3>

<P>J'ai utilis&eacute; les valeurs par d&eacute;faut.</P>
<H3>Editez <CODE>policy.h</CODE> pour les besoins de votre syst&egrave;me.</H3>

<P>
<UL>
<LI> - choisissez le type de fichiers de verrouillage d&eacute;sir&eacute; <CODE>(HAVE_HDB_LOCKFILES)</CODE></LI>
<LI> - choisissez le(s) type(s) de fichiers de configuration d&eacute;sir&eacute;(s)
<CODE>(HAVE_TAYLOR_CONFIG, HAVE_V2_CONFIG, HAVE_HDB_CONFIG)</CODE></LI>
<LI> - choisissez le type de structure voulue pour le r&eacute;pertoire "spool" 
<CODE>(SPOOLDIR_HDB)</CODE></LI>
<LI> - choisissez le type de fichiers de trace d&eacute;sir&eacute; <CODE>(HAVE_HDB_LOGGING)</CODE></LI>
<LI> - choisissez le chemin de recherche par d&eacute;faut des commandes
(j'ai rajout&eacute; /usr/local/bin )</LI>
</UL>
</P>
<H2><A NAME="ss4.5">4.5 Compilation et installation des programmes</A>
</H2>

<P>
<UL>
<LI>Tapez  <CODE>make</CODE>.</LI>
<LI>Utilisez <CODE>uuchk | more</CODE> pour tester les fichiers de configuration.
Vous pouvez employer <CODE>uuconv</CODE> pour convertir les diff&eacute;rents formats
entre eux.</LI>
<LI>Tapez <CODE>make install</CODE> pour installer les programmes.</LI>
</UL>
</P>
<H2><A NAME="ss4.6">4.6 Les fichiers de configuration</A>
</H2>

<P>Je vous recommande de commencer par prendre les bons vieux fichiers HDB
fournis et de les installer.
<UL>
<LI> Assurez-vous que le fichier <CODE>Permissions</CODE> indique exactement
o&ugrave; se trouvent <CODE>rmail</CODE> et <CODE>rnews</CODE> s'ils sont dans un r&eacute;pertoire non
compris dans le chemin de recherche que vous avez sp&eacute;cifi&eacute; dans <CODE>policy.h</CODE>.</LI>
<LI>V&eacute;rifiez que votre fichier <CODE>Devices</CODE> correspond bien &agrave; votre modem
(cua1=COM2 dans les exemples)</LI>
<LI>Editez le fichier <CODE>Systems</CODE> pour d&eacute;clarer les machines avec lesquelles
vous comptez communiquer, ainsi que les vitesses, num&eacute;ros de t&eacute;l&eacute;phone,
nom d'utilisateur et mots de passe.

*CE FICHIER NE DOIT PAS ETRE LISIBLE PAR TOUT LE MONDE*
</LI>
<LI> Rajoutez dans le fichier <CODE>Permissions</CODE> les lignes n&eacute;cessaires
pour chaque site avec lequel vous communiquerez. Pour des raisons de
s&eacute;curit&eacute;, il faut que chaque machine ait un compte s&eacute;par&eacute; (si vous
acceptez les appels entrants) et un r&eacute;pertoire personnel particulier,
pour que vous puissiez ma&icirc;triser les acc&egrave;s.</LI>
</UL>
</P>
<H2><A NAME="ss4.7">4.7 Essayez la chose...</A>
</H2>


<P>
<PRE>
/usr/lib/uucp/uucico -r 1 -x 9 -s remote_system_name
</PRE>
</P>
<P>Le param&egrave;tre <CODE>-x 9</CODE> donne un maximum d'informations de d&eacute;boguage,
&eacute;crite en principe dans le fichier  <CODE>/usr/spool/uucp/.Admin/audit.local</CODE>
(ou dans <CODE>/usr/lib/uucp/Log</CODE> en configuration Taylor), qui
aide beaucoup  &agrave; la mise au point initiale.</P>
<P>J'utilise souvent <CODE>-x 4</CODE> car ce niveau de d&eacute;boguage d&eacute;taille
suffisament les choses pour verifier les probl&egrave;mes de "login".
Bien entendu, le fichier tra&ccedil;ant tout cela doit  &ecirc;tre prot&eacute;g&eacute; de mani&egrave;re
&agrave; ce que personne ne puisse le lire.</P>
<P>
<UL>
<LI>  <EM>Pierre.Beyssac@emeraude.syseca.fr</EM> nous &eacute;crit :

Taylor supporte plus de niveaux de d&eacute;boguage. Utilisez <CODE> -x all</CODE>
pour positionner le niveau maximum.

Vous pouvez aussi faire un <CODE>tail -f</CODE> sur le fichier de trace
pour voir les informations s'afficher au fur et &agrave; mesure de leur
enregistrement.</LI>
</UL>
</P>
<H2><A NAME="ss4.8">4.8 Ca ne marche pas. Que faire ?</A>
</H2>

<P>En g&eacute;n&eacute;ral, vous pouvez vous r&eacute;f&eacute;rer &agrave; la documentation mentionn&eacute;e
au d&eacute;but de ce guide pour trouver l'erreur. Vous pouvez aussi demander
aux op&eacute;rateurs des sites UUCP dont vous &ecirc;tes voisins, mais souvent
il ne s'agit que d'une simple faute de frappe dans un fichier de
configuration.</P>

<H2><A NAME="s5">5. Questions fr&eacute;quemment pos&eacute;es &agrave; propos d'UUCP sous Linux</A></H2>



<H2><A NAME="ss5.1">5.1 Pourquoi mon binaire de uucp est-il configur&eacute; en mode HDB plut&ocirc;t qu'en Taylor ?</A>
</H2>

<P>(Je sais que certains sont aussi intransigeants sur la facilit&eacute; d'emploi,
que je le suis sur le fait de rester standard. C'est pour cette raison
que vous disposez du code source pour faire comme vous l'entendez :-) )</P>
<P>Parce que mon humble avis est que le standard "de fait" des
impl&eacute;mentations d'UUCP, est le type HDB. Il y a des milliers de sites
administr&eacute;s par des op&eacute;rateurs exp&eacute;riment&eacute;s et de nombreux endroits o&ugrave;
vous pourrez trouver des informations incroyablement correctes &agrave;
propos de la configuration HDB.</P>
<P>Les versions fournies avec certaines distributions de Linux sont compil&eacute;es
avec le support des trois modes possibles. Ca marche. Choisissez le
v&ocirc;tre.</P>
<P>L'ordre de recherche des fichiers de configuration est Taylor, puis V2
(L.sys) et enfin HDB. Vous pouvez utiliser l'utilitaire <CODE>uuconv</CODE>
pour convertir les diff&eacute;rents fichiers de configuration d'un type
&agrave; l'autre.</P>

<P>Si vous ne pouvez pas attendre, prenez les sources d'UUCP et sp&eacute;cifiez
<CODE>HAVE_BNU_CONFIG</CODE>, <CODE>HAVE_V2_CONFIG</CODE> et <CODE>HAVE_TAYLOR_CONFIG</CODE>,
les trois &agrave; la fois, dans le fichier <CODE>policy.h</CODE> et tapez <CODE>make</CODE>.</P>
<P>Il faut &eacute;galement savoir que la distribution Slackware est configur&eacute;e
de telle sorte qu'elle s&eacute;pare les fichiers n&eacute;cessaires aux diff&eacute;rentes
configuration dans plusieurs r&eacute;pertoires. Par exemple, ceux pour HDB
se trouveront dans <CODE>/usr/lib/uucp/hdb_config</CODE>.</P>

<H2><A NAME="ss5.2">5.2 D'o&ugrave; viennent ces <CODE>timeout</CODE> sur les connexions ?</A>
</H2>

<P>
<UL>
<LI> D'apr&egrave;s  <EM>Ed Carp - erc@apple.com</EM> :

Si vous utilisez un p&eacute;riph&eacute;rique <CODE>Direct</CODE> dans le fichier
<CODE>Devices</CODE>, il y a un timeout de 10 secondes, cod&eacute; lors de la compilation.
Changez le nom du p&eacute;riph&eacute;rique pour autre chose que <CODE>Direct</CODE>.
</LI>
<LI> <EM>Greg Naber - greg@squally.halcyon.com</EM> &eacute;crit :

Si vous avez des "timeout" lors des dialogues de connexion, vous
pouvez r&eacute;gler ce probl&egrave;me en &eacute;ditant la ligne 323 du fichier
<CODE>uuconf/syssub.c</CODE>, afin de changer les 10 secondes par d&eacute;faut
pour une valeur sup&eacute;rieure.
</LI>
<LI>  <EM>Ed Rodda - ed@orca.wimsey.bc.ca</EM> rench&eacute;rit :

En cas de "timeout" lors de connexions, particuli&egrave;rement avec
d'autres sites Taylor, une pause apr&egrave;s le "login" peut r&eacute;gler
le probl&egrave;me.
<PRE>
feed Any ACU,ag 38400 5551212 ogin: \c\d "" votrenom word: votrepasse
</PRE>
</LI>
<LI> <EM>Dr. Eberhard W. Lisse - el@lisse.NA</EM>  pr&eacute;cise :

Quelques noyaux Linux raccrochent pr&eacute;matur&eacute;ment la ligne au bout
de quelques secondes. Le patch suivant, fourni par Ian Taylor, peut
&eacute;viter ce probl&egrave;me.
<PRE>
*** conn.c.orig Mon Feb 22 20:25:24 1993
--- conn.c      Mon Feb 22 20:33:10 1993
***************
*** 204,209 ****
--- 204,212 ----

     /* Make sure any signal reporting has been done before we set
       fLog_sighup back to TRUE.  */
+   /* SMR: it seems to me if we don't care about SIGHUPS, we should clear
+      the flag before we return  */
+   afSignal[INDEXSIG_SIGHUP] = FALSE;
    ulog (LOG_ERROR, (const char *) NULL);
    fLog_sighup = TRUE;
</PRE>

Note du traducteur : cette modification est incluse dans la version 1.05,
disponible depuis fin avril 1994 !</LI>
</UL>
</P>
<H2><A NAME="ss5.3">5.3 Pourquoi l'UUCP Anonyme semble ne pas fonctionner en mode HDB ?</A>
</H2>

<P>La version 1.04 incluse dans la distribution SLS de Linux ne fonctionne
en anonyme qu'en mode Taylor, car elle est compil&eacute;e avec <CODE>HAVE_TAYLOR_CONFIG</CODE>.
Si vous voulez qu'elle marche en HDB, vous devrez la recompiler &agrave; partir
des sources en d&eacute;finissant uniquement HDB. Ian Taylor est en train de
r&eacute;fl&eacute;chir comment r&eacute;gler cette "caract&eacute;ristique".</P>
<P>Par ailleurs, Taylor en mode HDB semble &ecirc;tre tr&egrave;s sensible aux espaces et
lignes vides. Par s&eacute;curit&eacute;, assurez-vous qu'il n'y a aucune ligne
vide ou espace en fin de ligne dans le fichier <CODE>Permissions</CODE>.</P>
<P>Enfin, v&eacute;rifiez que vous avez un fichier nomm&eacute; <CODE> remote.unknown </CODE>
dans <CODE>/usr/lib/uucp</CODE> et qu'il n'est PAS ex&eacute;cutable. Voyez le livre
<EM>Managing UUCP and USENET</EM> de O'Reilly pour plus de d&eacute;tails &agrave; ce
sujet.</P>

<H2><A NAME="ss5.4">5.4 Que signifie l'erreur <CODE>no matching ports found</CODE> ?</A>
</H2>

<P>Vous &ecirc;tes probablement en train d'essayer d'utiliser un p&eacute;riph&eacute;rique
qui n'existe pas (fichier <CODE>/usr/lib/uucp/Devices</CODE>),
ou bien celui que vous avez sp&eacute;cifi&eacute; dans <CODE>/usr/lib/uucp/Systems</CODE>
ne correspond &agrave; aucun de ceux d&eacute;clar&eacute;s dans le fichier <CODE>Devices</CODE>.</P>
<P>Voici ci-dessous des versions <EM>saines</EM> de mes fichiers de configuration
de Taylor UUCP 1.05 en mode HDB que vous pouvez en toute s&eacute;curit&eacute; copier
et utiliser.</P>
<P>Vous voyez le mot <CODE>ACU</CODE> dans <CODE>Systems</CODE> ? Cela d&eacute;termine
quel "port" utiliser dans <CODE>Devices</CODE>.</P>
<P>Vous notez le mot <CODE>scout</CODE> dans <CODE>Systems</CODE> ? Il indique quel
composeur de num&eacute;ro utiliser dans <CODE>Dialers</CODE>.</P>
<P>Si vous aviez un port <CODE>ACU</CODE>, mais qu'aucun ne correspondait au
num&eacute;roteur pr&eacute;cis&eacute; sur la m&ecirc;me ligne dans <CODE>Systems</CODE>, vous avez
eu ce message d'erreur.</P>

<H2><A NAME="ss5.5">5.5 Existe-t-il de "bons" fichiers de configuration pour le mode HDB ?</A>
</H2>

<P>Ceux qui vont suivre sont "bons", pour Taylor-UUCP 1.05 sous Linux
en mode HoneyDanBer. Tous ces fichiers doivent &ecirc;tre dans
<CODE> /usr/lib/uucp</CODE> sauf si vous avez bricol&eacute; les sources pour changer
cette configuration de base.</P>
<P>Si vous <EM>avez</EM> d&eacute;plac&eacute; les chemins d'acc&egrave;s standards, m&eacute;fiez-vous
car certains programmes comme <CODE>sendmail</CODE> peuvent &ecirc;tre totalement
perdus. Vous devez vous assurer que tous les programmes relatifs aux
communications soient d'accord avec votre id&eacute;e des r&eacute;pertoires
"standard".</P>

<P>
<PRE>
#------------- Devices -------------
# assurez-vous que le peripherique (ici cua1) est correct pour vous.
# cua1 = COM2
#
# Ici, "scout" est le modem Digicom Scout Plus 19.2 que j'utilise.
# tbfast, et la suite, correspondent a un modem Telebit Trailblazer Plus
# a differentes vitesses.
#
ACU cua1 - 19200 scout
ACU cua1 - 9600 tbfast
ACU cua1 - 1200 tbslow
ACU cua1 - 2400 tbmed

#------------- Dialers --------------
# Notez l'ajustement des registres du Trailblazer "au vol"
# "scout" est le modem Digicom Scout Plus 19.2 que j'utilise.
#
scout   =W-,    "" ATM0DT\T CONNECT
tbfast  =W-,    "" A\pA\pA\pT OK ATS50=255DT\T CONNECT\sFAST
tbslow  =W-,    "" A\pA\pA\pT OK ATS50=2DT\T CONNECT\s1200
tbmed   =W-,    "" A\pA\pA\pT OK ATS50=3DT\T CONNECT\s2400

#-------------- Systems -------------
# Voici une entree tres generale qui devrait fonctionner avec la plupart
# des systemes.
#
# Le Any;1 signifie que l'on peut appeler une fois par minute avec  -f (force)
# Le ACU,g force le protocole "g" au lieu du Taylor "i" par defaut.
#
fredsys Any;1 ACU,g 19200 scout5555555 "" \r ogin:--ogin: uanon word: uanon

#-------------------------------- Permissions -------------------------
#
# Taylor UUCP en mode HDB est sensible aux lignes vides.
# Verifiez bien que toutes les lignes sont valides ou bien commentees.
#       
# Voici une entree UUCP Anonyme
#
LOGNAME=nuucp MACHINE=OTHER \
READ=/usr/spool/uucp/nuucp \
WRITE=/usr/spool/uucp/nuucp \
SENDFILES=yes REQUEST=yes \
COMMANDS=/bin/rmail
#
#
# Voici une entree normale pour une machine distante connue qui nous
# appellera. Notez le chemin d'acces absolu a rnews, qui n'est pas
# du tout le chemin "standard".
#
LOGNAME=fredsys MACHINE=fredsys \
READ=/usr/spool/uucp/fredsys:/usr/spool/uucp/uucppublic:/files \
WRITE=/usr/spool/uucp/fredsys:/usr/spool/uucppublic \
SENDFILES=yes REQUEST=yes \
COMMANDS=/bin/rmail:/usr/local/lib/news/bin/rnews
#----------------------------------------------------------------------
</PRE>
</P>
<H2><A NAME="ss5.6">5.6 Faire appeler diff&eacute;rents num&eacute;ros pour un m&ecirc;me site par uucico</A>
</H2>

<P>La version 1.05 impl&eacute;mente l'option <CODE>-z</CODE> dans uucico, pour
lui permettre d'appeler alternativement diff&eacute;rents num&eacute;ros de
t&eacute;l&eacute;phone pour un m&ecirc;me site.</P>
<H2><A NAME="s6">6. Remerciements</A></H2>


<P>Les personnes suivantes ont aid&eacute; &agrave; rassembler les informations (et
l'exp&eacute;rience) qui ont rendu ce document possible :</P>
<P>Ed Carp, Steve Robbins, Ian Taylor, Greg Naber, Matt Welsh,
Pierre Beyssac.</P>
<P>Si j'ai oubli&eacute; quelqu'un, je m'en excuse par avance.</P>

</BODY>
</HTML>
