<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>XFree86 Video Timings HOWTO</title><link href="style.css" rel="stylesheet" type="text/css"><meta content="DocBook XSL Stylesheets V1.68.1" name="generator"><meta name="description" content="Cet Howto est maintenant obsol&egrave;te.
Les versions courantes de XFree86 (4.0.1 et sup&eacute;rieures) calculent
automatiquement les lignes de mode optimales pour les r&eacute;solutions 
sp&eacute;cifi&eacute;es dans le fichier de configuration de X, section Modes.
 Comment d&eacute;finir une ligne de mode pour votre couple carte
graphique/moniteur sous XFree86. 
La distribution XFree86
inclut maintenant les &eacute;l&eacute;ments requis pour configurer la plupart des
combinaisons standard&nbsp;; le but premier de ce document est de vous
apprendre &agrave; mettre au point une ligne de mode personnalis&eacute;e pour un
moniteur &agrave; haute performance ou du mat&eacute;riel tr&egrave;s inhabituel.  Il vous
aidera aussi &agrave; utiliser kvideogen pour cr&eacute;er des lignes de mode 
(modelines), ou xvidtune pour effectuer le r&eacute;glage fin d'un
mode standard qui n'est pas encore optimal pour votre moniteur. 
"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article" lang="fr"><div class="titlepage"><div><div><h1 class="title"><a name="N10002"></a>XFree86 Video Timings HOWTO</h1></div><div><div class="author"><h3 class="author"><span class="firstname">Eric</span> <span class="othername">Steven</span> <span class="surname">Raymond</span></h3><div class="affiliation"><span class="orgname"><a href="http://www.tuxedo.org/~esr/" target="_top">
    Thyrsus Enterprises</a><br></span><div class="address"><p><span style="white-space: pre;">
    <code class="email">&lt;<a href="mailto:esr@thyrsus.com">esr@thyrsus.com</a>&gt;</code>
    </span></p></div></div></div></div><div><p class="othercredit"><span class="contrib">Traduction fran&ccedil;aise</span>&nbsp;: <span class="firstname">Guillaume</span> <span class="surname">All&egrave;gre</span></p></div><div><p class="releaseinfo">Version 5.0</p></div><div><p class="copyright">Copyright &copy; 2001 Eric S. Raymond</p></div><div><div class="legalnotice"><a name="N10035"></a><p class="legalnotice-title"><b>Copyright</b></p><p>Il est permis de copier, distribuer et/ou modifier ce document
  sous les conditions sp&eacute;cifi&eacute;es par l'<span class="emphasis"><em>Open Publication 
  License</em></span>, version 2.0.</p></div></div><div><p class="pubdate">$Date: 2001/08/11 00:37:48 $</p></div><div><div class="revhistory"><table summary="Revision history" width="100%" border="1"><tr><th colspan="3" valign="top" align="left"><b>Historique des versions</b></th></tr><tr><td align="left">Version 6.0</td><td align="left">2001-08-09</td><td align="left">esr</td></tr><tr><td colspan="3" align="left">
	 Explication plus pr&eacute;cise de DDC et EDID. 
	 Cet Howto est maintenant intrins&egrave;quement obsol&egrave;te.
      </td></tr><tr><td align="left">Version 5.0</td><td align="left">2000-08-22</td><td align="left">esr</td></tr><tr><td colspan="3" align="left">
	 Premi&egrave;re version DocBook.
      </td></tr></table></div></div><div><div class="abstract"><p class="title"><b>R&eacute;sum&eacute;</b></p><p><span class="bold"><strong>Cet Howto est maintenant obsol&egrave;te.
Les versions courantes de XFree86 (4.0.1 et sup&eacute;rieures) calculent
automatiquement les lignes de mode optimales pour les r&eacute;solutions 
sp&eacute;cifi&eacute;es dans le fichier de configuration de X, section Modes.
</strong></span></p><p>Comment d&eacute;finir une ligne de mode pour votre couple carte
graphique/moniteur sous <a name="N10059" class="indexterm"></a>. 
La distribution XFree86
inclut maintenant les &eacute;l&eacute;ments requis pour configurer la plupart des
combinaisons standard&nbsp;; le but premier de ce document est de vous
apprendre &agrave; mettre au point une ligne de mode personnalis&eacute;e pour un
moniteur &agrave; haute performance ou du mat&eacute;riel tr&egrave;s inhabituel.  Il vous
aidera aussi &agrave; utiliser kvideogen pour cr&eacute;er des lignes de mode 
(<span class="emphasis"><em>modelines</em></span>), ou xvidtune pour effectuer le r&eacute;glage fin d'un
mode standard qui n'est pas encore optimal pour votre moniteur. 
</p></div></div></div><hr></div><div class="toc"><p><b>Table des mati&egrave;res</b></p><dl><dt><span class="sect1"><a href="#disclaimer">1. Mise en garde</a></span></dt><dt><span class="sect1"><a href="#obsolete">2. Pourquoi cet Howto est obsol&egrave;te</a></span></dt><dt><span class="sect1"><a href="#introduction">3. Introduction</a></span></dt><dt><span class="sect1"><a href="#N100A1">4. Outils de calcul automatique</a></span></dt><dt><span class="sect1"><a href="#video">5. Comment fonctionnent les &eacute;crans vid&eacute;o</a></span></dt><dt><span class="sect1"><a href="#basic">6. Principes fondamentaux relatifs &agrave; votre &eacute;cran
et votrecarte graphique</a></span></dt><dd><dl><dt><span class="sect2"><a href="#N10117">6.1.  Les fr&eacute;quences de synchronisation du moniteur</a></span></dt><dt><span class="sect2"><a href="#N10130">6.2. La bande passante vid&eacute;o du moniteur</a></span></dt><dt><span class="sect2"><a href="#N10143">6.3. La fr&eacute;quence pilote (dot clock) de la carte graphique</a></span></dt><dt><span class="sect2"><a href="#N10166">6.4. Ce que contr&ocirc;lent ces donn&eacute;es de base</a></span></dt></dl></dd><dt><span class="sect1"><a href="#specs">7. Comprendre les sp&eacute;cifications de base</a></span></dt><dd><dl><dt><span class="sect2"><a href="#N101AC">7.1. A propos de la bande passante</a></span></dt><dt><span class="sect2"><a href="#N101BA">7.2. Fr&eacute;quences de synchronisation et fr&eacute;quence de rafra&icirc;chissement</a></span></dt></dl></dd><dt><span class="sect1"><a href="#tradeoffs">8. Concessions lors de la configuration du syst&egrave;me</a></span></dt><dt><span class="sect1"><a href="#sizes">9. Exigences en terme de m&eacute;moire</a></span></dt><dt><span class="sect1"><a href="#framesizes">10. Calcul de la taille de trame</a></span></dt><dt><span class="sect1"><a href="#magic">11. Magie noire et impulsions de synchronisation</a></span></dt><dd><dl><dt><span class="sect2"><a href="#N1023A">11.1. Synchronisation horizontale</a></span></dt><dt><span class="sect2"><a href="#N10271">11.2. Synchronisation verticale</a></span></dt></dl></dd><dt><span class="sect1"><a href="#synth">12. Synth&egrave;se</a></span></dt><dt><span class="sect1"><a href="#overd">13. Usage du moniteur en surcapacit&eacute;</a></span></dt><dt><span class="sect1"><a href="#inter">14. Utilisation des modes entrelac&eacute;s</a></span></dt><dt><span class="sect1"><a href="#answe">15. Questions et r&eacute;ponses</a></span></dt><dt><span class="sect1"><a href="#N1034C">16. R&eacute;soudre les probl&egrave;mes affectant l'image</a></span></dt><dd><dl><dt><span class="sect2"><a href="#N10367">16.1. L'image est d&eacute;centr&eacute;e vers la gauche ou la droite</a></span></dt><dt><span class="sect2"><a href="#N1036E">16.2. L'image est d&eacute;centr&eacute;e vers le haut ou le bas</a></span></dt><dt><span class="sect2"><a href="#N10375">16.3. L'image est trop large dans les deux directions</a></span></dt><dt><span class="sect2"><a href="#N1037A">16.4. L'image est trop large (ou trop &eacute;troite) horizontalement</a></span></dt><dt><span class="sect2"><a href="#N1037F">16.5. L'image est trop grande (ou trop petite) verticalement</a></span></dt></dl></dd><dt><span class="sect1"><a href="#cplot">17. Repr&eacute;sentation graphique des capacit&eacute;s du moniteur</a></span></dt><dt><span class="sect1"><a href="#credi">18. Cr&eacute;dits</a></span></dt></dl></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="disclaimer"></a>1.&nbsp;Mise en garde</h2></div></div></div><p> L'utilisation des informations reprises ci-dessous se fait 
<span class="emphasis"><em>EXCLUSIVEMENT A VOS RISQUES ET PERILS</em></span>.  
Cadencer votre moniteur en
dehors des limites fix&eacute;es par les sp&eacute;cifications du fabricant peut
pr&eacute;senter un danger pour votre mat&eacute;riel et pour vous-m&ecirc;mes.
Lisez la section <a href="#overd" title="13.&nbsp;Usage du moniteur en surcapacit&eacute;">Usage du moniteur en
surcapacit&eacute;</a> pour un avertissement d&eacute;taill&eacute;.
Tout dommage inflig&eacute; &agrave; votre personne ou &agrave; votre moniteur d&ucirc; &agrave; un
usage en surcapacit&eacute; rel&egrave;ve de votre seule responsabilit&eacute;.</p><p>La plus r&eacute;cente version de ce HOWTO est disponible &agrave; la page Web
du <a href="http://www.linuxdoc.org/LDP" target="_top">Linux Documentation
Project</a>.</p><p>Pri&egrave;re de transmettre vos commentaires, critiques, et suggestions &agrave;
<code class="email">&lt;<a href="mailto:esr@snark.thyrsus.com">esr@snark.thyrsus.com</a>&gt;</code> (en anglais). 
S'il vous pla&icirc;t, <span class="emphasis"><em>n'envoyez pas</em></span>de courrier
&eacute;lectronique implorant une solution miracle &agrave; vos probl&egrave;mes personnels
de moniteur, dans la mesure o&ugrave; agir de la sorte ne servira
qu'&agrave; perdre mon temps et &agrave; vous frustrer -- tout ce que je sais sur le
sujet est contenu ici. </p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="obsolete"></a>2.&nbsp;Pourquoi cet Howto est obsol&egrave;te</h2></div></div></div><p>
Avec les versions 4.0.0 et sup&eacute;rieures de XFree86, vous n'avez plus du
tout besoin de g&eacute;n&eacute;rer les lignes de mode. Elles sont calcul&eacute;es 
automatiquement par le serveur au d&eacute;marrage, d'apr&egrave;s la r&eacute;solution
sp&eacute;cifi&eacute;e dans le fichier de configuration de XFree86, section Screen,
sous-section Modes, et les capacit&eacute;s de votre moniteur que le serveur
X r&eacute;cup&egrave;re via une requ&ecirc;te EDID au moniteur.</p><p>Pour changer la r&eacute;solution &eacute;cran et la profondeur des couleurs,
il suffit d'&eacute;diter ou de cr&eacute;er une section Display les d&eacute;crivant.
Voici un exemple de description Screen de mon fichier de configuration
pour X :</p><pre class="screen">
Section "Screen"
	Identifier   "Screen0"
        Device       "ATI Rage Mobility"
        Monitor      "Monitor0"
	DefaultDepth	16

	Subsection "Display"
        	Depth       16
                Modes       "1024x768" 
	EndSubsection

EndSection
</pre><p>Normalement, tout ce que vous devrez faire sera de changer les
valeurs dans l'entr&eacute;e Modes ; X fera le reste.
Si vous demandez une r&eacute;solution impossible, il calculera la plus
proche r&eacute;solution supportable par votre moniteur, d'apr&egrave;s les donn&eacute;e
de la requ&ecirc;te EDID.</p><p>De ce fait, les informations contenues dans le reste de cet 
Howto ne vous seront utiles que si (a) vous avez un vieux moniteur,
ant&eacute;rieur &agrave; la norme EDID, ou si (b) votre pilote de carte
graphique ne permet pas d'interroger le moniteur, ou si (c) vous
utilisez une ancienne version de XFree86. Dans ce dernier cas,
vous devriez le mettre &agrave; jour pour r&eacute;gler tous vos probl&egrave;mes.</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="introduction"></a>3.&nbsp;Introduction<a name="intro"></a></h2></div></div></div><p>Le serveur XFree86 permet aux utilisateurs de configurer leur
sous-syst&egrave;me vid&eacute;o, ce qui favorise une utilisation optimale du
mat&eacute;riel existant.  Le but de ce guide est de vous apprendre &agrave; cr&eacute;er
vos propre valeurs d'horloge pour faire le meilleur usage de votre
carte vid&eacute;o et moniteur.</p><p>Nous pr&eacute;senterons une m&eacute;thode pour obtenir une configuration de base
utilisable, ensuite nous vous montrerons comment, au d&eacute;part de
celle-ci, vous pouvez vous livrer &agrave; des exp&eacute;riences pour d&eacute;terminer un
ensemble de valeurs qui l'adapte &agrave; vos pr&eacute;f&eacute;rences.</p><p>Si vous disposez d&eacute;j&agrave; d'un mode qui fonctionne presque (en
particulier, si l'un des modes VESA pr&eacute;-d&eacute;finis vous donne une image
stable mais d&eacute;centr&eacute;e vers la gauche ou la droite, trop petite, ou
trop grande) vous pouvez passer imm&eacute;diatement &agrave; la section intitul&eacute;e
<a href="#fixes">R&eacute;soudre les probl&egrave;mes affectant l'image</a>. 
Celle-ci vous apprendra diverses mani&egrave;res de manipuler les valeurs
d'horloge en vue d'obtenir certains r&eacute;sultats pr&eacute;cis.</p><p>Ne partez pas du principe que vous allez avoir de fastidieux
      ajustements de modes &agrave; faire, juste parce qu'&agrave; votre premier
      lancement de X apr&egrave;s installation, vous obtenez un &eacute;cran
      brouill&eacute;. Il se peut que presque toutes les lignes de modes
      soient bonnes, mais que le serveur utilise par d&eacute;faut justement
      celle qui ne convient pas &agrave; votre mat&eacute;riel. Commencez
      plut&ocirc;t par parcourir le cycle des modes install&eacute;s avec
      <span class="keysym">CTRL-ALT-KP+</span>.
      Si certains donnent de bons r&eacute;sultats, essayez de
      les commenter tous, sauf un mode 640x480, et v&eacute;rifiez que ce mode
      fonctionne. Si c'est le cas, d&eacute;commentez aussi une paire
      d'autres modes, par exemple un 800x600 et un 1024x768 &agrave; une
      fr&eacute;quence que votre moniteur devrait aussi g&eacute;rer.</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N100A1"></a>4.&nbsp;Outils de calcul automatique</h2></div></div></div><p>Si votre moniteur est post&eacute;rieur &agrave; 1996, il supporte probablement la norme
<a href="http://www.vesa.org/dload/summary/sumeedidrar1.htm" target="_top">EDID</a>.
Les moniteurs compatibles EDID (parfois appel&eacute;s "Plug'n'Play" dans la 
litt&eacute;rature marketing de Microsoft) peuvent d&eacute;clarer leurs
capacit&eacute;s &agrave; l'ordinateur.</p><p>De nombreux modules pilotes de XFree86 4.0 supportent le syst&egrave;me DDC,
<a href="http://www.vesa.org/dload/summary/sumeddcv1.htm" target="_top">
VESA Display Data Channel facility</a> (canal de donn&eacute;es d'affichage VESA).
Un module de pilote de carte compatible DDC est capable d'envoyer au moniteur
une requ&ecirc;te EDID, et de se configurer automatiquement d'apr&egrave;s la r&eacute;ponse.
Ainsi, avec XFree 4.0 et un moniteur r&eacute;cent, vous avez de bonnes      
chances de n'avoir aucune configuration &agrave; faire.</p><p>Si votre module de pilote de carte n'est pas compatible DDC,
mais que votre moniteur est compatible EDID, vous pouvez tout de m&ecirc;me      
utiliser le programme read-edid, qui interrogera le moniteur sur ses      
capacit&eacute;s, et calculera pour vous une ligne de mode. Voir
<a href="http://altern.org/vii/programs/linux/read-edid/" target="_top">
        http://altern.org/vii/programs/linux/read-edid/</a>.</p><p>Depuis la version 3.2, XFree86 s'accompagne du programme
  <span><strong class="command">XF86Setup</strong></span> qui simplifie grandement la cr&eacute;ation interactive d'un
  mode graphique valable, sans devoir manipuler directement les valeurs
  d'horloge vid&eacute;o.  Ainsi, dans la plupart des cas, il ne devrait pas
  vous &ecirc;tre n&eacute;cessaire de calculer un mode graphique de base.
  Malheureusement, <span><strong class="command">XF86Setup</strong></span> a ses limites ; il ne conna&icirc;t que les
  modes graphiques standards jusqu'&agrave; 1280x1024.  Si vous disposez d'un
  moniteur &agrave; tr&egrave;s haute performance capable d'afficher 1600x1200 ou
  plus, il vous faudra malgr&eacute; tout encore calculer votre mode graphique
  de base vous-m&ecirc;mes.</p><p>Il y a un utilitaire KDE appel&eacute; 
  <a href="http://paranoia.rulez.org/videogen/" target="_top">KVideoGen</a>
  qui calcule des lignes de
  mode &agrave; partir des caract&eacute;ristiques du moniteur et de la carte. J'ai
  bien g&eacute;n&eacute;r&eacute; des lignes de modes avec, mais je ne les ai pas test&eacute;es.
  Notez que ses param&egrave;tres "refresh rate" horizontal et vertical sont la
  m&ecirc;me chose que les fr&eacute;quences de synchronisation HSF et VSF que nous
  d&eacute;crivons plus loin. Le nombre "horizontal sync pulse" semble &ecirc;tre la
  largeur de l'impulsion de synchronisation en microsecondes, HSP 
  (l'outil supposant des valeurs corrig&eacute;es de HGT1 "front porch" et 
  HGT2 "back porch").  
  Si vous ne connaissez pas votre "horizontal sync pulse", il vaut mieux
  laisser la valeur par d&eacute;faut. </p><p>Un autre g&eacute;n&eacute;rateur de lignes de mode pour XFree86 se trouve
  <a href="http://zaph.com/Modelinw" target="_top">ici</a>.  Vous pouvez soit
  r&eacute;cup&eacute;rer le script Python script, soit utiliser le formulaire CGI.</p><p>Les versions r&eacute;centes de XFree86 fournissent un outil appel&eacute;
  <span><strong class="command">xvidtune</strong></span> que vous trouverez sans doute tr&egrave;s utile pour 
  tester et affiner les modes graphiques.  Il commence par un avertissement
  effrayant relatif aux possibles cons&eacute;quences d'un usage abusif.  Si
  vous accordez &agrave; ce document une attention scrupuleuse et apprenez ce
  qui se cache derri&egrave;re les jolies valeurs dans les &eacute;crans de xvidtune,
  vous serez capables d'utiliser ce programme efficacement et en toute
  confiance.</p><p>Si <span><strong class="command">xvidtune</strong></span>(1) est pr&eacute;sent, il vous sera possible 
  d'essayer de
  nouveaux modes "au vol", sans modifier votre fichier de configuration
  X, sans m&ecirc;me red&eacute;marrer votre serveur X.  Dans le cas contraire,
  XFree86 vous permet d'utiliser des raccourcis clavier pour
  s&eacute;lectionner parmi les diff&eacute;rents modes d&eacute;finis dans Xconfig (voyez
  XFree86.man pour de plus amples d&eacute;tails).  Exploitez cette capacit&eacute;
  pour vous &eacute;viter des ennuis !  Lorsque vous souhaitez tester un
  nouveau mode, donnez-lui un nom unique et ajoutez-le &agrave; la 
  <span class="emphasis"><em>fin</em></span> de votre
  liste de raccourcis.  Gardez toujours un mode que vous savez bon comme
  d&eacute;faut, de fa&ccedil;on &agrave; avoir une position de repli si le mode en cours de
  test ne marche pas.</p><p>A la fin de ce document, vous trouverez un script modeplot que vous
  pourrez utiliser pour produire un graphe analogique des modes
  disponibles. Ce n'est pas directement utile pour g&eacute;n&eacute;rer des lignes de
  mode, mais &ccedil;a peut vous aider &agrave; comprendre les relations qui
  permettent de les d&eacute;finir.</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="video"></a>5.&nbsp;Comment fonctionnent les &eacute;crans vid&eacute;o</h2></div></div></div><p>Savoir comment fonctionne l'&eacute;cran
<a name="N100E3" class="indexterm"></a> 
  est essentiel pour comprendre
  quelles valeurs placer dans les diff&eacute;rents champs du fichier Xconfig.
  Le serveur XFree86 utilise ces valeurs pour obtenir le contr&ocirc;le de
  plus bas niveau sur l'&eacute;cran.</p><p>L'&eacute;cran cr&eacute;e une image &agrave; partir de ce qu'on peut consid&eacute;rer comme une
  s&eacute;rie de points.  Ces points sont juxtapos&eacute;s de gauche &agrave; droite pour
  cr&eacute;er des lignes.  Ces lignes sont &agrave; leur tour juxtapos&eacute;es de haut en
  bas pour cr&eacute;er l'image.  Les points &eacute;mettent de la lumi&egrave;re lorsqu'ils
  sont frapp&eacute;s par les faisceaux d'&eacute;lectrons &agrave; l'int&eacute;rieur du tube
  cathodique, un faisceau par couleur primaire, Rouge, Vert, Bleu.  
  Pour faire en sorte que chaque faisceau
  frappe tous les points pendant une dur&eacute;e &eacute;gale, le faisceau balaye
  l'&eacute;cran suivant un itin&eacute;raire immuable, appel&eacute;e trame.</p><p>Nous avons &eacute;crit "ce qu'on peut consid&eacute;rer comme une s&eacute;rie de points"
  car les points de la trame ne correspondent pas aux points de
  phosphore physiques. Les points de trame sont beaucoup plus gros, et 
  regroupent beaucoup de points de phosphore. Ils doivent l'&ecirc;tre, car autrement
  l'affichage souffrirait d'un s&eacute;v&egrave;re effet de moir&eacute;. Les points de la
  trame correspondent r&eacute;ellement &agrave; l'&eacute;chantillonnage du signal
  analogique du pilote vid&eacute;o, et sont affich&eacute;s sous la forme d'une
  grille de points simplement parce que les pics et les vall&eacute;es du
  signal sont espac&eacute;s suffisamment r&eacute;guli&egrave;rement et finement.</p><p>Le trac&eacute; de cet itin&eacute;raire commence dans le coin sup&eacute;rieur gauche,
  traverse l'&eacute;cran vers la droite en une ligne presque horizontale, 
  imperceptiblement descendante.
  Le faisceau est alors envoy&eacute; du c&ocirc;t&eacute; gauche de l'&eacute;cran, mais une
  ligne plus bas. Cette nouvelle ligne est
  parcourue de gauche &agrave; droite tout comme la premi&egrave;re.  Ce sch&eacute;ma est
  r&eacute;p&eacute;t&eacute; jusqu'&agrave; ce que la derni&egrave;re ligne de l'&eacute;cran ait &eacute;t&eacute; parcourue.
  A ce moment, le faisceau est renvoy&eacute; du coin inf&eacute;rieur droit au coin
  sup&eacute;rieur gauche, et la manoeuvre recommence.</p><p>Il existe une variante de ce sch&eacute;ma, appel&eacute;e mode entrelac&eacute; (interlacing)
  <a name="N100F0" class="indexterm"></a> :
  dans ce cas, seule une ligne sur deux est parcourue
  pendant la premi&egrave;re demi-trame et les autres sont trait&eacute;es lors d'un
  deuxi&egrave;me parcours de demi-trame.</p><p>Le d&eacute;part du faisceau dans le coin sup&eacute;rieur gauche de l'&eacute;cran est
  appel&eacute; le d&eacute;but de trame.  La trame se termine lorsque le faisceau
  retrouve sa position de d&eacute;part, revenant du coin inf&eacute;rieur droit.  Une
  trame se compose de toutes les lignes que le faisceau a parcourues
  entre le haut et le bas de l'&eacute;cran.</p><p>Si les faisceaux d'&eacute;lectrons &eacute;taient allum&eacute;s en permanence pendant leur
  parcours de la trame, tous les points de l'&eacute;cran seraient illumin&eacute;s.
  Il n'y aurait pas de marges noires autour de la zone affichable.  Aux
  bords de l'&eacute;cran, l'image serait distordue car il est difficile de
  contr&ocirc;ler les faisceaux &agrave; cet endroit.  Afin de r&eacute;duire cette
  distorsion, les points en dehors de la zone affichable ne sont pas
  illumin&eacute;s par les faisceaux, alors que les faisceaux traversent bien
  ces zones, mais &eacute;teints.
  C'est ainsi que la taille de la zone affichable est
  inf&eacute;rieure &agrave; la surface totale de l'&eacute;cran.</p><p>Un autre concept important &agrave; comprendre est ce qu'il advient des
  faisceaux lorsqu'aucun point n'est illumin&eacute; &agrave; ce moment dans la zone
  affichable.  Le temps pendant lequel le faisceau aurait pu illuminer
  les marges lat&eacute;rales de la zone affichable est utilis&eacute; pour renvoyer
  le faisceau du c&ocirc;t&eacute; droit au c&ocirc;t&eacute; gauche.  
  De la m&ecirc;me fa&ccedil;on, le temps pendant lequel le faisceau
  aurait pu illuminer les marges inf&eacute;rieure et sup&eacute;rieure de la zone
  affichable est utilis&eacute; pour d&eacute;placer le faisceau du coin inf&eacute;rieur
  droit de l'&eacute;cran au coin sup&eacute;rieur gauche.</p><p> Le r&ocirc;le de la carte graphique est de g&eacute;n&eacute;rer les signaux qui
  commanderont &agrave; l'&eacute;cran d'allumer ou d'&eacute;teindre les faisceaux d'&eacute;lectrons
  pour chaque point, selon la couleur d&eacute;sir&eacute;e, cr&eacute;ant ainsi l'image.
  La carte contr&ocirc;le aussi le
  moment o&ugrave; l'&eacute;cran d&eacute;place les faisceaux du c&ocirc;t&eacute; droit au d&eacute;but de la
  ligne suivante en &eacute;mettant ce que l'on appelle le signal de
  synchronisation horizontale (horizontal sync pulse).  Un signal de
  synchronisation horizontale est &eacute;mis &agrave; la fin de de chaque ligne.  La
  carte graphique &eacute;met aussi un signal de synchronisation verticale
  (vertical sync pulse) qui commande &agrave; l'&eacute;cran de renvoyer le faisceau
  dans le coin sup&eacute;rieur gauche.  Un signal de synchronisation verticale
  est &eacute;mis &agrave; la fin de chaque trame.</p><p>De courts temps de pause sont n&eacute;cessaires imm&eacute;diatement avant et apr&egrave;s
  l'&eacute;mission des signaux de synchronisation horizontale et verticale de
  fa&ccedil;on &agrave; ce que les positions des faisceaux puissent se stabiliser.  
  Sans cela, l'image ne sera pas stable.</p><p>Pour plus d'informations, il y a une page (en anglais) <a href="http://fribble.cie.rpi.edu/~repairfaq/REPAIR/F_deflfaq.html" target="_top">TV
and Monitor Deflection Systems</a>.</p><p>Dans une section ult&eacute;rieure, nous reviendrons sur ces bases avec des
  d&eacute;finitions, des formules et des exemples pour vous aider &agrave; les
  utiliser.</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="basic"></a>6.&nbsp;Principes fondamentaux relatifs &agrave; votre &eacute;cran
et votrecarte graphique</h2></div></div></div><p>Il y a quelques principes fondamentaux qu'il vous faut comprendre
  avant de bricoler une entr&eacute;e dans le fichier XF86config.  Ceux-ci
  sont :</p><div class="itemizedlist"><ul type="disc"><li><p>les fr&eacute;quences de synchronisation horizontale
     et verticale de votre moniteur</p></li><li><p>la bande passante de votre moniteur</p></li><li><p>les fr&eacute;quences d'horloge pilote de votre carte graphique, 
ou  "dot clocks"</p></li></ul></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10117"></a>6.1.&nbsp; Les fr&eacute;quences de synchronisation du moniteur</h3></div></div></div><p>La fr&eacute;quence de synchronisation horizontale 
  <a name="N1011C" class="indexterm"></a> repr&eacute;sente simplement le
  nombre de fois par seconde que le moniteur peut parcourir une ligne
  horizontale ; c'est, de toutes, la valeur la plus importante
  concernant votre moniteur.  La fr&eacute;quence de synchronisation verticale
  repr&eacute;sente le nombre de fois par seconde que le faisceau peut
  enti&egrave;rement traverser l'&eacute;cran verticalement.</p><p>  Les fr&eacute;quences de synchronisation seront g&eacute;n&eacute;ralement fournies &agrave; la
  page "sp&eacute;cifications techniques" du manuel de votre moniteur.
  La fr&eacute;quence de synchronisation verticale <a name="N10123" class="indexterm"></a> 
  est typiquement exprim&eacute;e en Hz
  (cycles par seconde), la valeur horizontale en kHz (kilo-cycles par
  seconde).  Les plages de valeurs se situent habituellement entre 50 et
  150 Hz verticalement, et entre 31 et 135 kHz horizontalement.
</p><p>Si vous avez un moniteur dit multi-fr&eacute;quences (multisync), ces
  fr&eacute;quences seront donn&eacute;es sous forme de plages.  Certains moniteurs,
  sp&eacute;cialement les mod&egrave;les bas de gamme, ne supportent qu'une s&eacute;rie de
  fr&eacute;quences fixes.  Ceux-ci peuvent aussi &ecirc;tre configur&eacute;s, mais votre
  marge de manoeuvre sera s&eacute;rieusement limit&eacute;e par les caract&eacute;ristiques
  physiques du moniteur.  Choisissez la plus haute paire de fr&eacute;quences
  pour obtenir la meilleure r&eacute;solution.  Et soyez prudents : essayer
  de piloter un moniteur &agrave; fr&eacute;quences fixes &agrave; une fr&eacute;quence
  sup&eacute;rieure &agrave; celle pour laquelle il a &eacute;t&eacute; con&ccedil;u peut ais&eacute;ment
  l'endommager.</p><p>Des versions pr&eacute;c&eacute;dentes de ce guide traitaient de fa&ccedil;on fort l&eacute;g&egrave;re
  l'utilisation de moniteurs multi-fr&eacute;quences en surcapacit&eacute;, les
  poussant au-del&agrave; du maximum nominal de leur fr&eacute;quence de
  synchronisation verticale dans le but d'obtenir de meilleures
  performances.  D'autres arguments ont depuis lors &eacute;t&eacute; port&eacute;s &agrave; notre
  connaissance, incitant &agrave; la prudence en ce domaine ; nous reviendrons
  sur ce sujet dans la section <a href="#overd" title="13.&nbsp;Usage du moniteur en surcapacit&eacute;">Usage du moniteur
  en surcapacit&eacute;</a> ci-dessous.</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10130"></a>6.2.&nbsp;La bande passante vid&eacute;o du moniteur</h3></div></div></div><p>La page des sp&eacute;cifications techniques du votre manuel de votre
  moniteur devrait mentionner sa bande passante.  Si ce n'est pas le
  cas, jetez un oeil &agrave; la r&eacute;solution maximale annonc&eacute;e pour le moniteur.
  En premi&egrave;re approximation, voici une table de conversion de r&eacute;solution
  en estimation de bande passante (il s'agit donc de limites sup&eacute;rieures
  approximatives pour la fr&eacute;quence pilote (dot clock) que vous pouvez
  utiliser) :</p><pre class="screen">
	640x480			25
	800x600			36
	1024x768		65
	1024x768 interlaced	45
	1280x1024		110
	1600x1200		185
</pre><p>Au demeurant, cette table n'a rien de magique ; ces valeurs sont
  simplement les fr&eacute;quences pilotes les plus basses par r&eacute;solution dans
  la base de donn&eacute;es des modes standard XFree86 (exception faite de la
  derni&egrave;re, que j'ai extrapol&eacute;e).  La bande passante de votre moniteur
  peut en r&eacute;alit&eacute; &ecirc;tre plus &eacute;lev&eacute;e que le minimum requis pour sa
  r&eacute;solution maximale, aussi ne craignez pas d'essayer une fr&eacute;quence
  pilote de quelques MHz sup&eacute;rieure.</p><p> Notez aussi que la bande passante doit rarement &ecirc;tre prise en ligne de
  compte aux fr&eacute;quences pilotes inf&eacute;rieures &agrave; 65 MHz environ.  Avec une
  carte SVGA et la plupart des moniteurs haute r&eacute;solution, vous ne
  pourrez m&ecirc;me pas approcher la limite de la bande passante de votre
  moniteur.  En voici quelques exemples :</p><pre class="screen">
	Brand				Video Bandwidth
	----------			---------------
	NEC 4D				75Mhz
	Nano 907a			50Mhz
	Nano 9080i			60Mhz
	Mitsubishi HL6615		110Mhz
	Mitsubishi Diamond Scan		100Mhz
	IDEK MF-5117			65Mhz
	IOCOMM Thinksync-17 CM-7126	136Mhz
	HP D1188A			100Mhz
	Philips SC-17AS			110Mhz
	Swan SW617			85Mhz
	Viewsonic 21PS			185Mhz
	PanaSync/Pro P21		220Mhz
</pre><p>  M&ecirc;me les moniteurs bas de gamme n'ont en g&eacute;n&eacute;ral pas de contrainte
  terrible au niveau de leur bande passante aux r&eacute;solutions annonc&eacute;es.
  Le NEC Multisync II en est un exemple parfait --- si l'on en croit les
  sp&eacute;cifications du constructeur, il ne parvient m&ecirc;me pas &agrave; afficher en
  800x600.  Il affichera au maximum en 800x560.  Pour des r&eacute;solutions si
  basses, il n'est pas n&eacute;cessaire de disposer de hautes fr&eacute;quences
  pilotes ou une large bande passante ; le mieux que vous puissiez faire
  sera probablement 32 MHz ou 36 MHz, l'un comme l'autre ne s'&eacute;cartant
  pas trop de la bande passante annonc&eacute;e du moniteur : 30 MHz.</p><p>A ces deux fr&eacute;quences pilotes, il se peut que l'image affich&eacute;e ne soit
  pas aussi nette qu'elle devrait l'&ecirc;tre, mais certainement d'une
  qualit&eacute; tol&eacute;rable. Il serait plus agr&eacute;able, bien s&ucirc;r, que le NEC
  Multisync II dispose d'une bande passante vid&eacute;o sup&eacute;rieure &agrave; 36 Mhz,
  par exemple.  Mais ceci n'est pas indispensable pour des t&acirc;ches de
  base comme l'&eacute;dition de texte, pour autant que l'&eacute;cart ne soit pas &agrave;
  ce point important qu'il occasionne une forte distorsion de l'image
  (vos yeux vous le feraient sentir imm&eacute;diatement si cela devait &ecirc;tre le
  cas).</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10143"></a>6.3.&nbsp;La fr&eacute;quence pilote (dot clock) de la carte graphique</h3></div></div></div><p>La page "sp&eacute;cifications techniques" du manuel de votre carte graphique
  mentionne sans doute le dot clock
  <a name="N10148" class="indexterm"></a>
  maximum de la carte (c'est &agrave; dire,
  le nombre total de pixels que la carte peut envoyer &agrave; l'&eacute;cran par
  seconde).</p><p>Si vous ne poss&eacute;dez pas cette information, le serveur X la trouvera
  pour vous.  Les versions r&eacute;centes des serveurs X supportent tous une
  option --probeonly qui imprime cette information et termine sans
  r&eacute;ellement d&eacute;marrer X ni changer le mode vid&eacute;o.</p><p>Si cette option n'est pas support&eacute;e dans votre cas, ne perdez pas
  espoir.  M&ecirc;me si X bloque votre moniteur, il &eacute;mettra une ligne de
  valeurs d'horloge et d'autres informations vers la sortie erreur
  standard (stderr).  Si vous re-dirigez cela vers un fichier, les
  informations devraient y &ecirc;tre conserv&eacute;es, m&ecirc;me s'il vous faut
  red&eacute;marrer la machine pour obtenir &agrave; nouveau l'acc&egrave;s &agrave; la console.</p><p>Les r&eacute;sultats de cette d&eacute;tection du mat&eacute;riel ou les messages de
  d&eacute;marrage devraient ressembler &agrave; l'un des exemples suivants :</p><p>Si vous utilisez XFree86 :</p><pre class="screen">
  Xconfig: /usr/X11R6/lib/X11/Xconfig
  (**) stands for supplied, (--) stands for probed/default values
  (**) Mouse: type: MouseMan, device: /dev/ttyS1, baudrate: 9600
  Warning: The directory "/usr/andrew/X11fonts" does not exist.
           Entry deleted from font path.
  (**) FontPath set to "/usr/lib/X11/fonts/misc/,/usr/lib/X11/fonts/75dpi/"
  (--) S3: card type: 386/486 localbus
  (--) S3: chipset:   924
                      ---
      Chipset -- le mod&egrave;le pr&eacute;cis du processeur (ici, un ancien masque du 86C91
1)

  (--) S3: chipset driver: s3_generic
  (--) S3: videoram:  1024k
                      -----
           Taille de la m&eacute;moire RAM tampon de trame embarqu&eacute;e

  (**) S3: clocks:  25.00  28.00  40.00   3.00  50.00  77.00  36.00  45.00
  (**) S3: clocks:   0.00   0.00  79.00  31.00  94.00  65.00  75.00  71.00
                    ------------------------------------------------------
                              Fr&eacute;quences pilotes autoris&eacute;es en MHz

  (--) S3: Maximum allowed dot-clock: 110MHz
                                      ------
                                 Largeur de bande
  (**) S3: Mode "1024x768": mode clock =  79.000, clock used =  79.000
  (--) S3: Virtual resolution set to 1024x768
  (--) S3: Using a banksize of 64k, line width of 1024
  (--) S3: Pixmap cache:
  (--) S3: Using 2 128-pixel 4 64-pixel and 8 32-pixel slots
  (--) S3: Using 8 pages of 768x255 for font caching
</pre><p>Si vous utilisez SGCS ou X/Inside X :</p><pre class="screen">
WGA: 86C911 (mem: 1024k clocks: 25 28 40 3 50 77 36 45 0 0 79 31 94 65 75 71)
---  ------       -----         --------------------------------------------
   |     |            |              Fr&eacute;quences pilotes autoris&eacute;es en MHz
   |     |            +-- Taille de la m&eacute;moire RAM tampon de trame embarqu&eacute;e
   |     +-- Mod&egrave;le du processeur
   +-- Type du serveur
</pre><p>Note : effectuez ce test sur votre machine lorsqu'elle n'est pas
  charg&eacute;e (si possible).  Dans la mesure o&ugrave; X est une application, ses
  boucles de temporisation peuvent &ecirc;tre perturb&eacute;es par l'activit&eacute; sur
  le disque, rendant les valeur mentionn&eacute;es ci-dessus impr&eacute;cises.
  Effectuez le test plusieurs fois et veillez &agrave; ce que ces valeurs se
  stabilisent ; si cela ne se produit pas, &eacute;liminez autant de processus
  actifs que n&eacute;cessaire.  En particulier, le processus d&eacute;mon qui pilote 
  votre souris risque fortement de vous causer des probl&egrave;mes (il s'agit de 
  gpm pour les utilisateurs Linux, de mousemgr pour les utilisateurs de SVr4).
</p><p>De fa&ccedil;on &agrave; &eacute;viter toute impr&eacute;cision lors de la d&eacute;tection des
  fr&eacute;quences d'horloge, vous pouvez simplement copier la liste de
  fr&eacute;quences et la placer dans votre fichier XF86config comme valeur de
  la propri&eacute;t&eacute; "Clocks" --- ceci supprime la boucle de temporisation et
  fournit &agrave; X une liste pr&eacute;cise des valeurs d'horloge qu'il peut
  utiliser.  En utilisant les donn&eacute;es de l'exemple ci-dessus, cela
  donnerait :</p><pre class="screen">
wga
	Clocks	25 28 40 3 50 77 36 45 0 0 79 31 94 65 75 71
</pre><p>Sur des syst&egrave;mes dont la charge de travail varie fortement, ceci peut
  vous aider &agrave; &eacute;viter de myst&eacute;rieux &eacute;checs au d&eacute;marrage de X.  Il peut
  arriver que X d&eacute;marre, obtienne une mauvaise temporisation &agrave; cause de
  la charge excessive du syst&egrave;me, et ne soit d&egrave;s lors pas capable de
  trouver une fr&eacute;quence correspondante dans sa base de donn&eacute;es de
  configuration --- ou choisisse la mauvaise !</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10166"></a>6.4.&nbsp;Ce que contr&ocirc;lent ces donn&eacute;es de base</h3></div></div></div><p>Les plages de fr&eacute;quences de synchronisation de votre moniteur, ainsi
  que la fr&eacute;quence pilote de votre carte graphique, d&eacute;terminent la
  r&eacute;solution maximale qu'il vous sera loisible d'atteindre.  Mais c'est
  le r&ocirc;le du pilote de p&eacute;riph&eacute;rique d'exploiter le potentiel de votre
  &eacute;quipement.  Du mat&eacute;riel haut de gamme sans pilote sp&eacute;cialis&eacute;
  est un gaspillage d'argent.  D'un autre c&ocirc;t&eacute;, avec un
  pilote de p&eacute;riph&eacute;rique flexible et du mat&eacute;riel moins puissant, vous
  pouvez gagner un peu de marge de manoeuvre par rapport aux contraintes
  physiques.  Telle est la philosophie qui pr&eacute;sida &agrave; la conception de
  XFree86.</p><p>Il vous faudra s&eacute;lectionner une fr&eacute;quence d'horloge adapt&eacute;e &agrave; la bande
  passante vid&eacute;o de votre moniteur.  Vous b&eacute;n&eacute;ficierez ici d'une large
  marge de manoeuvre, cependant --- certains moniteurs ont une capacit&eacute;
  r&eacute;elle sup&eacute;rieure de 30% par rapport &agrave; leur bande passante nominale.
  Le risque ici est de d&eacute;passer la fr&eacute;quence de synchronisation
  verticale annonc&eacute;e du moniteur ; nous discuterons ceci en d&eacute;tail plus
  loin.</p><p>  Cette connaissance de la bande passante vous permettra d'effectuer des
  choix plus avertis entre diverses configurations possibles. Elle peut
  en effet influencer la qualit&eacute; visuelle de votre &eacute;cran
  (sp&eacute;cialement la pr&eacute;cision dans les petits d&eacute;tails).</p></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="specs"></a>7.&nbsp;Comprendre les sp&eacute;cifications de base</h2></div></div></div><p>Cette section explique la signification des sp&eacute;cifications mentionn&eacute;es
  pr&eacute;c&eacute;demment, ainsi que certains autres &eacute;l&eacute;ments qu'il vous sera utile
  de conna&icirc;tre.  Tout d'abord, quelques d&eacute;finitions.  A c&ocirc;t&eacute; de chaque
  terme d&eacute;fini est mentionn&eacute; entre parenth&egrave;ses le nom de la variable que
  nous utiliserons pour le repr&eacute;senter dans nos formules.</p><div class="variablelist"><dl><dt><span class="term">fr&eacute;quence de synchronisation horizontale (HSF - horizontal sync freq.)</span></dt><dd><p>Nombre de parcours horizontaux par seconde (voir ci-dessus).</p></dd><dt><span class="term">fr&eacute;quence de synchronisation verticale (VSF - vertical sync freq.)</span></dt><dd><p>Nombre de parcours verticaux par seconde (voir ci-dessus).
Principalement important comme limite sup&eacute;rieure de la
fr&eacute;quence de rafra&icirc;chissement.</p></dd><dt><span class="term">fr&eacute;quence pilote (DCF - driving clock freq. = dot clock)</span></dt><dd><p>La fr&eacute;quence du cristal ou VCO de votre carte graphique 
--- le nombre maximum de points par seconde qu'elle peut &eacute;mettre.</p></dd><dt><span class="term">bande passante vid&eacute;o (VB - video bandwith)</span></dt><dd><p>
        La fr&eacute;quence la plus &eacute;lev&eacute;e que vous puissiez appliquer &agrave;
        l'entr&eacute;e vid&eacute;o de votre moniteur en conservant une chance
        raisonnable d'obtenir une image intelligible. Si vous vous
        repr&eacute;sentez le signal &eacute;mis par votre carte graphique comme une
        succession rapide d'&eacute;tats allum&eacute;s/&eacute;teints, sa fr&eacute;quence la plus
        basse est &eacute;gale &agrave; la moiti&eacute; de DCF, de sorte qu'en th&eacute;orie, la
        bande passante n'a de sens qu'&agrave; partir de DCF/2.  Pour obtenir &agrave;
        l'&eacute;cran un affichage suffisamment net des petits d&eacute;tails,
        cependant, vous ne souhaiterez pas qu'elle soit de loin
        inf&eacute;rieure &agrave; votre DCF maximale ; il vaudrait m&ecirc;me mieux qu'elle
        lui soit sup&eacute;rieure.
</p></dd><dt><span class="term">longueur de trame (HFL, VFL)</span></dt><dd><p>
        La longueur de trame horizontale (HFL - horizontal frame length)
        est le nombre de tics d'horloge de votre carte graphique dont
        le canon &agrave; &eacute;lectrons de votre moniteur a besoin pour parcourir
        une ligne horizontale, <span class="emphasis"><em>y compris les marges gauche et droite
        inactives</em></span>.
        La longueur de trame verticale (VFL - vertical frame
        length) est le nombre de lignes parcourues dans l'image 
        <span class="emphasis"><em>enti&egrave;re</em></span>,
        y compris les marges inf&eacute;rieure et sup&eacute;rieure inactives.
</p></dd><dt><span class="term">fr&eacute;quence de rafra&icirc;chissement de l'&eacute;cran (RR - refresh rate)</span></dt><dd><p>
        Le nombre de fois par seconde que votre image est redessin&eacute;e
        (ceci est aussi appel&eacute; la "fr&eacute;quence de trame" - frame rate).
        Plus cette fr&eacute;quence est &eacute;lev&eacute;e, meilleure est l'image, dans la
        mesure o&ugrave; cela diminue l'effet de clignotement.  60 Hz est bon,
        mais le standard VESA (72 Hz) est meilleur.  Calculez-la sur
        base de la formule suivante :</p><pre class="screen">
	RR = DCF / (HFL * VFL)
</pre><p>Notez que le produit au d&eacute;nominateur n'est
        <span class="emphasis"><em>pas</em></span> &eacute;gal &agrave; la r&eacute;solution
        visible du moniteur, mais typiquement l&eacute;g&egrave;rement plus grand.  Nous
        entrerons dans les d&eacute;tails de ceci plus loin.</p></dd></dl></div><p>Les fr&eacute;quences pour lesquelles sont g&eacute;n&eacute;ralement mentionn&eacute;s les
     modes dits entrelac&eacute;s (comme "87Hz Interlaced") sont en fait des
     fr&eacute;quences de demi-trame : un &eacute;cran de ce type semble avoir une
     fr&eacute;quence de rafra&icirc;chissement sup&eacute;rieure aux autres mod&egrave;les de sa
     cat&eacute;gorie, mais chaque ligne individuelle n'est rafra&icirc;chie qu'une
     fois sur deux.</p><p>Dans le cadre de nos calculs, nous prendrons en compte la fr&eacute;quence
     de rafra&icirc;chissement d'un moniteur entrelac&eacute; par trame compl&egrave;te,
     c'est-&agrave;-dire 43.5 Hz dans l'exemple cit&eacute; plus haut. La qualit&eacute; d'un
     mode entrelac&eacute; est meilleure que celle d'un mode non-entrelac&eacute; &agrave;
     fr&eacute;quence de rafra&icirc;chissement par trame compl&egrave;te &eacute;gale, mais
     d&eacute;finitivement plus m&eacute;diocre que le mode non-entrelac&eacute;
     correspondant &agrave; la fr&eacute;quence de rafra&icirc;chissement par demi-trame.</p><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N101AC"></a>7.1.&nbsp;A propos de la bande passante</h3></div></div></div><p>Les fabricants de moniteurs aiment vanter la large bande passante
  offerte par leur mat&eacute;riel car elle d&eacute;termine la nettet&eacute; des
  transitions d'intensit&eacute; et de couleur &agrave; l'&eacute;cran.  Une large bande
  passante signifie des petits d&eacute;tails bien visibles.</p><p>Votre moniteur utilise des signaux &eacute;lectroniques pour offrir &agrave; vos
  yeux l'image qu'ils contemplent.  Des signaux de ce type se pr&eacute;sentent
  toujours sous la forme d'une onde une fois que l'information digitale
  a &eacute;t&eacute; convertie en un signal analogique.  Ils peuvent &ecirc;tre per&ccedil;us
  comme une combinaison de nombreuses ondes plus simples, chacune ayant
  une fr&eacute;quence fixe, pour la plupart dans la bande des MHz, par
  exemple, 20 MHz, 40 MHz, voire m&ecirc;me 70 MHz.  La bande passante de
  votre moniteur n'est autre que le signal analogique de plus
  haute fr&eacute;quence qu'il peut g&eacute;rer sans distorsion.</p><p>Dans le cas qui nous occupe, la bande passante vid&eacute;o 
  <a name="N101B5" class="indexterm"></a>
  est essentiellement importante comme limite sup&eacute;rieure approximative 
  de la fr&eacute;quence pilote (dot clock) qu'il vous est possible d'utiliser.
</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N101BA"></a>7.2.&nbsp;Fr&eacute;quences de synchronisation et fr&eacute;quence de rafra&icirc;chissement</h3></div></div></div><p>Chaque ligne parcourue horizontalement &agrave; l'&eacute;cran n'est que la partie
  visible d'un parcours de toute la longueur de la trame.  A tout
  moment, il n'y a en fait qu'un seul point actif &agrave; l'&eacute;cran, mais avec
  une fr&eacute;quence de rafra&icirc;chissement suffisamment &eacute;lev&eacute;e, la persistance
  r&eacute;tinienne de vos yeux vous permet de percevoir l'image compl&egrave;te.</p><p>Voici quelques sch&eacute;mas qui vous aideront :</p><pre class="screen">
     _______________________
    |                       |     La fr&eacute;quence de synchronisation horizontale
    |-&gt;-&gt;-&gt;-&gt;-&gt;-&gt;-&gt;-&gt;-&gt;-&gt;-&gt; |     repr&eacute;sente le nombre de fois
    |                      )|     par seconde que le faisceau d'&eacute;lectrons
    |&lt;-----&lt;-----&lt;-----&lt;--- |     du moniteur peut parcourir
    |                       |     un chemin semblable &agrave; celui-ci
    |                       |
    |                       |
    |                       |
    |_______________________|    
     _______________________
    |        ^              |     La fr&eacute;quence de synchronisation verticale
    |       ^ |             |     repr&eacute;sente le nombre de fois par
    |       | v             |     seconde que le faisceau d'&eacute;lectrons du
    |       ^ |             |     moniteur peut parcourir un chemin
    |       | |             |     semblable &agrave; celui-ci
    |       ^ |             |
    |       | v             |
    |       ^ |             |
    |_______|_v_____________|    
</pre><p>Souvenez-vous que le balayage de la zone affichable (raster scan)
  adopte en r&eacute;alit&eacute; la forme d'un zigzag tr&egrave;s serr&eacute; ; cela signifie que
  le faisceau se d&eacute;place de gauche &agrave; droite et en m&ecirc;me temps de haut en
  bas.</p><p>Nous comprenons maintenant comment fr&eacute;quence pilote (dot clock) et
  taille de trame sont li&eacute;es &agrave; la fr&eacute;quence de rafra&icirc;chissement.  Par
  d&eacute;finition, un hertz (Hz) &eacute;quivaut &agrave; un cycle par seconde.  Ainsi, si
  votre longueur de trame horizontale est repr&eacute;sent&eacute;e par HFL et votre
  longueur de trame verticale par VFL, il vous faut alors (HFL * VFL)
  tics pour couvrir l'enti&egrave;ret&eacute; de l'&eacute;cran.  Puisque votre carte &eacute;met
  DCF tics par seconde par d&eacute;finition, il s'ensuit bien entendu que le
  (les) canon(s) &agrave; &eacute;lectrons de votre moniteur peuvent parcourir l'&eacute;cran
  de gauche &agrave; droite et retour et de haut en bas et retour DCF / (HFL *
  VFL) fois par seconde. 
  Ceci repr&eacute;sente la fr&eacute;quence de rafra&icirc;chissement de votre &eacute;cran, car
  c'est le nombre de fois que le  contenu de votre &eacute;cran peut &ecirc;tre mis
  &agrave; jour (donc <span class="emphasis"><em>rafra&icirc;chi</em></span>) par seconde !</p><p>Il vous est n&eacute;cessaire d'int&eacute;grer ce concept si vous voulez pouvoir
  mettre sur pied une configuration qui sacrifie de la r&eacute;solution pour
  gagner de la stabilit&eacute; (r&eacute;duction de l'effet de clignotement) de la
  mani&egrave;re qui vous convienne le mieux.</p><p>Pour ceux d'entre vous qui comprennent mieux un petit dessin qu'un
  long discours, en voici un :</p><pre class="screen">
        RR                                      VB
         |   min HSF                     max HSF |
         |    |             R1        R2  |      |
max VSF -+----|------------/----------/---|------+----- max VSF
         |    |:::::::::::/::::::::::/:::::\     |
         |    \::::::::::/::::::::::/:::::::\    |
         |     |::::::::/::::::::::/:::::::::|   |
         |     |:::::::/::::::::::/::::::::::\   |
         |     \::::::/::::::::::/::::::::::::\  |
         |      \::::/::::::::::/::::::::::::::| |
         |       |::/::::::::::/:::::::::::::::| |
         |        \/::::::::::/:::::::::::::::::\| 
         |        /\:::::::::/:::::::::::::::::::|
         |       /  \:::::::/::::::::::::::::::::|\
         |      /    |:::::/:::::::::::::::::::::| |
         |     /     \::::/::::::::::::::::::::::| \
min VSF -+----/-------\--/-----------------------|--\--- min VSF
         |   /         \/                        |   \
         +--/----------/\------------------------+----\- DCF
           R1        R2  \                       |     \
                          min HSF                |    max HSF
                                                 VB
</pre><p>Ce graphique appel&eacute; diagramme de mode traduit les capacit&eacute;s 
  d'un moniteur classique.  Sur l'axe
  des x sont plac&eacute;es les fr&eacute;quences pilotes (DCF), sur l'axe des y les
  fr&eacute;quences de rafra&icirc;chissement (RR). La r&eacute;gion noircie du diagramme
  repr&eacute;sente les capacit&eacute;s du moniteur : chaque point &agrave; l'int&eacute;rieur de
  cette r&eacute;gion est un mode graphique possible.</p><p>Les lignes marqu&eacute;es `R1' et `R2' symbolisent une r&eacute;solution fixe
  (telle 640x480) ; le but de leur pr&eacute;sence est de montrer comment une
  r&eacute;solution donn&eacute;e peut &ecirc;tre obtenue par l'utilisation de nombreuses
  combinaisons diff&eacute;rentes de fr&eacute;quences pilotes et de fr&eacute;quences de
  rafra&icirc;chissement. La ligne R2 repr&eacute;sentera donc une plus haute
  r&eacute;solution que R1.</p><p>Les fronti&egrave;res haute et basse de la r&eacute;gion noircie sont de simples
  lignes horizontales qui repr&eacute;sentent les valeurs limites de la
  fr&eacute;quence de synchronisation verticale (min VSF et max VSF). La bande
  passante vid&eacute;o (VB) est une limite sup&eacute;rieure &agrave; la fr&eacute;quence pilote et
  appara&icirc;t donc comme une ligne verticale limitant la r&eacute;gion noircie sur
  la droite.</p><p>&Agrave; la section <a href="#cplot" title="17.&nbsp;Repr&eacute;sentation graphique des capacit&eacute;s du moniteur">Repr&eacute;sentation graphique des capacit&eacute;s du moniteur</a>,
  vous trouverez un programme qui vous aidera &agrave; &eacute;tablir un diagramme
  semblable &agrave; celui-ci (mais beaucoup plus joli, avec des graphiques X)
  pour votre moniteur personnel.  Ce chapitre couvrira
  aussi ce sujet fascinant : comment d&eacute;duire les limites r&eacute;sultant des
  fr&eacute;quences de synchronisation horizontale minimum et maximum.</p></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="tradeoffs"></a>8.&nbsp;Concessions lors de la configuration du syst&egrave;me</h2></div></div></div><p>Il existe une autre fa&ccedil;on de formuler l'&eacute;quation d&eacute;velopp&eacute;e plus haut</p><pre class="screen">
	DCF = RR * HFL * VFL
</pre><p>C'est-&agrave;-dire que vous consid&eacute;rez votre fr&eacute;quence pilote comme fixe.
  Vous pouvez ensuite convertir ces points par seconde que vous venez
  d'&eacute;conomiser en fr&eacute;quence de rafra&icirc;chissement, r&eacute;solution horizontale,
  ou r&eacute;solution verticale.  Si l'un de ces param&egrave;tres augmente, l'un ou
  les deux autres doivent diminuer.</p><p>Notez, cependant, que votre fr&eacute;quence de rafra&icirc;chissement ne peut
  exc&eacute;der la fr&eacute;quence de synchronisation verticale maximum de votre
  moniteur.  Ainsi, pour tout moniteur &agrave; une fr&eacute;quence pilote donn&eacute;e, il
  existe un produit de longueurs de trame minimum (HFL * VFL) en dessous
  duquel vous ne pourrez le faire descendre.</p><p>Lorsque vous choisirez vos param&egrave;tres, souvenez-vous de ceci : si vous
  prenez une valeur de RR trop basse, vous serez g&ecirc;n&eacute;s par un effet de
  clignotement.
  Il n'est pas recommand&eacute; de faire descendre votre fr&eacute;quence de
  rafra&icirc;chissement en dessous des 60 Hz.  Ceci repr&eacute;sente la fr&eacute;quence
  d'oscillation des n&eacute;ons aux USA (50 Hz en Europe, puisque c'est la
  fr&eacute;quence du courant &eacute;lectrique) ; 
  si vous &ecirc;tes sensibles &agrave; ceux-ci, il vous faudra de pr&eacute;f&eacute;rence 
  conserver les 72 Hz, le standard ergonomique VESA.</p><p>L'effet de clignotement est tr&egrave;s &eacute;prouvant pour les yeux, bien que
  l'oeil humain soit adaptable et que la tol&eacute;rance individuelle au
  ph&eacute;nom&egrave;ne varie fortement.  Si vous faites face &agrave; votre moniteur &agrave; un
  angle de 90%, que vous utilisez une couleur de fond sombre et une
  couleur en fort contraste pour l'avant-plan, et que vous vous
  contentez d'une intensit&eacute; basse &agrave; moyenne, il se *peut* qu'une
  fr&eacute;quence de rafra&icirc;chissement aussi basse que 45 Hz vous semble
  confortable.</p><p>Et maintenant le test qui tue : ouvrez un xterm avec un fond
  blanc et un avant-plan noir avec la commande 
  <span><strong class="command">xterm -bg white -fg black</strong></span> 
  et modifiez sa taille de fa&ccedil;on &agrave; ce qu'il recouvre
  l'enti&egrave;ret&eacute; de la zone affichable.  R&eacute;glez ensuite votre moniteur aux
  3/4 de son intensit&eacute; maximum, et d&eacute;tournez votre regard du moniteur.
  Essayez de le regarder en biais (de fa&ccedil;on &agrave; forcer l'utilisation des
  cellules r&eacute;tiniennes p&eacute;riph&eacute;riques, plus sensibles).  Si vous ne
  percevez aucun effet de clignotement, ou si vous consid&eacute;rez celui-ci
  tol&eacute;rable, cela signifie que la fr&eacute;quence de rafra&icirc;chissement vous
  convient.  Dans le cas contraire il serait pr&eacute;f&eacute;rable que vous
  configuriez une fr&eacute;quence de rafra&icirc;chissement plus &eacute;lev&eacute;e, car ce
  clignotement &agrave; la limite du perceptible fatiguera terriblement vos
  yeux et causera des maux de t&ecirc;te, m&ecirc;me si l'image semble parfaite en
  vision normale.</p><p>Dans le cas des modes entrelac&eacute;s, l'importance du clignotement d&eacute;pend
  de plus de facteurs diff&eacute;rents tels la r&eacute;solution verticale choisie et
  le type d'image affich&eacute;.  Il ne vous reste qu'&agrave; proc&eacute;der &agrave; vos propres
  exp&eacute;riences.  Quoi qu'il en soit, je ne vous conseille pas de
  descendre beaucoup sous la limite des 85 Hz (fr&eacute;quence de demi-trame).
</p><p>Partons du principe que vous avez choisi une fr&eacute;quence de
  rafra&icirc;chissement repr&eacute;sentant un minimum acceptable.  Vous aurez alors
  quelqu'espace de manoeuvre dans le choix de vos HFL et VFL.</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sizes"></a>9.&nbsp;Exigences en terme de m&eacute;moire</h2></div></div></div><p>La m&eacute;moire tampon de trame (frame-buffer RAM) disponible peut limiter
  la r&eacute;solution qu'il vous sera possible d'obtenir sur des &eacute;crans
  couleur ou &agrave; niveaux de gris.  Cela ne joue sans doute pas de r&ocirc;le par
  contre sur des &eacute;crans qui ne peuvent afficher que deux couleurs, noir
  et blanc sans d&eacute;grad&eacute; de gris.</p><p>Pour des images en 256 couleurs, un octet de m&eacute;moire vid&eacute;o est
  n&eacute;cessaire pour chaque point visible &agrave; afficher.  Cet octet contient
  l'information qui d&eacute;finit quel m&eacute;lange de rouge, vert et bleu est
  utilis&eacute; pour son point.  Pour calculer la quantit&eacute; de m&eacute;moire requise,
  multipliez le nombre de points visibles par ligne par le nombre de
  lignes visibles.  Pour un &eacute;cran d'une r&eacute;solution de 1024x768, cela
  ferait 1024 x 768 = 786432, ce qui correspond au nombre de points
  visibles sur l'&eacute;cran.  Cela repr&eacute;sente aussi, &agrave; raison d'un octet par
  point, le nombre d'octets de m&eacute;moire vid&eacute;o requise sur votre carte
  graphique.</p><p>Ainsi, vos exigences en terme de m&eacute;moire seront typiquement de 
  (HR * VR)/1024 Ko de VRAM, arrondis &agrave; l'unit&eacute; sup&eacute;rieure 
  (768 Ko exactement dans l'exemple pr&eacute;c&eacute;dent).  Si vous disposez de plus
  de m&eacute;moire qu'il n'est strictement n&eacute;cessaire, il vous sera possible
  d'utiliser l'exc&eacute;dent par la cr&eacute;ation d'un &eacute;cran virtuel d'une
  surface sup&eacute;rieure &agrave; celle de votre &eacute;cran physique.</p><p>Cependant, si votre carte graphique n'est &eacute;quip&eacute;e que de 512K, il ne
  vous sera pas possible d'atteindre cette r&eacute;solution.  M&ecirc;me si vous
  poss&eacute;dez un bon moniteur, &agrave; d&eacute;faut d'une quantit&eacute; suffisante de
  m&eacute;moire vid&eacute;o, votre ne pourrez exploiter pleinement les capacit&eacute;s de
  votre &eacute;cran.  D'un autre c&ocirc;t&eacute;, si votre carte SVGA est dot&eacute;e d'un M&eacute;ga
  de RAM, mais que votre &eacute;cran ne peut afficher plus de 800x600, les
  hautes r&eacute;solutions sont malgr&eacute; tout hors de votre port&eacute;e.
  Voyez la section <a href="#inter" title="14.&nbsp;Utilisation des modes entrelac&eacute;s">Utilisation des modes entrelac&eacute;s</a>
  pour une solution possible.</p><p>Ne vous inqui&eacute;tez pas si vous disposez de plus de m&eacute;moire que
  n&eacute;cessaire ; XFree86 en fera bon usage en vous permettant de faire
  d&eacute;rouler votre zone affichable (voyez la documentation du fichier
  Xconfig concernant les param&egrave;tres de taille de l'&eacute;cran virtuel).
  Souvenez-vous aussi qu'une carte &eacute;quip&eacute;e de 512 Ko de m&eacute;moire ne dispose 
  pas en r&eacute;alit&eacute; de 512000 octets, mais bien de 512 x 1024 = 524288 octets.
</p><p>Si vous utilisez X/Inside avec une carte S3, et que vous acceptez de
  vous contenter de 16 couleurs (4 bits par pixel), vous pouvez employer
  le param&egrave;tre depth=4 dans Xconfig et effectivement doubler la
  r&eacute;solution que votre carte pourra g&eacute;rer. Les cartes S3, par exemple,
  offrent normalement 1024x768x256.  Vous pouvez les configurer en 
  1280x1024x16 en for&ccedil;ant la profondeur d'image &agrave; 4 bits.
</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="framesizes"></a>10.&nbsp;Calcul de la taille de trame<a name="frame"></a></h2></div></div></div><p>Avertissement : cette m&eacute;thode a &eacute;t&eacute; d&eacute;velopp&eacute;e pour les moniteurs
  multi-fr&eacute;quences (multisync).  Elle s'appliquera sans doute aussi aux
  moniteurs &agrave; fr&eacute;quence fixe, mais c'est sans garantie !</p><p>Commencez par diviser DCF par la plus haute valeur de HSF disponible
  pour obtenir une longueur de trame horizontale.</p><p>Par exemple, supposons que vous poss&eacute;diez une carte graphique SVGA de
  type Sigma Legend dont la fr&eacute;quence pilote est de 65 MHz, et que votre
  moniteur ait une fr&eacute;quence de synchronisation horizontale de 55 kHz.
  La valeur (DCF / HSF) est alors de 1181 (65 MHz = 65000 kHz ; 65000/55
  = 1181).</p><p>Et maintenant notre premi&egrave;re astuce de magie noire.  Il vous faut
  arrondir le r&eacute;sultat obtenu au plus proche multiple de 8.  Cela
  s'explique par l'architecture du contr&ocirc;leur VGA en usage sur les
  cartes SVGA et S3 ; ce dernier utilise un registre sur 8 bits, apr&egrave;s
  d&eacute;calage &agrave; gauche de 3 bits, pour repr&eacute;senter une valeur qui
  normalement occupe 11 bits.  D'autres mod&egrave;les de carte comme l'ATI
  8514/A n'exigent sans doute pas cet arrondi, mais nous ne sommes pas
  s&ucirc;rs et l'utiliser ne peut pas nuire.  Aussi, arrondissez la longueur
  de trame horizontale utilisable vers le bas pour obtenir 1176.</p><p> Ce r&eacute;sultat (DCF / HSF arrondi &agrave; un multiple de 8) repr&eacute;sente la
  valeur minimum de HFL utilisable.  Il est possible d'obtenir de plus
  grandes valeurs de HFL (et donc, probablement, plus de points
  horizontalement &agrave; l'&eacute;cran) en jouant sur la fr&eacute;quence de synchronisation
  pour diminuer HSF, mais en le payant par un rafra&icirc;chissement plus
  lent et donc un effet de clignotement accentu&eacute;.</p><p>En r&egrave;gle g&eacute;n&eacute;rale, 80% de la longueur de trame horizontale est
  disponible pour la r&eacute;solution horizontale, autrement dit la partie
  visible du parcours horizontal du faisceau (ceci tient compte,
  globalement, des marges et du temps de retour -- c'est-&agrave;-dire le temps
  requis par le faisceau pour se d&eacute;placer du c&ocirc;t&eacute; droit de l'&eacute;cran au
  c&ocirc;t&eacute; gauche).  Dans cet exemple, cela repr&eacute;sente 940 tics d'horloge.
</p><p>  D&egrave;s lors, pour donner &agrave; votre image ses proportions normales de 4:3,
  fixez la r&eacute;solution verticale aux 3/4 de la valeur que vous venez
  juste de calculer pour la r&eacute;solution horizontale.  Toujours dans notre
  exemple, cela repr&eacute;sente 705 tics d'horloge.  Pour obtenir votre VFL
  r&eacute;el, multipliez ce chiffre par 1.05, ce qui vous donne 740 tics.</p><p>Ce rapport 4:3 n'est rev&ecirc;tu d'aucun pouvoir magique ; rien ne vous
  emp&ecirc;che de d&eacute;finir des proportions qui s'&eacute;cartent de la R&egrave;gle d'Or si
  cela doit vous permettre d'exploiter au mieux votre espace affichable.
  Le seul avantage de ces proportions classiques est de faciliter le
  calcul de la hauteur et largeur de trame &agrave; partir de la taille
  diagonale : multipliez simplement la diagonale par 0.8 pour obtenir la
  largeur et par 0.6 pour obtenir la hauteur.</p><p>Ainsi, nous avons HFL=1176 et VFL=740.  Si nous divisons 65 MHz par le
  produit de ces deux valeurs, nous obtenons une fr&eacute;quence de
  rafra&icirc;chissement -- parfaitement saine -- de 74.6 Hz.  Excellent !
  Mieux que le standard VESA !  Et vous obtenez une surface affichable
  de 944 x 705, soit plus que les 800 x 600 que vous attendiez
  probablement.  Pas mal du tout !</p><p>Il est m&ecirc;me possible d'augmenter encore la fr&eacute;quence de
  rafra&icirc;chissement, la poussant presque jusqu'&agrave; 76 Hz, en exploitant le
  fait que les moniteurs supportent souvent une fr&eacute;quence de
  synchronisation horizontale sup&eacute;rieure de 2 kHz environ &agrave; leur maximum
  annonc&eacute;, et en diminuant quelque peu VFL (c'est-&agrave;-dire, en utilisant
  moins de 75% de 940 dans l'exemple ci-dessus).  Mais avant de vous
  lancer dans cette tentative d'usage en surcapacit&eacute;, si vous vous y
  d&eacute;cidez, <span class="emphasis"><em>assurez-vous</em></span> que le canon &agrave; &eacute;lectrons
  de votre moniteur accepte des fr&eacute;quences verticales allant jusqu'&agrave; 76 Hz.
  (Le tr&egrave;s r&eacute;pandu NEC 4D, par exemple, ne le supporte pas.  Il ne va
  que jusqu'&agrave; 75 Hz VSF).  
  (Reportez-vous &agrave; la section <a href="#overd" title="13.&nbsp;Usage du moniteur en surcapacit&eacute;">Usage du moniteur en
  surcapacit&eacute;</a> pour une discussion plus g&eacute;n&eacute;rale de ce sujet.)
</p><p>Jusqu'ici, la majeure partie de ce que nous avons expos&eacute; n'est que
  simple arithm&eacute;tique et connaissance de base des &eacute;crans d'affichage.
  Pas besoin de la moindre magie noire !</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="magic"></a>11.&nbsp;Magie noire et impulsions de synchronisation</h2></div></div></div><p>OK, vous venez de calculer les valeurs de HFL/VFL pour la fr&eacute;quence
  pilote que vous avez choisie, vous avez trouv&eacute; une fr&eacute;quence de
  rafra&icirc;chissement acceptable, et v&eacute;rifi&eacute; que vous disposiez d'une
  quantit&eacute; suffisante de m&eacute;moire VRAM.  Passons maintenant &agrave; la vraie
  magie noire : il vous faut d&eacute;terminer o&ugrave; et quand placer vos signaux
  de synchronisation.</p><p>Les signaux de synchronisation contr&ocirc;lent en fait les fr&eacute;quences de
  balayage horizontale et verticale du moniteur.  Les valeurs HSF et VSF
  que vous avez extraites des sp&eacute;cifications techniques sont des
  quantit&eacute;s nominales, approximatives pour les fr&eacute;quences de
  synchronisation maximum.  L'impulsion de synchronisation pr&eacute;sente dans
  le signal de la carte graphique fournit au moniteur sa vitesse
  d'ex&eacute;cution effective.</p><p>Vous souvenez-vous des deux sch&eacute;mas pr&eacute;sent&eacute;s ci-dessus ? Seule une
  partie du temps requis pour que le faisceau balaye une trame compl&egrave;te
  est utilis&eacute; pour construire l'image affich&eacute;e (autrement dit, votre
  r&eacute;solution).</p><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N1023A"></a>11.1.&nbsp;Synchronisation horizontale</h3></div></div></div><p>  En fonction de notre d&eacute;finition pr&eacute;c&eacute;dente, il faut HFL tics d'horloge
  pour effectuer le parcours d'une ligne horizontale.  Appelons HR
  (horizontal resolution) le nombre de tics accomplis en mode visible
  (c'est-&agrave;-dire la r&eacute;solution horizontale de votre &eacute;cran).  Il s'ensuit,
  par d&eacute;finition, que HR &lt; HFL.  Pour rester pratique, supposons que 
  les
  deux quantit&eacute;s d&eacute;marrent au m&ecirc;me instant comme illustr&eacute; ci-dessous :</p><pre class="screen">
  |___ __ __ __ __ __ __ __ __ __ __ __ __
  |_ _ _ _ _ _ _ _ _ _ _ _                |
  |_______________________|_______________|_____ 
  0                       ^               ^     unit&eacute; : tic
                          |   ^       ^   |
                          HR  |       |  HFL
                          |   |&lt;-----&gt;|   |
                          |&lt;-&gt;|  HSP  |&lt;-&gt;|
                          HGT1         HGT2
</pre><p>Maintenant, nous voudrions placer un signal de synchronisation de
  longueur HSP comme illustr&eacute; ci-dessus, c'est-&agrave;-dire entre la fin des
  tics d'horloge utilis&eacute;s pour l'affichage de l'image et la limite des tics
  consacr&eacute;s &agrave; la trame compl&egrave;te.  Pourquoi cela ?  Parce que si nous
  parvenons &agrave; ce r&eacute;sultat, l'image affich&eacute;e ne sera pas d&eacute;cacl&eacute;e &agrave;
  gauche ou &agrave; droite.  Elle occupera sa place assign&eacute;e sur l'&eacute;cran,
  recouvrant le centre de la zone affichable.</p><p>Qui plus est, il est pr&eacute;f&eacute;rable de conserver environ 30 tics "de
  s&eacute;curit&eacute;" (guard time) de part et d'autre de l'impulsion de
  synchronisation.  Ces valeurs sont repr&eacute;sent&eacute;es par HGT1 et HGT2.
  Dans une configuration typique HGT1 != HGT2, mais si vous &ecirc;tes en
  train de construire une configuration &agrave; partir de z&eacute;ro, il vaudra
  mieux que vous commenciez vos exp&eacute;riences avec des valeurs &eacute;gales
  (c'est-&agrave;-dire, avec l'impulsion de synchronisation centr&eacute;e).</p><p>Le sympt&ocirc;me d'une impulsion de synchronisation mal plac&eacute;e consiste en
  un d&eacute;placement de l'image sur l'&eacute;cran, l'une des marges &eacute;largie &agrave;
  l'extr&ecirc;me tandis que l'autre c&ocirc;t&eacute; de l'image est r&eacute;fl&eacute;chi sur la paroi
  lat&eacute;rale du tube, ce qui r&eacute;sulte en une ligne blanche &agrave; la limite de
  la zone affichable et une bande d'image "fant&ocirc;me" du c&ocirc;t&eacute; int&eacute;rieur de
  cette ligne.  
  Une impulsion de synchronisation verticale excessivement
  mal plac&eacute;e peut aller jusqu'&agrave; provoquer un saut cyclique de l'image
  similaire &agrave; ce qu'on observe sur un poste de t&eacute;l&eacute;vision dont on aurait
  d&eacute;r&eacute;gl&eacute; le bouton d'ajustement vertical (c'est en fait le m&ecirc;me
  ph&eacute;nom&egrave;ne qui est &agrave; l'oeuvre ici).</p><p> Si vous avez de la chance, la largeur des signaux de synchronisation
  de votre moniteur sera document&eacute;e &agrave; la page des sp&eacute;cifications
  techniques.  Dans le cas contraire, c'est ici que l'on entre dans la
  vraie magie noire...</p><p> Pour cette section-ci, il vous faudra en partie proc&eacute;der par essais et
  erreurs.  Mais la plupart du temps, vous pouvez sans danger partir du
  principe qu'une impulsion de synchronisation a une dur&eacute;e d'environ 3.5
  &agrave; 4.0 microsecondes.</p><p>Toujours pour rester concret, supposons qu'HSP vaille 3.8
  microsecondes (ce qui, soit dit en passant, n'est pas une mauvaise
  valeur de d&eacute;part lorsque l'on exp&eacute;rimente).</p><p>Dans cette hypoth&egrave;se, sur la base de la fr&eacute;quence pilote de 65 Mhz
  mentionn&eacute;e plus haut, nous obtenons que HSP est &eacute;gal &agrave; 247 tics
  d'horloge (= 65 * 10^6 * 3.8 * 10^-6) [souvenez-vous : M&eacute;ga=10^6,
  micro=10^-6].
</p><p>Certains fabricants aiment mentionner leurs param&egrave;tres de tramage
  horizontal sous forme de dur&eacute;e plut&ocirc;t que de largeur exprim&eacute;e en
  hertz.  Vous pourriez chez eux rencontrer les termes suivants :</p><div class="variablelist"><dl><dt><span class="term">dur&eacute;e utile (HAT - Horizontal Active Time)</span></dt><dd><p>
	Equivalent &agrave; HR, mais en millisecondes.
	HAT * DCF = HR.
</p></dd><dt><span class="term">dur&eacute;e hors service (HBT - Horizontal Blanking Time</span></dt><dd><p>
	Equivalent &agrave; (HFL - HR), mais en millisecondes.
        HBT * DCF = (HFL - HR).
</p></dd><dt><span class="term">fen&ecirc;tre avant (HFP - Horizontal Front Porch)</span></dt><dd><p>
	Synonyme d'HGT1.
</p></dd><dt><span class="term">dur&eacute;e de synchronisation</span></dt><dd><p>
	Synonyme d'HSP.
</p></dd><dt><span class="term">fen&ecirc;tre arri&egrave;re (HBP - Horizontal Back Porch)</span></dt><dd><p>
	Synonyme d'HGT2.
</p></dd></dl></div></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10271"></a>11.2.&nbsp;Synchronisation verticale</h3></div></div></div><p>En nous r&eacute;f&eacute;rant &agrave; l'illustration pr&eacute;c&eacute;dente, comment placerons-nous
  les 247 tics d'horloge comme indiqu&eacute; dans le graphe ?</p><p>Toujours sur base du m&ecirc;me exemple, nous avons HR &eacute;gal &agrave; 944 et HFL
  &eacute;gal &agrave; 1176.  La diff&eacute;rence entre les deux est 1176 - 944 = 232 &lt;
  247 !  De toute &eacute;vidence, il nous faudra ici proc&eacute;der &agrave; quelques
  ajustements.  Que peut-on faire ?</p><p>La premi&egrave;re &eacute;tape est de porter 1176 &agrave; 1184, et de r&eacute;duire 944 &agrave; 936
  (NdT : choix des arrondis aux multiples de 8).  Maintenant la
  diff&eacute;rence = 1184 - 936 = 248. Hmm, on approche.</p><p>Ensuite, au lieu d'utiliser 3.8, nous prendrons 3.5 pour calculer
  HSP ; ce qui nous donne 65 * 3.5 = 227.  C'est d&eacute;j&agrave; beaucoup mieux.
  Mais 248 n'est pas beaucoup plus &eacute;lev&eacute; que 227.  Il est normalement
  requis de laisser environ 30 tics d'horloge entre HR et le d&eacute;but de
  SP, et la m&ecirc;me remarque est valable entre la fin de SP et HFL.  ET ces
  valeurs doivent &ecirc;tre multiples de huit !  Sommes-nous dans l'impasse ?
</p><p>Non.  Proc&eacute;dons comme suit, 936 % 8 = 0, (936 + 32) % 8 = 0 &eacute;galement.
  Mais 936 + 32 = 968, 968 + 227 = 1195, 1195 + 32 = 1227.  Hmm... ceci
  n'a pas l'air trop mal.  Mais ce n'est pas un multiple de huit, aussi
  arrondissons-le &agrave; 1232.</p><p>Des ennuis potentiels se profilent h&eacute;las &agrave; l'horizon car l'impulsion
  de synchronisation n'est plus situ&eacute;e juste au milieu de l'espace h -
  H.  Heureusement, gr&acirc;ce &agrave; l'aide de notre calculette nous trouvons que
  1232 - 32 = 1200 est aussi un multiple de 8 et que (1232 - 32) - 968 =
  232, ce qui correspondrait &agrave; utiliser une impulsion de synchronisation
  d'une dur&eacute;e de 3.57 microsecondes, une valeur qui est encore
  raisonnable.</p><p>De plus, 936 / 1232 ~ 0.76 ou 76%, ce qui ne s'&eacute;loigne pas trop des
  80%, il ne devrait donc pas y avoir de probl&egrave;me.</p><p>Qui plus est, l'usage de la longueur de trame horizontale pr&eacute;sente
  requiert de notre moniteur qu'il effectue sa synchronisation &agrave;
  52.7 kHz (= 65 MHz / 1232) ce qui se situe dans les limites de ses
  capacit&eacute;s.  Pas de probl&egrave;me.</p><p>Sur la base des r&egrave;gles g&eacute;n&eacute;rales mentionn&eacute;es plus haut, notre nouvelle
  r&eacute;solution verticale sera de 936 * 75% = 702.  Notre nouvelle longueur
  de trame verticale vaudra 702 * 1.05 = 737.</p><p>Fr&eacute;quence de rafra&icirc;chissement de l'&eacute;cran = 65 MHz / (737 * 1232) =
  71.6 Hz.  Cette valeur est toujours excellente.</p><p>La repr&eacute;sentation de l'impulsion de synchronisation verticale est tr&egrave;s
  semblable :</p><pre class="screen">
   |___ __ __ __ __ __ __ __ __ __ __ __ __
   |_ _ _ _ _ _ _ _ _ _ _ _                |
   |_______________________|_______________|_____ 
   0                      VR              VFL     unit: ticks
                           ^   ^       ^
                           |   |       |
                           |&lt;-&gt;|&lt;-----&gt;|
                            VGT    VSP
</pre><p>Nous commen&ccedil;ons l'impulsion de synchronisation juste apr&egrave;s la fin des
  cycles verticaux consacr&eacute;s &agrave; l'affichage r&eacute;el de donn&eacute;es.  VGT est
  l'intervalle de s&eacute;curit&eacute; (vertical guard time) requis pour l'impulsion
  de synchronisation.  La plupart des moniteurs supportent sans broncher
  une valeur de VGT de 0 (pas d'intervalle de s&eacute;curit&eacute;) et nous tirerons
  parti de cette possibilit&eacute; dans cet exemple.  Un petit nombre,
  cependant, n&eacute;cessitent l'emploi d'un intervalle de s&eacute;curit&eacute; de 2 ou 3
  tics, et cela ne cause g&eacute;n&eacute;ralement pas grand tort de les ajouter.</p><p>Revenons &agrave; notre exemple : puisque, suivant la d&eacute;finition du concept
  de longueur de trame, un tic (ou cycle) vertical repr&eacute;sente le temps
  n&eacute;cessaire pour dessiner une trame HORIZONTALE compl&egrave;te, il s'ensuit
  dans notre exemple qu'il vaut 1232 / 65 MHz = 18.95 &micro;s.</p><p>L'exp&eacute;rience prouve qu'une impulsion de synchronisation verticale
  devrait se situer quelque part entre 50 &micro;s et 300 &micro;s.  En guise
  d'illustration, prenons 150 &micro;s, ce qui correspond &agrave; 8 tics d'horloge
  verticaux (150 &micro;s / 18.95 &micro;s ~ 8).</p><p>Certains fabricants aiment mentionner leurs param&egrave;tres de tramage
  vertical sous forme de dur&eacute;e plut&ocirc;t que de largeur exprim&eacute;e en pixels.
  Vous pourriez chez eux rencontrer les termes suivants :</p><div class="variablelist"><dl><dt><span class="term">dur&eacute;e utile (VAT - Vertical Active Time)</span></dt><dd><p>Equivalent &agrave; VR, mais en millisecondes.
        VAT * VSF = VR.</p></dd><dt><span class="term">dur&eacute;e hors service (VBT - Vertical Blanking Time)</span></dt><dd><p>Equivalent &agrave; (VFL - VR), mais en millisecondes. 
	VBT * VSF = (VFL - VR).</p></dd><dt><span class="term">fen&ecirc;tre avant (VFP - Vertical Front Porch)</span></dt><dd><p>Synonyme de VGT.</p></dd><dt><span class="term">dur&eacute;e de synchronisation</span></dt><dd><p>Synonyme de VSP.</p></dd><dt><span class="term">fen&ecirc;tre arri&egrave;re (VBP - Vertical Back Porch)</span></dt><dd><p>Une seconde temporisation de s&eacute;curit&eacute; apr&egrave;s l'impulsion de
        synchronisation verticale.  Souvent nulle.</p></dd></dl></div></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="synth"></a>12.&nbsp;Synth&egrave;se</h2></div></div></div><p>La Table des Modes Vid&eacute;o du fichier Xconfig contient des s&eacute;quences de
  nombres, chaque ligne d&eacute;finissant de fa&ccedil;on compl&egrave;te un mode op&eacute;ratoire
  du serveur X.  Les champs sont group&eacute;s en quatre sections, &agrave; savoir
  respectivement le nom, la fr&eacute;quence pilote, les param&egrave;tres horizontaux
  et les param&egrave;tres verticaux.</p><p>La section consacr&eacute;e au nom ne contient qu'un champ, le nom du mode
  vid&eacute;o d&eacute;fini par le reste de la ligne.  Il sera fait r&eacute;f&eacute;rence &agrave; ce
  nom dans les lignes "Modes" de la section de configuration du pilote
  de carte graphique du fichier Xconfig.  Le champ nom peut &ecirc;tre omis si
  la valeur nom d'une ligne pr&eacute;c&eacute;dente s'applique &agrave; la ligne courante.</p><p>La section de la ligne de mode consacr&eacute;e &agrave; la fr&eacute;quence pilote ne
  contient que ce champ-l&agrave; (c'est la quantit&eacute; que nous avions baptis&eacute;e
  DCF).  La valeur plac&eacute;e dans ce champ sp&eacute;cifie quelle fr&eacute;quence pilote
  a &eacute;t&eacute; utilis&eacute;e pour g&eacute;n&eacute;rer les valeurs des sections suivantes.</p><p>La section des param&egrave;tres horizontaux se compose de quatre champs qui
  d&eacute;finissent comment chaque ligne horizontale de l'&eacute;cran doit &ecirc;tre
  construite.  Le premier champ de la section contient le nombre de
  points par ligne qui seront illumin&eacute;s pour cr&eacute;er l'image (la quantit&eacute;
  que nous avons appel&eacute;e HR).  Le second champ de la section (SH1)
  d&eacute;crit le point o&ugrave; commencera l'impulsion de synchronisation
  horizontale.  Le troisi&egrave;me champ (SH2) d&eacute;crit le point o&ugrave; se terminera
  cette impulsion de synchronisation.  Le quatri&egrave;me champ d&eacute;finit la
  longueur de trame horizontale totale (HFL).</p><p>La section des param&egrave;tres verticaux contient aussi quatre champs.  Le
  premier champ contient le nombre de lignes visibles qui appara&icirc;tront
  sur l'&eacute;cran (VR).  Le second champ (SV1) indique le num&eacute;ro de la ligne
  o&ugrave; commencera l'impulsion de synchronisation verticale.  Le troisi&egrave;me
  champ (SV2) d&eacute;finit le num&eacute;ro de ligne o&ugrave; se terminera cette impulsion
  de synchronisation.  Le quatri&egrave;me champ contient la longueur de trame
  verticale totale (VFL).</p><p>Exemple :</p><pre class="screen">
     #Nom de mode  horloge  valeurs horizontales  valeurs verticales

     "752x564"     40       752 784  944 1088     564 567 569 611
	           44.5     752 792  976 1240     564 567 570 600
</pre><p>(Note : la version de base de X11R5 ne permet pas l'emploi de
  fr&eacute;quences pilotes fractionnaires.)</p><p>Pour Xconfig, toutes les valeurs dont nous venons de parler - le
  nombre de points illumin&eacute;s sur une ligne, le nombre de points s&eacute;parant
  ceux qui sont illumin&eacute;s du d&eacute;but de l'impulsion de synchronisation, le
  nombre de points repr&eacute;sentant la dur&eacute;e de cette impulsion, et le
  nombre de points situ&eacute;s apr&egrave;s la fin de l'impulsion de synchronisation
  - sont additionn&eacute;s pour fournir le nombre de points par ligne.  Le
  nombre de points horizontaux doit &ecirc;tre divisible par huit.</p><p>Exemple de valeurs horizontales : 800 864 1024 1088</p><p>Cette ligne d'exemple comporte le nombre de points illumin&eacute;s (800)
  suivi par la coordonn&eacute;e horizontale du point o&ugrave; commence l'impulsion
  de synchronisation (864), suivi par la coordonn&eacute;e horizontale du point
  o&ugrave; finit cette impulsion (1024), suivi par la coordonn&eacute;e horizontale
  du dernier point sur la ligne (1088).</p><p>Remarquez encore une fois que chacune des valeurs horizontales (800, 864,
  1024, et 1088) est divisible par huit !  Les valeurs verticales ne
  sont pas frapp&eacute;es de la m&ecirc;me exigence.</p><p>Le nombre de lignes comprises entre le sommet de la zone affichable et
  le bas de celle-ci compose la trame.  Le signal d'horloge de base, en
  ce qui concerne la trame, est la ligne.  Un certain nombre de lignes
  composeront l'image.  Apr&egrave;s que la derni&egrave;re ligne illumin&eacute;e a &eacute;t&eacute;
  affich&eacute;e, un d&eacute;lai correspondant &agrave; un nombre pr&eacute;cis de lignes sera
  respect&eacute; avant que l'impulsion de synchronisation verticale soit
  &eacute;mise.  Cette impulsion durera alors quelques lignes, et
  finalement les derni&egrave;res lignes de la trame, correspondant au d&eacute;lai
  requis apr&egrave;s l'impulsion, seront g&eacute;n&eacute;r&eacute;es.  Les valeurs qui d&eacute;finissent
  ce mode op&eacute;ratoire sont fournies d'une mani&egrave;re semblable &agrave; l'exemple
  suivant.</p><p>Exemple de valeurs verticales : 600 603 609 630</p><p>Cet exemple d&eacute;finit une image compos&eacute;e de 600 lignes visibles, o&ugrave;
  l'impulsion de synchronisation verticale d&eacute;bute sur la 603&egrave;me ligne et
  se termine sur la 609&egrave;me, et compos&eacute;e d'un total de 630 lignes.</p><p>Remarquez que les valeurs verticales ne doivent pas n&eacute;cessairement
  &ecirc;tre divisibles par huit !</p><p>  Revenons &agrave; l'exemple sur lequel nous travaillions.  Suivant ce que
  nous venons d'exposer, tout ce qu'il nous reste &agrave; faire est de placer
  nos r&eacute;sultats dans le fichier Xconfig selon le format suivant :</p><pre class="screen">
&lt;nom&gt;   DCF     HR  SH1 SH2   HFL   VR  SV1 SV2 VFL
</pre><p>o&ugrave; SH1 repr&eacute;sente le tic de d&eacute;but de l'impulsion de synchronisation
  horizontale et SH2 son tic final ; de la m&ecirc;me mani&egrave;re, SV1 repr&eacute;sente
  le tic initial de l'impulsion de synchronisation verticale et SV2 son
  tic final.</p><p>Pour d&eacute;finir ces valeurs, souvenez-vous de la discussion relative &agrave; la
  magie noire et aux impulsions de synchronisation que nous avons tenue
  plus haut. SH1 est le point qui marque le front avant de l'impulsion
  de synchronisation horizontale ; donc, SH1 = HR + HGT1. SH2 repr&eacute;sente
  le front arri&egrave;re ; donc, SH2 = SH1 + HSP. De la m&ecirc;me mani&egrave;re, SV1 = VR
  + VGT (mais VGT vaut la plupart du temps 0) et SV2 = SV1 + VSP.</p><pre class="screen">
#nom    dotclock valeurs horizontales   valeurs verticales   drapeau
936x702  65      936 968 1200 1232   702 702 710 737
</pre><p>Aucun drapeau (flag) sp&eacute;cial n'est n&eacute;cessaire ici ; il s'agit d'un
  mode non-entrelac&eacute;.  Maintenant nous avons r&eacute;ellement termin&eacute;.</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="overd"></a>13.&nbsp;Usage du moniteur en surcapacit&eacute;</h2></div></div></div><p>Il vous est <span class="emphasis"><em>fermement d&eacute;conseill&eacute;</em></span> de tenter 
  d'imposer &agrave; votre moniteur
  l'usage d'une fr&eacute;quence de balayage sup&eacute;rieure s'il s'agit d'un
  moniteur &agrave; fr&eacute;quence fixe.  Votre &eacute;cran peut tout simplement finir
  grill&eacute; !  Avec un moniteur multi-fr&eacute;quences en surcapacit&eacute;, il peut
  survenir des probl&egrave;mes potentiellement plus subtils, dont il est bon
  que vous soyez conscient.</p><p>Par contre, utiliser une fr&eacute;quence pilote sup&eacute;rieure &agrave; la bande
  passante maximum du moniteur est relativement inoffensif. C'est le
  d&eacute;passement des fr&eacute;quences maximales de synchronisation qui est
  probl&eacute;matique. Les moniteurs modernes ont des circuits de protection
  qui &eacute;teignent l'&eacute;cran aux fr&eacute;quences dangereuses, mais ne comptez pas
  trop dessus. En particulier, il y a des vieux moniteurs
  multifr&eacute;quences (comme le Multisync II) qui n'utilisent qu'un
  transformateur horizontal.  Ces moniteurs n'offrent pas tellement de
  protection contre leur usage en surcapacit&eacute;. M&ecirc;me s'il y a forc&eacute;ment
  des circuits de r&eacute;gulation haute tension (qui ne sont pas n&eacute;cessaires
  dans un moniteur &agrave; fr&eacute;quences fixes), ils ne couvriront pas forc&eacute;ments
  tous les intervalles de fr&eacute;quences possibles, particuli&egrave;rement dans
  les mod&egrave;les bon march&eacute;.  Il n'y a pas seulement des risques pour les
  circuits, mais cela risque aussi d'acc&eacute;l&eacute;rer le vieillissement de la
  couche de phosphore, et d'augmenter la dose de radiations (dont les
  rayons X) &eacute;mise par le moniteur.</p><p>Cependant, la valeur qui est la source principale des probl&egrave;mes est la
  fr&eacute;quence d'oscillation (slew rate) - la "pente" des signaux vid&eacute;o - &agrave;
  la sortie de la carte graphique, et cela ne d&eacute;pend normalement pas de
  la fr&eacute;quence pilote courante, mais (si le constructeur de votre carte
  se pr&eacute;occupe de ces questions) est li&eacute; &agrave; la fr&eacute;quence pilote maximum
  support&eacute;e par la carte.</p><p>Aussi, soyez prudents...</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="inter"></a>14.&nbsp;Utilisation des modes entrelac&eacute;s</h2></div></div></div><p>(Cette section est d&ucirc;e en majeure partie &agrave; David Kastrup
<code class="email">&lt;<a href="mailto:dak@pool.informatik.rwth-aachen.de">dak@pool.informatik.rwth-aachen.de</a>&gt;</code>)</p><p>A une fr&eacute;quence pilote donn&eacute;e, un &eacute;cran entrelac&eacute; manifestera un effet
  de clignotement consid&eacute;rablement moins perceptible qu'un &eacute;cran non-
  entrelac&eacute;, si les circuits verticaux de votre moniteur sont capables
  de supporter cette fr&eacute;quence de fa&ccedil;on stable.  C'est la raison pour
  laquelle ces modes entrelac&eacute;s furent invent&eacute;s au d&eacute;part.</p><p>Les modes entrelac&eacute;s doivent leur mauvaise r&eacute;putation au fait que leur
  qualit&eacute; est inf&eacute;rieure au mode non-entrelac&eacute; &eacute;quivalent &agrave; la m&ecirc;me
  fr&eacute;quence de balayage verticale, VSF (celle qui est g&eacute;n&eacute;ralement
  mentionn&eacute;e dans les publicit&eacute;s). Mais ils sont certainement d'une
  qualit&eacute; sup&eacute;rieure &agrave; la m&ecirc;me fr&eacute;quence de balayage horizontale, et
  c'est l&agrave; que se situent les limites d&eacute;cisives de votre couple
  moniteur/carte graphique.</p><p>&Agrave; une <span class="emphasis"><em>fr&eacute;quence de rafra&icirc;chissement</em></span> 
  donn&eacute;e (ou fr&eacute;quence de demi-trame, ou VSF),
  l'affichage entrelac&eacute; manifestera un clignotement plus
  fort : un affichage entrelac&eacute; &agrave; 90 Hz sera d'une qualit&eacute; inf&eacute;rieure &agrave;
  un affichage non-entrelac&eacute; &agrave; 90 Hz. Il ne n&eacute;cessitera, cependant, que
  la moiti&eacute; de la bande passante vid&eacute;o et la moiti&eacute; de la fr&eacute;quence de
  balayage horizontale. Si vous le comparez &agrave; un mode non-entrelac&eacute; &agrave; la
  m&ecirc;me fr&eacute;quence pilote et aux m&ecirc;mes fr&eacute;quences de balayage, vous le
  trouverez de loin sup&eacute;rieur : 45 Hz non-entrelac&eacute; est intol&eacute;rable.
  Avec 90 Hz entrelac&eacute;, j'ai travaill&eacute; des ann&eacute;es sur mon Multisync 3D
  (&agrave; 1024x768) et j'en suis tout &agrave; fait satisfait. J'ai l'impression
  qu'il vous faudrait au moins du 70 Hz non-entrelac&eacute; pour atteindre un
  niveau de confort &eacute;quivalent. </p><p>Voici quelques &eacute;l&eacute;ments auxquels il vous faudra pr&ecirc;ter attention,
  cependant : n'employez les modes entrelac&eacute;s qu'&agrave; des r&eacute;solutions
  &eacute;lev&eacute;es, de sorte que les lignes illumin&eacute;es alternativement soient
  proches les unes des autres. Vous avez aussi la possibilit&eacute; de jouer
  sur la largeur et la position de l'impulsion de synchronisation pour
  obtenir le positionnement des lignes le plus stable. Si des lignes
  sont alternativement claires et fonc&eacute;es, l'entrelacement va vous "sauter &agrave;
  la figure". J'utilise un programme qui emploie une configuration de
  points semblable pour l'arri&egrave;re-plan d'un menu (il s'agit d'XCept -
  aucun autre programme &agrave; ma connaissance ne fait cela, heureusement).
  </p><p>Pour la m&ecirc;me raison, utilisez au moins des polices 100 dpi, ou toute
  autre police dont les barres horizontales font au moins deux lignes
  d'&eacute;paisseur (dans le cas de hautes r&eacute;solutions, cela n'a pas de sens
  d'utiliser quoi que ce soit d'autre de toute fa&ccedil;on).</p><p>Et bien s&ucirc;r, n'utilisez jamais de mode entrelac&eacute; si votre mat&eacute;riel est
  capable de supporter l'emploi d'un mode non-entrelac&eacute; &agrave; la m&ecirc;me
  fr&eacute;quence de rafra&icirc;chissement.</p><p>Si, au contraire, vous remarquez qu'&agrave; certaines r&eacute;solutions vous
  poussez soit le moniteur soit la carte graphique jusqu'&agrave; ses limites,
  et que vous obtenez un clignotement d&eacute;sagr&eacute;able ou une image d&eacute;lav&eacute;e
  (signe que vous saturez la bande passante disponible), peut-&ecirc;tre
  souhaiterez-vous essayer d'obtenir la m&ecirc;me r&eacute;solution par l'emploi
  d'un mode entrelac&eacute;. Ceci bien s&ucirc;r n'a de sens que si le VSF de votre
  moniteur n'est pas encore proche de sa limite.</p><p> La mise au point d'un mode entrelac&eacute; est facile : proc&eacute;dez exactement
  comme pour un mode non-entrelac&eacute;. Il suffit de prendre en compte deux
  &eacute;l&eacute;ments suppl&eacute;mentaires : il vous faut un nombre total impair de
  lignes verticales (la derni&egrave;re valeur de votre ligne de mode), et
  lorsque vous sp&eacute;cifiez le drapeau "Interlace", la fr&eacute;quence de trame
  verticale r&eacute;elle pour votre moniteur est doubl&eacute;e. Il faut que votre
  moniteur supporte une fr&eacute;quence de trame de 90 Hz si le mode que vous
  sp&eacute;cifiez semble &ecirc;tre du 45 Hz, le drapeau "Interlace" mis &agrave; part.
</p><p>En guise d'exemple, ceci est ma ligne de mode pour du 1024x768
  entrelac&eacute; : mon Multisync 3D supporte jusqu'&agrave; 90 Hz vertical et 38 kHz
  horizontal.</p><pre class="screen">
ModeLine "1024x768" 45 1024 1048 1208 1248 768 768 776 807 Interlace
</pre><p>Les deux limites sont pour ainsi dire atteintes avec ce mode. Mais si
  vous sp&eacute;cifiez le m&ecirc;me mode, en omettant simplement le drapeau
  "Interlace", vous vous situez toujours &agrave; la limite de la capacit&eacute;
  horizontale du moniteur (et, &agrave; strictement parler, un poil en dessous
  de la limite inf&eacute;rieure de la fr&eacute;quence de balayage verticale), tandis
  que vous souffrirez d'un insupportable effet de clignotement de
  l'image.</p><p>Quelques r&egrave;gles de base : si vous avez mis au point un mode qui
  n'exploite que la moiti&eacute; de la capacit&eacute; verticale de votre moniteur,
  changez le nombre total de lignes en une valeur impaire et ajoutez le
  drapeau "Interlace". La qualit&eacute; de l'image devrait s'en trouver
  grandement am&eacute;lior&eacute;e dans la majorit&eacute; des cas.</p><p>Si vous utilisez un mode non-entrelac&eacute; qui par ailleurs d&eacute;passe les
  sp&eacute;cifications de votre moniteur tandis que la fr&eacute;quence de balayage
  verticale se situe &agrave; 30% ou plus en dessous du maximum support&eacute; par
  votre &eacute;cran, mettre au point manuellement un mode entrelac&eacute; (qui
  offrira sans doute une r&eacute;solution l&eacute;g&egrave;rement sup&eacute;rieure) peut fournir
  de meilleurs r&eacute;sultats, mais je ne peux rien promettre.</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="answe"></a>15.&nbsp;Questions et r&eacute;ponses</h2></div></div></div><div class="qandaset"><dl><dt>Q&nbsp;: <a href="#N10324">L'exemple pr&eacute;sent&eacute; plus haut met en sc&egrave;ne une taille d'&eacute;cran non
  standard. Puis-je l'utiliser ?</a></dt><dt>Q&nbsp;: <a href="#N1032B">Est-ce l&agrave; la seule r&eacute;solution utilisable compte tenu d'une
  fr&eacute;quence pilote de 65 MHz et d'un HSF de 55 kHz ?
</a></dt><dt>Q&nbsp;: <a href="#N10337">Vous n'avez fait mention que de deux r&eacute;solutions standard. Dans le
  fichier Xconfig, de nombreuses r&eacute;solutions standard sont disponibles.
  Pouvez-vous me dire s'il y a une raison pour moi de chipoter avec les
  valeurs de synchronisation ?</a></dt><dt>Q&nbsp;: <a href="#N1033E">Pourriez-vous r&eacute;sumer ce qui a &eacute;t&eacute; expos&eacute; jusqu'ici ?</a></dt></dl><table summary="Q and A Set" border="0"><col align="left" width="1%"><tbody><tr class="question"><td valign="top" align="left"><a name="N10324"></a><a name="N10325"></a><b>Q&nbsp;:</b></td><td valign="top" align="left"><p>L'exemple pr&eacute;sent&eacute; plus haut met en sc&egrave;ne une taille d'&eacute;cran non
  standard. Puis-je l'utiliser ?</p></td></tr><tr class="answer"><td valign="top" align="left"><b>R&nbsp;:</b></td><td valign="top" align="left"><p>Pourquoi pas ?  Il n'y a absolument AUCUNE raison qui vous force &agrave;
  vous cantonner aux tailles habituelles 640x480, 800x600, ou m&ecirc;me
  1024x768.  Les serveurs XFree86 vous offrent &eacute;norm&eacute;ment de libert&eacute;
  lors de la configuration de votre mat&eacute;riel.  Il faut g&eacute;n&eacute;ralement deux
  ou trois essais pour obtenir la bonne.  L'objectif &agrave; garder en ligne
  de mire est une fr&eacute;quence de rafra&icirc;chissement &eacute;lev&eacute;e tout en
  conservant une zone affichable de taille raisonnable. Ne visez pas une
  r&eacute;solution &eacute;lev&eacute;e si c'est au prix d'un clignotement qui vous ruinera
  les yeux !</p></td></tr><tr class="question"><td valign="top" align="left"><a name="N1032B"></a><a name="N1032C"></a><b>Q&nbsp;:</b></td><td valign="top" align="left"><p>Est-ce l&agrave; la seule r&eacute;solution utilisable compte tenu d'une
  fr&eacute;quence pilote de 65 MHz et d'un HSF de 55 kHz ?
</p></td></tr><tr class="answer"><td valign="top" align="left"><b>R&nbsp;:</b></td><td valign="top" align="left"><p>Pas du tout !  Nous vous exhortons au contraire &agrave; suivre la
  proc&eacute;dure g&eacute;n&eacute;rale d&eacute;crite plus haut et &agrave; vous livrer &agrave; quelques
  exp&eacute;riences afin d'obtenir une configuration qui vous plaise
  r&eacute;ellement.  Vous livrer &agrave; ces exp&eacute;riences peut vous apporter
  &eacute;norm&eacute;ment de plaisir.  La plupart des configurations risquent de ne
  produire qu'une horrible neige, mais en pratique un &eacute;cran moderne
  multi-fr&eacute;quences n'est pas si facile &agrave; endommager.  Soyez s&ucirc;r,
  cependant, que votre moniteur peut supporter la fr&eacute;quence de trame que
  vous voulez lui infliger avant de l'utiliser pour un temps
  consid&eacute;rable.</p><p>Mais m&eacute;fiez-vous des moniteurs &agrave; fr&eacute;quence fixe !  Ce type de
  manipulations hasardeuses peut les endommager tr&egrave;s rapidement. Soyez
  s&ucirc;r que vous utilisez une fr&eacute;quence de rafra&icirc;chissement support&eacute;e lors
  de <span class="emphasis"><em>chaque</em></span> tentative.</p></td></tr><tr class="question"><td valign="top" align="left"><a name="N10337"></a><a name="N10338"></a><b>Q&nbsp;:</b></td><td valign="top" align="left"><p>Vous n'avez fait mention que de deux r&eacute;solutions standard. Dans le
  fichier Xconfig, de nombreuses r&eacute;solutions standard sont disponibles.
  Pouvez-vous me dire s'il y a une raison pour moi de chipoter avec les
  valeurs de synchronisation ?</p></td></tr><tr class="answer"><td valign="top" align="left"><b>R&nbsp;:</b></td><td valign="top" align="left"><p>Tout &agrave; fait !  Prenez par exemple le "standard" 640x480 mentionn&eacute;
  dans le fichier Xconfig actuel.  Il exploite une fr&eacute;quence pilote de
  25 Mhz, les longueurs de trame sont de 800 et 525 ce qui nous donne
  une fr&eacute;quence de rafra&icirc;chissement d'environ 59.5 Hz. Pas trop mal.
  Mais 28 MHz est une fr&eacute;quence pilote g&eacute;n&eacute;ralement disponible sur
  nombre de cartes SVGA.  Si vous utilisiez celle-ci pour g&eacute;n&eacute;rer du
  640x480, suivant la proc&eacute;dure illustr&eacute;e plus haut, vous obtiendriez
  des longueurs de trame de 812 (arrondi &agrave; 808) et 505.  La fr&eacute;quence de
  rafra&icirc;chissement est maintenant port&eacute;e &agrave; 68 Hz, ce qui repr&eacute;sente une
  am&eacute;lioration significative par rapport &agrave; la configuration standard.</p></td></tr><tr class="question"><td valign="top" align="left"><a name="N1033E"></a><a name="N1033F"></a><b>Q&nbsp;:</b></td><td valign="top" align="left"><p>Pourriez-vous r&eacute;sumer ce qui a &eacute;t&eacute; expos&eacute; jusqu'ici ?</p></td></tr><tr class="answer"><td valign="top" align="left"><b>R&nbsp;:</b></td><td valign="top" align="left"><p>En bref :</p><div class="itemizedlist"><ul type="disc"><li><p>
     pour toute fr&eacute;quence pilote donn&eacute;e, une augmentation de la
     r&eacute;solution maximum se paye par une diminution de la fr&eacute;quence de
     rafra&icirc;chissement, ce qui induira un effet de clignotement accru.
</p></li><li><p>
     si l'obtention d'une r&eacute;solution &eacute;lev&eacute;e s'av&egrave;re n&eacute;cessaire et si
     votre moniteur la supporte, essayez de vous procurer une carte SVGA
     qui fournisse une fr&eacute;quence pilote (ou DCF) compatible. Plus elle
     est &eacute;lev&eacute;e, meilleur sera le r&eacute;sultat !
</p></li></ul></div></td></tr></tbody></table></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N1034C"></a>16.&nbsp;R&eacute;soudre les probl&egrave;mes affectant l'image</h2></div></div></div><p>OK, ainsi donc vous disposez maintenant des valeurs n&eacute;cessaires &agrave; la
  configuration de X.  Vous les avez plac&eacute;es dans votre fichier Xconfig,
  en choisissant pour le mode un champ "nom" qui l'identifie comme un
  test.  Vous d&eacute;marrez X, vous utilisez les raccourcis clavier pour
  sauter au nouveau mode, ... et l'image ne semble pas correcte.  Que
  faire ?  Ci-dessous se trouve une liste de distorsions d'image vid&eacute;o 
  <a name="N10352" class="indexterm"></a>
  fr&eacute;quentes et la fa&ccedil;on d'y rem&eacute;dier.</p><p>(La r&eacute;paration de ces distorsions mineures est r&eacute;ellement la
  situation o&ugrave;<span><strong class="command">xvidtune</strong></span>(1) se distinguera brillamment.)
</p><p>Vous <span class="emphasis"><em>d&eacute;placerez</em></span> l'image en modifiant les
  coordonn&eacute;es temporelles de l'impulsion de synchronisation.  
  Vous <span class="emphasis"><em>agirez sur sa taille</em></span> en jouant
  sur la longueur de trame (n'oubliez pas de d&eacute;placer l'impulsion de
  synchronisation en cons&eacute;quence, de fa&ccedil;on &agrave; la maintenir &agrave; la m&ecirc;me
  position relative, sinon alt&eacute;rer la taille de l'image d&eacute;placera aussi
  celle-ci).  Voici quelques recettes plus sp&eacute;cifiques :</p><p>Les positions horizontale et verticale sont ind&eacute;pendantes.  Par cela,
  nous entendons que d&eacute;placer l'image horizontalement n'affecte pas sa
  position verticale, et r&eacute;ciproquement.  Cependant, il n'en va pas tout
  &agrave; fait de m&ecirc;me pour la taille.  Alors que le fait de modifier la
  taille horizontale n'affecte en rien la dimension verticale et vice
  versa, la quantit&eacute; globale de changement qui peut &ecirc;tre apport&eacute; dans
  les deux directions peut &ecirc;tre limit&eacute;.  En particulier, si votre image
  est trop large dans les deux sens il vous faudra probablement adopter
  une fr&eacute;quence pilote plus &eacute;lev&eacute;e pour la faire r&eacute;tr&eacute;cir.  Dans la
  mesure o&ugrave; cela se traduira par une augmentation de la r&eacute;solution
  utilisable, c'est rarement un probl&egrave;me !</p><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10367"></a>16.1.&nbsp;L'image est d&eacute;centr&eacute;e vers la gauche ou la droite</h3></div></div></div><p>Pour y rem&eacute;dier, d&eacute;placez l'impulsion de synchronisation horizontale.
  C'est-&agrave;-dire, incr&eacute;mentez ou d&eacute;cr&eacute;mentez (par un multiple de 8) les
  deux valeurs m&eacute;dianes de la section des donn&eacute;es horizontales qui
  d&eacute;terminent les limites ant&eacute;rieure et post&eacute;rieure de l'impulsion de
  synchronisation horizontale.</p><p>Si l'image est d&eacute;centr&eacute;e vers la gauche (la marge droite &eacute;tant trop
  large, vous souhaitez faire glisser l'image vers la droite)
  d&eacute;cr&eacute;mentez les valeurs.  Si l'image est d&eacute;centr&eacute;e vers la droite
  (marge gauche trop large, vous voulez faire glisser l'image vers la
  gauche) incr&eacute;mentez les coordonn&eacute;es de l'impulsion de synchronisation.</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N1036E"></a>16.2.&nbsp;L'image est d&eacute;centr&eacute;e vers le haut ou le bas</h3></div></div></div><p>Pour r&eacute;soudre ce probl&egrave;me, d&eacute;placez l'impulsion de synchronisation
  verticale.  A savoir, incr&eacute;mentez ou d&eacute;cr&eacute;mentez les deux valeurs
  m&eacute;dianes de la section des donn&eacute;es verticales qui d&eacute;terminent les
  limites ant&eacute;rieure et post&eacute;rieure de l'impulsion de synchronisation
  verticale.</p><p>Si l'image est d&eacute;centr&eacute;e vers le haut (marge inf&eacute;rieure trop large,
  vous souhaitez faire glisser l'image vers le bas) d&eacute;cr&eacute;mentez les
  valeurs.  Si l'image est d&eacute;centr&eacute;e vers le bas (marge sup&eacute;rieure trop
  large, vous souhaitez faire glisser l'image vers le haut) incr&eacute;mentez
  les valeurs.</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N10375"></a>16.3.&nbsp;L'image est trop large dans les deux directions</h3></div></div></div><p>Passez &agrave; une fr&eacute;quence d'horloge sup&eacute;rieure sur la carte. Si vous
  disposez de nombreux modes diff&eacute;rents dans votre fichier de
  configuration, il est possible que l'un de ceux qui exploitent une
  fr&eacute;quence inf&eacute;rieure ait &eacute;t&eacute; activ&eacute; par erreur.</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N1037A"></a>16.4.&nbsp;L'image est trop large (ou trop &eacute;troite) horizontalement</h3></div></div></div><p>Pour rem&eacute;dier &agrave; cela, augmentez (ou diminuez) la longueur de trame
  horizontale.  C'est-&agrave;-dire, modifiez la quatri&egrave;me valeur de la
  premi&egrave;re section des coordonn&eacute;es temporelles.  Pour &eacute;viter de d&eacute;placer
  l'image par la m&ecirc;me occasion, d&eacute;placez aussi l'impulsion de
  synchronisation (deuxi&egrave;me et troisi&egrave;me valeurs) de la moiti&eacute; de la
  diff&eacute;rence, de fa&ccedil;on &agrave; la conserver &agrave; la m&ecirc;me position relative.</p></div><div class="sect2" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="N1037F"></a>16.5.&nbsp;L'image est trop grande (ou trop petite) verticalement</h3></div></div></div><p>Pour r&eacute;soudre ce probl&egrave;me, augmentez (ou diminuez) la longueur de
  trame verticale.  C'est-&agrave;-dire, modifiez la quatri&egrave;me valeur dans la
  deuxi&egrave;me section des coordonn&eacute;es temporelles.  Pour &eacute;viter de d&eacute;placer
  l'image, n'oubliez pas de d&eacute;placer aussi l'impulsion de
  synchronisation (deuxi&egrave;me et troisi&egrave;me valeurs) de la moiti&eacute; de la
  diff&eacute;rence, pour la garder &agrave; la m&ecirc;me position relative.</p><p>Toute distorsion qui ne peut &ecirc;tre &eacute;limin&eacute;e en combinant ces techniques
  est probablement la preuve d'un probl&egrave;me plus profond, comme une
  erreur dans les calculs ou une fr&eacute;quence pilote sup&eacute;rieure aux limites
  du moniteur.</p><p>En dernier lieu, souvenez-vous que si vous augmentez l'une des
  longueurs de trame, vous diminuerez du m&ecirc;me coup votre fr&eacute;quence de
  rafra&icirc;chissement, et r&eacute;ciproquement.</p><p>Occasionnellement, vous pouvez corriger les petites distorsions
  d'image en jouant sur les r&eacute;glages de votre moniteur. Le d&eacute;faut de
  cette m&eacute;thode est que si vous vous &eacute;loignez trop des r&eacute;glages d'usine
  pour r&eacute;gler les probl&egrave;mes du mode graphique, vous pouvez vous
  retrouver avec une image inutilisable en mode texte. Il vaut mieux
  r&eacute;gler vos lignes de modes.</p></div></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="cplot"></a>17.&nbsp;Repr&eacute;sentation graphique des capacit&eacute;s du moniteur</h2></div></div></div><p>Pour tracer le diagramme de mode d'un moniteur, il vous faudra le
  programme gnuplot (un logiciel libre de trac&eacute; graphique) et l'outil 
  <span><strong class="command">modeplot</strong></span>, un script  shell/gnuplot qui tracera 
  le diagramme sur la base des caract&eacute;ristiques
  de votre moniteur, fournies comme options sur la ligne de commande.</p><p>Voici le listing du script <span><strong class="command">modeplot</strong></span> :</p><pre class="programlisting">
  #!/bin/sh
  #
  # modeplot -- cr&eacute;e un graphe X des modes moniteurs disponibles
  #
  # Invoquez `modeplot -?' pour afficher les options de contr&ocirc;le.
  #

  # Description du moniteur. Bande passante en MHz, fr&eacute;quences horizontales
  # en kHz et fr&eacute;quences verticales en Hz.
  TITLE="Viewsonic 21PS"
  BANDWIDTH=185
  MINHSF=31
  MAXHSF=85
  MINVSF=50
  MAXVSF=160
  ASPECT="4/3"
  vesa=72.5       # fr&eacute;q. de rafra&icirc;chissement min. recommand&eacute;e VESA

  while [ "$1" != "" ]
  do
          case $1 in
          -t) TITLE="$2"; shift;;
          -b) BANDWIDTH="$2"; shift;;
          -h) MINHSF="$2" MAXHSF="$3"; shift; shift;;
          -v) MINVSF="$2" MAXVSF="$3"; shift; shift;;
          -a) ASPECT="$2"; shift;;
          -g) GNUOPTS="$2"; shift;;
          -?) cat &lt;&lt;EOF
  options de contr&ocirc;le de modeplot :

  -t "&lt;description&gt;"  nom du moniteur            d&eacute;faut : "Viewsonic 21PS"
  -b &lt;nn&gt;                 bande passante en MHz      d&eacute;faut : 185
  -h &lt;min&gt; &lt;max&gt;          HSF min &amp; max (kHz)        d&eacute;faut : 31 85
  -v &lt;min&gt; &lt;max&gt;          VSF min &amp; max (Hz)         d&eacute;faut : 50 160
  -a &lt;aspect ratio&gt;       proportions de l'image     d&eacute;faut : 4/3
  -g "&lt;options&gt;"      options &agrave; transmettre &agrave; gnuplot

  La pr&eacute;sence des param&egrave;tres -b, -h et -v est requise, -a, -t, -g sont
  optionnels.  Vous pouvez utiliser -g pour transmettre un nom de
  p&eacute;riph&eacute;rique &agrave; gnuplot de fa&ccedil;on &agrave; ce que (par exemple) les sorties
  produites par modeplot puissent &ecirc;tre redirig&eacute;es vers une imprimante.
  Voyez gnuplot(1) pour de plus amples d&eacute;tails.

  L'outil modeplot a &eacute;t&eacute; con&ccedil;u par Eric S. Raymond &lt;esr@thyrsus.com&gt; sur
  base d'une analyse et d'un code original par Martin Lottermoser
  &lt;Martin.Lottermoser@mch.sni.de&gt;

  Voici modeplot $Revision: 1.20 $
  EOF
                  exit;;
          esac
          shift
  done

  gnuplot $GNUOPTS &lt;&lt;EOF
  set title "$TITLE Mode Plot"

  # Nombres magiques.  Malheureusement, le graphe est tr&egrave;s sensible &agrave; toute
  # modification de ceux-ci, et ils pourraient &ecirc;tre loin de la v&eacute;rit&eacute; dans
  # le cas de certains moniteurs.  Il nous faut d&eacute;terminer des valeurs afin
  # d'obtenir m&ecirc;me une approximation du diagramme de mode. Ces valeurs
  # proviennent d'une comparaison de nombreux exemples fournis dans la base
  # de donn&eacute;es ModeDB.
  F1 = 1.30       # facteur de conversion r&eacute;sol. horiz. -&gt; largeur de trame
  F2 = 1.05       # facteur de conversion r&eacute;sol. vertic. -&gt; hauteur de trame

  # D&eacute;finition de fonctions
  # (multiplier par 1.0 force l'arithm&eacute;tique en nombres r&eacute;els)
  ac = (1.0*$ASPECT)*F1/F2
  refresh(hsync, dcf) = ac * (hsync**2)/(1.0*dcf)
  dotclock(hsync, rr) = ac * (hsync**2)/(1.0*rr)
  resolution(hv, dcf) = dcf * (10**6)/(hv * F1 * F2)

  # Place les l&eacute;gendes le long des axes
  set xlabel 'DCF (MHz)'
  set ylabel 'RR (Hz)' 6  # Place la l&eacute;gende juste au-dessus de l'axe des Y

  # G&eacute;n&egrave;re le diagramme
  set grid
  set label "VB" at $BANDWIDTH+1, ($MAXVSF + $MINVSF) / 2 left
  set arrow from $BANDWIDTH, $MINVSF to $BANDWIDTH, $MAXVSF nohead
  set label "max VSF" at 1, $MAXVSF-1.5
  set arrow from 0, $MAXVSF to $BANDWIDTH, $MAXVSF nohead
  set label "min VSF" at 1, $MINVSF-1.5
  set arrow from 0, $MINVSF to $BANDWIDTH, $MINVSF nohead
  set label "min HSF" at dotclock($MINHSF, $MAXVSF+17), $MAXVSF + 17 right
  set label "max HSF" at dotclock($MAXHSF, $MAXVSF+17), $MAXVSF + 17 right
  set label "VESA $vesa" at 1, $vesa-1.5
  set arrow from 0, $vesa to $BANDWIDTH, $vesa nohead # style -1
  plot [dcf=0:1.1*$BANDWIDTH] [$MINVSF-10:$MAXVSF+20] \
    refresh($MINHSF, dcf) notitle with lines 1, \
    refresh($MAXHSF, dcf) notitle with lines 1, \
    resolution(640*480,   dcf) title "640x480  " with points 2, \
    resolution(800*600,   dcf) title "800x600  " with points 3, \
    resolution(1024*768,  dcf) title "1024x768 " with points 4, \
    resolution(1280*1024, dcf) title "1280x1024" with points 5, \
    resolution(1600*1280, dcf) title "1600x1200" with points 6

  pause 9999
  EOF
</pre><p>Une fois que vous &ecirc;tes s&ucirc;r d'avoir correctement install&eacute; 
  <span><strong class="command">modeplot</strong></span> et
  le programme gnuplot, il vous faudra r&eacute;unir les caract&eacute;ristiques
  suivantes de votre moniteur :</p><div class="itemizedlist"><ul type="disc"><li><p>bande passante vid&eacute;o (VB)</p></li><li><p>gamme de fr&eacute;quences de synchronisation horizontale (HSF)</p></li><li><p>gamme de fr&eacute;quences de synchronisation verticale (VSF)</p></li></ul></div><p>Le programme de trac&eacute; doit faire quelques suppositions
  simplificatrices qui ne sont pas n&eacute;cessairement correctes.  C'est la
  raison pour laquelle le diagramme r&eacute;sultant n'est qu'une description
  relativement grossi&egrave;re. Ces suppositions sont les suivantes :</p><div class="itemizedlist"><ul type="disc"><li><p>Toutes les r&eacute;solutions n'ont qu'un seul rapport de proportions
     pr&eacute;d&eacute;fini AR = HR/VR.  Les r&eacute;solutions standard ont AR = 4/3 ou AR
     = 5/4.  Le programme modeplot suppose 4/3 par d&eacute;faut, Mais il vous
     est possible de modifier cela.</p></li><li><p>Pour les modes pris en compte, les longueurs de trames 
     horizontale et verticale sont des multiples fix&eacute;s des r&eacute;solutions
     horizontale et verticale, respectivement :</p><pre class="screen">
	HFL = F1 * HR
	VFL = F2 * VR
</pre></li></ul></div><p>En premi&egrave;re approximation, prenez F1 = 1.30 et F2 = 1.05 
  (voyez la section <a href="#frame">Calcul de la taille de
  trame</a>).</p><p>Maintenant consid&eacute;rez une fr&eacute;quence de synchronisation particuli&egrave;re,
  HSF.  Sur base des pr&eacute;suppos&eacute;s que nous venons de mentionner, la
  valeur que prendra la fr&eacute;quence pilote DCF d&eacute;terminera d&eacute;j&agrave; la
  fr&eacute;quence de rafra&icirc;chissement RR, c'est-&agrave;-dire que pour toute valeur
  de HSF il y a une fonction RR(DCF).  Celle-ci peut s'obtenir comme
  suit.</p><p>La fr&eacute;quence de rafra&icirc;chissement est &eacute;gale &agrave; la fr&eacute;quence pilote
  divis&eacute;e par le produit des longueurs de trame :</p><pre class="screen">
	RR = DCF / (HFL * VFL)		(*)
</pre><p>D'autre part, la longueur de trame horizontale est &eacute;gale &agrave; la
  fr&eacute;quence pilote divis&eacute;e par la fr&eacute;quence de synchronisation
  horizontale :</p><pre class="screen">
	HFL = DCF / HSF			(**)
</pre><p>Il est possible de r&eacute;duire VFL &agrave; HFL au moyen des deux suppositions
  mentionn&eacute;es plus haut :</p><pre class="screen">
	VFL = F2 * VR
	    = F2 * (HR / AR)
	    = (F2/F1) * HFL / AR	(***)
</pre><p>En ins&eacute;rant (**) et (***) dans (*) nous obtenons :</p><pre class="screen">
	RR = DCF / ((F2/F1) * HFL**2 / AR)
	   = (F1/F2) * AR * DCF * (HSF/DCF)**2
	   = (F1/F2) * AR * HSF**2 / DCF
</pre><p>Pour des valeurs fixes de HSF, F1, F2 et AR, cette formule se traduit
  par une hyperbole dans notre diagramme.  Si nous tra&ccedil;ons deux courbes
  de ce type pour les fr&eacute;quences de synchronisation horizontale minimum
  et maximum nous obtenons les deux limites restantes de la r&eacute;gion des
  solutions permises.</p><p>Les lignes droites qui traversent la r&eacute;gion des capacit&eacute;s repr&eacute;sentent
  des r&eacute;solutions particuli&egrave;res. Ceci est bas&eacute; sur (*) et la deuxi&egrave;me
  supposition :</p><pre class="screen">
	RR = DCF / (HFL * VFL) = DCF / (F1 * HR * F2 * VR)
</pre><p>En tra&ccedil;ant de telles droites pour chacune des r&eacute;solutions qui vous
  int&eacute;ressent, vous pourrez imm&eacute;diatement extraire du graphe les
  relations possibles entre r&eacute;solution, fr&eacute;quence pilote et fr&eacute;quence de
  rafra&icirc;chissement dont le moniteur est capable. Remarquez que ces
  lignes ne d&eacute;pendent pas des caract&eacute;ristiques r&eacute;elles du moniteur, mais
  bien de notre seconde supposition.</p><p>L'outil <span><strong class="command">modeplot</strong></span> vous offre une mani&egrave;re tr&egrave;s simple de faire cela.
 Tapez <span><strong class="command">modeplot -?</strong></span> pour afficher ses options de contr&ocirc;le.
 Une invocation usuelle ressemble &agrave; ceci :</p><pre class="screen">
	modeplot -t "Swan SW617" -b 85 -v 50 90 -h 31 58
</pre><p>Le param&egrave;tre -b sp&eacute;cifie la bande passante vid&eacute;o ; -v et -h
  d&eacute;finissent les gammes de fr&eacute;quences de synchronisation horizontale et
  verticale.</p><p>Lorsque vous consulterez le graphique produit par 
  <span><strong class="command">modeplot</strong></span>, conservez
  toujours pr&eacute;sent &agrave; l'esprit le fait qu'il n'offre qu'une description
  approximative. Par exemple, il ignore les limitations impos&eacute;es &agrave; HFL
  dues &agrave; ce qu'une largeur d'impulsion de synchronisation minimum est
  requise, et sa pr&eacute;cision ne peut d&eacute;passer celle de nos suppositions.
  Il ne peut d&egrave;s lors remplacer un calcul d&eacute;taill&eacute; (incluant une
  certaine dose de magie noire) tel celui que nous avons pr&eacute;sent&eacute; dans
  la section <a href="#synth" title="12.&nbsp;Synth&egrave;se">Synth&egrave;se</a>. 
  Il devrait, cependant, vous offrir une  meilleure perception de ce
  qui est possible et des concessions que  cela implique.
</p></div><div class="sect1" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="credi"></a>18.&nbsp;Cr&eacute;dits</h2></div></div></div><p>L'anc&ecirc;tre primordial de ce document est d&ucirc; &agrave; Chin Fang
<code class="email">&lt;<a href="mailto:fangchin@leland.stanford.edu">fangchin@leland.stanford.edu</a>&gt;</code>.</p><p>Eric S. Raymond <code class="email">&lt;<a href="mailto:esr@snark.thyrsus.com">esr@snark.thyrsus.com</a>&gt;</code> a retravaill&eacute;,
  r&eacute;organis&eacute;, et largement r&eacute;-&eacute;crit l'original de Chin Fang dans le but
  de le comprendre.  Au cours de cette op&eacute;ration, il y a inclus la plus
  grande part d'un autre Howto &eacute;crit par Bob Crosson
  <code class="email">&lt;<a href="mailto:crosson@cam.nist.gov">crosson@cam.nist.gov</a>&gt;</code>.</p><p>Les informations consacr&eacute;es aux modes entrelac&eacute;s sont en grande partie
  dues &agrave; David Kastrup <code class="email">&lt;<a href="mailto:dak@pool.informatik.rwth-aachen.de">dak@pool.informatik.rwth-aachen.de</a>&gt;</code></p><p>Nicholas Bodley <code class="email">&lt;<a href="mailto:nbodley@alumni.princeton.edu">nbodley@alumni.princeton.edu</a>&gt;</code> a corrig&eacute; et
  clarifi&eacute; la section sur le fonctionnement des &eacute;crans.</p><p>Payne Freret <code class="email">&lt;<a href="mailto:payne@freret.org">payne@freret.org</a>&gt;</code> a corrig&eacute; quelques erreurs
  mineures sur la conception des moniteurs.</p><p>Martin Lottermoser <code class="email">&lt;<a href="mailto:Martin.Lottermoser@mch.sni.de">Martin.Lottermoser@mch.sni.de</a>&gt;</code> a soumis
  l'id&eacute;e d'utiliser gnuplot pour g&eacute;n&eacute;rer des diagrammes de mode et a
  r&eacute;alis&eacute; l'analyse math&eacute;matique qui sous-tend <span><strong class="command">modeplot</strong></span>. 
  La version de modeplot telle qu'elle est actuellement distribu&eacute;e a &eacute;t&eacute; 
  repens&eacute;e et g&eacute;n&eacute;ralis&eacute;e par ESR &agrave; partir du code gnuplot original de
  Martin pour un cas pr&eacute;cis.
</p></div></div></body></html>