<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>German Howto: Fun f&uuml;r Dich: Denglish</TITLE>
 <LINK HREF="German-HOWTO-2.html" REL=previous>
 <LINK HREF="German-HOWTO.html#toc3" REL=contents>
</HEAD>
<BODY>
Next
<A HREF="German-HOWTO-2.html">Previous</A>
<A HREF="German-HOWTO.html#toc3">Contents</A>
<HR>
<H2><A NAME="s3">3. Fun f&uuml;r Dich: Denglish</A></H2>

<P>Das erste Kapitel in Deutsch, das zweite in Englisch. Was liegt n&auml;her, als
im Dritten beide Sprachen zu mischen? Zur genaueren Er&ouml;rterung dieser Frage
m&ouml;chte ich an dieser Stelle ein Beispiel aus der Welt der
Programmiersprachen geben. Programmiersprachen haben den Vorteil, dass sie
einen einfachen Grund-Wortschatz aufweisen und nicht gesprochen werden,
d.h. reine Schriftsprachen sind. Vorranging um Schriftsprache geht es ja
bei der einleitenden Frage.
<P>
<BLOCKQUOTE><CODE>
<PRE>
# Perl und Bourne gemischt:
system("rm wochenplan.pdf");

# natives Perl
unlink("wochenplan.pdf");
</PRE>
</CODE></BLOCKQUOTE>
<P>Auch Programmiersprachen lassen sich mischen, wie im Beispiel gezeigt wird.
Die Perl-Funktion system ruft den Bourne-Interpreter auf, der seinerseits
das externe Programm rm zur Entfernung der Datei gesch&auml;ftsbericht.txt
aufruft. Eine Recht komplizierte Vorgehensweise, welche aber oft in
Computer-Programmen von Anf&auml;ngern zu finden ist, denen noch die Erfahrung
im Umgang mit der Sprache fehlt. Das fehlende Wissen &uuml;ber die Funktion unlink
wird kompensiert durch die Kombination der Universal-Funktion system mit
dem Wissen &uuml;ber das externe Werkzeug rm zur Entfernung von Dateien. Auf
diese Weise ist das Programm in k&uuml;rzester Zeit lauff&auml;hig.
<P>Jeder erfahrene Perl-Programmierer wird bei der oben gezeigten Mischung der Sprachen einen Schrei des Entsetzens ausstossen, weil er um die
damit verbundenen Gefahren weiss. Die Bedenken sind technischer Art, zum
Beispiel k&ouml;nnten sich rm oder der Bourne-Interpreter sp&auml;ter anders
verhalten, schliesslich sind beide nicht Teil von Perl als Sprache.  Als
Folge k&ouml;nnte die Datei nicht oder eine andere Datei gel&ouml;scht werden.  Und
weil das in der Praxis tats&auml;chlich vorkommt, wird immer wieder geraten, die
M&ouml;glichkeiten einer Programmiersprache auszusch&ouml;pfen, bevor man andere
Sprachen hinzumischt.
<P>Leider ist es in den letzten Jahren &uuml;blich geworden, viel Englisch in die
Deutsche Sprache zu mischen, obwohl dazu keine Notwendigkeit besteht. Aber
bevor ich auf die m&ouml;glichen Ursachen eingehe, ist es noch notwendig, den
Bezug zu den Programmiersprachen herzustellen. Die deutsche Schriftsprache
ist sicherlich sehr viel komplexer als Perl. Trotzdem ist der Zweck in
beiden F&auml;llen gleich: Informationen zu &uuml;bermitteln, ohne dass deren Urheber
zugegen w&auml;re. Bei einem Buch werden in Abwesenheit des Autors Informationen
an den Leser &uuml;bermittelt, bei einem Programmtext an den Prozessor des
Rechners.  Genau das ist der Unterschied zur gesprochenen Sprache, bei der
immerhin eine unterst&uuml;tzende Betonung gegeben werden kann, wenn nicht sogar
der Autor pers&ouml;nlich zugegen ist und auf diese Weise Gesten oder R&uuml;ckfragen
m&ouml;glich sind. In diesem Sinne geh&ouml;rt auch eine eingetippte Plauderei
(engl. chat) im IRC, den virtuellen R&auml;umen oder im Heise Newsticker trotz
der Verwendung von Buchstaben eher zur gesprochenen Sprache.
<P>Man kann also festhalten, dass es f&uuml;r die Informations&uuml;bermittlung
Medien mit verschiedenen Bandbreiten gibt. Papier ist sozusagen das alte Modem,
getippte Plaudereien sind schon DSL und die Anwesenheit vor Ort ist
100base-T Ethernet. Der R&uuml;ckschluss "Im Chat haben mich immer alle
verstanden, daher brauche ich zum Schreiben eines Buch keine
Grammatik-Kenntnisse" f&uuml;hrt daher nicht zum Erfolg: Was bleibt von einem 
Video &uuml;brig, das von DSL-Qualit&auml;t auf Modem-Bandbreite herunterproduziert
wird? Ich will an dieser Stelle nicht den vielzitierten Untergang des
Abendlandes heraufbeschw&ouml;ren, aber die Notwendigkeit und die Vorteile von
Schriftsprache f&uuml;r unsere Kultur sollte man schon verst&auml;ndlich
vermitteln. Eine immer komplexer werdende Welt erfasst man besser mit
einer guten Schriftsprache.
<P>Drei Ursachen f&uuml;r die Verenglischung der Deutschen Sprache stellen sich mir
dar:
<UL>
<LI> K&uuml;nstliche Aufwertung von gew&ouml;hnlichen Produkten durch Verwendung
der englischen Bezeichnungen. Beispiele: LCD-Display statt LCD-Anzeige,
Music Awards statt Musikpreise, Server-Cluster statt Server-Gruppe oder
Open-Air-Konzert statt Freiluftkonzert.
</LI>
<LI> Die Bequemlichkeit, die Kenntnisse aus Sprachen
unreflektiert in andere zu &uuml;bernehmen. (Siehe oben.)
</LI>
<LI> Fehlender Mut zu mehr Selbstbewusstsein. Das steigert sich dann bis
hin zur Mystifizierung, man k&ouml;nne to mount nicht mit montieren &uuml;bersetzen,
weil noch andere (unerforschte?) Bedeutungen in "mount" stecken w&uuml;rden.
</LI>
</UL>
<P>Nat&uuml;rlich gibt es auch den umgekehrten Fall, n&auml;mlich dass
deutsche Worte hin und wieder in der englischen Sprache verwendet
werden. Beispiele: Kindergarden, Autobahn oder heimlich. Aber dieser Anteil
ist ohne Bedeutung und bleibt tats&auml;chlich im Rahmen einer Bereicherung der
Sprache, nicht der einer Verdr&auml;ngung.
<P>Die derzeitige Verenglischung des Deutschen halte ich aus den skizzierten
Gr&uuml;nden f&uuml;r bedenklich, aber nicht f&uuml;r unausweichlich. Einzelne
gewaltsam &uuml;bersetzte IBM-Handb&uuml;cher vergangener Tage sind zumindest f&uuml;r mich
kein Argument, nicht nach besseren L&ouml;sungen zu suchen. 
<P>
<P>
<HR>
Next
<A HREF="German-HOWTO-2.html">Previous</A>
<A HREF="German-HOWTO.html#toc3">Contents</A>
</BODY>
</HTML>
