<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux Portuguese-HOWTO: Ficheiros necess&aacute;rios</TITLE>
 <LINK HREF="Portuguese-HOWTO-8.html" REL=next>
 <LINK HREF="Portuguese-HOWTO-6.html" REL=previous>
 <LINK HREF="Portuguese-HOWTO.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="Portuguese-HOWTO-8.html">Next</A>
<A HREF="Portuguese-HOWTO-6.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc7">Contents</A>
<HR>
<H2><A NAME="SEC:FICHEIROS"></A> <A NAME="s7">7. Ficheiros necess&aacute;rios</A></H2>

<P><B>Aten&ccedil;&atilde;o!</B> Os mapas de teclado para o X fornecidos mapeiam a fun&ccedil;&atilde;o das
teclas segundo a lista a seguir:
<UL>
<LI>Alt esquerdo: Alt</LI>
<LI>Alt direito: AltGr</LI>
<LI>Control esquerdo: Control</LI>
<LI>Control direito: Control</LI>
<LI>ScrollLock: ScrollLock</LI>
<LI>Janela esquerda: Meta</LI>
<LI>Janela direita: Compose</LI>
<LI>Menu: Menu</LI>
</UL>
<P>Se o seu teclado n&atilde;o possuir as teclas <EM>para Windows 95</EM> ent&atilde;o pode ser
melhor restabelecer a distribui&ccedil;&atilde;o padr&atilde;o: edite o mapa e coloque um ponto de
exclama&ccedil;&atilde;o no in&iacute;cio das linhas que definem os <EM>keycodes</EM> 64, 113, 115, 116
e 117.
<P>Foram elaborados mapas com suporte &agrave; acentua&ccedil;&atilde;o para seis modelos de teclado,
tanto para uso no console quanto para o X. Eles podem ser obtidos via WWW em
um dos reposit&oacute;rios da p&aacute;gina do Portuguese HOWTO:
<P>
<UL>
<LI>
<A HREF="http://linusp.usp.br/~casantos/">http://linusp.usp.br/~casantos/</A></LI>
</UL>
<P>Ao instalar um dos mapas fornecidos, lembre-se de ler os coment&aacute;rios
contidos neles, pois h&aacute; informa&ccedil;&otilde;es importantes sobre op&ccedil;&otilde;es de configura&ccedil;&atilde;o
e aproveitamento das teclas adicionais dos teclados padr&atilde;o <EM>Windows&nbsp;95</EM>.
As instru&ccedil;&otilde;es para instala&ccedil;&atilde;o est&atilde;o nas se&ccedil;&otilde;es 
<A HREF="Portuguese-HOWTO-3.html#CONF-CONS">Configura&ccedil;&atilde;o do console</A> e 
<A HREF="Portuguese-HOWTO-5.html#CONF-X">Configura&ccedil;&atilde;o do X</A>.
<P>
<DL>
<P>
<DT><B>O mapa US+ (us+.map e Xmodmap.us+)</B><DD><P>Mapas para os teclados que seguem o padr&atilde;o americano. Como n&atilde;o existem teclas
especiais para gerar o c-cedilhado nem o trema, foi usado um pequeno truque: o
c-cedilhado &eacute; gerado pela seq&uuml;&ecirc;ncia <CODE>'C</CODE>.  No console pode-se faz&ecirc;-lo com
a seq&uuml;&ecirc;ncia <CODE>AltGR-C</CODE>.  O trema &eacute; gerado pela tecla <CODE>&quot;</CODE>. Para
gerar as aspas duplas &eacute; necess&aacute;rio digitar a seq&uuml;&ecirc;ncia
<CODE>&quot;&lt;espa&ccedil;o&gt;</CODE> e no console pode-se usar <CODE>&quot;&quot;</CODE>;
opcionalmente pode-se usar <CODE>AltGR-&quot;</CODE>, o que n&atilde;o &eacute; uma solu&ccedil;&atilde;o muito
confort&aacute;vel, mas funciona...
<P>Testados com teclados de v&aacute;rias marcas (e alguns sem marca :-).
<P>
<DT><B>O mapa Portugal (pt.map e Xmodmap.pt)</B><DD><P>Mapas para teclados com desenho portugu&ecirc;s. Esses teclados s&atilde;o os que possuem
uma tecla com os caracteres <B>«</B> e <B>»</B>. N&atilde;o s&atilde;o muito confort&aacute;veis,
porque para gerar o s&iacute;mbolos <B>@ [ ] { }</B> e o trema &eacute;
necess&aacute;rio usar a tecla <B>Alt-GR</B>.
<P>Testado com um teclado da marca Key Tronic.
<P>
<DT><B>O mapa ABNT-2 (abnt-2.map e Xmodmap.abnt2)</B><DD><P>Os computadores vendidos no Brasil fabricados pela IBM, Compaq e Itautec,
entre outros, v&ecirc;m com esses teclados. Eles tamb&eacute;m pode ser adquiridos avulsos
e s&atilde;o fabricados pela UIS e Keytec (n&atilde;o confundir com Key Tronic).  Este
desenho &eacute; o mais confort&aacute;vel de todos, pois tem a mesma distribui&ccedil;&atilde;o dos
acentos encontrada nas m&aacute;quinas de escrever.
<P>Testado com teclados das marcas UIS e IBM.
<P>
<DT><B>Sun Type 4 e Type 5 (Xmodmap.Sun4+ e Xmodmap.Sun5c+)</B><DD><P>Encontrados nas m&aacute;quinas fabricadas pela Sun.  Estes mapas foram testados em
SPARCstations modelos 1, 4, IPC e Classic rodando SunOS 4.1, Solaris 2.5.1 e
Linux 2.0.33 (Red Hat 4.2). Como esses teclados n&atilde;o possuem o c-cedilhado, foi
usado o mesmo truque do mapa US+. Apenas o mapa para o X &eacute; fornecido.
<P>
<DT><B>NCD+ (Xmodmap.NCD+)</B><DD><P>Este mapa &eacute; para o teclado modelo N107 e foi testado em terminais X modelo 16r
fabricados pela Network Computing Devices Inc.&nbsp;(NCD).  Embora a distribui&ccedil;&atilde;o
de teclas seja id&ecirc;ntica &agrave; do Sun <EM>Type 4</EM>, os <EM>keycodes</EM> das teclas
s&atilde;o diferentes. Esses teclados tamb&eacute;m n&atilde;o possuem o c-cedilhado, por isso foi
usado o mesmo truque do mapa US+.  Apenas o mapa para o X &eacute; fornecido.
</DL>
<P>A gera&ccedil;&atilde;o dos caracteres acentuados &eacute; feita de acordo com a tabela a seguir:
<P>
<PRE>
    Para gerar              Digitar
    -------------------------------------------------
    &ccedil;                       'c ou compose-,-c
    &aacute; &eacute; &iacute; &oacute; &uacute;               'a 'e 'i 'o 'u
    &agrave; &egrave; &igrave; &ograve; &ugrave;               `a `e `i `o `u
    &atilde; &otilde;                     ~a ~o
    &acirc; &ecirc; &icirc; &ocirc; &ucirc;               ^a ^e ^i ^o ^u
    &auml; &euml; &iuml; &ouml; &uuml;               "a "e "i "o "u
    " (aspas)               "" ou AltGR-" no mapa US+
    ¨ (trema)               "-espa&ccedil;o
    ' (ap&oacute;strofo)           '' ou AltGR-' no mapa US+
    ` (grave)               `` ou AltGR-` no mapa US+
    ®                       compose-O-R
    ©                       compose-O-C
    -------------------------------------------------
</PRE>
<P>
<HR>
<A HREF="Portuguese-HOWTO-8.html">Next</A>
<A HREF="Portuguese-HOWTO-6.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc7">Contents</A>
</BODY>
</HTML>
