<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux Portuguese-HOWTO: Observa&ccedil;&otilde;es finais</TITLE>
 <LINK HREF="Portuguese-HOWTO-10.html" REL=next>
 <LINK HREF="Portuguese-HOWTO-8.html" REL=previous>
 <LINK HREF="Portuguese-HOWTO.html#toc9" REL=contents>
</HEAD>
<BODY>
<A HREF="Portuguese-HOWTO-10.html">Next</A>
<A HREF="Portuguese-HOWTO-8.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc9">Contents</A>
<HR>
<H2><A NAME="s9">9. Observa&ccedil;&otilde;es finais</A></H2>

<H2><A NAME="ss9.1">9.1 Futuras adi&ccedil;&otilde;es a este documento</A>
</H2>

<P>As pr&oacute;ximas vers&otilde;es do HOWTO dever&atilde;o conter, entre outros assuntos, os
seguintes:
<UL>
<LI>suporte &agrave; distribui&ccedil;&atilde;o Caldera;</LI>
<LI>informa&ccedil;&otilde;es sobre compartilhamento de arquivos em rede usando NFS, SAMBA
e Mars-NWE;</LI>
<LI>configura&ccedil;&atilde;o de <EM>toolkits</EM> de interface gr&aacute;fica: Qt, GTK, XForms,
Tk (Tcl) e os baseados em Xt, como Motif, Lesstif, Xaw (*international
ainda n&atilde;o est&aacute; funcionando);</LI>
<LI>uma se&ccedil;&atilde;o sobre desenvolvimento de programas;</LI>
<LI>refer&ecirc;ncias ao Ispell (us&aacute;-lo para corrigir o pr&oacute;prio HOWTO :-);</LI>
<LI>informa&ccedil;&otilde;es sobre X/Open, XPG4 e POSIX, ou pelo menos ponteiros para
elas.</LI>
</UL>

Aceitam-se volunt&aacute;rios para qualquer uma destas tarefas.
<P>Parece cada vez mais claro que as informa&ccedil;&otilde;es sobre configura&ccedil;&atilde;o de
aplicativos devem ser movidas para outro documento, independente do HOWTO. Na
forma como ele est&aacute; hoje j&aacute; chega a quase quarenta p&aacute;ginas impressas e com a
adi&ccedil;&atilde;o de outras distribui&ccedil;&otilde;es e aplica&ccedil;&otilde;es em breve chegar&aacute; &agrave;s 50. Um
documento t&atilde;o grande foge ao esp&iacute;rito de um HOWTO, que deve ser sucinto e
concentrado em um assunto espec&iacute;fico.
<P>
<H2><A NAME="ss9.2">9.2 Nota de Direitos de Autor</A>
</H2>

<P>Este HOWTO teve como autor Jo&atilde;o Carlos Rodrigues Pereira, baseado em
documenta&ccedil;&atilde;o escrita por Jos&eacute; Bandeira al&eacute;m dos restantes HOWTO's do Linux.
Atualmente ele &eacute; mantido por Carlos Augusto Moreira dos Santos, com a
colabora&ccedil;&atilde;o de muitos outros.
<P>Os documentos HOWTO do Linux podem ser reproduzidos e distribu&iacute;dos
em todo ou em parte, segundo qualquer meio f&iacute;sico ou electr&oacute;nico, desde que
esta Nota de Direitos de Autor se mantenha intacta em todas as c&oacute;pias dos
mesmos.  A distribui&ccedil;&atilde;o comercial &eacute; autorizada e encorajada, no entanto, o
autor gostaria de ser notificado de tais ocorr&ecirc;ncias.
<P>Todas as tradu&ccedil;&otilde;es, trabalhos derivados, ou trabalhos agregando qualquer dos
documentos HOWTO do Linux dever&atilde;o estar abrangidos por esta Nota de
Direitos de Autor, ou seja, n&atilde;o poder&aacute; ser imposta qualquer restri&ccedil;&atilde;o
adicional a trabalhos efectuados a partir de um dos documentos HOWTO do
Linux nomeadamente no que diz respeito &agrave; sua distribui&ccedil;&atilde;o.
<P>Exce&ccedil;&otilde;es a estas regras poderam ser obtidas. Para tal, dever-se-&aacute; contactar o
coordenador dos documentos HOWTO do Linux no endere&ccedil;o &lt;
<A HREF="mailto:linux-howto@metalab.unc.edu">linux-howto@metalab.unc.edu</A>&gt;.
<P>
<H2><A NAME="ss9.3">9.3 Garantia (inexist&ecirc;ncia de) e nota de responsabilidade</A>
</H2>

<P>Apesar de ter sido feito o m&aacute;ximo esfor&ccedil;o poss&iacute;vel para que o conte&uacute;do deste
documento esteja correto, n&atilde;o h&aacute; nenhuma garantia de que ele n&atilde;o possua erros,
nem de que tenha algum tipo de utilidade ou aplica&ccedil;&atilde;o comercial, t&eacute;cnica,
educacional ou medicinal.  O autor n&atilde;o se responsabiliza por preju&iacute;zos
decorrentes do seu uso. Em resumo: se a informa&ccedil;&atilde;o aqui contida quebrar seu
computador em mil pedacinhos, junte tudo e cole, mas <B>n&atilde;o reclame para
mim</B>! 
<P>Documentos escritos por terceiros s&atilde;o de responsabilidade exclusiva deles e
sua refer&ecirc;ncia neste HOWTO n&atilde;o representa nenhum tipo de recomenda&ccedil;&atilde;o,
abono ou garantia de suporte.
<P>
<H2><A NAME="ss9.4">9.4 Agradecimentos</A>
</H2>

<P>Deixo aqui os meus agradecimentos a todos os que de alguma forma me ajudaram
quer atrav&eacute;s das suas sugest&otilde;es quer atrav&eacute;s de contribui&ccedil;&otilde;es de outro tipo,
em especial a
<P>
<DL>
<DT><B>Jo&atilde;o Carlos Rodrigues Pereira</B><DD><P>Autor original deste documento que agora
mantenho. Nunca tive contato com ele, nem sei por onde andar&aacute;.  Sua
p&aacute;gina no Departamento de Inform&aacute;tica da Faculdade de Ci&ecirc;ncias da
Universidade de Lisboa (http://caravela.di.fc.ul.pt/~jcrp/) n&atilde;o
existe mais. Lembro-me de t&ecirc;-la visto, anos atr&aacute;s.
<DT><B>Greg Hankins</B><DD><P>Ex-coordenador dos <B>Linux HOWTO</B>, por me permitir assumir
a manuten&ccedil;&atilde;o deste documento e fornecer as primeiras dicas sobre autoria
de documentos SGML.
</DL>
<P>As pessoas listadas a seguir enviaram mensagens diretamente para mim ou para
as listas Linux-BR da UNICAMP e TeX-BR com informa&ccedil;&otilde;es, sugest&otilde;es ou
coment&aacute;rios que foram inclu&iacute;das neste texto. Se algu&eacute;m foi esquecido, por
favor desculpe a falha.
<P>
<BLOCKQUOTE>
Andre Gerhard &lt;andre@lme.usp.br&gt;<BR>
Arnaldo Carvalho de Melo &lt;acme@conectiva.com.br&gt;<BR>
Bruno Barberi Gnecco &lt;brunobg@geocities.com&gt;<BR>
Cees de Groot &lt;cg@pobox.com&gt;<BR>
Francisco Semeraro &lt;semeraro@sti.com.br&gt;<BR>
Goedson Teixeira Paixao &lt;gopaixao@dcc.ufmg.br&gt;<BR>
Joao Carvalho &lt;foxfire@fe.up.pt&gt;<BR>
Jorge Carvalho Pinto &lt;jmcpinto@yahoo.com&gt;<BR>
Judson S Santiago &lt;judson@costeira.dimap.ufrn.br&gt;<BR>
Ken MacLeod &lt;ken@bitsko.slc.ut.us&gt;<BR>
Klaus Steding-Jessen &lt;jessen@acm.org&gt;<BR>
Lamarque Vieira Souza &lt;lamarque@dcc.ufmg.br&gt;<BR>
Marcelo Malheiros &lt;malheiro@dca.fee.unicamp.br&gt;<BR>
Marcos Vinicius Lannes dos Santos &lt;lannes@cnpgl.embrapa.br&gt;<BR>
Pedro Kr&ouml;ger &lt;kroger@e-net.com.br&gt;<BR>
Rafael Caetano dos Santos &lt;rcaetano@linux.ime.usp.br&gt;<BR>
Rafael Rodrigues Obelheiro &lt;obelix@biquinho.furg.br&gt;<BR>
Ramiro Morales &lt;morales@siscard.com.ar&gt;<BR>
Raul Carvalho &lt;rmpc@ip.pt&gt;<BR>
Ricardo Y. Igarashi &lt;iga@originet.com.br&gt;<BR>
Roberto Mello &lt;mello@internext.com.br&gt;<BR>
Wanderlei Antonio Cavassin &lt;cavassin@conectiva.com.br&gt;<BR>
</BLOCKQUOTE>
<P>Os seguintes agradecimentos s&atilde;o do primeiro autor:
<DL>
<DT><B>Carlos Ferreira</B><DD><P>Pela luta que trava pela defesa da lingua portuguesa, bem
patente na sua <EM>P&aacute;gina Portuguesa</EM> dispon&iacute;vel no URL:
<CODE>http://lila.dei.uc.pt/~cjrf/po/</CODE> [Nota do mantenedor
atual: esta p&aacute;gina n&atilde;o existe]
<DT><B>Jo&atilde;o C. Silva</B><DD><P>Pelo apoio e incentivo e criticas (bem como por me deixar
testar os meus conhecimentos no SEU computador). 
<DT><B>Jos&eacute; Bandeira</B><DD><P>Autor dos ficheiros <CODE>port.map</CODE> e <CODE>xmodmap</CODE>.  Pelo seu
apoio e por ter escrito alguma da documenta&ccedil;&atilde;o mais elucidativa que eu j&aacute;
li sobre o assunto.
</DL>
<P>
<HR>
<A HREF="Portuguese-HOWTO-10.html">Next</A>
<A HREF="Portuguese-HOWTO-8.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc9">Contents</A>
</BODY>
</HTML>
