<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Turkish-HOWTO: Klavye ayarlar&yacute;</TITLE>
 <LINK HREF="Turkish-HOWTO-4.html" REL=next>
 <LINK HREF="Turkish-HOWTO-2.html" REL=previous>
 <LINK HREF="Turkish-HOWTO.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="Turkish-HOWTO-4.html">Next</A>
<A HREF="Turkish-HOWTO-2.html">Previous</A>
<A HREF="Turkish-HOWTO.html#toc3">Contents</A>
<HR>
<H2><A NAME="s3">3. Klavye ayarlar&yacute;</A></H2>

<P>Bu b&ouml;l&uuml;mde, metin ekranda T&uuml;rk&ccedil;e yazmak i&ccedil;in gerekli programlar&yacute;
inceleyece&eth;iniz. Bunlardan ilki, bilgisayara T&uuml;rk&ccedil;e klavye tu&thorn; tak&yacute;m&yacute;
haritas&yacute;n&yacute; g&ouml;sterecek olan <CODE>loadkeys</CODE> komutudur. <CODE>loadkeys</CODE>
komutu ve uygun bir T&uuml;rk&ccedil;e klavye da&eth;&yacute;l&yacute;m&yacute; haritas&yacute; yard&yacute;m&yacute;yla istedi&eth;imiz
bir T&uuml;rk&ccedil;e klavyeyi (Q T&uuml;rk&ccedil;e, F T&uuml;rk&ccedil;e gibi) y&uuml;kleyebiliriz.
<P>
<P>
<H2><A NAME="ss3.1">3.1 Klavye tu&thorn; tak&yacute;m&yacute; y&uuml;klenmesi</A>
</H2>

<P>
<P><CODE>loadkeys</CODE> komutunun kullan&yacute;m&yacute; &ccedil;ok basittir. Da&eth;&yacute;t&yacute;m&yacute;n&yacute;zda bulunan ve
<CODE>/usr/lib/kbd/keymaps/i386</CODE> dizini alt&yacute;na yerle&thorn;tirilmi&thorn; olan klavye
haritalar&yacute;ndan bir tanesini se&ccedil;in. Asl&yacute;nda klavye haritalar&yacute;n&yacute;n ad&yacute;n&yacute;
bilmek zorunda de&eth;ilsiniz, burada kullanabilece&eth;iniz dosyalar&yacute; ve ne
tip bir klavyeyi y&uuml;klediklerini g&ouml;rebilirsiniz:
<P>
<P>
<P>
<UL>
<LI> trq.map : T&uuml;rk&ccedil;e Q klavye</LI>
<LI> trf.map : T&uuml;rk&ccedil;e F klavye</LI>
<LI> tralt.map : Bu klavye ile, ALT tu&thorn;u ile birlikte bast&yacute;&eth;&yacute;n&yacute;z bir
karakterin kar&thorn;&yacute;l&yacute;&eth;&yacute; olan T&uuml;rk&ccedil;e karakter ekranda belirecektir. &Ouml;rnek olarak
ALT ve "c" karakterlerine bast&yacute;&eth;&yacute;n&yacute;z zaman "&ccedil;", ALT ve "G"
karakterlerine bast&yacute;&eth;&yacute;n&yacute;zda ise "Ð" harfi g&ouml;r&uuml;lecektir. Bu klavye da&eth;&yacute;l&yacute;m&yacute;,
Q klavyeye al&yacute;&thorn;k&yacute;n, ancak arada bir T&uuml;rk&ccedil;e yazmak isteyenler i&ccedil;in ideal 
g&ouml;r&uuml;n&uuml;n&uuml;yor. Ancak h&yacute;zl&yacute; kullanmak i&ccedil;in biraz zaman istiyor.</LI>
</UL>
<P>
<P>
<P>&THORN;imdi <CODE>loadkeys</CODE> komutunu birka&ccedil; &ouml;rnekte kullanal&yacute;m:
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ loadkeys trq.map                 (T&uuml;rk&ccedil;e Q klavye haritas&yacute;n&yacute; y&uuml;kle) 
$ loadkeys trf.map                 (T&uuml;rk&ccedil;e F klavye haritas&yacute;n&yacute; y&uuml;kle) 
$ loadkeys tralt.map               (T&uuml;rk&ccedil;e F klavye haritas&yacute;n&yacute; y&uuml;kle) 
</PRE>
</CODE></BLOCKQUOTE>
<P>E&eth;er normal US klavye haritas&yacute;na d&ouml;nmek isterseniz, defkeymap klavye
e&thorn;lem dosyas&yacute;n&yacute; kullan&yacute;n.
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ loadkeys defkeymap
</PRE>
</CODE></BLOCKQUOTE>
<P>Yap&yacute;lan t&uuml;m i&thorn;lemler t&uuml;m sistemde etkin olacakt&yacute;r. Bir kullan&yacute;c&yacute; &ccedil;al&yacute;&thorn;ma
yapt&yacute;ktan sonra sistem kapan&yacute;ncaya, ya da ba&thorn;ka bir klavye da&eth;&yacute;l&yacute;m&yacute;
y&uuml;klenince de&eth;in klavye d&uuml;zeni ayn&yacute; kal&yacute;r.
<P>
<P>
<P>Not: &Ccedil;o&eth;u Linux da&eth;&yacute;t&yacute;mlar&yacute;nda bulunan kbd paketi sistemde kullan&yacute;labilecek
klavye e&thorn;lem (da&eth;&yacute;l&yacute;m) dosyalar&yacute;n&yacute; ve yaz&yacute;tiplerini i&ccedil;erir. Son
zamanlarda, diskten tasarruf sa&eth;lamak amac&yacute;yla hem yaz&yacute;tipi, hem de
klavye e&thorn;lem dosyalar&yacute; s&yacute;k&yacute;&thorn;t&yacute;r&yacute;larak kullan&yacute;lmaktad&yacute;r. Bu tip s&yacute;k&yacute;&thorn;t&yacute;r&yacute;lm&yacute;&thorn;
dosyalar&yacute;n sonu .gz ile biter (&ouml;rne&eth;in <CODE>trq.map.gz</CODE>). 
<CODE>loadkeys</CODE> ve <CODE>setfont</CODE> komutlar&yacute; herhangi bir sorunla
kar&thorn;&yacute;la&thorn;madan bu dosyalar&yacute; okuyabilecek ve gerekli i&thorn;lemleri yapacakt&yacute;r.
<P>
<P>
<P>
<H2><A NAME="ss3.2">3.2 Bu tu&thorn;tak&yacute;mlar&yacute;n&yacute; nerede bulabilirim?</A>
</H2>

<P>E&eth;er kulland&yacute;&eth;&yacute;n&yacute;z da&eth;&yacute;t&yacute;mda trq.map, trf.map ya da tralt.map klavye e&thorn;lem
dosyalar&yacute;n&yacute; bulam&yacute;yorsan&yacute;z ve yukar&yacute;daki komutlar&yacute; i&thorn;lerken hata mesaj&yacute;
al&yacute;yorsan&yacute;z, 
<A HREF="ftp://ftp.gelecek.com.tr/pub/turkce">ftp.gelecek.com.tr</A> adresinden bu dosyalar&yacute;
indirmeniz m&uuml;mk&uuml;nd&uuml;r.
<P>
<P>
<P>Diledi&eth;iniz klavye d&uuml;zenini, Red Hat da&eth;&yacute;t&yacute;m&yacute;nda yeralan
/etc/sysconfig/keyboard dosyas&yacute;na ekleyebilirsiniz. Kullanabilece&eth;iniz
dosya isimlerinden baz&yacute;lar&yacute; trq, trf ve tralt't&yacute;r.
<P>
<HR>
<A HREF="Turkish-HOWTO-4.html">Next</A>
<A HREF="Turkish-HOWTO-2.html">Previous</A>
<A HREF="Turkish-HOWTO.html#toc3">Contents</A>
</BODY>
</HTML>
