<!DOCTYPE article PUBLIC "-//OASIS//DTD DocBook V4.2//EN">
 
<article>
  <articleinfo>
    <title>&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;&#2472;&#2478;&#2495; &#2489;&#2494;&#2451;&#2463;&#2497;</title>

    <authorgroup>
      <author>
        <firstname>&#2447;&#2482;&#2441;&#2465;</firstname> <surname>&#2465;&#2508;&#2472;&#2496;</surname> 
      </author>

      <author>
        <firstname>&#2460;&#2472;</firstname> <surname>&#2489;&#2494;&#2455;&#2495;&#2472;&#2509;&#8204;&#2488;</surname>
        <affiliation>
          <address><email>howto AT astronomy.net</email></address>
        </affiliation>
      </author>
    </authorgroup>  

    <othercredit>
      <contrib>&#2477;&#2494;&#2487;&#2494;&#2472;&#2509;&#2468;&#2480;</contrib>
      <othername>&#2474;&#2509;&#2480;&#2460;&#2509;&#2462;&#2494;</othername>
      <affiliation><address><email>abulfazl AT juniv.edu</email></address></affiliation>
    </othercredit>
    
    <subjectset>
      <subject><subjectterm>&#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;</subjectterm></subject>
      <subject><subjectterm>&#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;</subjectterm></subject>
    </subjectset>

    <pubdate>&#2536;&#2534;&#2534;&#2537;-&#2534;&#2540;-&#2534;&#2539;</pubdate>

    <revhistory>
      <revision>
        <revnumber>&#2535;.&#2534;</revnumber>
        <date>&#2536;&#2534;&#2534;&#2537;-&#2534;&#2540;-&#2534;&#2539;</date>
        <authorinitials>&#2474;&#2509;&#2480;</authorinitials>
        <revremark>&#2478;&#2498;&#2482; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503;&#2480; &#2535;.&#2538;&#2538; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;&#2503;&#2480; &#2476;&#2457;&#2509;&#2455;&#2494;&#2472;&#2497;&#2476;&#2494;&#2470;</revremark>
      </revision>
    </revhistory>

    <abstract> <para> &#2447;&#2439; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2503; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2458;&#2480;&#2509;&#2458;&#2494;&#2480; &#2451;&#2474;&#2480; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2468;&#2469;&#2509;&#2479; &#2451; &#2463;&#2495;&#2474;&#2509;&#8204;&#2488; &#2470;&#2503;&#2527;&#2494; &#2489;&#2527;&#2503;&#2459;&#2503;&#2404; </para> </abstract>
  </articleinfo>

  <sect1 id="introduction">  
    <title>&#2474;&#2509;&#2480;&#2494;&#2480;&#2478;&#2509;&#2477;&#2495;&#2453;</title>

    <sect2 id="knowledge-required">
      <title>&#2474;&#2498;&#2480;&#2509;&#2476;&#2503;&#2439; &#2479;&#2494; &#2460;&#2494;&#2472;&#2494; &#2469;&#2494;&#2453;&#2468;&#2503; &#2489;&#2476;&#2503;</title>
 
      <para>&#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2476;&#2499;&#2489;&#2468;&#2509;&#8205; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2465;&#2495;&#2488;&#2509;&#2463;&#2509;&#2480;&#2495;&#2476;&#2495;&#2441;&#2486;&#2472;, &#2479;&#2503;&#2478;&#2472; &#2488;&#2497;&#2488;&#2503;, &#2480;&#2503;&#2465;&#2489;&#2509;&#2479;&#2494;&#2463; &#2451; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479;&#2470;&#2503;&#2480; &#2453;&#2482;&#2509;&#2479;&#2494;&#2467;&#2503; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2470;&#2495;&#2472; &#2470;&#2495;&#2472; &#2488;&#2489;&#2460; &#2489;&#2527;&#2503;
 &#2441;&#2464;&#2459;&#2503;&#2404; &#2453;&#2495;&#2472;&#2509;&#2468;&#2497; &#2468;&#2494;&#2480;&#2474;&#2480;&#2451; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2503; &#2488;&#2480;&#2509;&#2476;&#2507;&#2458;&#2509;&#2458; &#2488;&#2497;&#2476;&#2495;&#2471;&#2494; &#2474;&#2503;&#2468;&#2503; &#2489;&#2482;&#2503; &#2439;&#2441;&#2472;&#2495;&#2453;&#2509;&#2488; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2495;&#2468; &#2474;&#2509;&#2480;&#2494;&#2469;&#2478;&#2495;&#2453; &#2460;&#2509;&#2462;&#2494;&#2472; &#2469;&#2494;&#2453;&#2494; &#2441;&#2458;&#2495;&#2468;&#2509;&#8205;&#2404; &#2468;&#2494;&#2439; &#2471;&#2480;&#2503; &#2472;&#2503;&#2527;&#2494; &#2489;&#2458;&#2509;&#2459;&#2503;
 &#2479;&#2503;, &#2447;&#2439; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2474;&#2494;&#2464;&#2453;&#2476;&#2499;&#2472;&#2509;&#2470;&#2503;&#2480; &#2437;&#2472;&#2509;&#2468;&#2468; &#2439;&#2441;&#2472;&#2495;&#2453;&#2509;&#2488; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2474;&#2509;&#2480;&#2494;&#2469;&#2478;&#2495;&#2453; &#2460;&#2509;&#2462;&#2494;&#2472; &#2451; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478; &#2453;&#2478;&#2509;&#2474;&#2494;&#2439;&#2482; &#2453;&#2480;&#2503; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2437;&#2477;&#2495;&#2460;&#2509;&#2462;&#2468;&#2494; &#2480;&#2527;&#2503;&#2459;&#2503;&#2404;
      </para>

      <para> &#2476;&#2495;&#2455;&#2468; &#2476;&#2459;&#2480;&#2455;&#2497;&#2482;&#2507;&#2468;&#2503; &#2468;&#2469;&#2509;&#2479;&#2503;&#2480; &#2479;&#2503;&#2488;&#2476; &#2441;&#2468;&#2509;&#8205;&#2488; &#2469;&#2503;&#2453;&#2503; &#2438;&#2478;&#2480;&#2494; &#2441;&#2474;&#2453;&#2499;&#2468; &#2489;&#2527;&#2503;&#2459;&#2495;, &#2468;&#2494;&#2480; &#2453;&#2468;&#2455;&#2497;&#2482;&#2507; &#2489;&#2482;&#2435; </para>

      <itemizedlist>
        <listitem>
          <para> <citetitle>A Practical Guide to the UNIX System</citetitle>,
            <author> <firstname>&#2478;&#2494;&#2480;&#2509;&#2453;</firstname> <othername>&#2460;&#2495;</othername> <surname>&#2488;&#2507;&#2476;&#2503;&#2482;</surname> </author>
          </para>
        </listitem>

        <listitem>
          <para> <citetitle>Advanced Programming in the UNIX Environment</citetitle>,  &#2474;&#2509;&#2480;&#2527;&#2494;&#2468; 
            <author> <firstname>&#2465;&#2476;&#2509;&#2482;&#2495;&#2441;.</firstname> <othername>&#2480;&#2495;&#2458;&#2494;&#2480;&#2509;&#2465;</othername> <surname>&#2488;&#2509;&#2463;&#2495;&#2477;&#2503;&#2472;&#2509;&#8204;&#2488;</surname> </author>
          </para>
        </listitem>  

        <listitem>
          <para> <citetitle>Running Linux</citetitle>, 
            <author> <firstname>&#2478;&#2509;&#2479;&#2494;&#2463;</firstname> <surname>&#2451;&#2527;&#2503;&#2482;&#2509;&#8204;&#2488;</surname> </author> &#2451; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479;
          </para>
        </listitem>   

        <listitem>
           <para> <citetitle>Linux Device Drivers</citetitle>,
             <author> <firstname>&#2438;&#2482;&#2503;&#2460;&#2494;&#2472;&#2509;&#2470;&#2509;&#2480;&#2507;</firstname> <surname>&#2480;&#2497;&#2476;&#2495;&#2472;&#2495;</surname> </author>
           </para>
        </listitem>
      </itemizedlist>

      <para> &#2476;&#2482;&#2503; &#2480;&#2494;&#2454;&#2494; &#2477;&#2494;&#2482; &#2479;&#2503;, &#2447;&#2439; &#2482;&#2503;&#2454;&#2494;&#2463;&#2495; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2480; &#2478;&#2498;&#2482;&#2468;&#2468;&#2509;&#2468;&#2509;&#2476; &#2453;&#2495;&#2434;&#2476;&#2494; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2527; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2479;&#2472;&#2509;&#2468;&#2509;&#2480;&#2474;&#2494;&#2468;&#2495; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2453;&#2507;&#2472; &#2437;&#2472;&#2497;&#2486;&#2496;&#2482;&#2472;&#2496; &#2476;&#2494; &#2468;&#2469;&#2509;&#2479;&#2488;&#2498;&#2468;&#2509;&#2480;
 &#2472;&#2527;&#2404; &#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472;&#2503;&#2480; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2486;&#2494;&#2454;&#2494;&#2455;&#2497;&#2482;&#2507;&#2480; &#2478;&#2471;&#2509;&#2479;&#2503; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2439; &#2488;&#2478;&#2509;&#2477;&#2476;&#2468; &#2474;&#2509;&#2480;&#2471;&#2494;&#2472;&#2468;&#2478;, &#2453;&#2494;&#2480;&#2467; &#2488;&#2478;&#2455;&#2509;&#2480; &#2476;&#2495;&#2486;&#2509;&#2476;&#2453;&#2503; &#2460;&#2494;&#2472;&#2494;&#2480; &#2474;&#2509;&#2480;&#2458;&#2472;&#2509;&#2465; &#2438;&#2453;&#2494;&#2453;&#2509;&#2487;&#2494;&#2527; &#2447;&#2439; &#2476;&#2495;&#2487;&#2527;&#2463;&#2495; &#2458;&#2480;&#2509;&#2458;&#2494; &#2453;&#2480;&#2468;&#2503;
 &#2455;&#2495;&#2527;&#2503; &#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472;&#2503;&#2480; &#2474;&#2509;&#2480;&#2494;&#2527; &#2474;&#2480;&#2488;&#2509;&#2474;&#2480; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2489;&#2496;&#2472; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2476;&#2495;&#2487;&#2527;&#2455;&#2497;&#2482;&#2507;&#2453;&#2503; &#2479;&#2503;&#2477;&#2494;&#2476;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2489;&#2527;, &#2468;&#2494; &#2488;&#2468;&#2509;&#2479;&#2495;&#2439; &#2437;&#2488;&#2494;&#2471;&#2494;&#2480;&#2467;&#2404; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2480; &#2474;&#2509;&#2480;&#2468;&#2495; &#2478;&#2494;&#2472;&#2497;&#2487;&#2503;&#2480;
 &#2438;&#2455;&#2509;&#2480;&#2489;&#2455;&#2509;&#2524;&#2468;&#2494;&#2439; &#2468;&#2494;&#2453;&#2503; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2474;&#2469;&#2503; &#2458;&#2494;&#2482;&#2495;&#2468; &#2453;&#2480;&#2503;&#2404; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2468;&#2469;&#2509;&#2479;&#2488;&#2498;&#2468;&#2509;&#2480;&#2455;&#2497;&#2482;&#2507;&#2480; &#2453;&#2527;&#2503;&#2453;&#2463;&#2495; &#2489;&#2482;&#2435;</para>

      <itemizedlist>
        <listitem>
          <para> <citetitle>Explanatory Supplement to the Astronomical Almanac</citetitle>,  
            <author> <firstname>&#2474;&#2495;.</firstname> <othername>&#2453;&#2503;&#2472;&#2503;&#2469;</othername> <surname>&#2488;&#2503;&#2439;&#2465;&#2503;&#2482;&#2478;&#2509;&#2479;&#2494;&#2472;</surname> </author>
          </para>
        </listitem>

        <listitem>
          <para> <citetitle>Astronomy with your Personal Computer</citetitle>, 
            <author> <firstname>&#2474;&#2495;&#2463;&#2494;&#2480;</firstname> <surname>&#2465;&#2475;-&#2488;&#2509;&#2478;&#2496;&#2469;</surname> </author>
          </para>
        </listitem>      

        <listitem>
          <para> <citetitle>Astronomy on the Personal Computer</citetitle>,
            <author> <firstname>&#2437;&#2482;&#2495;&#2477;&#2494;&#2480;</firstname> <surname>&#2478;&#2472;&#2509;&#2463;&#2503;&#2472;&#2476;&#2509;&#2480;&#2453;</surname> </author> &#2451; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479;
          </para>
        </listitem>

        <listitem>
          <para> <citetitle>Textbook on Spherical Astronomy</citetitle>,
            <author> <firstname>&#2465;&#2476;&#2509;&#2482;&#2495;&#2441;.</firstname> <othername>&#2447;&#2478;.</othername> <surname>&#2488;&#2509;&#2478;&#2494;&#2480;&#2509;&#2463;</surname> </author>
          </para>   
        </listitem>

        <listitem>
          <para> <citetitle>The Astronomy and Astrophysics Encyclopedia</citetitle>,
            <author> <firstname>&#2488;&#2509;&#2463;&#2495;&#2475;&#2503;&#2472;</firstname> <othername>&#2474;&#2495;.</othername> <surname>&#2478;&#2494;&#2480;&#2494;&#2472;</surname> </author> &#2453;&#2468;&#2499;&#2453;
 &#2488;&#2478;&#2509;&#2474;&#2494;&#2470;&#2495;&#2468; </para>
        </listitem>
      </itemizedlist>
    </sect2>
    
    <sect2 id="scope">
      <title> &#2474;&#2480;&#2495;&#2471;&#2495; </title>

      <para> &#2479;&#2503;&#2488;&#2476; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472; &#2453;&#2507;&#2472; &#2472;&#2494; &#2453;&#2507;&#2472; &#2477;&#2494;&#2476;&#2503; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2458;&#2480;&#2509;&#2458;&#2494;&#2527; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2489;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;, &#2482;&#2503;&#2454;&#2453;&#2476;&#2499;&#2472;&#2509;&#2470; &#2478;&#2498;&#2482;&#2468;&#2435; &#2447;&#2439; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480;
 &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480; &#2489;&#2495;&#2488;&#2503;&#2476;&#2503; &#2468;&#2494;&#2480; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494;&#2453;&#2503;&#2439; &#2472;&#2495;&#2480;&#2509;&#2471;&#2494;&#2480;&#2467; &#2453;&#2480;&#2503;&#2459;&#2503;&#2472;&#2404; &#2451;&#2527;&#2503;&#2476;&#2503;&#2474;&#2509;&#2474;&#2509;&#2468;&#2474;&#2509;&#2480;&#2494;&#2474;&#2509;&#2468; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2488;&#2453;&#2482; &#2468;&#2469;&#2509;&#2479;&#2488;&#2498;&#2468;&#2509;&#2480;&#2453;&#2503; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494;&#2477;&#2497;&#2453;&#2509;&#2468; &#2453;&#2480;&#2494; &#2453;&#2454;&#2472;&#2507;&#2439; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480;
 &#2441;&#2470;&#2509;&#2470;&#2503;&#2486;&#2509;&#2479; &#2472;&#2527;&#2404; &#2438;&#2478;&#2480;&#2494; &#2472;&#2495;&#2460;&#2503;&#2480;&#2494; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2488;&#2509;&#2469; &#2478;&#2508;&#2482;&#2495;&#2453; &#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472; &#2437;&#2474;&#2503;&#2453;&#2509;&#2487;&#2494; &#2468;&#2494;&#2480; &#2474;&#2509;&#2480;&#2479;&#2497;&#2453;&#2509;&#2468;&#2495;&#2455;&#2468; &#2470;&#2495;&#2453;&#2463;&#2495;&#2480; &#2474;&#2509;&#2480;&#2468;&#2495;&#2439; &#2476;&#2503;&#2486;&#2495; &#2438;&#2455;&#2509;&#2480;&#2489;&#2496; &#2438;&#2480; &#2468;&#2494;&#2439; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2480;
 &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503;&#2480; &#2437;&#2476;&#2470;&#2494;&#2472; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2503; &#2479;&#2494;&#2480;&#2494; &#2437;&#2476;&#2489;&#2495;&#2468;, &#2447;&#2439; &#2482;&#2503;&#2454;&#2494;&#2480; &#2453;&#2482;&#2503;&#2476;&#2480; &#2476;&#2499;&#2470;&#2509;&#2471;&#2495;&#2468;&#2503; &#2468;&#2494;&#2470;&#2503;&#2480; &#2437;&#2476;&#2470;&#2494;&#2472;&#2453;&#2503; &#2438;&#2478;&#2480;&#2494; &#2488;&#2494;&#2470;&#2480;&#2503;
 &#2438;&#2478;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467; &#2460;&#2494;&#2472;&#2494;&#2439;&#2404; &#2447;&#2460;&#2472;&#2509;&#2479;&#2472;&#2509;&#2460;&#2437;&#2472;&#2497;&#2455;&#2509;&#2480;&#2489; &#2453;&#2480;&#2503; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2507;&#2453;&#2509;&#2468; &#2464;&#2495;&#2453;&#2494;&#2472;&#2494;&#2527; &#2479;&#2507;&#2455;&#2494;&#2479;&#2507;&#2455; &#2453;&#2480;&#2497;&#2472;&#2404;</para>
    </sect2>

    <sect2 id="version">
      <title> &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; </title>

      <para> &#2447;&#2439; &#2482;&#2503;&#2454;&#2494;&#2463;&#2495;&#2480; &#2488;&#2480;&#2509;&#2476;&#2486;&#2503;&#2487; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; <ulink url="http://howto.astronomy.net/howto/Astronomy-HOWTO.html">&#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;&#2472;&#2478;&#2495;
 &#2489;&#2494;&#2451;&#2463;&#2497;</ulink> &#2489;&#2495;&#2488;&#2503;&#2476;&#2503; &#2488;&#2476;&#2488;&#2478;&#2527;&#2439; <ulink url="http://astronomy.net/">&#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;&#2472;&#2478;&#2495; &#2472;&#2503;&#2463;&#2503;</ulink> &#2474;&#2494;&#2451;&#2527;&#2494; &#2479;&#2494;&#2476;&#2503;&#2404; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2476;&#2509;&#2479;&#2494;&#2474;&#2494;&#2480;&#2503; &#2438;&#2478;&#2480;&#2494;
 &#2488;&#2494;&#2455;&#2509;&#2480;&#2489;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2474;&#2480;&#2494;&#2478;&#2480;&#2509;&#2486; &#2455;&#2509;&#2480;&#2489;&#2467; &#2453;&#2480;&#2476;&#2507;&#2404; &#2474;&#2480;&#2494;&#2478;&#2480;&#2509;&#2486; &#2469;&#2494;&#2453;&#2482;&#2503; &#2468;&#2494; &#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;&#2472;&#2478;&#2495; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2488;&#2478;&#2509;&#2474;&#2494;&#2470;&#2453;&#2503;&#2480; <email>howto@astronomy.net</email> &#2472;&#2495;&#2453;&#2463;
 &#2474;&#2509;&#2480;&#2503;&#2480;&#2467; &#2453;&#2480;&#2497;&#2472;&#2404; </para>
    </sect2>

    <sect2 id="copyright">
      <title> &#2453;&#2474;&#2495;&#2480;&#2494;&#2439;&#2463; </title>

      <para> &#2447;&#2482;&#2441;&#2465; &#2465;&#2508;&#2472;&#2496; &#2451; &#2460;&#2472; &#2489;&#2494;&#2455;&#2495;&#2472;&#2509;&#8204;&#2488; &#2453;&#2480;&#2509;&#2468;&#2499;&#2453; &#2453;&#2474;&#2495;&#2480;&#2494;&#2439;&#2463; &#2536;&#2534;&#2534;&#2534;-&#2536;&#2534;&#2534;&#2537; &#2488;&#2434;&#2480;&#2453;&#2509;&#2487;&#2495;&#2468;&#2404; &#2482;&#2503;&#2454;&#2494;&#2463;&#2495; &#2476;&#2495;&#2468;&#2480;&#2467;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; LDP (&#2482;&#2495;&#2472;&#2509;&#2479;&#2494;&#2453;&#2509;&#2488; &#2465;&#2453;&#2497;&#2478;&#2503;&#2472;&#2509;&#2463;&#2503;&#2486;&#2472;
 &#2474;&#2509;&#2480;&#2460;&#2503;&#2453;&#2509;&#2463;) &#2482;&#2494;&#2439;&#2488;&#2503;&#2472;&#2509;&#2488;&#2503; &#2441;&#2482;&#2509;&#2482;&#2503;&#2454;&#2495;&#2468; &#2486;&#2480;&#2509;&#2468; &#2478;&#2503;&#2472;&#2503; &#2458;&#2482;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; &#2468;&#2494;&#2459;&#2494;&#2524;&#2494; &#2482;&#2503;&#2454;&#2453;&#2476;&#2499;&#2472;&#2509;&#2470;&#2503;&#2480; &#2437;&#2472;&#2497;&#2478;&#2468;&#2495; &#2476;&#2509;&#2479;&#2468;&#2496;&#2468; &#2476;&#2495;&#2468;&#2480;&#2467;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2503; &#2453;&#2507;&#2472; &#2437;&#2476;&#2488;&#2509;&#2469;&#2494;&#2468;&#2503;&#2439; &#2482;&#2503;&#2454;&#2494;&#2463;&#2495;&#2453;&#2503;
 &#2474;&#2480;&#2495;&#2476;&#2480;&#2509;&#2468;&#2472; &#2453;&#2480;&#2494; &#2479;&#2494;&#2476;&#2503; &#2472;&#2494;&#2404; </para>

      <para> &#2453;&#2494;&#2455;&#2460; &#2476;&#2494; &#2439;&#2482;&#2503;&#2453;&#2463;&#2509;&#2480;&#2472;&#2495;&#2453; &#2478;&#2494;&#2471;&#2509;&#2479;&#2478;&#2503; &#2437;&#2476;&#2495;&#2453;&#2499;&#2468; &#2453;&#2474;&#2495; &#2468;&#2504;&#2480;&#2496; &#2476;&#2494; &#2476;&#2495;&#2468;&#2480;&#2467;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2482;&#2503;&#2454;&#2453;&#2476;&#2499;&#2472;&#2509;&#2470;&#2503;&#2480; &#2437;&#2472;&#2497;&#2478;&#2468;&#2495;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472; &#2472;&#2503;&#2439;&#2404; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453;&#2503;&#2480; &#2472;&#2494;&#2478;
 &#2441;&#2482;&#2509;&#2482;&#2503;&#2454; &#2453;&#2480;&#2494; &#2489;&#2482;&#2503; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2503;&#2480; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503;&#2451; &#2447;&#2439; &#2486;&#2480;&#2509;&#2468; &#2474;&#2509;&#2480;&#2479;&#2507;&#2460;&#2509;&#2479; &#2447;&#2476;&#2434; &#2447;&#2460;&#2472;&#2509;&#2479; &#2482;&#2503;&#2454;&#2453;&#2476;&#2499;&#2472;&#2509;&#2470;&#2503;&#2480; &#2488;&#2497;&#2472;&#2495;&#2480;&#2509;&#2470;&#2495;&#2487;&#2509;&#2463;&#2487;&#2509;&#2468;&#2453;&#2507;&#2472; &#2437;&#2472;&#2497;&#2478;&#2468;&#2495;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472; &#2472;&#2503;&#2439;&#2404; &#2476;&#2494;&#2467;&#2495;&#2460;&#2509;&#2479;&#2495;&#2453; &#2441;&#2470;&#2509;&#2470;&#2503;&#2486;&#2509;&#2479;&#2503;
 &#2474;&#2497;&#2472;&#2435;&#2476;&#2495;&#2468;&#2480;&#2467;&#2503;&#2480; &#2437;&#2472;&#2497;&#2478;&#2468;&#2495;&#2451; &#2470;&#2503;&#2527;&#2494; &#2489;&#2458;&#2509;&#2459;&#2503; &#2447;&#2476;&#2434; &#2476;&#2495;&#2486;&#2503;&#2487;&#2477;&#2494;&#2476;&#2503; &#2441;&#2468;&#2509;&#8205;&#2488;&#2494;&#2489;&#2495;&#2468; &#2453;&#2480;&#2494; &#2489;&#2458;&#2509;&#2459;&#2503;; &#2468;&#2476;&#2503; &#2447;&#2480;&#2498;&#2474; &#2476;&#2495;&#2468;&#2480;&#2467;&#2503;&#2480; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2482;&#2503;&#2454;&#2453;&#2476;&#2499;&#2472;&#2509;&#2470;&#2453;&#2503; &#2460;&#2494;&#2472;&#2494;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; &#2447;&#2439;
 &#2482;&#2503;&#2454;&#2494;&#2480; &#2437;&#2434;&#2486; &#2476;&#2495;&#2486;&#2503;&#2487; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503; &#2453;&#2507;&#2472; &#2437;&#2472;&#2497;&#2478;&#2468;&#2495; &#2459;&#2494;&#2524;&#2494;&#2439; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2479;&#2494;&#2476;&#2503;; &#2468;&#2476;&#2503; &#2447;&#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2478;&#2498;&#2482;&#2453;&#2474;&#2495; &#2437;&#2469;&#2476;&#2494; &#2478;&#2498;&#2482;&#2453;&#2474;&#2495;&#2480; &#2453;&#2507;&#2472; &#2474;&#2527;&#2503;&#2472;&#2509;&#2463;&#2494;&#2480;&#2503;&#2480; &#2441;&#2482;&#2509;&#2482;&#2503;&#2454;
 &#2469;&#2494;&#2453;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; </para>

       <para>&#2447;&#2439; &#2453;&#2474;&#2495;&#2480;&#2494;&#2439;&#2463; &#2451; &#2437;&#2472;&#2497;&#2478;&#2468;&#2495;&#2488;&#2498;&#2458;&#2453; &#2476;&#2495;&#2460;&#2509;&#2462;&#2474;&#2509;&#2468;&#2495; &#2474;&#2509;&#2480;&#2468;&#2495;&#2463;&#2495; &#2453;&#2474;&#2495;&#2468;&#2503; &#2488;&#2434;&#2480;&#2453;&#2509;&#2487;&#2467; &#2453;&#2480;&#2494; &#2488;&#2494;&#2474;&#2503;&#2453;&#2509;&#2487;&#2503; &#2489;&#2494;&#2451;&#2463;&#2497;&#2463;&#2495;&#2480; &#2437;&#2476;&#2495;&#2453;&#2499;&#2468; &#2453;&#2474;&#2495; &#2468;&#2504;&#2480;&#2496; &#2451; &#2476;&#2495;&#2468;&#2480;&#2467;&#2503;&#2480; &#2437;&#2472;&#2497;&#2478;&#2468;&#2495;
 &#2474;&#2509;&#2480;&#2470;&#2494;&#2472; &#2453;&#2480;&#2494; &#2489;&#2482;&#2404; </para>

      <para> &#2488;&#2434;&#2453;&#2509;&#2487;&#2503;&#2474;&#2503; &#2476;&#2482;&#2468;&#2503; &#2455;&#2503;&#2482;&#2503;, &#2447;&#2439; &#2489;&#2494;&#2451;&#2463;&#2497;&#2468;&#2503; &#2441;&#2482;&#2509;&#2482;&#2503;&#2454;&#2495;&#2468; &#2468;&#2469;&#2509;&#2479;&#2488;&#2478;&#2498;&#2489;&#2453;&#2503; &#2488;&#2480;&#2509;&#2476;&#2507;&#2458;&#2509;&#2458; &#2488;&#2434;&#2454;&#2509;&#2479;&#2453; &#2478;&#2494;&#2471;&#2509;&#2479;&#2478;&#2503; &#2459;&#2524;&#2495;&#2527;&#2503; &#2470;&#2503;&#2527;&#2494;&#2439; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2441;&#2470;&#2509;&#2470;&#2503;&#2486;&#2509;&#2479;&#2404; &#2468;&#2476;&#2503;
 &#2489;&#2494;&#2451;&#2463;&#2497;&#2463;&#2495;&#2480; &#2453;&#2474;&#2495;&#2480;&#2494;&#2439;&#2463; &#2437;&#2471;&#2495;&#2453;&#2494;&#2480; &#2438;&#2478;&#2480;&#2494; &#2480;&#2494;&#2454;&#2468;&#2503; &#2458;&#2494;&#2439; &#2447;&#2476;&#2434; &#2447;&#2463;&#2495; &#2476;&#2495;&#2468;&#2480;&#2467;&#2503;&#2480; &#2453;&#2507;&#2472; &#2474;&#2480;&#2495;&#2453;&#2482;&#2509;&#2474;&#2472;&#2494; &#2469;&#2494;&#2453;&#2482;&#2503; &#2468;&#2494; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480;&#2453;&#2503; &#2460;&#2494;&#2472;&#2494;&#2482;&#2503; &#2438;&#2478;&#2480;&#2494; &#2438;&#2472;&#2472;&#2509;&#2470;&#2495;&#2468;
 &#2489;&#2476;&#2507;&#2404; </para>
    </sect2>

    <sect2 id="contribution">
      <title> &#2476;&#2495;&#2476;&#2495;&#2471; &#2488;&#2509;&#2476;&#2496;&#2453;&#2499;&#2468;&#2495; </title>

      <para> &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2453;&#2494;&#2460;&#2503; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2468;&#2469;&#2509;&#2479; &#2470;&#2495;&#2527;&#2503; &#2479;&#2494;&#2480;&#2494; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2488;&#2494;&#2489;&#2494;&#2479;&#2509;&#2479; &#2453;&#2480;&#2503;&#2459;&#2503;&#2472; &#2451; &#2453;&#2480;&#2476;&#2503;&#2472;, &#2447;&#2454;&#2494;&#2472;&#2503; &#2438;&#2478;&#2480;&#2494; &#2468;&#2494;&#2433;&#2470;&#2503;&#2480; &#2453;&#2494;&#2459;&#2503; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480;
 &#2443;&#2467;&#2488;&#2509;&#2476;&#2496;&#2453;&#2494;&#2480; &#2453;&#2480;&#2459;&#2495;&#2404; </para>

      <itemizedlist>
        <listitem>
          <para>  &#2478;&#2498;&#2482; &#2439;&#2434;&#2480;&#2503;&#2460;&#2495; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2453;&#2494;&#2464;&#2494;&#2478;&#2507;&#2453;&#2503; &#2474;&#2497;&#2480;&#2472;&#2507; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2465;&#2453; (Linuxdoc) &#2469;&#2503;&#2453;&#2503; &#2465;&#2453;&#2476;&#2497;&#2453; (Docbook) &#2447; &#2474;&#2480;&#2495;&#2476;&#2480;&#2509;&#2468;&#2472; &#2453;&#2480;&#2503;  &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2488;&#2494;&#2489;&#2494;&#2479;&#2509;&#2479;
 &#2453;&#2480;&#2503;&#2459;&#2503; <personname><othername>&#2474;&#2509;&#2480;&#2460;&#2509;&#2462;&#2494;</othername></personname>&#2404; </para>
        </listitem>
      </itemizedlist>
    </sect2>

    <sect2 id="translation">
      <title> &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; </title>

      <para> &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2479;&#2503;&#2489;&#2503;&#2468;&#2497; &#2476;&#2489;&#2497;&#2482;&#2494;&#2434;&#2486;&#2503;&#2439; &#2447;&#2453;&#2463;&#2495; &#2438;&#2472;&#2509;&#2468;&#2480;&#2509;&#2460;&#2494;&#2468;&#2495;&#2453; &#2441;&#2470;&#2509;&#2479;&#2507;&#2455;, &#2468;&#2494;&#2439; &#2479;&#2503;&#2453;&#2507;&#2472; &#2477;&#2494;&#2487;&#2494;&#2527; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453;&#2503; &#2438;&#2478;&#2480;&#2494; &#2488;&#2509;&#2476;&#2494;&#2455;&#2468; &#2460;&#2494;&#2472;&#2494;&#2439;&#2404; &#2468;&#2476;&#2503;
 &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2503;&#2480; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2438;&#2478;&#2480;&#2494; &#2472;&#2495;&#2478;&#2509;&#2472;&#2507;&#2453;&#2509;&#2468; &#2486;&#2480;&#2509;&#2468;&#2494;&#2476;&#2482;&#2496; &#2478;&#2503;&#2472;&#2503; &#2458;&#2482;&#2494;&#2480; &#2437;&#2472;&#2497;&#2480;&#2507;&#2471; &#2460;&#2494;&#2472;&#2494;&#2458;&#2509;&#2459;&#2495;: </para>

      <itemizedlist>
        <listitem>
          <para> &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2495; &#2447;&#2439; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2447;&#2453;&#2460;&#2472; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453; &#2489;&#2472;, &#2468;&#2476;&#2503; &#2441;&#2474;&#2480;&#2507;&#2453;&#2509;&#2468; &#2464;&#2495;&#2453;&#2494;&#2472;&#2494;&#2527; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503; &#2479;&#2507;&#2455;&#2494;&#2479;&#2507;&#2455; &#2453;&#2480;&#2497;&#2472; &#2479;&#2503;&#2472; &#2438;&#2478;&#2480;&#2494;
 &#2438;&#2474;&#2472;&#2494;&#2453;&#2503; &#2479;&#2469;&#2494;&#2480;&#2509;&#2469; &#2453;&#2499;&#2468;&#2495;&#2468;&#2509;&#2476; &#2470;&#2495;&#2468;&#2503; &#2474;&#2494;&#2480;&#2495;&#2404; &#2447;&#2468;&#2503; &#2474;&#2494;&#2464;&#2453;&#2476;&#2499;&#2472;&#2509;&#2470; &#2468;&#2494;&#2468;&#2509;&#8205;&#2453;&#2509;&#2487;&#2467;&#2495;&#2453;&#2477;&#2494;&#2476;&#2503; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2463;&#2495;&#2480; &#2437;&#2488;&#2509;&#2468;&#2495;&#2468;&#2509;&#2476; &#2451; &#2437;&#2476;&#2488;&#2509;&#2469;&#2494;&#2472; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2503; &#2460;&#2494;&#2472;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2404; </para>
        </listitem>

        <listitem>
          <para> &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2503; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2474;&#2509;&#2480;&#2471;&#2494;&#2472; &#2488;&#2494;&#2439;&#2463; <ulink url="http://howto.astronomy.net/">&#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;&#2472;&#2478;&#2495; &#2472;&#2503;&#2463;</ulink> &#2469;&#2503;&#2453;&#2503;
 &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2447;&#2453;&#2463;&#2495; &#2488;&#2480;&#2509;&#2476;&#2486;&#2503;&#2487; &#2453;&#2474;&#2495; &#2488;&#2434;&#2455;&#2509;&#2480;&#2489; &#2453;&#2480;&#2497;&#2472;&#2404; </para>
        </listitem>
      </itemizedlist> 

      <para> &#2472;&#2495;&#2478;&#2509;&#2472;&#2507;&#2453;&#2509;&#2468; &#2476;&#2509;&#2479;&#2453;&#2509;&#2468;&#2495;&#2476;&#2480;&#2509;&#2455;&#2453;&#2503; &#2468;&#2494;&#2433;&#2470;&#2503;&#2480; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453;&#2480;&#2509;&#2478;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2478;&#2480;&#2494; &#2471;&#2472;&#2509;&#2479;&#2476;&#2494;&#2470; &#2460;&#2494;&#2472;&#2494;&#2458;&#2509;&#2459;&#2495;: </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://www.michael-moltenbrey.de/misc.html">&#2460;&#2494;&#2480;&#2509;&#2478;&#2494;&#2472; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;</ulink>, &#2488;&#2508;&#2460;&#2472;&#2509;&#2479;&#2503; 
 <personname><firstname>&#2478;&#2494;&#2439;&#2453;&#2503;&#2482;</firstname><surname>&#2478;&#2482;&#2509;&#2463;&#2503;&#2472;&#2476;&#2509;&#2480;&#2503;</surname></personname>&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://www.linux.or.jp/JF/JFdocs/Astronomy-HOWTO.html">&#2460;&#2494;&#2474;&#2494;&#2472;&#2496; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;</ulink>, &#2488;&#2508;&#2460;&#2472;&#2509;&#2479;&#2503; 
 <personname><firstname>&#2486;&#2508;&#2489;&#2503;&#2439;</firstname><surname>&#2472;&#2494;&#2455;&#2494;&#2451;&#2453;&#2494;</surname></personname>&#2404; </para>
        </listitem>
      </itemizedlist>
    </sect2>
 
    <sect2 id="on-authors">
      <title> &#2482;&#2503;&#2454;&#2453; &#2474;&#2480;&#2495;&#2458;&#2495;&#2468;&#2495; </title>

      <para> &#2447;&#2482;&#2441;&#2465; &#2465;&#2508;&#2472;&#2496; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;  &#2474;&#2509;&#2480;&#2453;&#2508;&#2486;&#2482;&#2496; &#2489;&#2495;&#2488;&#2503;&#2476;&#2503; &#2474;&#2509;&#2480;&#2494;&#2527; &#2476;&#2495;&#2486; &#2476;&#2459;&#2480;&#2503;&#2480; &#2437;&#2471;&#2495;&#2453; &#2453;&#2494;&#2460; &#2453;&#2480;&#2503;&#2459;&#2503;&#2472;&#2404; &#2468;&#2494;&#2433;&#2480;
 &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2503;  &#2438;&#2480;&#2507; &#2460;&#2494;&#2472;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472; <ulink url="http://www.clearskyinstitute.com/resumes/ecdowney/resume.htm">&#2453;&#2509;&#2482;&#2495;&#2527;&#2494;&#2480; &#2488;&#2509;&#2453;&#2494;&#2439; &#2439;&#2472;&#2488;&#2509;&#2463;&#2495;&#2463;&#2495;&#2441;&#2463;
 &#2469;&#2503;&#2453;&#2503;</ulink> &#2404; </para> 
 
      <para> &#2460;&#2472; &#2489;&#2494;&#2455;&#2495;&#2472;&#2488;&#2503;&#2480; &#2489;&#2494;&#2480;&#2509;&#2465;&#2451;&#2527;&#2494;&#2480; &#2474;&#2509;&#2480;&#2453;&#2508;&#2486;&#2482;&#2503;&#2480; &#2451;&#2474;&#2480; &#2437;&#2477;&#2495;&#2460;&#2509;&#2462;&#2468;&#2494; &#2447;&#2455;&#2494;&#2480; &#2476;&#2459;&#2480;&#2503;&#2480; &#2447;&#2476;&#2434; &#2447;&#2480; &#2477;&#2503;&#2468;&#2480; &#2438;&#2463; &#2476;&#2459;&#2480; &#2468;&#2495;&#2472;&#2495; &#2447;&#2453;&#2463;&#2495; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468;
 &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503; &#2460;&#2524;&#2495;&#2468;  &#2459;&#2495;&#2482;&#2503;&#2472;&#2404; &#2460;&#2472; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2503; &#2438;&#2480;&#2507; &#2460;&#2494;&#2472;&#2468;&#2503; &#2458;&#2494;&#2439;&#2482;&#2503; <ulink url="http://www.johnhuggins.com/resume/">&#2468;&#2494;&#2433;&#2480; &#2451;&#2527;&#2503;&#2476;&#2488;&#2494;&#2439;&#2463;
 &#2470;&#2503;&#2454;&#2497;&#2472;</ulink>&#2404;
       </para>
    </sect2>
  </sect1>

  <sect1 id="software-list">
    <title> &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; </title>

    <sect2 id="software-collection">
      <title> &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2488;&#2434;&#2455;&#2509;&#2480;&#2489; </title>

      <para> &#2447;&#2454;&#2494;&#2472;&#2503; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503;&#2480; &#2453;&#2495;&#2459;&#2497; &#2488;&#2434;&#2455;&#2509;&#2480;&#2489; &#2451; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494;&#2480; &#2441;&#2482;&#2509;&#2482;&#2503;&#2454; &#2453;&#2480;&#2494; &#2489;&#2482;&#2404; </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://www.randomfactory.com/lfa.html">&#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2476;&#2495;&#2487;&#2527;&#2453; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2488;&#2495;&#2465;&#2495;&#2480;&#2478;</ulink> </para>
        </listitem> 

        <listitem>
          <para>  <ulink url="http://SAL.KachinaTech.COM/Z/4/index.shtml">&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472;&#2476;&#2495;&#2487;&#2527;&#2453; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472; (<acronym>
 SAL</acronym>), &#2474;&#2470;&#2494;&#2480;&#2509;&#2469;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2451; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; </ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://bima.astro.umd.edu/nemo/linuxastro/astromake/">&#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;&#2478;&#2503;&#2453;</ulink> &#2447;&#2453;&#2463;&#2495; &#2439;&#2441;&#2463;&#2495;&#2482;&#2495;&#2463;&#2495; &#2479;&#2494; &#2476;&#2489;&#2497;&#2482;
 &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2453;&#2495;&#2459;&#2497; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2476;&#2495;&#2487;&#2527;&#2453; &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460;&#2503;&#2480; (&#2476;&#2494;&#2439;&#2472;&#2494;&#2480;&#2495; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;) &#2439;&#2472;&#2488;&#2509;&#2463;&#2482;&#2503;&#2486;&#2472; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494; &#2488;&#2489;&#2460; &#2453;&#2480;&#2503; &#2468;&#2507;&#2482;&#2503;&#2404; </para>
        </listitem>

        <listitem>
          <para> &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507; &#2478;&#2503;&#2439;&#2482;&#2495;&#2434; &#2482;&#2495;&#2488;&#2509;&#2463; &#2453;&#2480;&#2509;&#2468;&#2499;&#2453; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472; &#2451; &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503;&#2480; &#2447;&#2453;&#2463;&#2495; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494; &#2488;&#2434;&#2480;&#2453;&#2509;&#2487;&#2467; &#2453;&#2480;&#2494; &#2489;&#2527;&#2404; &#2447; &#2476;&#2509;&#2479;&#2494;&#2474;&#2494;&#2480;&#2503;
 &#2438;&#2480;&#2507; &#2460;&#2494;&#2472;&#2468;&#2503; &#2458;&#2494;&#2439;&#2482;&#2503; &#2470;&#2503;&#2454;&#2497;&#2472; <ulink url="http://bima.astro.umd.edu/nemo/linuxastro">&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;</ulink> </para>
        </listitem>    

        <listitem>
          <para> <ulink url="http://sourceforge.net/softwaremap/trove_list.php?form_cat=134">Sourceforge.net &#2447; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;</ulink>
          </para>
        </listitem>
      </itemizedlist>  

      <para> &#2474;&#2498;&#2480;&#2509;&#2476;&#2503;&#2480; &#2482;&#2495;&#2457;&#2509;&#2453;&#2455;&#2497;&#2482;&#2507; &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2494;&#2480; &#2453;&#2494;&#2460;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2479;&#2469;&#2503;&#2487;&#2509;&#2463; &#2472;&#2494; &#2489;&#2527; &#2468;&#2476;&#2503; &#2447;&#2455;&#2497;&#2482;&#2507; &#2489;&#2527;&#2468;&#2507; &#2488;&#2494;&#2489;&#2494;&#2479;&#2509;&#2479; &#2453;&#2480;&#2476;&#2503;&#2435; </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://www.google.com/search?q=Astronomy+S&#2451;ftware+Linux">&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503;&#2480;
 &#2451;&#2474;&#2480; Google &#2488;&#2494;&#2480;&#2509;&#2458; &#2439;&#2462;&#2509;&#2460;&#2495;&#2472;&#2503;&#2480; &#2441;&#2468;&#2509;&#2468;&#2480;</ulink> </para>
        </listitem>
 
        <listitem>
          <para> <ulink url="http://dir.yahoo.com/Science/Astronomy/Software/">&#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2476;&#2495;&#2487;&#2527;&#2453; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503;&#2480; Yahoo! &#2474;&#2509;&#2480;&#2470;&#2468;&#2509;&#2468;
 &#2468;&#2494;&#2482;&#2495;&#2453;&#2494;</ulink>  </para>
        </listitem>
      </itemizedlist>  
    </sect2>  

    <sect2 id="planetarium-software">
      <title> &#2474;&#2509;&#2482;&#2509;&#2479;&#2494;&#2472;&#2503;&#2463;&#2507;&#2480;&#2495;&#2527;&#2494;&#2478; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; </title>

      <para> &#2474;&#2509;&#2480;&#2453;&#2499;&#2468;&#2495; &#2451; &#2478;&#2472;&#2497;&#2487;&#2509;&#2479;&#2472;&#2495;&#2480;&#2509;&#2478;&#2495;&#2468; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2454;-&#2476;&#2488;&#2509;&#2468;&#2497; &#2454;&#2497;&#2460;&#2503; &#2474;&#2494;&#2451;&#2527;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2453;&#2495;&#2459;&#2497; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503;&#2480; &#2476;&#2480;&#2509;&#2467;&#2472;&#2494; &#2470;&#2503;&#2527;&#2494; &#2489;&#2482;&#2404; </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://clearskyinstitute.com/xephem/"><application>XEphem</application></ulink> &#2489;&#2482; &#2455;&#2468; &#2535;&#2539; &#2476;&#2459;&#2480; &#2479;&#2494;&#2476;&#2468;&#2509;&#8205;
 &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2447;&#2453;&#2460;&#2472;&#2503;&#2480; (&#2465;&#2508;&#2472;&#2496;) &#2486;&#2454;&#2503;&#2480; &#2476;&#2486;&#2503; &#2468;&#2504;&#2480;&#2496; &#2453;&#2480;&#2494; &#2447;&#2453;&#2463;&#2495; &#2474;&#2509;&#2480;&#2460;&#2503;&#2453;&#2509;&#2463;&#2404; &#2488;&#2478;&#2527;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503; &#2488;&#2494;&#2469;&#2503; &#2438;&#2453;&#2494;&#2486;&#2503;&#2480; &#2447;&#2475;&#2495;&#2478;&#2503;&#2480;&#2495;&#2465;&#2509;&#8204;&#2488; &#2455;&#2467;&#2472;&#2494; &#2453;&#2480;&#2494;&#2480; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2447;&#2463;&#2495;
 &#2447;&#2453;&#2463;&#2495; &#2437;&#2468;&#2509;&#2479;&#2472;&#2509;&#2468; &#2470;&#2453;&#2509;&#2487; &#2451; &#2488;&#2489;&#2460; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2479;&#2507;&#2455;&#2509;&#2479; &#2489;&#2494;&#2468;&#2495;&#2527;&#2494;&#2480;&#2503; &#2474;&#2480;&#2495;&#2467;&#2468; &#2489;&#2527;&#2503;&#2459;&#2503;&#2404; </para>
        </listitem>
      
        <listitem>
          <para> <ulink url="http://astrotrf.net:8080/xsky_blurb.html"><application>XSky</application></ulink> &#2468;&#2504;&#2480;&#2496; &#2453;&#2480;&#2503;&#2459;&#2503;&#2472; 
 <personname><firstname>&#2463;&#2503;&#2480;&#2496;</firstname><othername>&#2438;&#2480;.</othername><surname>&#2475;&#2509;&#2480;&#2503;&#2439;&#2465;&#2480;&#2495;&#2453;&#2488;&#2503;&#2472;</surname></personname>,
 <email>terry@venus.sunquest.com</email> &#2404; XSky &#2447;&#2453;&#2463;&#2495; &#2488;&#2489;&#2460; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2479;&#2507;&#2455;&#2509;&#2479; &#2454;-&#2478;&#2494;&#2472;&#2458;&#2495;&#2468;&#2509;&#2480;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://edu.kde.org/kstars">KStars</ulink> &#2489;&#2482; <acronym>KDE</acronym> &#2474;&#2509;&#2480;&#2460;&#2503;&#2453;&#2509;&#2463;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2468;&#2504;&#2480;&#2495; &#2453;&#2480;&#2494; &#2447;&#2453;&#2463;&#2495;
 &#2465;&#2503;&#2488;&#2509;&#2453;&#2463;&#2474; &#2474;&#2509;&#2482;&#2509;&#2479;&#2494;&#2472;&#2503;&#2463;&#2507;&#2480;&#2495;&#2527;&#2494;&#2478; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://tdc-www.harvard.edu/software/skymap.html"><application>Skymap</application></ulink> &#2447;&#2453;&#2463;&#2495;
 &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2478;&#2494;&#2472;&#2458;&#2495;&#2468;&#2509;&#2480; &#2468;&#2504;&#2480;&#2496;&#2480; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478; &#2479;&#2494; &#2439;&#2441;&#2472;&#2495;&#2453;&#2509;&#2488; &#2451;&#2527;&#2494;&#2480;&#2509;&#2453;&#2488;&#2509;&#2463;&#2503;&#2486;&#2472;&#2503; &#2458;&#2494;&#2482;&#2494;&#2472;&#2507;&#2480; &#2460;&#2472;&#2509;&#2479; &#2488;&#2495; &#2451; &#2475;&#2507;&#2480;&#2463;&#2509;&#2480;&#2509;&#2479;&#2494;&#2472; &#2477;&#2494;&#2487;&#2494;&#2527; &#2482;&#2503;&#2454;&#2494; &#2489;&#2527;&#2503;&#2459;&#2503;&#2404; &#2488;&#2509;&#2478;&#2495;&#2469;&#2488;&#2507;&#2472;&#2495;&#2527;&#2494;&#2472;
 &#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;&#2475;&#2495;&#2460;&#2495;&#2453;&#2509;&#2479;&#2494;&#2482; &#2437;&#2476;&#2460;&#2494;&#2480;&#2477;&#2503;&#2463;&#2480;&#2495; &#2465;&#2494;&#2463;&#2494; &#2488;&#2503;&#2472;&#2509;&#2463;&#2494;&#2480;&#2503; &#2453;&#2480;&#2509;&#2478;&#2480;&#2468; <personname><firstname>&#2465;&#2441;&#2455;</firstname><surname>&#2478;&#2495;&#2457;&#2509;&#2453;</surname>
 </personname> &#2447;&#2463;&#2495; &#2468;&#2504;&#2480;&#2496; &#2453;&#2480;&#2503;&#2459;&#2503;&#2472;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://www.astroarts.com/products/xplns/"><application>Xplns</application></ulink> &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478;&#2463;&#2495;
 &#2447;&#2453;&#2509;&#2488; &#2441;&#2439;&#2472;&#2509;&#2465;&#2507; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503;&#2480; &#2474;&#2480;&#2509;&#2470;&#2494;&#2527; &#2437;&#2476;&#2495;&#2453;&#2482; &#2468;&#2494;&#2480;&#2494;&#2478;&#2527; &#2438;&#2453;&#2494;&#2486; &#2475;&#2497;&#2463;&#2495;&#2527;&#2503; &#2468;&#2507;&#2482;&#2503;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://www.lsw.uni-heidelberg.de/~rwichman/Nightfall.html"><application>NIghtfall</application></ulink>
 &#2472;&#2494;&#2478;&#2503;&#2480; &#2447;&#2439; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2476;&#2495;&#2487;&#2527;&#2453; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2463;&#2495;&#2468;&#2503; &#2486;&#2495;&#2453;&#2509;&#2487;&#2494; &#2451; &#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503; &#2476;&#2495;&#2472;&#2507;&#2470;&#2472;&#2503;&#2480; &#2458;&#2478;&#2468;&#2509;&#8205;&#2453;&#2494;&#2480; &#2488;&#2478;&#2472;&#2509;&#2476;&#2527; &#2456;&#2463;&#2494;&#2472;&#2507; &#2489;&#2527;&#2503;&#2459;&#2503;&#2404; &#2447;&#2463;&#2495; &#2460;&#2507;&#2524;&#2494;&#2468;&#2494;&#2480;&#2494;&#2480;
 &#2455;&#2509;&#2480;&#2489;&#2467;&#2453;&#2494;&#2482;&#2496;&#2472; &#2437;&#2509;&#2479;&#2494;&#2472;&#2495;&#2478;&#2503;&#2463;&#2503;&#2465; &#2458;&#2495;&#2468;&#2509;&#2480; &#2468;&#2504;&#2480;&#2496; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;, &#2474;&#2494;&#2480;&#2503; &#2488;&#2495;&#2472;&#2469;&#2503;&#2463;&#2495;&#2453; &#2482;&#2494;&#2439;&#2463;&#2453;&#2494;&#2480;&#2509;&#2477; &#2451; &#2480;&#2503;&#2465;&#2495;&#2527;&#2494;&#2482; &#2477;&#2503;&#2482;&#2507;&#2488;&#2495;&#2463;&#2495; &#2453;&#2494;&#2480;&#2509;&#2477; &#2489;&#2495;&#2488;&#2494;&#2476; &#2453;&#2480;&#2468;&#2503; - &#2447;&#2476;&#2434; &#2447;&#2488;&#2476;&#2503;&#2480;
 &#2451;&#2474;&#2480; &#2477;&#2495;&#2468;&#2509;&#2468;&#2495; &#2453;&#2480;&#2503; &#2455;&#2509;&#2480;&#2489;&#2467;&#2453;&#2494;&#2482;&#2496;&#2472; &#2460;&#2507;&#2524;&#2494;&#2468;&#2494;&#2480;&#2494;&#2480; &#2474;&#2480;&#2509;&#2479;&#2476;&#2503;&#2453;&#2509;&#2487;&#2467; &#2482;&#2476;&#2509;&#2471; &#2468;&#2469;&#2509;&#2479;&#2503;&#2480; &#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2468;&#2503; &#2476;&#2503;&#2488;&#2509;&#2463;&#2475;&#2495;&#2463; &#2478;&#2465;&#2503;&#2482; &#2468;&#2504;&#2480;&#2496; &#2453;&#2480;&#2468;&#2503;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://nova.sourceforge.net"><application>NOVA</application></ulink> &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2463;&#2495; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2470;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;
 &#2447;&#2453;&#2463;&#2495; &#2488;&#2478;&#2472;&#2509;&#2476;&#2495;&#2468; &#2474;&#2480;&#2509;&#2479;&#2476;&#2503;&#2453;&#2509;&#2487;&#2467; &#2476;&#2509;&#2479;&#2476;&#2488;&#2509;&#2469;&#2494; &#2438;&#2480; &#2447;&#2463;&#2495; &#2474;&#2494;&#2451;&#2527;&#2494; &#2479;&#2494;&#2527; &#2488;&#2478;&#2509;&#2474;&#2498;&#2480;&#2509;&#2467; &#2476;&#2495;&#2472;&#2494;&#2478;&#2498;&#2482;&#2509;&#2479;&#2503;&#2404; </para>
        </listitem>
 
      </itemizedlist>   
    </sect2>

    <sect2 id="hand-held">
      <title> &#2453;&#2509;&#2487;&#2497;&#2470;&#2509;&#2480; &#2451; &#2476;&#2489;&#2472;&#2479;&#2507;&#2455;&#2509;&#2479; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472; </title>

      <para> &#2489;&#2494;&#2468;&#2503;&#2480; &#2468;&#2494;&#2482;&#2497;&#2468;&#2503; &#2476;&#2489;&#2472;&#2479;&#2507;&#2455;&#2509;&#2479; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503;&#2480; &#2438;&#2471;&#2495;&#2474;&#2468;&#2509;&#2479; &#2470;&#2495;&#2472; &#2470;&#2495;&#2472; &#2476;&#2494;&#2524;&#2459;&#2503;&#2404; &#2438;&#2480; &#2447; &#2471;&#2480;&#2472;&#2503;&#2480; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503;&#2480; &#2460;&#2455;&#2468;&#2503;&#2451; &#2474;&#2509;&#2480;&#2476;&#2503;&#2486; &#2453;&#2480;&#2503;&#2459;&#2503;
 &#2482;&#2495;&#2472;&#2509;&#2479;&#2494;&#2453;&#2509;&#2488;&#2404; </para> 

      <itemizedlist>
        <listitem>
          <para> &#2486;&#2494;&#2480;&#2509;&#2474; &#2460;&#2480;&#2497;&#2488; &#2474;&#2495;&#2465;&#2495;&#2447;'&#2480; &#2460;&#2472;&#2509;&#2479; &#2453;&#2509;&#2482;&#2495;&#2527;&#2494;&#2480; &#2488;&#2509;&#2453;&#2494;&#2439; &#2439;&#2472;&#2488;&#2509;&#2463;&#2495;&#2463;&#2495;&#2441;&#2463; &#2468;&#2504;&#2480;&#2495; &#2453;&#2480;&#2503;&#2459;&#2503; <ulink url="http://www.clearskyinstitute.com/psc/">
 &#2476;&#2509;&#2479;&#2453;&#2509;&#2468;&#2495;&#2455;&#2468; &#2454;-&#2478;&#2494;&#2472;&#2458;&#2495;&#2468;&#2509;&#2480;</ulink>. </para>
        </listitem>
      </itemizedlist>
    </sect2>
  
    <sect2 id="simulator-software">
      <title> &#2488;&#2495;&#2478;&#2497;&#2482;&#2503;&#2463;&#2480; </title>

      <para> &#2447;&#2439; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478;&#2455;&#2497;&#2482;&#2507; &#2472;&#2495;&#2460;&#2503;&#2470;&#2503;&#2480; &#2488;&#2495;&#2478;&#2497;&#2482;&#2503;&#2463;&#2480; &#2476;&#2482;&#2503; &#2470;&#2494;&#2476;&#2496; &#2453;&#2480;&#2503;&#2404; </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://www.shatters.net/celestia/"><application>Celestia</application></ulink> &#2478;&#2489;&#2494;&#2486;&#2498;&#2472;&#2509;&#2479;&#2503;&#2480; &#2480;&#2495;&#2527;&#2503;&#2482;&#2463;&#2494;&#2439;&#2478;
 &#2488;&#2495;&#2478;&#2497;&#2482;&#2503;&#2486;&#2472; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472; &#2453;&#2480;&#2503;&#2404; &#2441;&#2439;&#2472;&#2509;&#2465;&#2507;&#2488; &#2451; &#2439;&#2441;&#2472;&#2495;&#2453;&#2509;&#2488; (&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;) &#2441;&#2477;&#2527; &#2437;&#2474;&#2494;&#2480;&#2503;&#2463;&#2495;&#2434; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503;&#2439; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478;&#2463;&#2495; &#2458;&#2494;&#2482;&#2494;&#2472;&#2507; &#2479;&#2494;&#2527;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://openuniverse.sourceforge.net/"><application>OpenUniverse</application></ulink> &#2488;&#2508;&#2480;&#2460;&#2455;&#2468;&#2503;&#2480;
 &#2476;&#2488;&#2509;&#2468;&#2497;&#2488;&#2478;&#2498;&#2489;&#2503;&#2480; &#2468;&#2509;&#2480;&#2495;&#2478;&#2494;&#2468;&#2509;&#2480;&#2495;&#2453; &#2488;&#2495;&#2478;&#2497;&#2482;&#2503;&#2486;&#2472; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472; &#2453;&#2480;&#2503;&#2404; &#2447;&#2439; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478;&#2463;&#2495; &#2441;&#2439;&#2472;&#2509;&#2465;&#2507;&#2488; &#2451; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2437;&#2474;&#2494;&#2480;&#2503;&#2463;&#2495;&#2434; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; &#2458;&#2494;&#2482;&#2494;&#2472;&#2507; &#2479;&#2494;&#2527;&#2404; </para>
        </listitem>
      </itemizedlist>
    </sect2>


    <sect2 id="image-processing">
      <title> &#2458;&#2495;&#2468;&#2509;&#2480; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494;&#2453;&#2480;&#2467; </title>

      <itemizedlist>
        <listitem>
          <para> &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2468;&#2469;&#2509;&#2479; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494;&#2453;&#2480;&#2467; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; (<application><acronym>AIPS</acronym></application>) &#2489;&#2482; &#2474;&#2503;&#2486;&#2494;&#2470;&#2494;&#2480;
 &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2470;&#2503;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2447;&#2453;&#2463;&#2495; &#2437;&#2468;&#2509;&#2479;&#2472;&#2509;&#2468; &#2486;&#2453;&#2509;&#2468;&#2495;&#2486;&#2494;&#2482;&#2496; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2404; &#2447;&#2463;&#2495; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2503; &#2476;&#2495;&#2488;&#2509;&#2468;&#2494;&#2480;&#2495;&#2468; &#2460;&#2494;&#2472;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2470;&#2503;&#2454;&#2497;&#2472;
 <ulink url="http://aips2.nrao.edu/docs/aips++.html">AIPS++</ulink>, &#2468;&#2476;&#2503; &#2482;&#2453;&#2509;&#2487;&#2467;&#2496;&#2527; &#2479;&#2503; <application>AIPS &#2453;&#2509;&#2482;&#2494;&#2488;&#2495;&#2453;</application> &#2472;&#2494;&#2478;&#2503;&#2451;
 &#2447;&#2453;&#2463;&#2495; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2438;&#2459;&#2503; &#2447;&#2476;&#2434; &#2468;&#2494; &#2472;&#2495;&#2527;&#2478;&#2495;&#2468; &#2480;&#2453;&#2509;&#2487;&#2467;&#2494;&#2476;&#2503;&#2453;&#2509;&#2487;&#2467; &#2453;&#2480;&#2494; &#2489;&#2527;&#2404;</para> 
        </listitem>

        <listitem>
          <para> &#2488;&#2453;&#2482; &#2453;&#2494;&#2460;&#2503;&#2480; &#2453;&#2494;&#2460;&#2496; <application>&#2455;&#2472;&#2497;&#2489; (GNU) &#2458;&#2495;&#2468;&#2509;&#2480; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494;&#2453;&#2494;&#2480;&#2453; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478;</application> (<acronym>GIMP</acronym>) 
 &#2479;&#2503;&#2453;&#2507;&#2472; &#2471;&#2480;&#2472;&#2503;&#2480; &#2458;&#2495;&#2468;&#2509;&#2480; &#2472;&#2495;&#2527;&#2503; &#2453;&#2494;&#2460; &#2453;&#2480;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479;&#2439; &#2447;&#2453;&#2463;&#2495; &#2458;&#2478;&#2468;&#2509;&#8205;&#2453;&#2494;&#2480; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478; &#2438;&#2480; &#2447;&#2453;&#2469;&#2494; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472; &#2476;&#2495;&#2487;&#2527;&#2453; &#2458;&#2495;&#2468;&#2509;&#2480;&#2503;&#2480; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503;&#2451; &#2488;&#2478;&#2494;&#2472;&#2477;&#2494;&#2476;&#2503; &#2474;&#2509;&#2480;&#2479;&#2507;&#2460;&#2509;&#2479;&#2404;
          </para>
        </listitem>
      </itemizedlist>
    </sect2>

    <sect2 id="sun-moon">
      <title> &#2458;&#2494;&#2433;&#2472;-&#2488;&#2497;&#2480;&#2497;&#2460; </title>

      <para> &#2476;&#2495;&#2488;&#2509;&#2478;&#2527;&#2453;&#2480; &#2476;&#2509;&#2479;&#2494;&#2474;&#2494;&#2480; &#2489;&#2482;, &#2486;&#2497;&#2471;&#2497;&#2478;&#2494;&#2468;&#2509;&#2480; &#2458;&#2494;&#2433;&#2470; &#2451; &#2488;&#2498;&#2480;&#2509;&#2479; &#2472;&#2495;&#2527;&#2503; &#2453;&#2494;&#2460; &#2453;&#2480;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479;&#2439; &#2480;&#2527;&#2503;&#2459;&#2503; &#2437;&#2472;&#2503;&#2453;&#2455;&#2497;&#2482;&#2507; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2404; </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://nis-www.lanl.gov/~mgh/WindowMaker/DockApps.shtml"><application>wmMoonClock</application>
 </ulink> &#2478;&#2507;&#2463;&#2494;&#2478;&#2497;&#2463;&#2495; &#2472;&#2495;&#2454;&#2497;&#2433;&#2468;&#2477;&#2494;&#2476;&#2503; &#2458;&#2494;&#2433;&#2470;&#2503;&#2480; &#2447;&#2475;&#2495;&#2478;&#2503;&#2480;&#2495;&#2488; &#2470;&#2503;&#2454;&#2494;&#2527;&#2404; &#2447;&#2459;&#2494;&#2524;&#2494; &#2447;&#2439; &#2451;&#2527;&#2503;&#2476;&#2488;&#2494;&#2439;&#2463;&#2463;&#2495;&#2468;&#2503; &#2438;&#2480;&#2507; &#2453;&#2495;&#2459;&#2497; &#2458;&#2478;&#2468;&#2509;&#8205;&#2453;&#2494;&#2480; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2480;&#2527;&#2503;&#2459;&#2503;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://www.paganlink.org/downloads/astronomy/xvmoontool.html"><application>XVMoontool</application>
 </ulink> &#2468;&#2494;&#2468;&#2509;&#8205;&#2453;&#2509;&#2487;&#2467;&#2495;&#2453;&#2477;&#2494;&#2476;&#2503; (Real time) &#2458;&#2494;&#2433;&#2470; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2468;&#2469;&#2509;&#2479; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472; &#2453;&#2480;&#2503;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://www.flaterco.com/xtide/"><application>XTide</application></ulink> &#2447;&#2453;&#2463;&#2495; &#2489;&#2494;&#2480;&#2478;&#2507;&#2472;&#2495;&#2453; &#2460;&#2507;&#2527;&#2494;&#2480;-&#2477;&#2494;&#2463;&#2494;
 &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2456;&#2524;&#2495;&#2404; &#2468;&#2494;&#2459;&#2494;&#2524;&#2494; &#2447;&#2463;&#2495; &#2460;&#2507;&#2527;&#2494;&#2480;-&#2477;&#2494;&#2463;&#2494;&#2480; &#2451;&#2474;&#2480; &#2477;&#2476;&#2495;&#2487;&#2509;&#2479;&#2468;&#2509;&#8205;&#2476;&#2494;&#2467;&#2496;&#2451; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2404; </para>
        </listitem>
      </itemizedlist>       
    </sect2>

    <sect2 id="software-library">
      <title> &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2468;&#2504;&#2480;&#2496;&#2480; &#2482;&#2494;&#2439;&#2476;&#2509;&#2480;&#2503;&#2480;&#2496; </title>

      <para> &#2447;&#2439; &#2474;&#2480;&#2495;&#2458;&#2509;&#2459;&#2503;&#2470;&#2503; &#2447;&#2478;&#2472; &#2453;&#2495;&#2459;&#2497; &#2482;&#2494;&#2439;&#2476;&#2509;&#2480;&#2503;&#2480;&#2496; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503; &#2438;&#2482;&#2507;&#2458;&#2472;&#2494; &#2453;&#2480;&#2503; &#2489;&#2482; &#2479;&#2494; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2476;&#2495;&#2487;&#2527;&#2453; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2468;&#2504;&#2480;&#2496;&#2468;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;
 &#2453;&#2480;&#2494; &#2479;&#2494;&#2527;&#2404;  </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://rlsp5.bnsc.rl.ac.uk/star/docs/sun67.htx/sun67.html#xref">SLALIB</ulink> &#2489;&#2482;
 <ulink url="http://start-www.rl.ac.uk">&#2488;&#2509;&#2463;&#2494;&#2480;&#2482;&#2495;&#2457;&#2509;&#2453; &#2474;&#2509;&#2480;&#2460;&#2503;&#2453;&#2509;&#2463;&#2503;&#2480;</ulink> &#2447;&#2453;&#2463;&#2495; &#2437;&#2434;&#2486; &#2479;&#2494; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2455;&#2467;&#2472;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2468;&#2504;&#2480;&#2496; &#2453;&#2480;&#2494; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472;
 &#2488;&#2494;&#2476;&#2480;&#2497;&#2463;&#2495;&#2472;&#2503;&#2480; &#2447;&#2453;&#2463;&#2495; &#2474;&#2480;&#2495;&#2474;&#2498;&#2480;&#2509;&#2467; &#2482;&#2494;&#2439;&#2476;&#2509;&#2480;&#2503;&#2480;&#2496; &#2488;&#2478;&#2494;&#2480;&#2507;&#2489;&#2404;
          </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://ascl.net">&#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;&#2475;&#2495;&#2460;&#2495;&#2453;&#2509;&#2488; &#2488;&#2507;&#2480;&#2509;&#2488;&#2453;&#2507;&#2465; &#2482;&#2494;&#2439;&#2476;&#2509;&#2480;&#2503;&#2480;&#2496;</ulink> &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2474;&#2470;&#2494;&#2480;&#2509;&#2469;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2480; &#2455;&#2494;&#2467;&#2495;&#2468;&#2495;&#2453; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2453;&#2495;&#2459;&#2497;
 &#2478;&#2465;&#2503;&#2482;&#2503;&#2480; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://hote104.ausys.se/pausch/comp/ppcomp.html">&#2455;&#2509;&#2480;&#2489;&#2494;&#2476;&#2488;&#2509;&#2469;&#2494;&#2472; &#2455;&#2467;&#2472;&#2494; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495;</ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://dimensional.com/~ashe/ccd-astro.html">&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; CCD &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;</ulink> SBIG &#2453;&#2509;&#2479;&#2494;&#2478;&#2503;&#2480;&#2494;
 &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2453;&#2495;&#2459;&#2497; &#2480;&#2497;&#2463;&#2495;&#2472;&#2503;&#2480; &#2447;&#2453;&#2463;&#2495; &#2482;&#2494;&#2439;&#2476;&#2509;&#2480;&#2503;&#2480;&#2496;&#2404; </para>
        </listitem>
      </itemizedlist>  
    </sect2>  

    <sect2 id="games-software">
      <title> &#2455;&#2503;&#2478;&#2509;&#8204;&#2488; </title>

      <para> &#2460;&#2495;, &#2455;&#2503;&#2478;&#2509;&#8204;&#2488;&#2451; &#2438;&#2459;&#2503;&#2404; </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://www.head-crash.com/orbit/"><application>Orbit</application></ulink> &#2472;&#2494;&#2478;&#2503;&#2480; &#2441;&#2439;&#2472;&#2509;&#2465;&#2507;&#2488; &#2451; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2503;
 &#2458;&#2482;&#2468;&#2503; &#2488;&#2453;&#2509;&#2487;&#2478; &#2447;&#2439; &#2455;&#2503;&#2478;&#2509;&#8204;&#2488;&#2463;&#2495;&#2468;&#2503; &#2438;&#2474;&#2472;&#2495; &#2489;&#2527;&#2503; &#2441;&#2464;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472; &#2478;&#2489;&#2494;&#2453;&#2494;&#2486;&#2503;&#2480; &#2447;&#2453; &#2460;&#2457;&#2509;&#2455;&#2496; &#2474;&#2494;&#2439;&#2482;&#2463;&#2404; </para>
        </listitem>
      </itemizedlist>  
    </sect2>  

    <sect2 id="other-software">
      <title> &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; </title>

      <para> &#2474;&#2509;&#2480;&#2468;&#2509;&#2479;&#2503;&#2453; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494;&#2468;&#2503;&#2439; '&#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479;' &#2472;&#2494;&#2478;&#2503; &#2447;&#2453;&#2463;&#2495; &#2474;&#2480;&#2495;&#2458;&#2509;&#2459;&#2503;&#2470; &#2469;&#2494;&#2453;&#2503; &#2438;&#2480; &#2447;&#2439; &#2482;&#2503;&#2454;&#2494;&#2463;&#2495;&#2451; &#2468;&#2494;&#2480; &#2476;&#2509;&#2479;&#2468;&#2495;&#2453;&#2509;&#2480;&#2478; &#2472;&#2527;&#2404; &#2468;&#2494;&#2439; &#2447;&#2454;&#2472; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503;&#2480;
 '&#2476;&#2495;&#2476;&#2495;&#2471;' &#2468;&#2494;&#2482;&#2495;&#2453;&#2494;&#2463;&#2495; &#2470;&#2503;&#2527;&#2494; &#2489;&#2482;&#2404; </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="htpp://irof.noao.edu"><application>IRAF</application></ulink> &#2447;&#2453;&#2463;&#2495; &#2476;&#2495;&#2486;&#2494;&#2482; &#2453;&#2495;&#2472;&#2509;&#2468;&#2497; &#2474;&#2509;&#2480;&#2458;&#2472;&#2509;&#2465; &#2453;&#2509;&#2487;&#2478;&#2468;&#2494;&#2486;&#2494;&#2482;&#2496;
 &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2476;&#2495;&#2486;&#2509;&#2482;&#2503;&#2487;&#2467;&#2496; &#2476;&#2509;&#2479;&#2476;&#2488;&#2509;&#2469;&#2494;, &#2455;&#2468; &#2536;&#2534; &#2476;&#2459;&#2480; &#2479;&#2494;&#2476;&#2468;&#2509;&#8205; &#2479;&#2494;&#2480; &#2468;&#2504;&#2480;&#2496; &#2451; &#2441;&#2472;&#2509;&#2472;&#2527;&#2472; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494; &#2458;&#2494;&#2482;&#2495;&#2527;&#2503; &#2479;&#2494;&#2458;&#2509;&#2459;&#2503;&#2472; <acronym>NOAO</acronym>'&#2480; &#2474;&#2509;&#2480;&#2494;&#2453;&#2509;&#2468;&#2472; &#2453;&#2480;&#2509;&#2478;&#2496;
 <personname> <firstname>&#2465;&#2508;&#2455;</firstname><surname>&#2463;&#2503;&#2465;&#2495;</surname> </personname>&#2404; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2480; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2486;&#2494;&#2454;&#2494;&#2527; &#2468;&#2469;&#2509;&#2479;
 &#2476;&#2495;&#2486;&#2509;&#2482;&#2503;&#2487;&#2467;&#2503; &#2472;&#2495;&#2476;&#2503;&#2470;&#2495;&#2468; &#2472;&#2503;&#2468;&#2499;&#2488;&#2509;&#2469;&#2494;&#2472;&#2496;&#2527; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2455;&#2467;&#2503;&#2480; &#2437;&#2488;&#2434;&#2454;&#2509;&#2479; &#2455;&#2497;&#2480;&#2497;&#2468;&#2509;&#2476;&#2474;&#2498;&#2480;&#2509;&#2467; &#2437;&#2476;&#2470;&#2494;&#2472;&#2503; &#2447;&#2463;&#2495; &#2474;&#2480;&#2495;&#2474;&#2498;&#2480;&#2509;&#2467;&#2404; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2468;&#2469;&#2509;&#2479; &#2476;&#2495;&#2486;&#2509;&#2482;&#2503;&#2487;&#2467;&#2503; &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2495;
 &#2474;&#2509;&#2480;&#2458;&#2472;&#2509;&#2465; &#2438;&#2455;&#2509;&#2480;&#2489;&#2496; &#2489;&#2472; &#2451; &#2474;&#2509;&#2480;&#2458;&#2497;&#2480; &#2488;&#2478;&#2527; &#2476;&#2509;&#2479;&#2527; &#2453;&#2480;&#2503; &#2469;&#2494;&#2453;&#2503;&#2472;, &#2468;&#2476;&#2503; &#2447;&#2439; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2463;&#2495; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2503; &#2438;&#2474;&#2472;&#2495; &#2454;&#2497;&#2476;&#2439; &#2441;&#2474;&#2453;&#2499;&#2468; &#2489;&#2476;&#2503;&#2472;&#2404; </para>
        </listitem>

        <listitem>
          <para> &#2455;&#2509;&#2489;&#2455;&#2509;&#2480;&#2489;&#2467;&#2480;&#2468; &#2460;&#2507;&#2524;&#2494;&#2468;&#2494;&#2480;&#2494; &#2476;&#2495;&#2487;&#2527;&#2453; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478; 
 <ulink url="http://www.lsw.uni-heidelberg.de/~rwichman/Nightfall.html"><application>Nightfall</application></ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://xplanet.sourceforge.net"><application>Xplanet</application></ulink> &#2474;&#2499;&#2469;&#2495;&#2476;&#2496;, &#2458;&#2494;&#2433;&#2470; &#2451; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; &#2455;&#2509;&#2480;&#2489;&#2503;&#2480;
 &#2437;&#2468;&#2509;&#2479;&#2472;&#2509;&#2468; &#2476;&#2494;&#2488;&#2509;&#2468;&#2476; &#2458;&#2495;&#2468;&#2509;&#2480; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472; &#2453;&#2480;&#2503;&#2404; &#2447;&#2463;&#2495; &#2458;&#2494;&#2482;&#2494;&#2468;&#2503; &#2447;&#2453;&#2509;&#2488; &#2441;&#2439;&#2472;&#2509;&#2465;&#2507; &#2451; &#2451;&#2474;&#2503;&#2472;&#2460;&#2495;&#2447;&#2482; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://www.princeton.edu/~kmaccarty/starplot.html"><application>Starplot</application></ulink> &#2447;&#2453;&#2463;&#2495;
 &#2468;&#2509;&#2480;&#2495;&#2478;&#2494;&#2468;&#2509;&#2480;&#2495;&#2453; &#2468;&#2494;&#2480;&#2494;&#2458;&#2495;&#2468;&#2509;&#2480; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2453;&#2404; C++ &#2477;&#2494;&#2487;&#2494;&#2527; &#2482;&#2503;&#2454;&#2494; &#2447;&#2439; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478;&#2463;&#2495; &#2458;&#2494;&#2482;&#2494;&#2468;&#2503; Gtk+ &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2404; </para>
        </listitem>

      </itemizedlist>  
    </sect2>
  </sect1>

  <sect1 id="online">
    <title> &#2437;&#2472;&#2482;&#2494;&#2439;&#2472; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2458;&#2480;&#2509;&#2458;&#2494; </title>

    <para> &#2479;&#2470;&#2495;&#2451; &#2438;&#2478;&#2480;&#2494; &#2474;&#2509;&#2480;&#2469;&#2478;&#2503;&#2439; &#2476;&#2482;&#2503;&#2459;&#2495; &#2479;&#2503;, &#2451;&#2527;&#2503;&#2476;&#2488;&#2494;&#2439;&#2463;&#2503;&#2480; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494; &#2468;&#2504;&#2480;&#2496; &#2453;&#2480;&#2494; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2441;&#2470;&#2509;&#2470;&#2503;&#2486;&#2509;&#2479; &#2472;&#2527;, &#2453;&#2495;&#2472;&#2509;&#2468;&#2497; &#2468;&#2476;&#2497;&#2451; &#2453;&#2495;&#2459;&#2497; &#2451;&#2527;&#2503;&#2476;&#2488;&#2494;&#2439;&#2463;&#2503;&#2480; &#2472;&#2494;&#2478; &#2472;&#2494;
 &#2470;&#2495;&#2527;&#2503; &#2474;&#2494;&#2480;&#2494; &#2479;&#2494;&#2458;&#2509;&#2459;&#2503; &#2472;&#2494;&#2404; &#2453;&#2508;&#2468;&#2497;&#2489;&#2482;&#2507;&#2470;&#2509;&#2470;&#2496;&#2474;&#2453; &#2447;&#2439; &#2451;&#2527;&#2503;&#2476;&#2488;&#2494;&#2439;&#2463;&#2455;&#2497;&#2482;&#2507; &#2479;&#2503;&#2453;&#2507;&#2472; &#2471;&#2480;&#2472;&#2503;&#2480; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503;&#2480; &#2479;&#2503;&#2453;&#2507;&#2472; &#2437;&#2474;&#2494;&#2480;&#2503;&#2463;&#2495;&#2434; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478; &#2469;&#2503;&#2453;&#2503;&#2439; &#2474;&#2524;&#2494; &#2479;&#2494;&#2527;
 - &#2486;&#2497;&#2471;&#2497; &#2447;&#2453;&#2463;&#2495; &#2476;&#2509;&#2480;&#2494;&#2441;&#2460;&#2494;&#2480; &#2469;&#2494;&#2453;&#2482;&#2503;&#2439; &#2489;&#2482;&#2404; &#2447;&#2439; &#2451;&#2527;&#2503;&#2476;&#2488;&#2494;&#2439;&#2463;&#2455;&#2497;&#2482;&#2507; &#2437;&#2472;&#2482;&#2494;&#2439;&#2472;&#2503;&#2439; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2458;&#2480;&#2509;&#2458;&#2494;&#2480; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2488;&#2497;&#2479;&#2507;&#2455; &#2474;&#2509;&#2480;&#2470;&#2494;&#2472; &#2453;&#2480;&#2503;&#2404; </para>

    <sect2 id="online-form">
      <title> &#2476;&#2489;&#2497;&#2482; &#2474;&#2509;&#2480;&#2458;&#2482;&#2495;&#2468; &#2475;&#2480;&#2509;&#2478; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496; &#2451;&#2527;&#2503;&#2476;&#2474;&#2503;&#2460; </title>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://aa.usno.navy.mil/data/docs/RS_OneYear.html">&#2458;&#2472;&#2509;&#2470;&#2509;&#2480; &#2451; &#2488;&#2498;&#2480;&#2509;&#2479;&#2503;&#2480; &#2441;&#2470;&#2527; &#2451; &#2437;&#2488;&#2509;&#2468;&#2503;&#2480; &#2488;&#2478;&#2527; &#2455;&#2467;&#2472;&#2494;&#2453;&#2494;&#2480;&#2496;
 &#2453;&#2509;&#2479;&#2494;&#2482;&#2453;&#2497;&#2482;&#2503;&#2463;&#2480;</ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://aa.usno.navy.mil/data/docs/WebMICA_2.html">MICA &#2447;&#2480; &#2451;&#2527;&#2503;&#2476; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;</ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://ssd.jpl.nasa.gov/cgi-bin/eph">JPL &#2447;&#2475;&#2495;&#2478;&#2503;&#2480;&#2495;&#2488; &#2441;&#2468;&#2509;&#8205;&#2474;&#2494;&#2470;&#2453;</ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://space.jpl.nasa.gov">&#2488;&#2508;&#2480;&#2460;&#2455;&#2468;&#2509;&#8205; &#2488;&#2495;&#2478;&#2497;&#2482;&#2503;&#2463;&#2480;</ulink> </para>
        </listitem>

        <listitem>
          <para> &#2453;&#2507;&#2472; &#2476;&#2495;&#2486;&#2503;&#2487; &#2437;&#2476;&#2488;&#2509;&#2469;&#2494;&#2472;&#2503;&#2480; &#2438;&#2453;&#2494;&#2486; &#2453;&#2454;&#2472; &#2478;&#2503;&#2456;&#2478;&#2497;&#2453;&#2509;&#2468; &#2438;&#2480; &#2453;&#2454;&#2472; &#2478;&#2503;&#2456;&#2478;&#2527; &#2469;&#2494;&#2453;&#2476;&#2503; &#2468;&#2494; &#2447;&#2453;&#2472;&#2460;&#2480;&#2503; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472; &#2453;&#2480;&#2503; 
 <ulink url="http://www.cleardarksky.com/csk">&#2453;&#2509;&#2482;&#2495;&#2527;&#2494;&#2480; &#2488;&#2509;&#2453;&#2494;&#2439; &#2474;&#2480;&#2495;&#2476;&#2503;&#2486;&#2495;&#2468; &#2456;&#2524;&#2495;</ulink>  </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://simbad.harvard.edu/cgi-bin/WSimbad.pl">&#2488;&#2495;&#2478;&#2476;&#2494;&#2470;</ulink> &#2447;&#2453;&#2463;&#2495; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2476;&#2495;&#2487;&#2527;&#2453; &#2465;&#2494;&#2463;&#2494;&#2476;&#2503;&#2488; &#2479;&#2494;
 &#2488;&#2508;&#2480;&#2460;&#2455;&#2468;&#2509;&#8205; &#2476;&#2489;&#2495;&#2480;&#2509;&#2477;&#2498;&#2468; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2454;-&#2476;&#2488;&#2509;&#2468;&#2497; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2495;&#2468; &#2474;&#2509;&#2480;&#2494;&#2469;&#2478;&#2495;&#2453; &#2468;&#2469;&#2509;&#2479;, &#2474;&#2480;&#2488;&#2509;&#2474;&#2480; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2495;&#2468; &#2488;&#2472;&#2494;&#2453;&#2509;&#2468;&#2453;&#2480;&#2467; (Cross-identification) &#2451; &#2455;&#2509;&#2480;&#2472;&#2509;&#2469;&#2488;&#2498;&#2468;&#2509;&#2480; &#2474;&#2509;&#2480;&#2470;&#2494;&#2472; &#2453;&#2480;&#2503;&#2404;</para>
        </listitem> 
      </itemizedlist>
    </sect2>

    <sect2 id="online-Japplet">  
      <title> &#2460;&#2494;&#2477;&#2494; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2503;&#2463; </title>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://www.sweethome.de/giesen/GeoAstro/GeoAstro.html"><personname><firstname>&#2460;&#2497;&#2480;&#2455;&#2503;&#2472;</firstname>
 <surname>&#2455;&#2503;&#2439;&#2527;&#2494;&#2472;&#2503;&#2480;</surname></personname> GeoAstro &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2503;&#2463; &#2488;&#2434;&#2455;&#2509;&#2480;&#2489;</ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://aladin.u-strasbg.fr">&#2438;&#2482;&#2494;&#2470;&#2495;&#2472; &#2439;&#2472;&#2509;&#2463;&#2494;&#2480;&#2437;&#2509;&#2479;&#2494;&#2453;&#2463;&#2495;&#2477;&#2503;&#2480; &#2454;-&#2478;&#2494;&#2472;&#2458;&#2495;&#2468;&#2509;&#2480;</ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://www.astro.queensu.ca/~dursi/dm-tutorial/cluster-sim.html">&#2453;&#2509;&#2482;&#2494;&#2488;&#2509;&#2463;&#2494;&#2480; &#2488;&#2495;&#2478;&#2497;&#2482;&#2503;&#2463;&#2480;</ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://www.phys.vt.edu/~jhs/SIP">&#2454;-&#2458;&#2495;&#2468;&#2509;&#2480; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494;&#2453;&#2494;&#2480;&#2453;</ulink> </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://liftoff.msfc.nasa.gov/RealTime/JTrack/3D/JTrack3D.html">J-Track 3D - &#2441;&#2474;&#2455;&#2509;&#2480;&#2489;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503;
 &#2479;&#2507;&#2455;&#2494;&#2479;&#2507;&#2455; &#2476;&#2509;&#2479;&#2476;&#2488;&#2509;&#2469;&#2494;</ulink> </para>
        </listitem>
      </itemizedlist>  
    </sect2>
  </sect1>

  <sect1 id="image">
    <title> &#2451;&#2527;&#2503;&#2476;&#2503; &#2459;&#2524;&#2495;&#2527;&#2503; &#2469;&#2494;&#2453;&#2494; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2476;&#2495;&#2487;&#2527;&#2453; &#2458;&#2495;&#2468;&#2509;&#2480;&#2494;&#2476;&#2482;&#2496; </title>
 
    <para> &#2479;&#2503;&#2453;&#2507;&#2472; &#2471;&#2480;&#2472;&#2503;&#2480; &#2476;&#2509;&#2480;&#2494;&#2441;&#2460;&#2494;&#2480; &#2469;&#2503;&#2453;&#2503;&#2439; &#2479;&#2503;&#2472; <acronym>FITS</acronym> &#2447;&#2480; &#2478;&#2468; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2476;&#2495;&#2487;&#2527;&#2453; &#2476;&#2495;&#2486;&#2503;&#2487; &#2471;&#2480;&#2472;&#2503;&#2480; &#2458;&#2495;&#2468;&#2509;&#2480;&#2503;&#2480; &#2475;&#2494;&#2439;&#2482;
 &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472; &#2453;&#2480;&#2494; &#2479;&#2494;&#2527; &#2488;&#2503;&#2460;&#2472;&#2509;&#2479; &#2438;&#2460;&#2453;&#2494;&#2482; &#2476;&#2503;&#2486; &#2458;&#2503;&#2487;&#2509;&#2463;&#2494; &#2458;&#2482;&#2459;&#2503;&#2404; &#2447;&#2454;&#2494;&#2472;&#2503; &#2453;&#2495;&#2459;&#2497; &#2474;&#2527;&#2503;&#2472;&#2509;&#2463;&#2494;&#2480; &#2470;&#2503;&#2527;&#2494; &#2489;&#2482;&#2404; </para>

    <sect2 id="list">
      <title> &#2458;&#2495;&#2468;&#2509;&#2480;&#2468;&#2494;&#2482;&#2495;&#2453;&#2494; </title>

      <para> &#2489;&#2494;&#2480;&#2509;&#2477;&#2494;&#2480;&#2509;&#2465; &#2476;&#2495;&#2486;&#2509;&#2476;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2482;&#2527; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2476;&#2495;&#2487;&#2527;&#2453; &#2458;&#2495;&#2468;&#2509;&#2480; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472;&#2453;&#2494;&#2480;&#2496; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2476;&#2509;&#2480;&#2494;&#2441;&#2460;&#2494;&#2480; &#2451; &#2451;&#2527;&#2503;&#2476;&#2488;&#2494;&#2439;&#2463;&#2503;&#2480; &#2464;&#2495;&#2453;&#2494;&#2472;&#2494;&#2480; &#2447;&#2453;&#2463;&#2495; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494; &#2468;&#2504;&#2480;&#2496;
 &#2453;&#2480;&#2503;&#2459;&#2503;&#2404;
      </para>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://tdc-www.harvard.edu/astro.images.html">&#2451;&#2527;&#2503;&#2476;&#2503; &#2474;&#2509;&#2480;&#2494;&#2474;&#2509;&#2468; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2476;&#2495;&#2487;&#2527;&#2453; &#2458;&#2495;&#2468;&#2509;&#2480;</ulink> </para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>

  <sect1 id="organisation">
    <title> &#2488;&#2494;&#2434;&#2455;&#2464;&#2472;&#2495;&#2453; &#2453;&#2494;&#2480;&#2509;&#2479;&#2453;&#2509;&#2480;&#2478; </title>

    <itemizedlist>
      <listitem>
        <para> &#2474;&#2509;&#2480;&#2468;&#2495;&#2476;&#2459;&#2480; &#2437;&#2472;&#2497;&#2487;&#2509;&#2464;&#2495;&#2468; <ulink url="http://hea-www.harvard.edu/adass">Astronomical Data Analysis Software and System &#2476;&#2494;
 &#2488;&#2434;&#2453;&#2509;&#2487;&#2474;&#2503; <acronym>ADASS</acronym></ulink>, &#2488;&#2478;&#2509;&#2478;&#2503;&#2482;&#2472;&#2463;&#2495; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2468;&#2469;&#2509;&#2479; &#2488;&#2434;&#2455;&#2509;&#2480;&#2489; &#2451; &#2476;&#2495;&#2486;&#2509;&#2482;&#2503;&#2487;&#2467;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;
 &#2437;&#2509;&#2479;&#2494;&#2482;&#2455;&#2507;&#2480;&#2495;&#2470;&#2478;, &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2451; &#2437;&#2474;&#2494;&#2480;&#2503;&#2463;&#2495;&#2434; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503;&#2480; &#2451;&#2474;&#2480; &#2453;&#2480;&#2509;&#2478;&#2480;&#2468; &#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472;&#2496; &#2451; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480; &#2476;&#2495;&#2486;&#2503;&#2487;&#2460;&#2509;&#2462;&#2470;&#2503;&#2480; &#2447;&#2453;&#2463;&#2495; &#2458;&#2478;&#2468;&#2509;&#8205;&#2453;&#2494;&#2480; &#2478;&#2495;&#2482;&#2472;&#2488;&#2509;&#2469;&#2482;&#2404; &#2447;&#2468;&#2503; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472;
 &#2438;&#2482;&#2507;&#2458;&#2472;&#2494;, &#2455;&#2476;&#2503;&#2487;&#2467;&#2494;&#2478;&#2498;&#2482;&#2453; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2474;&#2494;&#2464;, &#2474;&#2507;&#2488;&#2509;&#2463;&#2494;&#2480; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472;&#2496;, &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496; &#2451; &#2476;&#2495;&#2486;&#2503;&#2487; &#2476;&#2495;&#2486;&#2503;&#2487; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2438;&#2455;&#2509;&#2480;&#2489;&#2496;&#2470;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2482;&#2507;&#2458;&#2472;&#2494;&#2458;&#2453;&#2509;&#2480;
 (<quote>BOFs</quote>) &#2437;&#2472;&#2497;&#2487;&#2509;&#2464;&#2495;&#2468; &#2489;&#2527;&#2404; &#2447;&#2488;&#2476; &#2453;&#2495;&#2459;&#2497;&#2480; &#2482;&#2453;&#2509;&#2487;&#2509;&#2479; &#2489;&#2482; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2476;&#2495;&#2486;&#2503;&#2487;&#2460;&#2509;&#2462; &#2451; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496;&#2470;&#2503;&#2480; &#2478;&#2471;&#2509;&#2479;&#2503; &#2478;&#2468; &#2476;&#2495;&#2472;&#2495;&#2478;&#2527;&#2503;&#2480; &#2488;&#2497;&#2479;&#2507;&#2455; &#2453;&#2480;&#2503;
 &#2470;&#2503;&#2527;&#2494;&#2480; &#2478;&#2494;&#2471;&#2509;&#2479;&#2478;&#2503; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2460;&#2509;&#2462;&#2494;&#2472;&#2476;&#2495;&#2487;&#2527;&#2453; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503;&#2480; &#2441;&#2472;&#2509;&#2472;&#2527;&#2472; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494;&#2453;&#2503; &#2438;&#2480;&#2507; &#2468;&#2509;&#2476;&#2480;&#2494;&#2472;&#2509;&#2476;&#2495;&#2468; &#2453;&#2480;&#2494;&#2404; </para>
      </listitem>

      <listitem>
        <para> &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507; &#2478;&#2503;&#2439;&#2482;&#2495;&#2434; &#2482;&#2495;&#2488;&#2509;&#2463;, <email>linuxastro@majordomo.cv.nrao.edu</email> &#2489;&#2482; &#2468;&#2494;&#2470;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2479;&#2494;&#2480;&#2494;
 &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2476;&#2495;&#2487;&#2527;&#2453; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2453;&#2503; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2503; &#2474;&#2507;&#2480;&#2509;&#2463; &#2453;&#2480;&#2468;&#2503; &#2458;&#2494;&#2472;&#2404; &#2447;&#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2503; &#2438;&#2480;&#2507; &#2460;&#2494;&#2472;&#2468;&#2503; &#2458;&#2494;&#2439;&#2482;&#2503; &#2470;&#2503;&#2454;&#2497;&#2472;
 <ulink url="http://bima.astro.umd.edu/nemo/linuxastro">&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2437;&#2509;&#2479;&#2494;&#2488;&#2509;&#2463;&#2509;&#2480;&#2507;</ulink> </para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="HW-control">
    <title> &#2479;&#2472;&#2509;&#2468;&#2509;&#2480;&#2474;&#2494;&#2468;&#2495; &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467; </title>

    <para> &#2438;&#2460;&#2453;&#2494;&#2482; &#2437;&#2472;&#2503;&#2453;&#2503;&#2439; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2458;&#2480;&#2509;&#2458;&#2494;&#2527; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2479;&#2472;&#2509;&#2468;&#2509;&#2480;&#2474;&#2494;&#2468;&#2495; &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467;&#2503; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2459;&#2503;&#2472;&#2404; &#2447; &#2471;&#2480;&#2472;&#2503;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496;&#2470;&#2503;&#2480; &#2478;&#2471;&#2509;&#2479;&#2503;
 &#2479;&#2503;&#2478;&#2472; &#2488;&#2508;&#2454;&#2495;&#2472; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2455;&#2467; &#2480;&#2527;&#2503;&#2459;&#2503;&#2472;, &#2468;&#2503;&#2478;&#2472;&#2495; &#2480;&#2527;&#2503;&#2459;&#2503; &#2474;&#2503;&#2486;&#2494;&#2470;&#2494;&#2480; &#2478;&#2494;&#2472;&#2478;&#2472;&#2509;&#2470;&#2495;&#2480;&#2455;&#2497;&#2482;&#2507;&#2451;&#2404; </para>

    <sect2 id="telescope">
      <title> &#2463;&#2503;&#2482;&#2495;&#2488;&#2509;&#2453;&#2507;&#2474; &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467; </title>

      <itemizedlist>
        <listitem>
          <para> <ulink url="http://ktelescope.sf.net/">KTelescope</ulink> &#2489;&#2482; Meade &#2447;&#2480; LX200 &#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2463;&#2503;&#2482;&#2495;&#2488;&#2509;&#2453;&#2507;&#2474; &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2479;&#2507;&#2455;&#2509;&#2479;
 &#2447;&#2453;&#2463;&#2495; &#2482;&#2494;&#2439;&#2476;&#2509;&#2480;&#2503;&#2480;&#2496;&#2404;</para>
        </listitem>

        <listitem>
          <para> <ulink url="http://clearskyinstitute.com/xephem"><application>XEphem</application></ulink> &#2463;&#2503;&#2482;&#2495;&#2488;&#2509;&#2453;&#2507;&#2474; &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467;&#2453;&#2494;&#2480;&#2496;
 &#2465;&#2503;&#2478;&#2507; &#2474;&#2509;&#2480;&#2488;&#2503;&#2488;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503; &#2479;&#2507;&#2455;&#2494;&#2479;&#2507;&#2455; &#2451; &#2488;&#2478;&#2472;&#2509;&#2476;&#2527; &#2480;&#2453;&#2509;&#2487;&#2494; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2404; </para>
        </listitem>
      </itemizedlist>
    </sect2>

    <sect2 id="CCD">
      <title> <acronym>CCD</acronym> &#2453;&#2509;&#2479;&#2494;&#2478;&#2503;&#2480;&#2494; &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467; </title>

      <itemizedlist>
        <listitem>
       <para> <ulink url="http://www.apogee-ccd.com/software.html">&#2437;&#2509;&#2479;&#2494;&#2474;&#2507;&#2455;&#2496; &#2439;&#2472;&#2488;&#2509;&#2463;&#2509;&#2480;&#2497;&#2478;&#2503;&#2472;&#2509;&#2463;&#2509;&#8204;&#2488; &#2439;&#2457;&#2509;&#2453;</ulink> &#2468;&#2494;&#2470;&#2503;&#2480; &#2474;&#2503;&#2486;&#2494;&#2470;&#2494;&#2480;&#2496; CCD
 &#2453;&#2509;&#2479;&#2494;&#2478;&#2503;&#2480;&#2494;&#2455;&#2497;&#2482;&#2507; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2469;&#2503;&#2453;&#2503; &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467;&#2503;&#2480; &#2488;&#2497;&#2476;&#2495;&#2471;&#2494; &#2470;&#2503;&#2527;&#2404; </para>
        </listitem>

        <listitem>
          <para> &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2465;&#2495;&#2477;&#2494;&#2439;&#2488; &#2465;&#2509;&#2480;&#2494;&#2439;&#2477;&#2494;&#2480;&#2488;&#2489; CCD &#2453;&#2509;&#2479;&#2494;&#2478;&#2503;&#2480;&#2494; &#2451; &#2475;&#2495;&#2482;&#2509;&#2463;&#2494;&#2480; &#2458;&#2453;&#2509;&#2480; &#2474;&#2509;&#2480;&#2488;&#2509;&#2468;&#2497;&#2468; &#2453;&#2480;&#2503; &#2469;&#2494;&#2453;&#2503; 
 <ulink url="http://www.fli-cam.com">&#2475;&#2495;&#2457;&#2509;&#2455;&#2494;&#2480; &#2482;&#2503;&#2453;&#2488;&#2509;&#8204; &#2439;&#2472;&#2488;&#2509;&#2463;&#2509;&#2480;&#2497;&#2478;&#2503;&#2472;&#2509;&#2463;&#2503;&#2486;&#2472;</ulink> </para>
        </listitem>       

        <listitem>
        <para> <ulink url="http://www.sbig.com/sbwhtmls/linux_announcement.htm">SBIG</ulink> &#2468;&#2494;&#2470;&#2503;&#2480; ST7 &#2451; ST8 &#2478;&#2465;&#2503;&#2482;&#2503;&#2480; CCD
 &#2453;&#2509;&#2479;&#2494;&#2478;&#2503;&#2480;&#2494;&#2455;&#2497;&#2482;&#2507; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2469;&#2503;&#2453;&#2503; &#2458;&#2494;&#2482;&#2494;&#2472;&#2507;&#2480; &#2476;&#2509;&#2479;&#2494;&#2474;&#2494;&#2480;&#2503; &#2453;&#2495;&#2459;&#2497; &#2488;&#2489;&#2494;&#2527;&#2468;&#2494; &#2474;&#2509;&#2480;&#2470;&#2494;&#2472; &#2453;&#2480;&#2503;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://dimensional.com/~ashe/ccd-astro.html">&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; CCD &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2480;</ulink>&#2472;&#2509;&#2453; &#2451;&#2527;&#2503;&#2476;&#2474;&#2503;&#2460;&#2455;&#2497;&#2482;&#2507;&#2468;&#2503;
 CCD &#2453;&#2509;&#2479;&#2494;&#2478;&#2503;&#2480;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;, &#2458;&#2495;&#2468;&#2509;&#2480; &#2455;&#2509;&#2480;&#2489;&#2467; &#2451; &#2474;&#2509;&#2480;&#2488;&#2503;&#2488; &#2453;&#2480;&#2494;&#2480; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2470;&#2495;&#2453; &#2472;&#2495;&#2527;&#2503; &#2438;&#2482;&#2507;&#2458;&#2472;&#2494; &#2453;&#2480;&#2494; &#2489;&#2527;&#2503;&#2459;&#2503;&#2404; </para>
        </listitem>

        <listitem>
          <para> <ulink url="http://home.earthlink.net/~dschmenk"><application>Gccd</application></ulink> &#2447;&#2453;&#2463;&#2495; &#2455;&#2497;&#2489;&#2509;&#8204;&#2472;&#2507;&#2478;
 (<acronym>GNOME</acronym>) &#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478; &#2479;&#2494; CCD &#2453;&#2509;&#2479;&#2494;&#2478;&#2503;&#2480;&#2494; &#2451; &#2475;&#2495;&#2482;&#2509;&#2463;&#2494;&#2480; &#2458;&#2453;&#2509;&#2480; &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2489;&#2527;&#2404; </para>
        </listitem>

      </itemizedlist>
    </sect2>
  </sect1>

  <sect1 id="installation">
    <title> &#2488;&#2489;&#2460; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482;&#2503;&#2486;&#2472; </title>

    <para> &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2503; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; &#2438;&#2474;&#2472;&#2494;&#2453;&#2503; &#2460;&#2494;&#2472;&#2468;&#2503; &#2489;&#2476;&#2503;, &#2468;&#2476;&#2503; &#2453;&#2495;&#2459;&#2497; &#2453;&#2495;&#2459;&#2497; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2488;&#2489;&#2460; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; &#2438;&#2459;&#2503;&#2404;
 &#2447;&#2480;&#2453;&#2478; &#2453;&#2495;&#2459;&#2497; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495;&#2480; &#2441;&#2482;&#2509;&#2482;&#2503;&#2454; &#2453;&#2480;&#2494; &#2489;&#2482;&#2404; </para>

    <itemizedlist>
      <listitem>
        <para> <ulink url="http://bima.astro.umd.edu/nemo/linuxastro/astromake/"><application>AstroMake</application></ulink> &#2447;&#2453;&#2463;&#2495;
 &#2439;&#2441;&#2463;&#2495;&#2482;&#2495;&#2463;&#2495; &#2479;&#2494; &#2476;&#2489;&#2497;&#2482; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2476;&#2495;&#2487;&#2527;&#2453; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482;&#2503;&#2486;&#2472;&#2503;&#2480; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494;&#2453;&#2503;  &#2488;&#2489;&#2460; &#2453;&#2480;&#2503; &#2468;&#2507;&#2482;&#2503;&#2404; </para>
      </listitem>

      <listitem>
        <para> <application>XEphem</application> &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2474;&#2472;&#2494;&#2480; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503; &#2476;&#2503;&#2486; &#2453;&#2495;&#2459;&#2497; &#2475;&#2494;&#2439;&#2482; &#2469;&#2494;&#2453;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; &#2468;&#2476;&#2503;
 &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2463;&#2495;&#2480; &#2488;&#2495;&#2465;&#2495;&#2480;&#2478; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; &#2469;&#2503;&#2453;&#2503; &#2447;&#2463;&#2495; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494; &#2437;&#2472;&#2503;&#2453; &#2488;&#2489;&#2460;; &#2453;&#2494;&#2480;&#2467; &#2488;&#2495;&#2465;&#2495;&#2480;&#2478;&#2503; &#2447;&#2453;&#2463;&#2495; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482;&#2503;&#2486;&#2472; &#2488;&#2509;&#2453;&#2509;&#2480;&#2495;&#2474;&#2509;&#2463; &#2469;&#2494;&#2453;&#2503; &#2479;&#2494; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2463;&#2495;&#2480;
 &#2476;&#2494;&#2439;&#2472;&#2494;&#2480;&#2495; &#2475;&#2494;&#2439;&#2482; &#2451; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; &#2437;&#2468;&#2495;&#2480;&#2495;&#2453;&#2509;&#2468; &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507;&#2453;&#2503; &#2460;&#2494;&#2527;&#2455;&#2494;&#2478;&#2468; &#2488;&#2509;&#2469;&#2494;&#2474;&#2472; &#2453;&#2480;&#2503;&#2404; &#2447; &#2476;&#2509;&#2479;&#2494;&#2474;&#2494;&#2480;&#2503; &#2476;&#2495;&#2488;&#2509;&#2468;&#2494;&#2480;&#2495;&#2468; &#2476;&#2495;&#2476;&#2480;&#2467; &#2480;&#2527;&#2503;&#2459;&#2503;
 <ulink url="http://www.clearskyinstitute.com/ecommerce/xephem/order.html">XEphem &#2488;&#2495;&#2465;&#2495;&#2480;&#2478;&#2503;</ulink> </para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="research-projects">
    <title> &#2479;&#2503;&#2488;&#2476; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2489;&#2458;&#2509;&#2459;&#2503; </title>

    <para> &#2479;&#2503;&#2488;&#2453;&#2482; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2509;&#2479;&#2494;&#2476;&#2495;&#2487;&#2527;&#2453; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503;&#2480; &#2479;&#2472;&#2509;&#2468;&#2509;&#2480;&#2474;&#2494;&#2468;&#2495; &#2458;&#2494;&#2482;&#2494;&#2468;&#2503; &#2488;&#2478;&#2509;&#2474;&#2498;&#2480;&#2509;&#2467; &#2476;&#2494; &#2438;&#2434;&#2486;&#2495;&#2453;&#2477;&#2494;&#2476;&#2503; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2489;&#2458;&#2509;&#2459;&#2503;, &#2468;&#2494;&#2470;&#2503;&#2480; &#2447;&#2453;&#2463;&#2495; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494;
 &#2470;&#2503;&#2527;&#2494; &#2489;&#2482;&#2435; </para>

    <itemizedlist>
      <listitem>
        <para> <ulink url="http://www.chara.gsu.edu/CHARA/index.html">CHARA Array</ulink> &#2447;&#2453;&#2463;&#2495; &#2437;&#2474;&#2463;&#2495;&#2453;&#2509;&#2479;&#2494;&#2482; &#2439;&#2472;&#2509;&#2463;&#2494;&#2480;&#2475;&#2503;&#2480;&#2507;&#2478;&#2495;&#2463;&#2494;&#2480; &#2479;&#2494;&#2480;
 &#2472;&#2495;&#2527;&#2472;&#2509;&#2468;&#2509;&#2480;&#2467; &#2476;&#2509;&#2479;&#2476;&#2488;&#2509;&#2469;&#2494; &#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2472;&#2495;&#2480;&#2509;&#2477;&#2480;&#2404; </para>
      </listitem>

      <listitem>
        <para> <ulink url="http://www.eso.org/projects/caos"><acronym>CAOS</acronym></ulink> &#2437;&#2474;&#2463;&#2495;&#2453;&#2509;&#2479;&#2494;&#2482; &#2488;&#2509;&#2474;&#2503;&#2453;&#2463;&#2509;&#2480;&#2507;&#2488;&#2509;&#2453;&#2507;&#2474;&#2495;&#2468;&#2503;
 &#2441;&#2468;&#2509;&#8205;&#2488;&#2494;&#2489;&#2496; &#2488;&#2508;&#2454;&#2495;&#2472; &#2460;&#2509;&#2479;&#2507;&#2468;&#2495;&#2480;&#2509;&#2476;&#2495;&#2470;&#2470;&#2503;&#2480; &#2447;&#2453;&#2463;&#2495; &#2488;&#2434;&#2455;&#2464;&#2472;&#2404; </para>
      </listitem>
    </itemizedlist>
  </sect1>
</article>
