<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//DE">

<HTML lang="en">

<HEAD>
<META http-equiv="Content-Type" 
      content="text/html; charset=iso-8859-1">

<TITLE> LinuxFocus Januar 1999 </TITLE>
</HEAD>

<BODY bgcolor="#ffffff" 
      text="#000000" 
      alink="#336633" 
      link="#336633" 
      vlink="#336633">

<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../index.shtml">

<AREA shape="rect" 
      coords="423, 9, 457, 30" 
      alt="Map" 
      href="../map.html">

<AREA shape="rect" 
      coords="463, 9, 508, 30" 
      alt="Index" 
      href="../indice.html">

<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/index.html">

</MAP>

<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15" alt="News" href="../News/index.shtml">

<AREA shape="rect" coords="189, 0, 284, 15" alt="Archives" href="../Archives/index.html">

<AREA shape="rect" coords="319, 0, 395, 15" alt="Links" href="../Links/index.shtml">

<AREA shape="rect" 
      coords="436, 0,  523, 15" 
      alt="About LF" 
      href="../aboutus.html">
</MAP>


<!-- Top and Bottom navegation bars -->
<CENTER>
<IMG src="../../common/images/Topbar-en.gif" 
     width="600" 
     height="40" 
     border="0" 
     alt="[Top Bar]" 
     ismap 
     usemap="#top" >
<BR>

<IMG src="../../common/images/Bottombar-en.gif" 
     width="600" 
     height="21" 
     border="0" 
     alt="[Bottom Bar]" 
     ismap 
     usemap="#bottom">

</CENTER>


<TABLE align="center" 
       width="100%"  
       cellspacing="0" 
       cellpadding="5" 
       border="0">

       <TR>
       <TD>
       <H1>Januar 1999:   Einsatz von Linux im Bereich der Robotik</H1>
       </TD>       
       </TR>


       <TR valign="top">            <!-- Row 2 --> 

       <TD>


       <!-- Monthly cover illustration -->
       <IMG src="../../common/images/cover9.jpg"
            width="400"
	    height="281"
	    align="left">

	<H3>
	<FONT face="Helvetica, Arial" 
	      color="#660033">
	Editorial
	</FONT>
	</H3>
	von Ismael Ripoll<BR>

	<P>Zu Anfang nahm ich am LinuxFocus Projekt teil, weil ich der Meinung
	war, da&szlig; die spanisch sprechende Linux Gemeinde ein freies
	GNU/Linux Magazin brauchte. Damals waren die meisten LF Artikel
	urspr&uuml;nglich in Englisch geschrieben, die Hauptarbeit bestand darin,
	diese ins Spanische zu &uuml;bersetzen. Es war &uuml;berhaupt nicht abzusehen,
	da&szlig; eine so gro&szlig;e Resonanz von spanischen und latein-amerikanischen 
	Linuxern kommen w&uuml;rde. Der Erfolg wurde erst durch die gro&szlig;e Zahl von
	Helfern (momentan &uuml;ber 90!), die breite Leserschaft und der Erw&auml;hnung
	in der Fachpresse m&ouml;glich.</P>

	<p>
	Schon vor dem LinuxFocus lieferten Projekte wie LuCAS (Linux in
        CAStilian - "Linux in Spanisch") oder SLUG (Spanish Linux User Group)
	spanische Linux Dokumentation. Ihr Hauptziel war und ist es, Dokumentation
	im Rahmen des LDP (Linux Documentation Project), ins Spanische zu
	&uuml;bersetzen. Unser Ziel ist &auml;hnlich in dem Sinne, da&szlig;
	wir GNU/Linux relevante Texte in Spanisch verf&uuml;gbar machen.
	Allerdings haben wir auch einen "p&auml;dagogischen" Anspruch.
	Unserer Meinung nach kommt es nicht nur auf den technischen Inhalt der Artikel an,
	sondern auch auf die Art und Weise, wie diese Inoformationen pr&auml;sentiert
	werden.
	</p>

	<p>
	F&uuml;r alle Mitarbeiter ist der LinuxFocus mehr als nur ein
	Hobby und Vergn&uuml;gen. Vielmehr stellt er auch einen Weg dar,
	neue Bereiche zu erschlie&szlig;en. Autoren, &Uuml;bersetzer
	und Reviewer erweitern ihre Erfahrung und zeigen so
	ihr Wissen und ihre F&auml;higkeiten.  Diese Art von Wissen und
	Erfahrung wird heutzutage von vielen Firmen verlangt.
	</p>

	<p>
	LinuxFocus stellt einen Treffpunkt f&uuml;r Leute dar, die ihr Wissen
	mit anderen teilen wollen und Lesern, welche ein bisschen mehr wollen,
	als an der Oberfl&auml;che von Linux zu kratzen.
	</p>

	<IMG src="../../common/images/Esperanza-S.gif" 
	     width="154" 
	     height="205"
	     align = "left">

	<H3>
	<FONT face="Helvetica, Arial" 
	      color="#660033">
	 Willkommen zur&uuml;ck
	</FONT>
	</H3>
	     
	<p>
	Nach langer Abwesenheit kehrte Esperanza Sepulveda in den Scho&szlig;
	der LF Familie zur&uuml;ck. Ihre F&auml;higkeiten werden uns nicht nur
	qualitativ hochwertige Illustrationen bescheren, sondern auch bei der 
	Verminderung der Speichergr&ouml;&szlig;e und somit der Ladezeiten der
	Bilder helfen.
	</p>

	<p>
	Sie ist Grafikdesignerin und machten ihren Kunstabschlu&szlig; an
	der Facultad de Bellas Artes de Madrid. Sie ist weiterhin an dieser Hochschule
	t&auml;tig und nimmt an einem Forschungsprojekt &uuml;ber Kunst und digitale
	Medien teil.
	Sie ist Teil einer Gruppe der Abteilung f&uuml;r Grafikdesign und ist recht versiert
	im Bereich digitaler Nachbearbeitung und Design. Ihr Interesse am Internet als
	Kommunikationsmedium f&uuml;hrte sie zum LinuxFocus und machte sie zu einer wertvollen
	Mitarbeiterin. 
	</p>

	</TD>
	</TR>


	<TR>                   <!--  Row 3 -->

	<TD colspan="2">
	<HR size=1 noshade>

	<H3>
	<FONT face="Helvetica, Arial" 
	      color="#660033">
	Inhalt
	</FONT>
	</H3>
 
        <H4>
	<FONT face="Helvetica, Arial" 
              color="#660033">
        Hardware Review
        </FONT>
        </H4>
 
        <UL>
          <LI>

	    <A href="article73.html">
	    Ein selbstgesteuertes Fahrzeug auf der Basis von Linux,
	    </A> 
	    von
	    Vicente Egea, Jorge Garrido, Roberto Guzmán und Ranko Zotovic
	    <BR>
	Der Bereich der mobilen Robotik erlebte in den vergangenen Jahren ein 
	gewaltiges Wachstum. Viele Institute f&uuml;r Robotik, Mechatronik und 
	k&uuml;nstliche Intelligenz haben einen gro&szlig;en Teil ihrer Forschung auf 
	selbstgesteuerte Fahrzeuge ausgerichtet. Bis jetzt haben hohe 
	Entwicklungskosten ihren Einsatz auf die Raumfahrt, das Milit&auml;r, 
	Atomkraftwerke, usw. beschr&auml;nkt. Doch der erreichte Entwicklungsstand 
	erlaubt jetzt ihre Anwendung in kommerziellen Bereichen wie 
	Landwirtschaft, Industrie, Dienstleistungssektoren, Bergbau und Medizin. 
	Es handelt sich um eine Schl&uuml;sseltechnologie, die ein spektakul&auml;res 
	Wachstumspotential beinhaltet.
          </LI>


          <LI>

	    <A href="article75.html">
	    Die Happy Hacking Tastatur,
	    </A> 
	    von
	    <A mailto:"sepulveda@linuxfocus.org">
	    Miguel Angel Sepulveda</A>
	    <BR>

             "Happy Hacking" hei&szlig;t eine Tastatur, die von PFU American Inc.
	     gebaut wird und dem LinuxFocus zur Ansicht zugeschickt wurde.
	     In diesem Artikel werden einige Eindr&uuml;cke &uuml;ber diese
	     stabile und vielseitige Tastatur geschildert.

          </LI>

          <LI>

	    <A href="article74.html">
	    Installation und Konfiguration eines RAID Systemes,
	    </A> 
	    von
	    <A href="mailto:acastro@ctv.es"> 
	    Antonio Castro
	    </A>  
	    <BR>

            RAID (Redundant Array of Inexpensive Disks) 
	    besteht aus einer Reihe von Systemen, um eine Anzahl von Festplatten
	    so zu organisieren, da&szlig; sie sich wie eine einzelne Platte
	    verhalten. Dabei arbeiten die Ger&auml;te parallel, wodurch das
	    Zugriffsverhalten verbessert wird und die gespeicherten Daten
	    besser vor Zerst&ouml;rung geschützt sind.
          </LI>


        </UL>

        <H4>
	<FONT face="Helvetica, Arial" 
              color="#660033">
        UNIX Grundlagen
        </FONT>
        </H4>
 
        <UL>

          <LI>

	    <A href="article77.html">
	    Dateizugriffsrechte,
	    </A> 
	    von
	    <A href="mailto:guido@bearix.oche.de"> 
	    Guido Socher
	    </A>  
	    <BR>
	    Dieser Artikel teilt sich in zwei Teile: 
	    Der erste Teil (Einfache Dateizugriffsrechte) ist eine kurze Einf&uuml;hrung &uuml;ber Filezugriffsrechte unter
	    UNIX. Der zweite Teil (T-bits, SUID und SGID) behandelt sehr fortgeschrittene Features von Linux, die &uuml;ber die einfachen
	    &quot;read-write-execute&quot; Dateizugriffsbits hinausgehen.
          </LI>


        </UL>




        <H4>
	<FONT face="Helvetica, Arial" 
              color="#660033">
        Programmierung & Entwicklung
        </FONT>
        </H4>


        <UL>
          <LI>
	    <A href="article78.html">
	    Java, Teil II,
	    </A> 
	    von
	    <A href="mailto:josefdz@latinmail.com">
	    Jose Fernandez
	    </A>
	    <BR>
	    In diesem Teil der Serie geht der Autor weiter auf Datentypen,
	    Variablen, Kontrollanweisungen, usw. ein. Der Artikel f&uuml;hrt den Leser so 
	    zum wichtigsten Thema: der Klasse.

          </LI>
        </UL>


        <H4>
	<FONT face="Helvetica, Arial" 
              color="#660033">
        Software Review
        </FONT>
        </H4>
 
        <UL>
 	  
          <LI>
	    <A href="article76.html">
	   PG2CGI: WWW basierter Datenbankzugriff,
	    </A> 
	    von
	    <A href="mailto:luis.colorado@slug.ctv.es">
	    Luis Colorado
	    </A>
	    <BR>
            PG2CGI dient als Schnittstelle zwischen Datenbanken und
	    CGI Skripten. Der Autor stellt in diesem Artikel
	    kurz die Struktur und Funktionsweise des Programmes vor.
	    Ein sehr interessanter Artikel f&uuml;r Benutzer von Informationssystemen
	    und WWW Administratoren.

          </LI>
	</UL>
	</TD>
	</TR>

</TABLE>

<!-- Page Foot -->
<BR clear="all">
<CENTER>
<TABLE width="95%">

<TR>
 <TD align="center" bgcolor="#666666">
  <FONT color="#ffffff">
  This website is maintained by the German LF team<BR>
 <B>&copy; 1998  LinuxFocus</B>
  </FONT>
 </TD>
</TR>

</TABLE>
</CENTER>
</BODY>
</HTML>
