<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.51">
 <META NAME="LFCATEGORY" CONTENT="SoftwareDevelopment">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf356, SoftwareDevelopment: Conhe&ccedil;a um Compilador Pascal Livre : Free Pascal</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 table.left { margin-right:0.3cm }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 div.tbbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   margin: 2px 5px 2px 5px;
   text-align: center;
   width: 20em;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
 div.bbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   float: left;
   margin: 2px 5px 2px 5px;
   text-align: center;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Razmal     Djamal
 =LF=CAT___: SoftwareDevelopment
 =LF=TITLE_: Conhe&ccedil;a um Compilador Pascal Livre : Free Pascal
 =LF=NUMBER: 356
 =LF=ANAME_: article356.shtml
 =LF=PARSER: 2.51
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, current, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><a href="../../index.shtml"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></a></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 
                 <A class="nodec" href="../../index.shtml"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">&Iacute;ndice</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/index.shtml"><FONT color=
                 "#DDDDDD" size="2">Procura</FONT></A> </TD>
                 
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/index.shtml"><FONT color=
           "#FFFFFF">Novidades</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/index.html"><FONT color=
           "#FFFFFF">Arquivos</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/index.shtml"><FONT color=
           "#FFFFFF">Links</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfdynahead ver 1.5 --><TABLE ALIGN="right" border=0><TR><TD ALIGN="right"><FONT SIZE="-1" FACE="Arial,Helvetica">Este artigo est&aacute; dispon&iacute;vel em: <A href="../../English/November2004/article356.shtml">English</a> &nbsp;<A href="../../Deutsch/November2004/article356.shtml">Deutsch</a> &nbsp;<A href="../../Francais/November2004/article356.shtml">Francais</a> &nbsp;<A href="../../Portugues/November2004/article356.shtml">Portugues</a> &nbsp;<A href="../../Indonesian/November2004/article356.shtml">Indonesian</a> &nbsp;<A href="../../Turkce/November2004/article356.shtml">Turkce</a> &nbsp;</FONT></TD></TR></TABLE><br>
 


<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_START -->
<TABLE ALIGN="LEFT" BORDER="0" WIDTH="195" summary="about the author" class="left">
<TR>
<TD>

<img src="../../common/images2/RazmalDjamal.jpg" alt=
    "[Photo of the Author]" width="140" height="168">
<BR>por  Razmal Djamal <a href="http://razmal.blogspot.com"><font size="1">(homepage)</font></a>
<BR><BR>
<I>Sobre o autor:</I><BR>
<!-- aboutauthor_start -->
<p>	Sou um grande f&atilde; do c&oacute;digo aberto. Gosoto do modo como trabalham
sem se verem uns aos outros. E &eacute; maravilhoso tornar o nosso conhecimento
dispon&iacute;vel como um recurso livre a todos as pessoas no mundo. Nos
tornamo-nos um mundo, um universo sem restri&ccedil;ões em termos de ra&ccedil;a, na&ccedil;&atilde;o
ou religi&atilde;o. Estou a fazer o meu trabalho em diversos sistemas, mas
prefiro o Linux. Sou um n&oacute;mada do Linux, vagueando nele e estou
interessado em muitas coisas... mas prefiro escrever c&oacute;digo... de um modo
especial em Pascal e Python. Sou um mul&ccedil;umano e adoro o meu grande profeta
Muhammad SAW... e os melhores cumprimentos para ele e Allah SWT. Amor e
promessas de salva&ccedil;&atilde;o para ele.</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED_TO pt -->
<BR><BR><I>Traduzido para Portugu&ecirc;s por:</I><BR>
Vinicius Pinheiro (<a href="http://coisa.im.ufba.br/~vinnie"><font size="1">homepage</font></a>)
<br>
<!--
 =LF=TRANSTO=pt: Vinicius Pinheiro
-->
<!-- TRANSLATED_TO_STOP -->
<!-- INDEX_START -->
<BR><i>Conte&uacute;do</i>:
<UL>
  <LI><A HREF="#356lfindex0">Introdu&ccedil;&atilde;o</A></LI>
  <LI><A HREF="#356lfindex1">Requisitos m&iacute;nimos</A></LI>
  <LI><A HREF="#356lfindex2">Por qu&ecirc; Pascal,.. Por qu&ecirc; Free Pascal ?</A></LI>
  <LI><A HREF="#356lfindex3">Direito para a instala&ccedil;&atilde;o</A></LI>
  <LI><A HREF="#356lfindex4">Al&ocirc; Mundo</A></LI>
  <LI><A HREF="#356lfindex5">Sum&aacute;rio</A></LI>
  <LI><A HREF="#356lfindex6">Links</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=356">Forma de respostas para este artigo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- INDEX_STOP -->
<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_STOP -->
<!-- HEAD_OF_THE_ARTICLE_START -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Conhe&ccedil;a um Compilador Pascal Livre : Free Pascal</H2>
 <img src="../../common/images2/article356/fpc.jpg" alt=
    "[The Free Pascal Logo and The Jaguar is courtesy of FreePascal.org]"
     hspace="10" width="616" height="166">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Abstrato</i>:
<P>
<!-- articleabstract_start -->

Conhe&ccedil;a um Compilador Pascal Livre : Free PascalMuitos de voc&ecirc;s podem se lembrar do legend&aacute;rio Turbo Pascal. Depois dele a ferramenta RAD (Rapid Application Development) chamada Delphi e Kylix (para Linux) vieram e ent&atilde;o ofereceram linguagens similares &agrave; sintaxe Pascal. Linguagens Pascal baseadas em textos Basic ASCII est&atilde;o quase mortas atualmente. Agora, Free Pascal est&aacute; em ascens&atilde;o combinando programa&ccedil;&atilde;o em modo texto e POO (Programa&ccedil;&atilde;o Orientada a Objeto) t&atilde;o poderosa quanto a RAD Delphi.


    
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- HEAD_OF_THE_ARTICLE_STOP -->
<!-- BODY_OF_THE_ARTICLE_START -->


    <A NAME="356lfindex0">&nbsp;</A>
<H2>Introdu&ccedil;&atilde;o</H2>

Free Pascal &eacute; um compilador livre para linguagens com sintaxe Pascal, semanticamente similares e compat&iacute;veis com o Borland Turbo Pascal 7, o &uacute;ltimo legend&aacute;rio Turbo Pascal. Ele vem com um monte de funcionalidades poderosas e &eacute; como uma combina&ccedil;&atilde;o entre TP7 e o Object Pascal do Delphi. Neste momento, a equipe de desenvolvimento do Free Pascal est&aacute; trabalhando pesado para fazer um compilador melhor para utiliza&ccedil;&atilde;o em v&aacute;rias plataformas. Voc&ecirc; pode baixar todo tipo de pacotes de instala&ccedil;&atilde;o de acordo com a plataforma em [1].


    <A NAME="356lfindex1">&nbsp;</A>
<H2>Requisitos m&iacute;nimos</H2>


    <p>
Free Pascal est&aacute; apto para rodar em processadores 386. Mas eu prefiro utilizar outros processadores como 486 ou superiores. CPUs AMD tamb&eacute;m funcionam, &eacute; claro, j&aacute; que eles s&atilde;o compat&iacute;veis com o 386. Free Pascal pode rodar tamb&eacute;m no processador da Motorola. Pode precisa ter pelo menos um 680x0 ou 68020 para que ele funcione. Em qualquer plataforma, eu recomendo pelo menos 8 megabytes de RAM, ele ir&aacute; funcionar at&eacute; com somente 4 megabytes de RAM. Considerando-se espa&ccedil;o em disco, voc&ecirc; precisa de no m&iacute;nimo 25 megabytes para a instala&ccedil;&atilde;o. O compilador est&aacute; dispon&iacute;vel para v&aacute;rios sistemas operacionais. A &uacute;ltima novidade &eacute; que ele tamb&eacute;m est&aacute; dispon&iacute;vel agora para sparc, AMD64, e arm/linux. Se voc&ecirc; est&aacute; interessado em saber quantas plataformas Free Pascal suporta, voc&ecirc; pode ir na p&aacute;gina de downloads em [1]. Existem pacotes para Linux, Win32, Amiga, Dos, QNX, Solaris, BeOS, NetBSD, FreeBSD, e OS2.
    </p>

    <A NAME="356lfindex2">&nbsp;</A>
<H2>Por qu&ecirc; Pascal,.. Por qu&ecirc; Free Pascal ?</H2>


    <p>
No linux, a maioria das pessoas gostam de programar em C, j&aacute; que o kernel est&aacute; escrito nessa linguagem. Ent&atilde;o porque voc&ecirc; precisaria aprender Pascal? Eu j&aacute; sou fluente em C, mas h&aacute; diversas e excelentes maneiras de se escrever c&oacute;digo em Pascal. Ele &eacute; muito "limpo". &Eacute; muito r&aacute;pido, n&atilde;o necessita de nenhum arquivo make, &eacute; muito bem estruturado, voc&ecirc; saber&aacute; precisamente quando estiver em um bloco de c&oacute;digo, um procedimento, ou uma fun&ccedil;&atilde;o. Os compiladores s&atilde;o muito muito r&aacute;pidos, mesmo quando voc&ecirc; est&aacute; compilando um arquivo grande. Uma coisa que eu admiro &eacute; a sua bela integra&ccedil;&atilde;o com assembler. Anos atr&aacute;s Pascal era conhecido por produzir c&oacute;digos assembly bem leg&iacute;veis. Para compatibilidade com o Linux, FPC (Free Pascal Compiler) tem &oacute;timas funcionalidades, uma vez que voc&ecirc; terminou um programa usando o compilador Linux FPC, ent&atilde;o o programa estar&aacute; apto a rodar em qualquer tipo de m&aacute;quina linux. Isso &eacute; muito legal! Voc&ecirc; poder&aacute; usar o c&oacute;digo que escreveu em qualquer uma delas. A &uacute;ltima melhoria do FPC &eacute; que ele agora suporta POO (Programa&ccedil;&atilde;o Orientada a Objeto) muito bem, da mesma forma que o Delphi e o Kylix. Para quem conhece Object Pascal as coisas est&atilde;o f&aacute;ceis. N&atilde;o h&aacute; diferen&ccedil;as entre eles, seja na sintaxe do c&oacute;digo, ou nas poderosas funcionalidades dispon&iacute;veis.
    </p>

    <p>
FPC possui uma grande vantagem tamb&eacute;m... ele &eacute; como uma IDE (Integrated Development Environment) que &eacute; muito similar ao TP7. Eu n&atilde;o posso ficar aqui divagando sobre as vantagens por muito tempo... este compilador pode fazer programa&ccedil;&atilde;o de banco de dados. Voc&ecirc; pode se conectar a grandes servidores SQL como MySQL e PostgreSQL, e at&eacute; Interbase. Considerando-se a GUI, FPC pode ser integrado com "widgets" como GTK, Tcl/Tk, e ncurses. Ent&atilde;o... por qu&ecirc; Free pascal... Por qu&ecirc; n&atilde;o?!!
    </p>

    <A NAME="356lfindex3">&nbsp;</A>
<H2>Direito para a instala&ccedil;&atilde;o</H2>


    <p>Since i wrote this article for a free Linux Magazine, then
    i'll take the installation for Linux the environment. You'll
    need one installation packet for linux x86. Simply grab the rpm
    package from the download page. The latest version is the beta
    release 1.9.4 aka 2.0.0-Beta3. The installation packages come
    with a unique name, for example
    <code>fpc-1.0.10.i386.tar</code>; You have to un-tar this file.
    Simply type this command:</p>
<pre class="code">
[root@yourlinuxbox /]tar xvf fpc-1.0.10.i386.tar
</pre>

Este comando ir&aacute; extrair os seguintes arquivos:

    <ul>
      <li>binary.tar</li>

      <li>sources.tar</li>

      <li>docs.tar.gz</li>

      <li>demo.tar.gz</li>

      <li>install.sh</li>
    </ul>
    <br>
    <br>

Para instalar Free Pascal, digite a partir do diret&oacute;rio fpc como root:

<pre class="code">
[root@yourlinuxbox /]#sh install.sh
</pre>
    ou
<pre class="code">
[root@yourlinuxbox /]#./install.sh
</pre>

Este comando ir&aacute; instalar o seu fpc no diret&oacute;rio padr&atilde;o, mas durante este processo voc&ecirc; encontrar&aacute; muitas questões sobre caminho e localiza&ccedil;&atilde;o de diversos arquivos. Se finalizar com sucesso aparecer&aacute; isso:

<pre class="code">
Writing sample configuration file to /etc/fpc.cfg
End of installation.
Refer to the documentation for more information.
</pre>

    <p>
A instala&ccedil;&atilde;o ir&aacute; criar alguns novos diret&oacute;rios que ser&atilde;o muito &uacute;teis aos iniciantes:
    </p>

    <ul>
      <li>/usr/local/doc/fpc-1.0.10</li>

      <li>/usr/local/src/fpc-1.0.10</li>

      <li>/usr/local/lib/fpc</li>

      <li>/usr/bin/fpc</li>

      <li>/usr/local/bin/fpc</li>
    </ul>
    <br>
Agora voc&ecirc; pode aproveitar e escrever numa excelente linguagem de programa&ccedil;&atilde;o muito bem estruturada, e de alto n&iacute;vel!
     <br>
    <br>


    <A NAME="356lfindex4">&nbsp;</A>
<H2>Al&ocirc; Mundo</H2>


    <p>
Seguindo, n&oacute;s iremos tentar escrever um famoso exemplo de c&oacute;digo chamado "Al&ocirc; Mundo". Para fazer isso, n&atilde;o precisamos de muito tempo ou de c&oacute;digo, mas somente criar um arquivo com a extens&atilde;o pp ou pas. Ent&atilde;o abra o seu editor favorito e digite isto:
    <br>
    </p>
<pre class="code">
  begin
    Writeln('Hello World From Pascal..!!');
  End.
</pre>
Salve o arquivo como "hello.pas". Agora &eacute; o processo de compila&ccedil;&atilde;o. Para compilar este arquivo simplesmente digite o comando:
<pre class="code">
  fpc test.pas
</pre>
Para rodar a sa&iacute;da (incrivelmente, a sa&iacute;da do processo de compila&ccedil;&atilde;o &eacute; um arquivo bin&aacute;rio!!), uma imagem vale por mais de mil palavras ent&atilde;o aqui est&aacute; o processo de compila&ccedil;&atilde;o e a sa&iacute;da do arquivo bin&aacute;rio:
    <br>
    <br>
     <img src="../../common/images2/article356/compilerun.gif"
    width="500" height="214">

    <p>
Como a sa&iacute;da &eacute; um arquivo bin&aacute;rio, significa que este arquivo &eacute; execut&aacute;vel. Este arquivo &eacute; independente de distribui&ccedil;&atilde;o, voc&ecirc; n&atilde;o precisa recompilar este arquivo em qualquer m&aacute;quina linux quando quiser utiliz&aacute;-lo. O exemplo acima ter&aacute; o mesmo resultado, mesmo que voc&ecirc; compile o arquivo no Windows 98, sem mudar c&oacute;digo algum. Isto s&oacute; &eacute; poss&iacute;vel, claro, porque n&oacute;s n&atilde;o estamos utilizando funcionalidades espec&iacute;ficas do sistema operacional.
    </p>

    <A NAME="356lfindex5">&nbsp;</A>
<H2>Sum&aacute;rio</H2>

   Free Pascal est&aacute; pronto para ser utilizado em produ&ccedil;&atilde;o. &Eacute; t&atilde;o bom (sen&atilde;o melhor) quanto os produtos comerciais. A vantagem dele &eacute; que ele &eacute; livre. Te d&aacute; mais flexibilidade e menos custo (sem taxa de licen&ccedil;a). Free Pascal &eacute; um canivete su&iacute;&ccedil;o. Voc&ecirc; pode desenvolver programas linux mais f&aacute;cil do que poderia imaginar. Vale a pena tentar... acredite. O plano &eacute; come&ccedil;ar uma s&eacute;rie sobre programa&ccedil;&atilde;o em FPC e eu espero que muitos de voc&ecirc;s ir&aacute; se juntar a mim escrevendo c&oacute;digos leg&iacute;veis com um compilador simples e bem estruturado.
     <br>
    <br>


    <A NAME="356lfindex6">&nbsp;</A>
<H2>Links</H2>


    <ul>
      <li>[1] O s&iacute;tio oficial do Free Pascal: <a href=
      "http://www.freepascal.org">www.freepascal.org</a></li>
    </ul>
    <!-- vim: set sw=2 ts=2 et tw=74: -->
  



<!-- BODY_OF_THE_ARTICLE_STOP -->
<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Forma de respostas para este artigo</h2>
Todo artigo tem sua pr&oacute;pria p&aacute;gina de respostas. Nesta p&aacute;gina voc&ecirc; pode enviar um coment&aacute;rio ou ver os coment&aacute;rios de outros leitores:
<center>
    <table width="250" border=0><tr><td>
    <div class="tbbutton"><A class="nodec" href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=356">&nbsp;p&aacute;gina de respostas&nbsp;</a></div>
    </td></tr></table>
</center>

<br clear="all">
<HR size="2" noshade>
<table width="250" border=0><tr><td>
<div class="bbutton"><a class="nodec" href="../../index.shtml">&lt;--, LF In&iacute;cio</a></div>
</td><td>
<div class="bbutton"><a class="nodec" href="./">regressar ao &iacute;ndice desta edi&ccedil;&atilde;o</a></div>
</td></tr></table>
<br clear="all">
<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">P&aacute;ginas Web mantidas pelo time de Editores LinuxFocus</A>
<BR><FONT COLOR="#1111aa"><a href="../../common/copy.html">&copy; Razmal     Djamal</a><br>&quot;some rights reserved&quot; see <a href="../../license/index.shtml">linuxfocus.org/license/</a><br><a href="http://www.linuxfocus.org">http://www.LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Informa&ccedil;&atilde;o sobre tradu&ccedil;&atilde;o:</font>
<TABLE summary="translators">
  <tr><td><font size="2">id --&gt; -- : Razmal Djamal (<a href="http://razmal.blogspot.com"><font size="1">homepage</font></a>)</font></td></tr>
  <tr><td><font size="2">id --&gt; en: Razmal Djamal (<a href="http://razmal.blogspot.com"><font size="1">homepage</font></a>)</font></td></tr>
  <tr><td><font size="2">en --&gt; pt: Vinicius Pinheiro (<a href="http://coisa.im.ufba.br/~vinnie"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2004-12-08, generated by lfparser version 2.51</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
