<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">  
<HTML lang="pt">  
<HEAD>  
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">  
<TITLE>LinuxFocus -- Revista Online</TITLE>  
</HEAD>  
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336699"  
vlink="#336633">  
<!-- MAP for top navegation bar -->

<MAP name="top">





<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../index.shtml">  



<AREA shape="rect" coords="423, 9, 457, 30" alt="Map"
href="../map.html">  



<AREA shape="rect" coords="463, 9, 508, 30" alt="Index"
href="../indice.html">  



<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/index.shtml">  



</MAP>



<!-- MAP for bottom navegation bar -->

<MAP name="bottom">



<AREA shape="rect" coords="78, 0, 163, 15" alt="News" href="../News/index.shtml">  



<AREA shape="rect" coords="189, 0, 284, 15" alt="Archives" href="../Archives/index.html">  



<AREA shape="rect" coords="319, 0, 395, 15" alt="Links" href="../Links/index.shtml">  



<AREA shape="rect" coords="436, 0,  523, 15" alt="About LF"
href="../aboutus.html">  



</MAP>

<CENTER>

<IMG src="../../common/images/Topbar-en.gif" width="600" height="40" border="0" alt="[Top
Bar]"

ismap usemap="#top" ><BR>

<IMG src="../../common/images/Bottombar-en.gif" width="600" height="21" border="0"
alt="[Bottom

Bar]" ismap usemap="#bottom">

</CENTER>

<!-- SHORT BIO ABOUT THE AUTHOR -->
<!-- MAIN BODY
-->  

<TABLE boder="1" cellspacing="5" cellpadding="5">  

  

<TR>  

    <TD width="40%" valign="top"> <I>4 de setembro de 1998</I><BR>

      <BR>

      <B>Novos Artigos:</B><BR>  

      <UL>

        <LI><A href="article65.html"><B>Habilitando 

          chin&ecirc;s no Linux</B></A> por Penelope Marr<BR>

          Sum&aacute;rio breve do Chinese HOWTO. Discute como habilitar fontes 

          chinesas no X-Window e o Netscape. &Eacute; &uacute;til para aqueles 

          interessados em seguir os artigos em chin&ecirc;s do LF.<BR>

          <BR>

        </LI>

        <LI><A href="article66.html"><B>Entrevista 

          com J.J. Love: Coordenador do LDP espanhol</B></A> por Ismael Ripoll<BR>

          Discuss&atilde;o sobre a origem e o status atual do projeto espanhol 

          do LDP.<BR>

          <BR>

        </LI>

      </UL>  

  

<A href="#september">

<B>Outros artigos em setembro....</B></A>

<BR><BR>

      <B>Artigos Mais Antigos:</B><BR>

      Visite nossos <A href="../Archives/index.html">arquivos</A> 

      para acessar volumes anteriormente publicados.<BR>

      <BR>  

  

  

<B>An&uacute;ncios:</B><BR><BR>  





      <P>31 de agosto de 1998 -- Pick Systems, Inc., um dos principais desenvolvedores 
        de sistemas de ger&ecirc;nciamento da base de dados (SGBD) multi-valor, 
        multi-usu&aacute;rio, <A

href="http://www.linuxfocus.org/English/announ1.txt">anunciou</A> a disponibilidade 
        imediata do seu D3 Linux v.7.1 com RedHat Linux v.5.1. Com este an&uacute;ncio, 
        mais de 4.000 aplica&ccedil;&otilde;es existentes adaptadas para o Ano 
        2000, desenvolvidas atrav&eacute;s do canal &quot;value-added reseller&quot; 
        (VAR) da Pick, est&atilde;o agora dispon&iacute;veis na plataforma Linux.</P>



<A href="#announcements">

<B>Outros an&uacute;ncios em setembro....</B></A>

<BR><BR>



  

</TD>  

  

    <TD width="30%" valign="top"> <B>Que h&aacute; de novo na LinuxFocus?</B><BR>

      No in&iacute;cio de agosto n&oacute;s mudamos a programa&ccedil;&atilde;o 

      da publica&ccedil;&atilde;o. A partir de agora os artigos aparecer&atilde;o 

      em nosso website assim que estiverem prontos e traduzidos. Isto agilizar&aacute; 

      nossa publica&ccedil;&atilde;o e far&aacute; a revista mais din&acirc;mica. 

      Ao mesmo tempo, a cada dois meses n&oacute;s coletaremos todos os artigos 

      publicados at&eacute; ent&atilde;o e os arquivaremos em um volume bimestral. 

      Estes arquivos s&atilde;o a forma favorita de distribui&ccedil;&atilde;o 

      para leitores dom&eacute;sticos, com custos elevados com telefone.<BR>

      <BR>

      <B>LinuxFocus Entra na &Aacute;sia</B><BR>
      Gra&ccedil;as a um grupo de estudantes e f&atilde;s do Linux em Taiwan, 
      LinuxFocus agora conta com um grupo editorial para a l&iacute;ngua chinesa 
      dirigido por Penelope Marr. Eles n&atilde;o s&oacute; traduzir&atilde;o 
      artigos para o chin&ecirc;s mas tamb&eacute;m nos fornecer&atilde;o aspectos 
      interessantes da &quot;locale&quot; chinesa do linux. Gra&ccedil;as &agrave;s 
      tradu&ccedil;&otilde;es em v&aacute;rios idiomas, toda esta informa&ccedil;&atilde;o 
      estar&aacute; dispon&iacute;veis em todas as l&iacute;nguas de modo que 
      os desenvolvedores possam portar suas aplica&ccedil;&otilde;es para o chin&ecirc;s 
      caso queiram.<BR>

      <BR>

      <B>Linux Significa Neg&oacute;cios</B><BR>

      Como uma nova iniciativa para aumentar o suporte ao Linux por vendedores 

      e fabricantes de hardware, nossa revista come&ccedil;ar&aacute; a postar 

      &quot;press releases&quot; e an&uacute;ncios importantes das companhias 

      que derem suporte ao Linux em seus produtos. </TD>  

  

    <TD width="30%" valign="top"> <B>Nossa Hist&oacute;ria</B><BR>

      LF &eacute; uma revista on-line gr&aacute;tis completamente original, pois 

      &eacute; escrita por cerca de 60 volunt&aacute;rios ao redor do mundo, em 

      v&aacute;rias l&iacute;nguas. Ela nasceu de nossa necessidade de ver uma 

      revista on-line de alta qualidade sobre Linux. Nem a Linux Gazette ou a 

      Linux Journal satisfizeram nossas necessidades. A primeira &eacute; uma 

      grande fonte de dicas curtas e t&eacute;cnicas para resolver problemas, 

      muitas vezes direcionada para novos usu&aacute;rios . LJ &eacute; uma revista 

      impressa comercial sobre Linux para uma vasta audi&ecirc;ncia. Infelizmente 

      est&aacute; somente dispon&iacute;vel em ingl&ecirc;s e al&eacute;m disso 

      seu car&aacute;ter geral a impede de ir mais profundo nos assuntos. &Eacute; 

      aqui onde Linux<font color="#ff0000">Focus</font> tenta preencher a lacuna 

      deixada pelas duas, LF: 

      <UL>
        <LI>traduz os artigos em um grande n&uacute;mero l&iacute;nguas. 
        <LI>escreve s&eacute;ries de artigos em um dado assunto, voltada para 
          usu&aacute;rios m&eacute;dianos situados entre novatos e avan&ccedil;ados. 
          Algumas de nossas s&eacute;ries em andamento: OpenGL, POVRAY, Real-Time 
          Linux, princ&iacute;pios do UNIX. 
        <LI>p&otilde;e grande esfor&ccedil;o n&atilde;o s&oacute; em conte&uacute;do 
          mas tamb&eacute;m em apresenta&ccedil;&atilde;o. Todos os artigos e 
          documenta&ccedil;&atilde;o s&atilde;o ilustrados por sua equipe de artistas. 
          O LF quer dar uma sensa&ccedil;&atilde;o profissional em todo seu material 
          porque seus membros pensam ser de extrema import&acirc;ncia uma boa 
          documenta&ccedil;&atilde;o para o sucesso de Linux. 
      </UL>

      <B>J&aacute; estamos l&aacute; ?</B><BR>

      Alguns leitores n&atilde;o apreciam realmente o valor do esfor&ccedil;o 

      envolvido em se fazer funcionar uma revista multilingual como a nossa. De 

      tempos em tempos n&oacute;s recebemos emails perguntando <I>porque isto 

      n&atilde;o est&aacute; traduzido ainda?</I> e assim vai. Por favor entenda 

      que ningu&eacute;m na LF trabalha em tempo integral neste esfor&ccedil;o. 

      Alguns grupos nacionais s&atilde;o pequenos e alguns s&atilde;o novos. D&ecirc;-nos 

      um pouco de tempo para fazermos com que todo o grupo trabalhe em sincronia. 

      Se voc&ecirc; encontrar algo que n&atilde;o esteja completo em sua l&iacute;ngua 

      nativa e quiser ajudar, pegue seu programa de email favorito e <A href="mailto:sepulveda@linuxfocus.org">nos 

      envie um mensagem</A>. </TD>  

  

  

</TR>  

  

</TABLE>  



<A name="september">

<H3>Outros artigos em setembro de 1998</H3>

</A>



<UL>
  <LI>  <IMG src="http://www.linuxfocus.org/English/frame.gif" border="0" height="" width="" alt="" align="absmiddle"> 
    </A> <A href="article63.html"><B>Uma 
    introdu&ccedil;&atilde;o ao boot de rede e Etherboot</B></A> por Ken Yap<BR>
    Este &eacute; um artigo avan&ccedil;ado que explica como inicializar seu computador 
    atrav&eacute;s de um programa armazenado em mem&oacute;ria permanente sem 
    acessar seu disco r&iacute;gido. &Eacute; uma t&eacute;cnica ideal para manter 
    e configurar um grupo de m&aacute;quinas Linux. <BR>
    <BR>
  </LI>
  <LI>  <IMG src="http://www.linuxfocus.org/English/frame.gif" border="0" height="" width="" alt="" align="absmiddle"> 
    </A> <A href="article64.html"><B>Encontrando 
    arquivos</B></A> por Guido Socher<BR>
    Este artigo d&aacute; uma introdu&ccedil;&atilde;o sobre como encontrar arquivos 
    pelo nome e pelo conte&uacute;do. <BR>
    <BR>
  </LI>
</UL>  

  





<A name="announcements">

<H3>Outros An&uacute;ncios</H3>

</A> 

<P><A href="http://www.alphaworks.ibm.com/formula/Jikes"> 

  Jikes para Linux</A> &eacute; um compilador Java que traduz arquivos fonte em 

  Java, como definido na Especifica&ccedil;&atilde;o da Linguagem Java (Addison-Wesley, 

  1996), em um conjunto de bytecodes no formato bin&aacute;rio, definido na Especifica&ccedil;&atilde;o 

  do Java Virtual Machine (Addison-Wesley, 1996). Ao contr&aacute;rio de outros 

  compiladores, Jikes aceita a linguagem Java somente como especificada: n&atilde;o 

  como um subconjunto, variante, ou superconjunto. De acordo com seus autores, 

  Jikes &eacute; mais r&aacute;pido do que a maioria de compiladores e pode computar 

  todas as rela&ccedil;&otilde;es de depend&ecirc;ncia em arquivos de programa.</P>  

  

<P> <A href="http://www.informix.com">Informix</A> 

  e <A
href="http://www.oracle.com">Oracle</A> 

  anunciaram vers&otilde;es de seus software de banco de dados para Linux.</P>  

  

<P>Debian GNU/Linux 2.0 foi liberado desde julho. Esta distribui&ccedil;&atilde;o 

  suporta as arquiteturas i386 e mk64. Inclui cerca de 1500 pacotes diferentes. 

  Um trabalho est&aacute; sendo feito de modo a suportar outras arquiteturas.</P>   







  

<!-- ARTICLE FOOT -->  

<BR clear="all">  

<CENTER>  

<TABLE width="95%">  

<TR>  

      <TD align="center" bgcolor="#666666"> <FONT color="#ffffff"> Este website &eacute; 

        mantido por Miguel Angel Sepulveda<BR>  

  <B>LinuxFocus 1998</B>  

  </FONT>  

 </TD>  

</TR>  

</TABLE>  

</CENTER>  

  

  

  

</BODY>  

  

</HTML>  

  



