<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content=
"text/html; charset=iso-8859-1">
<meta name="keywords" content=
"LinuxFocus, international magazine for Linux">
<title>LinuxFocus Magazine, July2000</title>
</head>
<body bgcolor="#ffffff">
<!-- MAP for top navegation bar --><map name="top">
<area shape="rect" coords="367,9,418,30" alt="Home" href="../index.shtml">
<area shape="rect" coords="423,9,457,30" alt="Map" href="../map.html">
<area shape="rect" coords="463,9,508,30" alt="Index" href="../indice.html">
<area shape="rect" coords="514,9,558,30" alt="Search" href="../Search/index.html">
</map> <!-- MAP for bottom navegation bar --> <map name="bottom">
<area shape="rect" coords="78,0,163,15" alt="News" href="../News/index.shtml">
<area shape="rect" coords="189,0,284,15" alt="Archives" href="../Archives/index.html">
<area shape="rect" coords="319,0,395,15" alt="Links" href="../Links/index.shtml">
<area shape="rect" coords="436,0,523,15" alt="About LinuxFocus" href="../aboutus.html">
</map> <!-- NAVEGATION BAR --> 

<center><img src="../../common/images/Topbar-en.gif" width="600"
height="40" border="0" ismap usemap="#top" alt="Topbar"><br>
 <img src="../../common/images/Bottombar-en.gif" width="600"
height="21" border="0" ismap usemap="#bottom" alt="Bottombar"><br>
</center>

<center>
<h1>LinuxFocus July 2000 issue</h1>
</center>

<table align="left">
<tr>
<td><img src="../../common/images/coverJuly2000.gif" width="250"
height="181" alt="cover image" align="left" hspace="10"></td>
</tr>

<tr>
<td><font size="2" color="#111166">The new LinuxFocus server in
Amsterdam</font></td>
</tr>
</table>

<b>Was war mit Linux<font color="#FF0000">Focus</font> los?</b>
Wie sie wahrscheinlich bemerkt haben, war der LinuxFocus vom 13. Mai bis Juni aus dem WWW verschwunden. Zumindest war der Hauptserver nicht mehr erreichbar. Die meisten Mirror-Server waren aber noch aktiv. Unser Hauptserver, der sich in Spanien befand, war zusammen gebrochen. Da wir unserem alten Server schon l&auml;ngere Zeit nicht mehr richtig getraut haben, stand ein neuer, zusammengebaut aus diversen Einzelteilen, bereit. Es war jedoch schwierig einen Internet Provider zu finden, bei dem wir den Server unterstellen konnten.<br> Die Zeit und die M&uuml;he, die die vielen Freiwilligen in den LinuxFocus investiert haben ist sicherlich einige tausend Mark wert, wenn wir LinuxFocus wie eine gedruckte Zeitschrift verkaufen w&uuml;rden. Die Idee, die hinter dem LinuxFocus steht, ist es allerding ein freies Magazin anzubieten f&uuml;r Leser denen es spa&szlig; macht mit Linux zu arbeiten und mehr dar&uuml;ber zu lernen.<br>
Das Daten-Volumen von LinuxFocus ist relativ hoch, und da wir kein Geld damit verdienen, sind wir auf Sponsoren angewiesen. Es stellte sich heraus, das es recht einfach war irgend einen ISP zu finden. Die meisten diese ISPs witterten jedoch das gro&szlig;e Geld hinter LinuxFocus und wollten durch Werbebanner dazu verdienen.
Diese ISP wissen jedoch oft nicht den Wert freier Software, und die Arbeit der Leute,  dahinter nicht zu w&uuml;rdigen.<br>
Linux ist eine starke Bewegung, es zeigt sich aber auch, das diese Bewegung recht verwundbar ist. Verwundbar deswegen, weil wir nicht das gleiche Geld wie die gro&szlig;en Firmen aufbringen k&ouml;nnen. Firmen k&ouml;nnen es sich z.B. leisten eine Lobby zu finanzieren damit Gesetze in ihrem Interesse ge&auml;ndert werden. Ein Beispiel hierf&uuml;r ist er Entwurf f&uuml;r das neue Europ&auml;ische Patent Gesetz.(vgl. <a href= "http://petition.eurolinux.org/index.html?LANG=de">petition.eurolinux.org</a> ) <a href= "http://petition.eurolinux.org/index.html?LANG=en"><img alt="Software Patent Free Europe" src="../../English/patent_button.gif" width="88" height="36" border="0" align="right"></a>
sind nur ein weiteres Beispiel f&uuml;r ein Gesetz da&szlig; das Monopol einiger m&auml;chtige Firmen unterst&uuml;tzt, aber nicht im Interesse der breiten &Ouml;ffentlichkeit ist.<br clear="all"><br>

Gl&uuml;cklicher weise gibt es aber noch einige gute Menschen auf dieser Welt, und so fand sich ein neues Heim f&uuml;r LinuxFocus in Amsterdam.<a href= "http://www.netsystem.nl">Netsystem.nl</a> ist eigentlich ein Internet Provoider f&uuml;r Firmen. Sie haben eine sehr gute Anbindung an die Haupt-Internet Knotenpunkte. Wenn sie eine Provider in den Niederladen suchen, ziehen sie Netsystem in betracht!<br>
<br>
 <br clear="all">
<hr width="85%" noshade size="1">
<!-- content -->
<center>
<h2>Die Artikel</h2>
</center>

<h4> <font color="#660033"> Grafik</font></h4>

<ul>
<li type="circle"><img src="../../common/images/frame.gif" alt=
"point" align="middle"> <a href="article113.shtml">Pseudo 3D Effekte mit
Gimp</a> , von Andre Pascual<br>
Gimp ist eigentlich zur 2D Grafikbearbeitung gedacht, aber mit einigen Tricks und Dank der zahlreichen Tools, ist es m&ouml;glich Bilder mit 3D Effekten zu erstellen.
</li>
</ul>

<br>
 

<h4> <font color="#660033"> Hardware</font></h4>

<ul>
<li type="circle"><img src="../../common/images/frame.gif" alt=
"point" align="middle"> <a href="article165.shtml">
Verwendung eines seriellen LCDs unter Linux
</a> , von Guido Socher<br>
Dieser Artikel zeigt, wie man ein BLC2021 PC-Bay Insert LCD Display zum Anschlu&szlig; an die serielle Schnittstelle unter Linux nutzt.
</ul>

<br>
 

<h4> <font color="#660033"> Software Entwicklung</font></h4>

<ul>
<li type="circle"><img src="../../common/images/frame.gif" alt=
"point" align="middle"> <a href="article160.shtml">
Entwicklung von GNOME Applikationen mit Python (Teil 1)
</a> , von Hilaire Fernandes<br>
Dieser Artikel richtet sich vorallem an Anf&auml;nger im Bereich GNOME Programmierung und GNU/Linux. Er zeigt, wie man Python und den GUI-Builder Glade benutzt, um Programme mit einer grafischen Benutzer Oberfl&auml;che zu erstellen.
</li>
</ul>

<br>
 

<h4> <font color="#660033"> System Administration</font></h4>

<ul>
<li type="circle"><img src="../../common/images/frame.gif" alt=
"point" align="middle"> <a href="article155.shtml">Virtual Network
Computing, auch als VNC  bekannt</a> , von Georges Tarbouriech<br>
Der Traum eines jeden Systemadministrators</li>
</ul>

<br>
 
<ul>
<li type="circle"><img src="../../common/images/frame.gif" alt=
"point" align="middle"> <a href="article159.shtml">Eine Einf&uuml;hrung in LDAP unter Linux</a> , von Atif Ghaffar <br>
Dieser Artikel beschreibt die Verwendung des Lightweight Directory Access Protocol
unter Linux</li>
</ul>

<br>
 

<h4> <font color="#660033"> Applications</font></h4>

<ul>
<li type="circle"><img src="../../common/images/frame.gif" alt=
"point" align="middle"> <a href="article156.shtml">
Einf&uuml;hrung in das PERL XML::XSLT Modul
</a> , von Egon Willighagen<br>
</li>
</ul>

<br>
<ul>
<li type="circle"><img src="../../common/images/frame.gif" alt=
"point" align="middle"> <a href="article161.shtml">
Installation der LinuxFocus Debian Pakete
</a> , von Egon Willighagen<br>Wie man LinuxFocus als Debian Pakete
auf seinem Rechner installiert.</li>
</ul>

<br>
 
<a name="tip"> </a>
<h4> <font color="#660033"> Der LinuxFocus Tip</font></h4>

<p>Wie l&ouml;scht man eine Datei mit dem Namen "-xx"? Selbstverst&auml;ndlich k&ouml;nnen sie einen grafischen Dateimanger verwenden, die Datei darin ausw&auml;hlen und dann l&ouml;schen, aber wie funktioniert das mit dem rm Befehl?<br>
<br>
rm wird -xx als Option interpretieren, da es mit einem Minuszeichen beginnt. Sie k&ouml;nnen nun folgenderma&szlig;en vorgehen:
</p>

<ol>
<li>Stellen sie sicher, das die Datei nicht mit einem Minuszeichen beginnt: bei Dateien ist dies immer m&ouml;glich. F&uuml;gen sie z.B. einfach den Pfad mit zu der Datei hinzu (z.B. rm /tmp/-xx wenn die Datei -xx im Verzeichnis /tmp liegt.<br>Sie k&ouml;nnen -xx auch als <b>.</b>/-xx schreiben.</li>

<li> Die meisten Unix Kommandos akzeptieren ein doppeltes Minuszeichen (--) als Markierung f&uuml;r das Ende der Optionsliste.<br>Bei <tt>rm -- -xx</tt> geht rm also davon aus, das -xx eine Datei und keine Option ist.</li>


</ol>

<br>
<br>
 <!-- end content --> <br clear="all">
<!-- start of footer --> 

<hr width="85%" noshade size="1">
<center>
<table width="85%">
<tr bgcolor="#666666">
<td align="center"><font color="#FFFFFF"> <b>&copy; 2000
LinuxFocus</b><br>
</font> <a href="../../common/lfteam.html"><font color="#FFFFFF">Go
to the LinuxFocus Contact Person Page</font></a></td>
</tr>
</table>
</center>


<!-- vim: set sw=2 ts=2 et: -->
</body>
</html>

