<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.52">
 <META NAME="LFCATEGORY" CONTENT="SystemAdministration">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf361, SystemAdministration: Wireless LAN unter Linux</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 table.left { margin-right:0.3cm }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 div.tbbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   margin: 2px 5px 2px 5px;
   text-align: center;
   width: 20em;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
 div.bbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   float: left;
   margin: 2px 5px 2px 5px;
   text-align: center;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Wang Xu
 =LF=CAT___: SystemAdministration
 =LF=TITLE_: Wireless LAN unter Linux
 =LF=NUMBER: 361
 =LF=ANAME_: article361.shtml
 =LF=PARSER: 2.52
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, current, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><a href="../../index.shtml"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></a></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 
                 <A class="nodec" href="../../index.shtml"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Plan</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Index</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/index.html"><FONT color=
                 "#DDDDDD" size="2">Suchen</FONT></A> </TD>
                 
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/index.shtml"><FONT color=
           "#FFFFFF">Nachrichten</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/index.html"><FONT color=
           "#FFFFFF">Archiv</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/index.shtml"><FONT color=
           "#FFFFFF">Links</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">&Uuml;ber uns</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfdynahead ver 1.5 --><TABLE ALIGN="right" border=0><TR><TD ALIGN="right"><FONT SIZE="-1" FACE="Arial,Helvetica">Dieses Dokument ist verf&uuml;bar auf: <A href="../../English/December2004/article361.shtml">English</a> &nbsp;<A href="../../ChineseGB/December2004/article361.shtml">ChineseGB</a> &nbsp;<A href="../../Deutsch/December2004/article361.shtml">Deutsch</a> &nbsp;<A href="../../Francais/December2004/article361.shtml">Francais</a> &nbsp;<A href="../../Italiano/December2004/article361.shtml">Italiano</a> &nbsp;<A href="../../Turkce/December2004/article361.shtml">Turkce</a> &nbsp;</FONT></TD></TR></TABLE><br>
 


<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_START -->
<TABLE ALIGN="LEFT" BORDER="0" WIDTH="195" summary="about the author" class="left">
<TR>
<TD>

<img src="../../common/images2/wangxu.gif" alt="[Photo of Wang Xu]" height="130" width="150">
<BR>von  Wang Xu <br> <small>&lt;wangxu[at]linuxfocus.org&gt;</small>
<BR><BR>
<I>&Uuml;ber den Autor:</I><BR>
<!-- aboutauthor_start -->
<p>Wang Xu ist PhD Student an der Beijinger Universit&auml;t f&uuml;r Post und Telekommunikation in China und besch&auml;ftigt sich mit drahtloser Kommunikation. Er wurde 1999 als Collegestudent zum Linuxliebhaber. Au&szlig;er Linux mag er auch TeX, C/C++, Perl, etc.


</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED_TO de -->
<BR><BR><I>&Uuml;bersetzt ins Deutsche von:</I><BR>
Katja Socher <small>&lt;katja[at]linuxfocus.org&gt;</small>
<br>
<!--
 =LF=TRANSTO=de: Katja Socher
-->
<!-- TRANSLATED_TO_STOP -->
<!-- INDEX_START -->
<BR><i>Inhalt</i>:
<UL>
  <LI><A HREF="#361lfindex0">Einleitung</A></LI>
  <LI><A HREF="#361lfindex1">WLAN Kartentreiber zum Laufen kriegen</A></LI>
  <LI><A HREF="#361lfindex2">Kernelunterst&uuml;tzung f&uuml;r WLAN</A></LI>
  <LI><A HREF="#361lfindex3">Unabh&auml;ngige Module f&uuml;r spezielle WLAN Karten</A></LI>
  <LI><A HREF="#361lfindex4">Treiber f&uuml;r andere Karten</A></LI>
  <LI><A HREF="#361lfindex5">Autentifizierung</A></LI>
  <LI><A HREF="#361lfindex6">Utilities f&uuml;r WLAN</A></LI>
  <LI><A HREF="#361lfindex7">Schlu&szlig;bemerkung</A></LI>
  <LI><A HREF="#361lfindex8">Referenzen</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=361">Talkback f&uuml;r diesen Artikel</A></LI>
</UL>

</TD></TR></TABLE>
<!-- INDEX_STOP -->
<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_STOP -->
<!-- HEAD_OF_THE_ARTICLE_START -->
<br>&nbsp;
<table border="0"><tr><td>
<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfPdf ver 0.1 -->
<TABLE style="border-style:outset; border-width:1px" align="right" bgcolor="#ff9616" cellspacing="1"><TR><TD bgcolor="#ff9616">
        <a href="../Archives/lf-2004_12-0361.pdf"><small>PDF</small></a>
        </TD></TR></TABLE>
         

<H2>Wireless LAN unter Linux</H2>
 <img src="../../common/images2/article361.jpg" alt="wireless interconnection
between computers">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Zusammenfassung</i>:
<P>
<!-- articleabstract_start -->

In diesem Artikel spreche ich &uuml;ber einige Treiber f&uuml;r gew&ouml;hnliche
Wireless LAN Adapter und einige verwandte Themen wie die Autentifizierung basierend auf 802.1x.


<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- HEAD_OF_THE_ARTICLE_STOP -->
<!-- BODY_OF_THE_ARTICLE_START -->


<A NAME="361lfindex0">&nbsp;</A>
<H2>Einleitung</H2>

<p>WLAN (IEEE 802.11b/a/g) wird immer popul&auml;rer, da WLAN Karten immer billiger werden und mehr Organisationen ihren Angestallten oder der &Ouml;ffentlichkeit Zugang zu WLAN erm&ouml;glichen. Fast jeder neue Laptop-Computer hat eine integrierte WLAN Karte und &auml;ltere k&ouml;nnen PCMCIA WLAN Karten benutzen, sogar Desktop-Computer k&ouml;nnen
USB WLAN Karten haben oder sogar eingebaute WLAN Karten. Andererseits werden  WLAN Access
Points (AP) an Universit&auml;ten, in B&uuml;rogeb&auml;uden, Hotels, Wohnh&auml;usern etc. eingerichtet. Das WLAN erleichtert das Einrichten lokaler Netzwerke und unterst&uuml;tzt mobiles/normadisches Computern, was eine weitere Revolution in unserem Arbeits- und t&auml;glichen Leben darstellt.

</p><p>Von daher ist es auch f&uuml;r die Linuxwelt essentiell, WLAN Zugang zu unterst&uuml;tzen. Der Rest dieses Artikels ist wie folgt unterteilt: la&szlig;t uns &uuml;berlegen, wie man die Treiber f&uuml;r die Karten zum Laufen kriegt; dann versuchen wir, zu Netzwerken, die Autentifizierung benutzen, Zugang zu bekommen; und es gibt eine kurze Einf&uuml;hrung in die Werkzeuge f&uuml;r die
WLAN Interface Konfiguration; schlie&szlig;lich gibt es eine Schlu&szlig;betrachtung.

</p><A NAME="361lfindex1">&nbsp;</A>
<H2>WLAN Kartentreiber zum Laufen kriegen</H2>

<p>Wenn du einmal eine Wireless LAN Karte in deinem Computer installiert hast, ist der erste Schritt, den Treiber zu installieren und zum Laufen zu kriegen. Eine WLAN Karte implementiert die Funktionen der physikalischen Schicht (PHY) und des media access control sublayer (MAC), wie es in mindestens einem der IEEE 802.11 Serien von Protokollen spezifiziert wurde, w&auml;hrend der Treiber die Karte steuert, eine Netzwerkschnittstelle identisch zu einer Ethernetschnittstelle sowie andere WLAN spezifische Managementschnittstellen zur Verf&uuml;gung stellt.

</p><p>Es gibt keine einheitliche Methode zum Installieren von Treibern bei der gro&szlig;en Zahl von Verk&auml;ufern und Karten. Die meisten Treiber k&ouml;nnen jedoch durch eine der folgeden drei Methoden zum Laufen gebracht werden:
</p><ul>
<li>Benutze die native Linux®kernelunterst&uuml;tzung f&uuml;r die Karte,</li>
<li>Kompiliere und installiere ein Treibermodul f&uuml;r die spezifizierte Karte ,</li>
<li>Benutze den NDIS wrapper [1], um Karten zu betreiben, die MS
Windows ® Treiber benutzen.</li>
</ul>
In den folgenden Abschnitten illustriere ich diese Methoden mit Beispielen.

<p>Anmerkung, auch wenn du die letzten beiden Methoden benutzt, mu&szlig;t du sicherstellen, dass der wireless LAN support in deiner Kernelkonfiguration gesetzt ist:
</p><pre class="code">gnawux@APTITUDE:~$ grep CONFIG_NET_RADIO /boot/config-`uname -r`
CONFIG_NET_RADIO=y
</pre>
Wenn das nicht der Fall ist, solltest du den Kernel  noch mal mit der aktivierten Option "Wireless LAN
(non-hamradio) Drivers and Wireless Extensions" konfigurieren.

<A NAME="361lfindex2">&nbsp;</A>
<H3>Kernelunterst&uuml;tzung f&uuml;r WLAN</H3>

<p>Die Treiber, die ausgereift genug sind und keine Lizenzprobleme machen, werden zum Linux Kernel hinzugef&uuml;gt. Von daher ist die Liste der unterst&uuml;tzten WLAN Karten im Kernel abh&auml;ngig von der Version des Kernels und es ist deshalb klug, zu &uuml;berpr&uuml;fen, ob ein neuer Kernel eine bessere Unterst&uuml;tzung f&uuml;r deine Karte bietet, bevor du den Treiber installierst.

</p><p>In diesem Abschnitt illustriere ich, wie man den Treiber f&uuml;r WLAN Karten basierend auf Intersil Prism
chipsets (ISL38xx) benutzt. Die Liste mit den unterst&uuml;tzten Karten findet man unter http://prism54.org [2].

</p><p>Um eine auf  Prism basierende Karte benutzen zu k&ouml;nnen, braucht man den neuesten 2.6 Kernel, und aktiviert die
"Intersil Prism GT/Duette/Indigo PCI/Cardbus" Option im Wireless LAN
Treiber Abschnitt der Kernelkonfiguration, und baut den Kernel erneut.

</p><p>Wenn du den Hilfetext des Moduls sorgf&auml;ltig durchliest, wenn du den Kernel konfigurierst, wirst du vielleicht feststellen, da&szlig; du eine  firmware von der <a href="http://prism54.org/">prism54.org project Webseite</a> [2] brauchst. Dies ist so, weil die Karte keinen EPROM hat, um die firmware zu speichern. Deshalb mu&szlig; man die firmware herunterladen, wenn der Treiber die Karte initialisiert. Die firmware kann wegen ihrer Lizenz nicht Teil des Kernels werden.
Nach dem Holen der firmware and schieben nach
"/usr/lib/hotplug/firmware/", reboote deinen Computer, und du wirst feststellen, da&szlig; du eine zus&auml;tzliche Ethernetschnittstelle hast, die von der WLAN Karte zur Verf&uuml;gung gestellt wird.

</p><A NAME="361lfindex3">&nbsp;</A>
<H3>Unabh&auml;ngige Module f&uuml;r spezielle WLAN Karten</H3>

<p>Viele neue Karten haben, wie viele andere neue Hardware, keine GPL-kompatiblen Treiber der Hersteller oder die Treiber, die von der Open Source Community entwickelt wurden, sind noch nicht ausgereift genug, um in den Kernel integriert zu werden. Deshalb werden diese Treiber als Module bereitgestellt und einige von ihnen werden schlie&szlig;lich in zuk&uuml;nftigen Kernelversionen hinzugef&uuml;gt werden, wenn sie vollst&auml;ndig sind.

</p><p>Einer der bekanntesten Treiber ist der <a href="http://ipw2100.sourceforge.net/">ipw2100</a> [3] f&uuml;r die Intel Pro/Wireless
2100 Karte, die ein Teil der Intel Centrino® Technologie ist und auf vielen Laptops installiert ist. In diesem Abschnitt f&uuml;hre ich in die Installation des ipw2100 Treibers ein.

</p><p>Zuerst mu&szlig; man das Quellpaket des Treibers sowie die firmware von der Projektwebseite <a href="http://ipw2100.sourceforge.net/">http://ipw2100.sourceforge.net</a> herunterladen.
Nachdem man sichergestellt hat, da&szlig; sein Kernel neu genug ist und mit Unterst&uuml;tzung f&uuml;r die Module hotplug firmware, and wireless LAN wie eben gesagt gebaut wurde, dekomprimiert man das Quellpaket:
</p><pre class="code">APTITUDE:/usr/src# tar -zxvf ipw2100-1.0.1.tgz
</pre>
Gehe dann zum Bilden und Installieren in das Quellverzeichnis:
<pre class="code">APTITUDE:/usr/src/ipw2100-1.0.1# make
APTITUDE:/usr/src/ipw2100-1.0.1# make install
</pre>
Nach dem Installieren der Module, mu&szlig; man nun die firmware installieren:
<pre class="code">Don't forget to copy firmware to /usr/lib/hotplug/firmware/ and have the
hotplug tools in place.
</pre>
Genau so, wie die Meldung es sagt: dekomprimiere die firmware in das hotplug Verzeichnis, dann ist die Installationsprozedur beendet. Jetzt kannst du durch das folgende das ipw2100 Modul aktivieren:
<pre class="code">APTITUDE:/usr/src/ipw2100-1.0.1# modprobe ipw2100
</pre>
Au&szlig;erdem f&uuml;gt man hier vielleicht noch ein paar Parameter f&uuml;r verschiedene Konfigurationen hinzu. Zum Beispiel kann der ifname Parameter den Schnittstellennamen spezifizieren:
<pre class="code">APTITUDE:/usr/src/ipw2100-1.0.1# modprobe ipw2100 ifname=wlan0
</pre>
D.h. die Schnittstelle wird wlan0 genannt. F&uuml;r andere Parameter kann man die Dokumente im Quellpaket des ipw2100 Treibers lesen.

<A NAME="361lfindex4">&nbsp;</A>
<H3>Treiber f&uuml;r andere Karten</H3>

<p>Leider gibt es f&uuml;r einige Karten &uuml;berhaupt keine Treiber f&uuml;r Linux oder der Treiber l&auml;uft aus bestimmten Gr&uuml;nden nicht. Dies bedeutet jedoch nicht, da&szlig; wir sie unter Linux nicht benutzen k&ouml;nnen. Zumindest gibt es <a href="http://ndiswrapper.sourceforge.net/">NDIS wrapper</a> [1].

</p><p>Die meisten WLAN Karten f&uuml;r Desktop- und Laptopcomputer unterst&uuml;tzen Windows
2000/XP, das die WLAN Unterst&uuml;tzung durch eine Standardschnittstelle namens NDIS handhabt. Deshalb unterst&uuml;tzen die Treiber f&uuml;r solche Karten normalerweise
NDIS. Deshalb k&ouml;nnen wir solch einen Treiber einwickeln (wrap) und unter Linux zum Laufen bringen, als wenn es Windows 2000/XP w&auml;re, was uns zum ndiswrapper Projekt f&uuml;hrt.

</p><p>In diesem Abschnitt installiere ich den ndiswrapper f&uuml;r eine Netgear
121 WLAN Karte als ein Beispiel. Als erstes sollte man den ndiswrapper von der Projektseite <a href="http://ndiswrapper.sourceforge.net/">http://ndiswrapper.sourceforge.net</a>
herunterladen und den NDIS Treiber f&uuml;r Windows vorbereiten. Der ndiswrapper besteht aus einem Kernelmodul und einem Satz von Werkzeugen. Du solltest es bauen und installieren:
</p><pre class="code">APTITUDE:/usr/src/ndiswrapper-0.11# make install
</pre>
Dann kannst du den Windowstreiber im Wrapper laden
<pre class="code">APTITUDE:/usr/src/ndiswrapper-0.11# ndiswrapper -i ../wg121/WG121V200/ndis5/netwg121.inf
</pre>
wobei die <tt>.inf</tt> Datei der NDIS Treiber f&uuml;r Windows ist. Nach der Installation des NDIS Treibers solltest du das folgende sehen
<pre class="code">APTITUDE:/usr/src/ndiswrapper-0.11# ndiswrapper -l
Installed ndis drivers:
netwg121        driver present
</pre>
<p>Cheers! Die Installationsprozedur ist beendet.

</p><A NAME="361lfindex5">&nbsp;</A>
<H2>Autentifizierung</H2>

<p>Wenn du in einem &ouml;ffentlichen Bereich auf ein WLAN zugreifst, verlangt das WLAN eventuell einige Autentifizierungsmethoden aus Sicherheitsgr&uuml;nden. Die meisten verf&uuml;gbaren Autentifizierungsmethoden f&uuml;r WLAN basieren auf IEEE 802.1x (EAP) und IEEE 802.11i, und auf EAP basierende Methoden sind momentan die beliebtesten.

</p><p>Es gibt viele auf EAP basierende Autentifizierungsmethoden, z.B. EAP-MD5,
EAP-TLS, EAP-TTLS, EAP-SIM, LEAP, etc. Linuxbenutzer k&ouml;nnen
<i>xsupplicant</i> benutzen, das von <a href="http://open1x.sourceforge.net/">Open1x project</a> [4]
zur Verf&uuml;gung gestellt wird, um auf ein Netzwerk zuzugreifen, das auf 802.1x basierende Autentifizierung erfordert. In diesem Abschnitt benutze ich das LEAP protocol, das von Cisco
corp. vorgeschlagen wurde, als eine Illustration. Beachte: ob das Protokol unterst&uuml;tzt wird, h&auml;ngt von der Karte und dem Treiber ab, z.B. selbst wenn dein xsupplicant richtig installiert und konfiguriert wurde, kann es dir trotzdem unm&ouml;glich sein, auf das Netzwerk zuzugreifen, weil deine Karte oder dein Treiber es nicht unterst&uuml;tzen.

</p><p>Du solltest <i>xsupplicant</i> von der Projektseite <a href="http://open1x.sourceforge.net/">http://open1x.sourceforge.net</a> herunterladen und installieren. Dann &auml;ndere die Konfigurationsdatei,
/etc/xsupplicant/xsupplicant.conf. Hier ist ein Beispiel f&uuml;r LEAP.
</p><pre class="code">#example of /etc/xsupplicant/xsupplicant.conf
#for LEAP protocol

network_list = all
#the list of networks to access

default_netname = default
#the default access network

first_auth_command = &lt;BEGIN_COMMAND&gt;dhclient %i&lt;END_COMMAND&gt;
#The command before authentication, which is usually used to get some info from
#the network

logfile = /var/log/xsupplicant.log
#log file

myssid #here is your network id, may be listed in the network list
{
  type = wireless
  ssid = &lt;BEGIN_SSID&gt;myssid&lt;END_SSID&gt;
  allow_types = all
  identity = &lt;BEGIN_ID&gt;aptitude&lt;END_ID&gt;
  eap-leap {
      username = &lt;BEGIN_UNAME&gt;aptitude&lt;END_UNAME&gt;
      password = &lt;BEGIN_PASS&gt;passwd&lt;END_PASS&gt;
  }#setup for leap
}

</pre>
LEAP ist eine einfache Autentifizierungsmethode, und es gibt viele Einstellungen f&uuml;r andere Methoden, bitte lies die Beispiele und Dokumente von
xsupplicant.

<A NAME="361lfindex6">&nbsp;</A>
<H2>Utilities f&uuml;r WLAN</H2>

<p>Wie du wei&szlig;t, stellt WLAN eine Netzwerkschnittstelle identisch zu Ethernet zur Verf&uuml;gung, und du kannst sie als eine weitere Ethernetschnittstelle benutzen. Auf der anderen Seite hat eine WLAN Karte viel mehr Features als eine Ethernetkarte wegen des drahtlosen Mediums. Deshalb gibt es eine Menge Werkzeuge, um WLAN Karten zu konfigurieren und Informationen &uuml;ber den Status zu bekommen. Du findest die  wireless tools
auf <a href="http://www.hpl.hp.com/personal/Jean_Tourrilhes/Linux/Tools.html">http://www.hpl.hp.com/personal/Jean_Tourrilhes/Linux/Tools.html</a>
[5], die von Jean Tourrilhes beigesteuert wurde.

</p><p>Das n&uuml;tzlichste Werkzeug ist <i>iwconfig</i>, das &auml;hnlich wie
ifconfig benutzt werden kann. Der iwconfig Befehl ohne Parameter, aber mit dem Schnittstellennamen druckt den Arbeitsstatus der Karte:
</p><pre class="code">gnawux@APTITUDE:~$ /sbin/iwconfig wlan0
wlan0     unassociated  ESSID:off/any  Nickname:"ipw2100"
          Mode:Managed  Channel=0  Access Point: 00:00:00:00:00:00
          Bit Rate=0 kb/s   Tx-Power:off
          Retry:on   RTS thr:off   Fragment thr:off
          Power Management:off
          Link Quality:0  Signal level:0  Noise level:0
          Rx invalid nwid:0  Rx invalid crypt:0  Rx invalid frag:0
          Tx excessive retries:0  Invalid misc:0   Missed beacon:0

</pre>
Mit dem "mode" Parameter kannst du den WLAN Karten Arbeitsmode &auml;ndern:
<pre class="code">APTITUDE:/home/gnawux# iwconfig wlan0 mode 1
APTITUDE:/home/gnawux# iwconfig wlan0
wlan0     unassociated  ESSID:off/any  Nickname:"ipw2100"
          Mode:Ad-Hoc  Channel=0  Cell: 00:00:00:00:00:00
          Bit Rate=0 kb/s   Tx-Power:off
          Retry:on   RTS thr:off   Fragment thr:off
          Encryption key:off
          Power Management:off
          Link Quality:0  Signal level:0  Noise level:0
          Rx invalid nwid:0  Rx invalid crypt:0  Rx invalid frag:0
          Tx excessive retries:0  Invalid misc:0   Missed beacon:0

</pre>
Hier &auml;ndern wir die WLAN Karte in den "Ad Hoc" mode. Wir k&ouml;nnen auch den Netzwerknamen durch den "essid" Parameter &auml;ndern:
<pre class="code">APTITUDE:/home/gnawux# iwconfig wlan0 essid gnawux
APTITUDE:/home/gnawux# iwconfig wlan0
wlan0     IEEE 802.11b  ESSID:"gnawux"  Nickname:"ipw2100"
          Mode:Ad-Hoc  Frequency:2.412 GHz  Cell: 02:0C:F1:0F:11:2A
          Bit Rate=0 kb/s   Tx-Power:off
          Retry:on   RTS thr:off   Fragment thr:off
          Encryption key:off
          Power Management:off
          Link Quality=60/100  Signal level=-83 dBm
          Rx invalid nwid:0  Rx invalid crypt:0  Rx invalid frag:0
          Tx excessive retries:0  Invalid misc:0   Missed beacon:0

</pre>
Du hast vielleicht bemerkt, dass wir jetzt vern&uuml;nftigere Statusinformationen haben als vorher, weil wir eine g&uuml;ltige ESSID haben. F&uuml;r andere Parameter von iwconfig lies bitte iwconfig(8).

<p>Ein weiteres m&auml;chtiges utility ist <i>iwlist</i>, mit dem wir eine Liste der verf&uuml;gbaren Ressourcen bekommen k&ouml;nnen. Mit dem  "scanning" Parameter k&ouml;nnen wir eine Liste verf&uuml;gbarer Zugriffspunkte (access points) bekommen:
</p><pre class="code">gnawux@APTITUDE:~$ /sbin/iwlist wlan0 scanning
wlan0     Scan completed :
          Cell 01 - Address: 00:0D:BD:6F:B4:48
                    ESSID:"<hidden>"
                    Protocol:IEEE 802.11b
                    Mode:Master
                    Channel:6
                    Encryption key:on
                    Bit Rate:11 Mb/s
                    Extra: Rates (Mb/s): 1 2 5.5 11
                    Extra: Signal: -70  dBm
                    Extra: Last beacon: 59ms ago
          Cell 02 - Address: 86:CF:C1:34:12:06
                    ESSID:"gnawux"
                    Protocol:IEEE 802.11b
                    Mode:Ad-Hoc
                    Channel:11
                    Encryption key:off
                    Bit Rate:11 Mb/s
                    Extra: Rates (Mb/s): 1 2 5.5 11
                    Extra: Signal: -37  dBm
                    Extra: Last beacon: 2ms ago

</hidden></pre>
Und mit dem "Frequenz" Parameter (<tt>freq</tt>), k&ouml;nnen wir eine Frequenzliste bekommen:
<pre class="code">gnawux@APTITUDE:~$ /sbin/iwlist wlan0 freq
wlan0     14 channels in total; available frequencies :
          Channel 01 : 2.412 GHz
          Channel 02 : 2.417 GHz
          Channel 03 : 2.422 GHz
          Channel 04 : 2.427 GHz
          Channel 05 : 2.432 GHz
          Channel 06 : 2.437 GHz
          Channel 07 : 2.442 GHz
          Channel 08 : 2.447 GHz
          Channel 09 : 2.452 GHz
          Channel 10 : 2.457 GHz
          Channel 11 : 2.462 GHz
          Channel 12 : 2.467 GHz
          Channel 13 : 2.472 GHz
          Channel 14 : 2.484 GHz
          Current Channel=1

</pre>
Und du kannst iwlist(8) f&uuml;r weitere Parameter lesen.

<p>Au&szlig;er den beiden obengenannten gibt es auch noch andere utilities, z.B. iwevent,
iwgetid, iwpriv, iwspy, um den Arbeitsstatus deiner WLAN Karte zu erhalten und zu verwalten.

</p><A NAME="361lfindex7">&nbsp;</A>
<H2>Schlu&szlig;bemerkung</H2>

<p>Ich habe die Treiberinstallation f&uuml;r verschiedene WLAN Karten gezeigt und illustriert, wie man eine Autentifizierung durchf&uuml;hrt. Au&szlig;erdem wurden m&auml;chtige
Konfigurations-utilities f&uuml;r WLAN in diesem Artikel angesprochen.

</p><p>Dank der  Beteiligung der Open Source Community k&ouml;nnen wir nicht nur auf Wireless LAN unter Linux zugreifen, sondern auch Spa&szlig; damit haben!

</p><A NAME="361lfindex8">&nbsp;</A>
<H2>Referenzen</H2>

<ol>
<li>NDIS wrapper Projekt, <a href="http://ndiswrapper.sourceforge.net/">http://ndiswrapper.sourceforge.net</a>;</li>
<li>Prism54 Projekt, <a href="http://prism54.org/">http://prism54.org</a>;</li>
<li>IPW2100 Projekt, <a href="http://ipw2100.sourceforge.net/">http://ipw2100.sourceforge.net</a>;</li>
<li>Open1x Projekt, <a href="http://open1x.sourceforge.net/">http://open1x.sourceforge.net</a>;</li>
<li>Jean Tourrilhes, wireless Werkzeuge, <a href="http://www.hpl.hp.com/personal/Jean_Tourrilhes/Linux/Tools.html">http://www.hpl.hp.com/personal/Jean_Tourrilhes/Linux/Tools.html</a>.</li>
</ol>


<!-- vim: set sw=2 ts=2 et tw=74: -->

<!-- BODY_OF_THE_ARTICLE_STOP -->
<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback f&uuml;r diesen Artikel</h2>
Jeder Artikel hat seine eigene Seite f&uuml;r Kommentare und R&uuml;ckmeldungen. Auf dieser Seite kann jeder eigene Kommentare abgeben und die Kommentare anderer Leser sehen:
<center>
    <table width="250" border=0><tr><td>
    <div class="tbbutton"><A class="nodec" href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=361">&nbsp;Talkback Seite&nbsp;</a></div>
    </td></tr></table>
</center>

<br clear="all">
<HR size="2" noshade>
<table width="250" border=0><tr><td>
<div class="bbutton"><a class="nodec" href="../../index.shtml">&lt;--, LF Home</a></div>
</td><td>
<div class="bbutton"><a class="nodec" href="index.shtml">Zum index dieser Ausgabe</a></div>
</td></tr></table>
<br clear="all">
<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">Der LinuxFocus Redaktion schreiben</A>
<BR><FONT COLOR="#1111aa"><a href="../../common/copy.html">&copy; Wang Xu</a><br>&quot;some rights reserved&quot; see <a href="../../license/index.shtml">linuxfocus.org/license/</a><br><a href="http://www.linuxfocus.org">http://www.LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Autoren und &Uuml;bersetzer:</font>
<TABLE summary="translators">
  <tr><td><font size="2">cn --&gt; -- : Wang Xu <small>&lt;wangxu[at]linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">cn --&gt; en: Wang Xu &lt;wangxu[at]linuxfocus.org&gt;</font></td></tr>
  <tr><td><font size="2">en --&gt; de: Katja Socher &lt;katja[at]linuxfocus.org&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2005-01-19, generated by lfparser version 2.52</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
