<HTML
><HEAD
><TITLE
>Configuration</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"><LINK
REL="HOME"
TITLE="Belgian HOWTO"
HREF="index.html"><LINK
REL="PREVIOUS"
TITLE="Introduction"
HREF="intro.html"><LINK
REL="NEXT"
TITLE="Belgian ISP information"
HREF="isp.html"></HEAD
><BODY
CLASS="section"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Belgian HOWTO</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="intro.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="isp.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="section"
><H1
CLASS="section"
><A
NAME="configuration"
></A
>2. Configuration</H1
><DIV
CLASS="section"
><H2
CLASS="section"
><A
NAME="AEN81"
></A
>2.1. Keyboard setup</H2
><P
>&#13;Linux provides 2 ways to set up your keyboard. At the console you can
use <B
CLASS="command"
>loadkeys</B
> and under 
<SPAN
CLASS="application"
>XFree86</SPAN
> you can use
<B
CLASS="command"
>xmodmap</B
>.
			</P
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN87"
></A
>2.1.1. Console</H3
><P
>&#13;To use the keytable for a Belgian keyboard you can use
<TT
CLASS="userinput"
><B
>loadkeys be2-latin1</B
></TT
> or
<TT
CLASS="userinput"
><B
>loadkeys be-latin1</B
></TT
>.
The only difference between the two is that be2-latin1 adds support
for twosuperior and threesuperior (keycode 41) and grave (keycode 43).
				</P
><P
>&#13;Usually <B
CLASS="command"
>loadkeys</B
> is started at boottime from the
scripts located somewhere in 
<TT
CLASS="filename"
>/etc/rc.d</TT
>.
Different distributions handle it differently. Most distributions
have a simple program (like <B
CLASS="command"
>kbdconfig</B
> in Red Hat, 
<B
CLASS="command"
>install-keymap</B
> in Debian or
<B
CLASS="command"
>yast</B
> in SuSE) to change the behaviour of these 
scripts.
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN98"
></A
>2.1.2. XFree86</H3
><P
>&#13;To set your keyboard properly under <SPAN
CLASS="application"
>XFree86</SPAN
>
you've got more choices. 
By running <B
CLASS="command"
>Xconfigurator</B
> (or a similar program) a
config-file for <SPAN
CLASS="application"
>XFree86</SPAN
> is created (with
some standard behaviour). This file is called 
<TT
CLASS="filename"
>XF86Config-4</TT
> or <TT
CLASS="filename"
>XF86Config</TT
>
and is usually located in 
<TT
CLASS="filename"
>/etc/X11</TT
> or 
<TT
CLASS="filename"
>/etc</TT
>
				</P
><P
>&#13;Make sure (and change otherwise) that something similar to this is
given under the <EM
>Keyboard Section</EM
>.
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	Section "Keyboard"
		Protocol        "Standard"
		XkbRules        "xfree86"
		XkbModel        "pc101"
		XkbLayout       "be"
	EndSection
</PRE
></FONT
></TD
></TR
></TABLE
>
				</P
><P
>&#13;If you own a 'microsoft' keyboard (or the less-known penguin
keyboards ;p) you can enable those extra 3 keys by changing the
<EM
>"pc101"</EM
> into <EM
>"pc104"</EM
>.
(I use the extra keys as meta-keys in my windowmanager so some
shortcuts don't conflict with the internal ones of my wm).
				</P
><P
>&#13;To get the AltGr key to work under <SPAN
CLASS="application"
>XFree86</SPAN
>
simply add in the <EM
>Keyboard Section:</EM
>

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	RightAlt        ModeShift
</PRE
></FONT
></TD
></TR
></TABLE
>
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN118"
></A
>2.1.3. Compose key</H3
><P
>&#13;Some people prefer to use a 'Compose'-key to enter their special characters, like:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	<SPAN
CLASS="keysym"
>Compose</SPAN
>-<B
CLASS="keycap"
>'</B
> <B
CLASS="keycap"
>e</B
>    =&#62;    é
	<SPAN
CLASS="keysym"
>Compose</SPAN
>-<B
CLASS="keycap"
>/</B
> <B
CLASS="keycap"
>o</B
>    =&#62;    ø
	<SPAN
CLASS="keysym"
>Compose</SPAN
>-<B
CLASS="keycap"
>c</B
> <B
CLASS="keycap"
>,</B
>    =&#62;    ç
	<SPAN
CLASS="keysym"
>Compose</SPAN
>-<B
CLASS="keycap"
>c</B
> <B
CLASS="keycap"
>o</B
>    =&#62;    ©
	<SPAN
CLASS="keysym"
>Compose</SPAN
>-<B
CLASS="keycap"
>s</B
> <B
CLASS="keycap"
>s</B
>    =&#62;    ß
</PRE
></FONT
></TD
></TR
></TABLE
>

For XFree86, the solution is to enter <TT
CLASS="userinput"
><B
>xmodmap -e "keycode xx = Multi_key"</B
></TT
>
or <TT
CLASS="userinput"
><B
>xmodmap -e "keysym yy = Multi_key"</B
></TT
>
where 'xx' is the keycode or 'yy' the keysym of the key you choose to
be the 'Compose'-key.
(use <B
CLASS="command"
>xev</B
> to get these values)
				</P
><P
>&#13;Alternatively you can add <TT
CLASS="userinput"
><B
>keycode xx = Multi_key</B
></TT
>
to your <TT
CLASS="filename"
>~/.xmodmaprc</TT
>. This way it happens automagically.
				</P
><P
>&#13;For the console, you could do something similar with loadkeys.
<TT
CLASS="userinput"
><B
>echo "altgr keycode 52 = Compose" | loadkeys</B
></TT
> to use 
<SPAN
CLASS="keysym"
>AltGr</SPAN
>-<B
CLASS="keycap"
>/</B
> as a 'Compose'-key.
				</P
></DIV
></DIV
><DIV
CLASS="section"
><H2
CLASS="section"
><A
NAME="AEN153"
></A
>2.2. Display and applications</H2
><P
>&#13;Some applications have to be compiled as 8-bit clean to work well
with the European characterset. Others like to be told in advance.
			</P
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN156"
></A
>2.2.1. Using the ISO-8859-1 font in console</H3
><P
>&#13;You can load the ISO-8859-1 font by typing the following in console:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	setfont lat1u-16.psf
	mapscrn trivial
	echo -ne '\033(K'
</PRE
></FONT
></TD
></TR
></TABLE
>
				</P
><P
>&#13;To be able to use ë, è, é or ç in console,
you might want to add these to your <TT
CLASS="filename"
>~/.inputrc</TT
>:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	set meta-flag on
	set convert-meta off
	set output-meta on
</PRE
></FONT
></TD
></TR
></TABLE
>

(This must be done for every user, if you want this to be default for
all users you can either add this file to 
<TT
CLASS="filename"
>/etc/skel/</TT
> or you could add 
these lines to <TT
CLASS="filename"
>/etc/inputrc</TT
> and add the
following to <TT
CLASS="filename"
>/etc/bashrc</TT
>,
<TT
CLASS="userinput"
><B
>export INPUTRC=/etc/inputrc</B
></TT
>)
				</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="CENTER"
><B
>Note!</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;This is only useful to programs that use readline 
(like <SPAN
CLASS="application"
>bash</SPAN
>)
					</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;Also set the following environment variables:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	LC_CTYPE=iso-8859-1
	SYSFONT=lat1u-16.psf
	SYSTERM=linux
</PRE
></FONT
></TD
></TR
></TABLE
>
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN173"
></A
>2.2.2. Support for the Euro symbol</H3
><P
>&#13;Since Europe had to invent a new character, the Euro, there's a new 
standard. It's called ISO-8859-15 (aka Latin-9 or Latin-0). To add
support you need both a new font and new keymaps.  This is part of
every major distribution nowadays, if you have an older distributions
you probably need a newer <EM
>console-tools</EM
> package.
				</P
><P
>&#13;There's more information in the 
<A
HREF="http://www.tldp.org/HOWTO/mini/Euro-Char-Support/"
TARGET="_top"
>Euro Character Support mini HOWTO</A
>
				</P
></DIV
></DIV
><DIV
CLASS="section"
><H2
CLASS="section"
><A
NAME="AEN179"
></A
>2.3. Time zone</H2
><P
>&#13;Since Belgium is located in the Central European Time zone (aka MET)
which (in the winter) is equivalent to the Greenwhich Mean Time plus 1
(GMT+1), you can simply link 
<TT
CLASS="filename"
>/usr/lib/zoneinfo/localtime/MET</TT
> to 
<TT
CLASS="filename"
>/etc/localtime</TT
> symbolicly like: 

<TT
CLASS="userinput"
><B
>&#13;	ln -sf /usr/lib/zoneinfo/MET /etc/localtime
</B
></TT
>
or 
<TT
CLASS="userinput"
><B
>&#13;	ln -sf /usr/lib/zoneinfo/Europe/Brussels /etc/localtime
</B
></TT
>

This automagically sets Daylight Savings (which is GMT+2 in the
summer). 
		</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="CENTER"
><B
>Note!</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;Different distributions have different paths,
zoneinfo can be located in 
<TT
CLASS="filename"
>/usr/share</TT
> or such...
			</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="CENTER"
><B
>Another note!</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;Red Hat uses a tool called <B
CLASS="command"
>timeconfig</B
>, 
SuSE uses <B
CLASS="command"
>yast</B
>
			</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;To change the <SPAN
CLASS="acronym"
>CMOS</SPAN
> clock and then synchronize the
system time with the <SPAN
CLASS="acronym"
>CMOS</SPAN
> clock, do something like
this: 

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	hwclock --set --date="Feb 25 03:38"
	clock -u -s
</PRE
></FONT
></TD
></TR
></TABLE
>

If your clock is set to local time (which is discouraged but if you
also run broken OS's, you must), you can do: 

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	hwclock --set --date="Feb 25 04:38"
	clock -s
</PRE
></FONT
></TD
></TR
></TABLE
>

[Noticed the 1 hour difference ? ;p] 
		</P
><P
>&#13;If your computer has Internet-access you can use 
<SPAN
CLASS="acronym"
>NTP</SPAN
> (Network Time Protocol) to keep your system
clock in sync. One way of doing this is by starting ntpdate from 
<SPAN
CLASS="application"
>cron</SPAN
> by adding

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	05 0 * * * root /usr/sbin/ntpdate -s ntp.belnet.be &#62; /dev/null 2&#62;&#38;1
</PRE
></FONT
></TD
></TR
></TABLE
>

to your <EM
>/etc/crontab</EM
>. Check the 
<SPAN
CLASS="acronym"
>ISP</SPAN
>-information below to see if your
<SPAN
CLASS="acronym"
>ISP</SPAN
> has a <SPAN
CLASS="acronym"
>NTP</SPAN
>-server available.
		</P
></DIV
><DIV
CLASS="section"
><H2
CLASS="section"
><A
NAME="AEN208"
></A
>2.4. Locale support</H2
><P
>&#13;Not much programs support locale yet, if you want to know more about
locale or how to write your own programs to support it, check: 
[put the damn url here ;p]
		</P
><P
>&#13;Be aware that locale makes it harder to resolve problems as less
people can help you !! You might understand a problem when it's in
technical English, but what if it's translated in some obscure
Dutch ?
		</P
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN212"
></A
>2.4.1. Dutch</H3
><P
>&#13;To enable support for the Dutch locale in Belgium on a system with
locale support you just have to set the following environment
variables: 

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	LANG=nl
	LANGUAGE=nl_BE
</PRE
></FONT
></TD
></TR
></TABLE
>

Try nl_BE.ISO_8859-1 if nl_BE does not work.
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN216"
></A
>2.4.2. French</H3
><P
>&#13;If you want French locale support in Belgium, set the following environment 
variabels:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	LANG=fr
	LANGUAGE=fr_BE
</PRE
></FONT
></TD
></TR
></TABLE
>

Try fr_BE.ISO_8859-1 if fr_BE does not work. 
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN220"
></A
>2.4.3. German</H3
><P
>&#13;If you want instead German locale support in Belgium, set the 
following environment variabels:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	LANG=de
	LANGUAGE=de_BE
</PRE
></FONT
></TD
></TR
></TABLE
>

Try de_BE.ISO_8859-1 if de_BE does not work. 
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN224"
></A
>2.4.4. Walloon</H3
><P
>&#13;For Walloon locale support you can find files and information at:
<A
HREF="http://chanae.stben.be/linux/locales/walon/"
TARGET="_top"
>http://chanae.stben.be/linux/locales/walon/</A
>.
To use it set:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	LANG=wa
	LANGUAGE=wa_BE:fr_BE
</PRE
></FONT
></TD
></TR
></TABLE
>

Try wa_BE.ISO_8859-1 if wa_BE does not work. 
				</P
></DIV
></DIV
><DIV
CLASS="section"
><H2
CLASS="section"
><A
NAME="AEN229"
></A
>2.5. Native language support and codepages</H2
><P
>&#13;These options add support for the Belgian characterset and codepages.
If you'd like to have these, compile a kernel with these options put
on. They only apply to some filesystems (<SPAN
CLASS="acronym"
>FAT</SPAN
>-based,
ISO9660, ...).

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	&#60; &#62; Codepage 850 (Europe) 
	&#60; &#62; NLS ISO 8859-1  (Latin 1; Western European Languages)  
	&#60; &#62; NLS ISO 8859-15 (Latin 9; Western European Languages with Euro)
</PRE
></FONT
></TD
></TR
></TABLE
>
Located in <EM
>Filesystems</EM
> &#62;
<EM
>Native Language Support</EM
>
			</P
><P
>&#13;If your kernel is a modular kernel that came with your distribution 
(=you never compiled a kernel before), then you might want to type:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	insmod nls_cp850
	insmod nls_iso8859_1
	insmod nls_iso8859_15
</PRE
></FONT
></TD
></TR
></TABLE
>
			</P
></DIV
><DIV
CLASS="section"
><H2
CLASS="section"
><A
NAME="AEN238"
></A
>2.6. Ispell</H2
><P
>&#13;   <EM
>&#13;    Contributed by Dany Vanderroost <TT
CLASS="email"
>&#60;<A
HREF="mailto:danyv@euronet.be"
>danyv@euronet.be</A
>&#62;</TT
>
   </EM
>
			</P
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN243"
></A
>2.6.1. Install and setup</H3
><P
>&#13;Ispell is composed of different components: the main software and 
one or more dictionaries. The default dictionary is
<TT
CLASS="filename"
>/usr/lib/ispell/english.hash</TT
>. To override this default
you have 2 options. Either you can set the <TT
CLASS="envar"
>DICTIONARY</TT
>-variable
or launch it with the "-d" option.
				</P
><P
>&#13;You can create custom dictionaries in your home-directory like
<TT
CLASS="filename"
>~/.ispell_english</TT
>.
			</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN250"
></A
>2.6.2. Dutch</H3
><P
>&#13;<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	export DICTIONARY=nederlands
</PRE
></FONT
></TD
></TR
></TABLE
>
       or
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	ispell -d nederlands file_name
</PRE
></FONT
></TD
></TR
></TABLE
>
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN255"
></A
>2.6.3. French</H3
><P
>&#13;<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	export DICTIONARY=francais
</PRE
></FONT
></TD
></TR
></TABLE
>
       or
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	ispell -d francais file_name
</PRE
></FONT
></TD
></TR
></TABLE
>
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN260"
></A
>2.6.4. German</H3
><P
>&#13;<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	export DICTIONARY=deutsch
</PRE
></FONT
></TD
></TR
></TABLE
>
       or
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	ispell -d deutsch file_name
</PRE
></FONT
></TD
></TR
></TABLE
>
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN265"
></A
>2.6.5. Walloon</H3
><P
>&#13;<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	export DICTIONARY=walon
</PRE
></FONT
></TD
></TR
></TABLE
>
       or
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	ispell -d walon file_name
</PRE
></FONT
></TD
></TR
></TABLE
>
				</P
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN270"
></A
>2.6.6. Multilanguage spelling</H3
><P
>&#13;By default Ispell will not work with multiple dictionaries but the solution
is to work with the <TT
CLASS="filename"
>~/.ispell_words</TT
> file.
				</P
><P
>&#13;If you don't want to make multi instance with Ispell, You can build 
<TT
CLASS="filename"
>~/.ispell_words</TT
> with the words package by
<TT
CLASS="userinput"
><B
>cp /usr/dict/words ~/.ispell_words; chmod +w ~/.ispell_words</B
></TT
>.
				</P
></DIV
></DIV
><DIV
CLASS="section"
><H2
CLASS="section"
><A
NAME="AEN277"
></A
>2.7. Setting up Internet</H2
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN279"
></A
>2.7.1. Dialing in with your modem (PPP)</H3
><P
>&#13;To configure <SPAN
CLASS="acronym"
>PPP</SPAN
> correctly, you should check the 
<A
HREF="http://www.linuxports.com/howto/ppp/"
TARGET="_top"
>PPP-HOWTO</A
>.
I try to explain it briefly, but if you have any questions or
problems, read the HOWTO very carefully.
				</P
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN284"
></A
>2.7.1.1. Configuring the modem</H4
><P
>&#13;To configure your modem, you can alter the initstring of your modem.
To learn more about your modem, check 
<A
HREF="http://www.spy.net/~dustin/modem/"
TARGET="_top"
>Ask Mr. Modem</A
>.
					</P
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;If you have a winmodem you will probably not get it to work. More
information about winmodems is at: 
<A
HREF="http://linmodems.org/"
TARGET="_top"
>http://linmodems.org/</A
>. 
Work is underway, but winmodems are not as good as 
<EM
>real</EM
> modems.
					</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN292"
></A
>2.7.1.2. Installing pppd</H4
><P
>&#13;Now, you need to have the ppp-package installed (check this by typing 
<TT
CLASS="userinput"
><B
>pppd --version</B
></TT
>), make sure you have a recent
one.  Then you have to make sure you've got these files:
					</P
><P
>&#13;<TT
CLASS="filename"
>/usr/local/bin/ppp</TT
>
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	#!/bin/sh

	case $1 in
		(on|start)
			TELEPHONE='555-1212'        # The telephone number for the connection
			ACCOUNT='your_login'        # The account name for logon (as in 'George Burns')
				PASSWORD='your_pass'        # The password for this account (and 'Gracie Allen')
			INITSTRING='AT&#38;F&#38;C1&#38;D2Z'# Modem initstring
			IPLOCAL=0.0.0.0             # Local IP address if known. Dynamic = 0.0.0.0
			IPREMOTE=0.0.0.0            # Remote IP address if desired. Normally 0.0.0.0
			DEVICE=/dev/ttyS1           # Serial Device com1=ttyS0, com2=ttyS1,...
			SPEED=57600                 # 19200, 38400 or 57600 (don't try something different)
			export TELEPHONE ACCOUNT PASSWORD INITSTRING
			exec /usr/sbin/pppd $DEVICE $SPEED $IPLOCAL:$IPREMOTE \
			user $ACCOUNT connect /etc/ppp/ppp-on-dialer
			;;
		(off|stop)
			if [ -r /var/run/ppp0.pid ]; then
				kill -INT `cat /var/run/ppp0.pid`
				if [ ! "$?" = "0" ]; then
					rm -f /var/run/ppp0.pid
					echo "ERROR: Removed stale pid file"
					exit 1
				fi
				exit 0
			fi
			echo "ERROR: PPP link is not active on ppp0"
			exit 1
			;;
		(info|status)
			/usr/sbin/pppstats
			;;
		(*)
			echo "Usage: ppp on|off|info|start|stop|status";
	esac
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
><P
>&#13;		<TT
CLASS="filename"
>/etc/ppp/ppp-on-dialer</TT
>
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	#!/bin/sh

	exec /usr/sbin/chat -v                                        \
		REPORT CONNECTION                                     \
		REPORT CARRIER                                        \
		TIMEOUT              10                               \
		ABORT                '\nBUSY\r'                       \
		ABORT                '\nNO ANSWER\r'                  \
		ABORT                '\nNO CARRIER\r'                 \
		ABORT                '\nNO DIALTONE\r'                \
		ABORT                '\nRINGING\r\n\r\nRINGING\r'     \
		ABORT                'Invalid Login'                  \
		ABORT                'Login incorrect'                \
		''                   "\r$INITSTRING\r"                \
		'OK-+++\c-OK'        'ATH0'                           \
		TIMEOUT              45                               \
		OK                   "ATDT$TELEPHONE"                 \
		CONNECT              '\d\c'                           \
		ogin:--ogin:         "$ACCOUNT"                       \
		ord:                 "$PASSWORD"
</PRE
></FONT
></TD
></TR
></TABLE
>

You can remove the <TT
CLASS="option"
>-v</TT
> once everything looks
normal.
					</P
><P
>&#13;The pppd command uses <TT
CLASS="filename"
>/etc/ppp/options</TT
> to list
its options, change these options to whatever fits. These defaults
normally work in most cases.

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	asyncmap 20a0000
	crtscts
	debug
	default-mru
	defaultroute
	detach
	escape 11,13,ff
	hide-password
	ipcp-accept-local
	ipcp-accept-remote
	lcp-echo-failure 4 
	lcp-echo-interval 400 
	lock
	modem
	mtu 1500
	netmask 255.255.255.0
	noipdefault
	passive

	#idle 300 
	#kdebug 0
	#-vj
</PRE
></FONT
></TD
></TR
></TABLE
>

Once dialing in works like a charm, you can leave
<TT
CLASS="option"
>debug</TT
> out.
					</P
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;It is important to emphasize that every special
character, thus every character that is not [a-ZA-Z0-9] and '_', 
should be escaped by preceding it with a '\'-character. 
Thus "e!b$l+" would become "e\!b\$l\+".
Try it if you are having troubles !
					</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN309"
></A
>2.7.1.3. pap-secrets / chap-secrets</H4
><P
>&#13;If your ISP requires CHAP or PAP, you need one of these files with 
their proper username and password:
					</P
><P
>&#13;<TT
CLASS="filename"
>/etc/ppp/pap-secrets</TT
> or <TT
CLASS="filename"
>/etc/ppp/chap-secrets</TT
>
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	#client         server  secret          IP      
	your_login      *       your_pass       *
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN316"
></A
>2.7.1.4. Network</H4
><P
>&#13;To configure your nameservers, change 
<TT
CLASS="filename"
>/etc/resolv.conf</TT
>. If dialing in is succesful, 
but you can't get it to connect to <SPAN
CLASS="acronym"
>URL</SPAN
>'s:
this is probably the cause.

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	domain domain_of_your_isp
	nameserver your_primary_nameserver
	nameserver your_secondary_nameserver
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN322"
></A
>2.7.1.5. File permissions</H4
><P
>&#13;Before you can run a (shell)script, it must be set executable. Be sure
that you set the permissions so that other users cannot see the
passwords stored in the files. If you want other users to be able to
dial in, you might want to consider using <B
CLASS="command"
>sudo</B
>.
You might want to do the following:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	chmod u+rw og-rwx -R /etc/ppp
	chmod u+x /etc/ppp/ppp-on-dialer /usr/local/bin/ppp
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN327"
></A
>2.7.1.6. Dial + Hangup</H4
><P
>&#13;Then if <TT
CLASS="filename"
>/usr/local/bin</TT
> is in
your <TT
CLASS="envar"
>PATH</TT
>, you can easily dial in with
<TT
CLASS="userinput"
><B
>ppp on</B
></TT
>, hangup with <TT
CLASS="userinput"
><B
>ppp off</B
></TT
>
and to get some statistics, you do: <TT
CLASS="userinput"
><B
>ppp status</B
></TT
>.
					</P
></DIV
></DIV
><DIV
CLASS="section"
><H3
CLASS="section"
><A
NAME="AEN335"
></A
>2.7.2. Dialing in with your ISDN-modem</H3
><P
>&#13;   <EM
>&#13;    Contributed by Christophe Lambin <TT
CLASS="email"
>&#60;<A
HREF="mailto:clambin@skynet.be"
>clambin@skynet.be</A
>&#62;</TT
>
   </EM
>
				</P
><P
>&#13;This section does not aim to be a definitive guide on ISDN for Linux. 
For a more detailed discussion on the topic, see 
<A
HREF="http://www.wurtel.demon.nl/"
TARGET="_top"
>Paul Slootman's ISDN4Linux HOWTO</A
> 
and <A
HREF="http://www.isdn4linux.de/faq/"
TARGET="_top"
>ISDN4Linux-FAQ</A
>.
				</P
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN343"
></A
>2.7.2.1. Updating the kernel</H4
><P
>&#13;If you're using a 2.2 kernel, it's recommended to get an updated
version of the <SPAN
CLASS="acronym"
>ISDN</SPAN
> code. You can retrieve it 
from <SPAN
CLASS="application"
>CVS</SPAN
> at 
<A
HREF="ftp://ftp.suse.com/pub/isdn4linux/"
TARGET="_top"
>ftp://ftp.suse.com/pub/isdn4linux/</A
>. 
For more information, check: 
<A
HREF="http://www.brisse.dk/site/linux/docs/isdn.htm"
TARGET="_top"
>http://www.brisse.dk/site/linux/docs/isdn.htm</A
>
					</P
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;If you've recently purchased an Eicon Diva 2.0 PCI
(eg, via Belgacom), there's a good chance you've actually got a 
Diva 2.01.In this case, you must get a version dated 1 July 1999 or
later !
					</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;Once the <SPAN
CLASS="acronym"
>ISDN</SPAN
> is in place, you can start up the
driver. Eg: <TT
CLASS="userinput"
><B
>modprobe hisax type=11 protocol=2</B
></TT
>
Refer to the Readme's for the right parameters and values for your
card. 
					</P
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN355"
></A
>2.7.2.2. ISDN4Linux toolkit</H4
><P
>&#13;Next, you'll need the ISDN4Linux toolkit.  You can retrieve the latest
version of the toolkit at: <A
HREF="ftp://ftp.suse.com/pub/isdn4linux/"
TARGET="_top"
>ftp://ftp.suse.com/pub/isdn4linux/</A
>
					</P
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN359"
></A
>2.7.2.3. Configuring the interface</H4
><P
>&#13;With the tools installed and configured, write a script to configure
the interface, to be used for the <SPAN
CLASS="acronym"
>ISDN</SPAN
> connection.
As always in Linux, there's no one correct way of doing this. I've
put these in a script 
					</P
><P
>&#13;<TT
CLASS="filename"
>/etc/rc.d/rc.isdn</TT
>:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	#!/bin/sh

	MSNREMOTE='555-1212'    # Phone number of ISP
	MSNLOCAL='555-1313'     # my number, without 0, with areacode
	ACCOUNT='george'        # The account for logon (as 'George Burns')
	IPLOCAL=10.0.0.2        # my fixed IP (use 10.0.0.2 if no fixed)
	IPREMOTE=0.0.0.0        # IP number of ISP
	INTERFACE=ippp0
	/sbin/modprobe hisax type=11 protocol=2
	/sbin/isdnctrl verbose 3 system on
	/sbin/isdnctrl addif $IF
	/sbin/isdnctrl secure $IF on 
	/sbin/isdnctrl addphone $IF out $MSNREMOTE
	/sbin/isdnctrl eaz $IF $MSNLOCAL
	/sbin/isdnctrl huptimeout $IF 300
	/sbin/isdnctrl l2_prot $IF hdlc
	/sbin/isdnctrl l3_prot $IF trans
	/sbin/isdnctrl encap $IF syncppp
	/sbin/isdnctrl dialmode $IF auto
	/sbin/ifconfig $IF $IPLOCAL pointopoint $IPREMOTE -arp -broadcast
	/sbin/ipppd /dev/ippp0 user $ACCOUNT $IPLOCAL:$IPREMOTE
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
><P
>&#13;To start this at boot time, make it executable and append the
following to <TT
CLASS="filename"
>/etc/rc.d/rc.local</TT
>:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	if [ -x /etc/rc.d/rc.isdn ]; then
		. /etc/rc.d/rc.isdn
	fi
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
><P
>&#13;The <B
CLASS="command"
>ipppd</B
> command gets its parameters passed
through a file, <TT
CLASS="filename"
>/etc/ppp/ioptions</TT
>:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	-ac
	-bsdcomp
	debug
	defaultroute
	ipcp-accept-local
	ipcp-accept-remote
	mru 1524
	mtu 1500
	noipdefault
	-pc
	useifip
	-vj
	-vjccomp

	#idle 360
	#persistent
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;Do NOT specify +pap or +chap in this file. This
specifies the authentication that ipppd should use for an INCOMING
client. If you were to use this to connect to your ISP, ipppd would
wait for the ISP to authenticate itself using the specified protocol.
					</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;It is important to emphasize that every special
character, thus every character that is not [a-ZA-Z0-9] and '_'
should be escaped by preceding it with a '\'-character. Thus 'e!b$l+'
would become 'e\!b\$l\+'.  Try it if you are having troubles !
					</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;Finally, create <TT
CLASS="filename"
>/etc/ppp/ip-down.local</TT
> to handle
the shutdown of the interface:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	#!/bin/sh

	/sbin/ifconfig $1 down
	sleep 1
	/sbin/ifconfig $1 10.0.0.2 pointopoint 
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="CENTER"
><B
>Note!</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;This is to handle some problems with routes on
shutdowns.  Anyone know of a clean(er) solution ?
						</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN383"
></A
>2.7.2.4. pap-secrets / chap-secrets</H4
><P
>&#13;If your ISP uses PAP or CHAP, create a file 
<TT
CLASS="filename"
>/etc/ppp/pap-secrets</TT
> or
<TT
CLASS="filename"
>/etc/ppp/chap-secrets</TT
>. Its format is:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	#client         server  secret          IP      
	your_login      *       your_pass       *
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN389"
></A
>2.7.2.5. Network</H4
><P
>&#13;Not really related to <SPAN
CLASS="acronym"
>ISDN</SPAN
>, but a lot of people
forget this step (too eager to try out all the stuff they typed in
above ? :-)).
					</P
><P
>&#13;Anyway, you need to configure the DNS, by creating a file 
<TT
CLASS="filename"
>/etc/resolv.conf</TT
>:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	domain your_domain_of_your_isp
	nameserver your_primary_nameserver
	nameserver your_secondary_nameserver
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN396"
></A
>2.7.2.6. File permissions</H4
><P
>&#13;Before you can run a (shell)script, it must be set executable. Be sure
that you set the permissions so that other users cannot see the
passwords stored in the files. If you want other users to be able to
dial in, you might want to consider using <B
CLASS="command"
>sudo</B
>.
You might want to do the following:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	chmod u+rw og-rwx -r /etc/ppp
	chmod u+x /etc/rc.d/rc.isdn /etc/ppp/ip.down-local /usr/local/bin/isdn
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
></DIV
><DIV
CLASS="section"
><H4
CLASS="section"
><A
NAME="AEN401"
></A
>2.7.2.7. Dial + Hangup</H4
><P
>&#13;Finally, you can write a little wrapper to start and stop the ISDN 
connection. I've put this as <B
CLASS="command"
>/usr/local/bin/isdn</B
>:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="screen"
>&#13;	#!/bin/bash
	
	case $1 in
		(on|start)
			/sbin/isdnctrl dial ippp0
			;;
		(off|stop)
			/sbin/isdnctrl hangup ippp0
			;;
		(info|status)
			/sbin/isdnctrl list ippp0
			;;
		(*)
			echo "Usage: isdn on|off|info|start|stop|status"
	esac
</PRE
></FONT
></TD
></TR
></TABLE
>
					</P
><P
>&#13;Then if <TT
CLASS="filename"
>/usr/local/bin</TT
> is in
your <TT
CLASS="envar"
>PATH</TT
>, you can easily dial in with
<TT
CLASS="userinput"
><B
>isdn on</B
></TT
> and hangup with 
<TT
CLASS="userinput"
><B
>isdn off</B
></TT
>.
					</P
></DIV
></DIV
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="intro.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="isp.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Introduction</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
>&nbsp;</TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Belgian ISP information</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>