<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.52">
 <META NAME="LFCATEGORY" CONTENT="SoftwareDevelopment">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf356, SoftwareDevelopment: Pr&ecirc;t &agrave; conna&icirc;tre un compilateur pascal libre: Free Pascal</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 table.left { margin-right:0.3cm }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 div.tbbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   margin: 2px 5px 2px 5px;
   text-align: center;
   width: 20em;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
 div.bbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   float: left;
   margin: 2px 5px 2px 5px;
   text-align: center;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Razmal Djamal
 =LF=CAT___: SoftwareDevelopment
 =LF=TITLE_: Pr&ecirc;t &agrave; conna&icirc;tre un compilateur pascal libre: Free Pascal
 =LF=NUMBER: 356
 =LF=ANAME_: article356.shtml
 =LF=PARSER: 2.52
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, current, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><a href="../../index.shtml"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></a></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 
                 <A class="nodec" href="../../index.shtml"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Carte</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Index</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/index.html"><FONT color=
                 "#DDDDDD" size="2">Recherche</FONT></A> </TD>
                 
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/index.shtml"><FONT color=
           "#FFFFFF">Nouvelles</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/index.html"><FONT color=
           "#FFFFFF">Archives</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/index.html"><FONT color=
           "#FFFFFF">Liens</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">A propos</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfdynahead ver 1.5 --><TABLE ALIGN="right" border=0><TR><TD ALIGN="right"><FONT SIZE="-1" FACE="Arial,Helvetica">Ce document est disponible en: <A href="../../English/November2004/article356.shtml">English</a> &nbsp;<A href="../../Deutsch/November2004/article356.shtml">Deutsch</a> &nbsp;<A href="../../Francais/November2004/article356.shtml">Francais</a> &nbsp;<A href="../../Portugues/November2004/article356.shtml">Portugues</a> &nbsp;<A href="../../Indonesian/November2004/article356.shtml">Indonesian</a> &nbsp;<A href="../../Turkce/November2004/article356.shtml">Turkce</a> &nbsp;</FONT></TD></TR></TABLE><br>
 


<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_START -->
<TABLE ALIGN="LEFT" BORDER="0" WIDTH="195" summary="about the author" class="left">
<TR>
<TD>

<img src="../../common/images2/RazmalDjamal.jpg" alt="[Photo of the
    Author]" width="140" height="168">
<BR>par  Razmal Djamal <a href="http://razmal.blogspot.com"><font size="1">(homepage)</font></a>
<BR><BR>
<I>L&acute;auteur:</I><BR>
<!-- aboutauthor_start -->
<p>Je suis un grand fan de l'Open Source. J'aime la mani&egrave;re dont ils
    travaillent ensemble sans voir les autres. Et c'est merveilleux de rendre
    notre connaissance disponible comme une ressource libre &agrave; tous les gens du
    monde entier. Nous devenons un monde, un univers sans restrictions en
    terme de race, nation ou religion. Je fais mon travail sur diff&eacute;rents
    syst&egrave;mes mais je pr&eacute;f&egrave;re Linux. Je suis un nomade Linux, je bouge partout
    et je m'int&eacute;resse &agrave; beaucoup de choses - mais j'aime par dessus tout
    &eacute;crire du code - sp&eacute;cialement en Pascal et Python. Je suis musulman et
    donc j'adore mon grand proph&egrave;te Mohammed SAW. Mes meilleures
    salutations &agrave; lui et puisse Allah SWT. Tout amour, salutation et promesses
    lui sont dues.</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED_TO fr -->
<BR><BR><I>Traduit en Français par:</I><BR>
Jean-Etienne Poirrier (<a href="http://www.poirrier.be"><font size="1">homepage</font></a>)
<br>
<!--
 =LF=TRANSTO=fr: Jean-Etienne Poirrier
-->
<!-- TRANSLATED_TO_STOP -->
<!-- INDEX_START -->
<BR><i>Sommaire</i>:
<UL>
  <LI><A HREF="#356lfindex0">Introduction</A></LI>
  <LI><A HREF="#356lfindex1">Pr&eacute;-requis minimum</A></LI>
  <LI><A HREF="#356lfindex2">Pourquoi le Pascal ? Pourquoi Free Pascal ?</A></LI>
  <LI><A HREF="#356lfindex3">Directement &agrave; l'installation</A></LI>
  <LI><A HREF="#356lfindex4">Bonjour tout le monde</A></LI>
  <LI><A HREF="#356lfindex5">R&eacute;sum&eacute;</A></LI>
  <LI><A HREF="#356lfindex6">Liens</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=356">Talkback form for this article</A></LI>
</UL>

</TD></TR></TABLE>
<!-- INDEX_STOP -->
<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_STOP -->
<!-- HEAD_OF_THE_ARTICLE_START -->
<br>&nbsp;
<table border="0"><tr><td>
<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfPdf ver 0.1 -->
<TABLE style="border-style:outset; border-width:1px" align="right" bgcolor="#ff9616" cellspacing="1"><TR><TD bgcolor="#ff9616">
        <a href="../Archives/lf-2004_11-0356.pdf"><small>PDF</small></a>
        </TD></TR></TABLE>
         

<H2>Pr&ecirc;t &agrave; conna&icirc;tre un compilateur pascal libre: Free Pascal</H2>
 <img src="../../common/images2/article356/fpc.jpg" alt="[The Free Pascal
    Logo and The Jaguar is courtesy of FreePascal.org]" hspace="10"
    width="616" height="166">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>R&eacute;sum&eacute;</i>:
<P>
<!-- articleabstract_start -->
<p>Plusieurs d'entre vous pourraient se souvenir du l&eacute;gendaire Turbo
    Pascal. Apr&egrave;s cela, les outils de d&eacute;veloppement rapide d'applications (RAD,
    Rapid Application Development) nomm&eacute;s Delphi et Kylix (pour Linux) sont
    arriv&eacute;s et, avec eux, des langages de programmation &agrave; la syntaxe similaire
    &agrave; celle du Pascal. Les langages Pascal en simples fichiers texte ASCII ont
    presque disparu aujourd'hui. Maintenant, Free Pascal monte, avec une
    combinaison de programmation en mode texte et de l'orient&eacute; objet aussi
    puissant que le RAD Delphi.</p>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- HEAD_OF_THE_ARTICLE_STOP -->
<!-- BODY_OF_THE_ARTICLE_START -->


    <A NAME="356lfindex0">&nbsp;</A>
<H2>Introduction</H2>


    <p>Free Pascal est un compilateur libre pour les langages &agrave; syntaxe
    Pascal, s&eacute;mantiquement similaire et compatible avec Borland Turbo Pascal
    7, le dernier Turbo Pascal l&eacute;gendaire. Il est fourni avec de nombreuses
    fonctionnalit&eacute;s puissantes et se situe comme une combinaison de TP7 et le
    Pascal Objet de Delphi. Pour le moment, l'&eacute;quipe de d&eacute;veloppement de Free
    Pascal travaille fort pour cr&eacute;er un meilleur compilateur pour un usage
    entre diff&eacute;rentes plateformes. Vous pouvez t&eacute;l&eacute;charger les paquets
    d'installation pour tout type de plates-formes &agrave; partir de [1].</p>

    <A NAME="356lfindex1">&nbsp;</A>
<H2>Pr&eacute;-requis minimum</H2>


    <p>Free Pascal est capable de tourner sur un processeur 386. Mais je
    pr&eacute;f&egrave;re utiliser des processeurs comme le 486 et plus &eacute;volu&eacute;s. Les CPU
    d'AMD fonctionnent bien s&ucirc;r aussi puisqu'ils sont compatibles avec le 386.
    Free Pascal peut aussi fonctionner sur processeur Motorola. Vous devez
    au moins poss&eacute;der un 680x0 ou un 68020 pour le faire fonctionner. Sur
    chaque plateforme, je recommande au moins 8 M&eacute;ga-octets de RAM mais il pourra
    m&ecirc;me fonctionner avec seulement 4 M&eacute;ga-octets de RAM. Pour l'espace
    disque, vous devez avoir au minimum 25 M&eacute;ga-octets pour l'installation. Ce
    compilateur est disponible pour diff&eacute;rents syst&egrave;mes d'exploitation. Aux
    derni&egrave;res nouvelles, il est maintenant disponible pour sparc, AMD 64 et
    arm/linux. Si vous &ecirc;tes int&eacute;ress&eacute; de savoir sur combien de plateforme Free
    Pascal est port&eacute;, vous pouvez vous rendre sur la page de t&eacute;l&eacute;chargement &agrave;
    [1]. Il y a des paquets pour Linux, Win32, Amiga, Dos, QNX,Solaris, BeOS,
    NetBSD, FreeBSD et OS2.</p>

    <A NAME="356lfindex2">&nbsp;</A>
<H2>Pourquoi le Pascal ? Pourquoi Free Pascal ?</H2>


    <p>Sous Linux, la plupart des gens appr&eacute;cient juste d'utiliser le C puisque le
    noyau est &eacute;crit en C. Alors pourquoi avez-vous &agrave; apprendre le Pascal ? Je
    code d&eacute;j&agrave; couramment en C mais il y a tant de voies parfaites d'&eacute;crire du
    code en Pascal. Il est tr&egrave;s clair. Il est tr&egrave;s rapide, ne n&eacute;cessite pas de
    fichier make, il est tr&egrave;s structur&eacute;, vous saurez pr&eacute;cis&eacute;ment si vous avez
    affaire &agrave; un bloc de code, une proc&eacute;dure ou une fonction. Les compilateurs
    sont vraiment tr&egrave;s rapides, m&ecirc;me si vous compilez un grand fichier. Une
    chose que j'admire est sa tr&egrave;s bonne int&eacute;gration avec l'assembleur. Il y a
    des ann&eacute;es, Pascal &eacute;tait connu pour produire du code assembleur tr&egrave;s
    lisible. Pour la compatibilit&eacute; Linux, FPC (le Free Pascal Compiler) a
    d'excellentes fonctionnalit&eacute;s ; une fois que vous avez &eacute;crit un programme
    en utilisant le compilateur FPC pour Linux, il pourra alors &ecirc;tre capable
    de tourner sur n'importe quel type de machine Linux. De plus, FPC est
    enti&egrave;rement compatible avec tout type de Pascal, comme TP7, GNUPascal et
    m&ecirc;me avec Delphi et Kylix. Vous pouvez utiliser le code que vous avez
    &eacute;crit avec n'importe lequel d'entre eux. La derni&egrave;re am&eacute;lioration est
    qu'il supporte maintenant la programmation orient&eacute;e objet (OOP), tout
    comme Delphi et Kylix. G&eacute;nial ! Pour quelqu'un qui connait le Pascal
    Objet, c'est tr&egrave;s simple : il n'y a pas de diff&eacute;rences entre eux, tant du
    point de vue de la syntaxe du code que des fonctionnalit&eacute;s puissantes.</p>

    <p>FPC a de beaux avantages aussi. Il est comme un IDE (Integrated
    Development Environment : Environnement de d&eacute;veloppement int&eacute;gr&eacute;), tr&egrave;s
    similaire &agrave; TP7. Je ne peux pas parler assez longuement des avantages.
    Ce compilateur est capable de faire de la programmation pour des bases de
    donn&eacute;es. Vous pouvez vous connecter &agrave; de grands serveurs SQL comme MySQL
    et PostgreSQL, m&ecirc;me InterBase. Et concernant l'interface utilisateur, FPC
    peut &ecirc;tre int&eacute;gr&eacute; avec des widgets comme GTK, Tcl/Tk et ncurses. Donc ...
    Pourquoi Free Pascal ... Pourquoi pas ?!!</p>

    <A NAME="356lfindex3">&nbsp;</A>
<H2>Directement &agrave; l'installation</H2>


    <p>Puisque j'&eacute;cris cet article pour un magazine Linux libre, alors je vais
    prendre l'installation pour l'environnement Linux. Vous avez besoin d'un
    paquet d'installation pour Linux x86. Prenez simplement le paquet rpm de
    la page de t&eacute;l&eacute;chargement. La derni&egrave;re version est la version b&ecirc;ta 1.9.4,
    aussi connue comme 2.0.0-Beta3. Le paquet d'installation vient avec un nom
    unique, par exemple : <code>fpc-1.0.10.i386.tar</code>. Vous devez
    d&eacute;compresser ce fichier. Tapez simplement cette commande : </p>
<pre class="code">
[root@yourlinuxbox /]tar xvf fpc-1.0.10.i386.tar
</pre>
    Cette commande va extraire les fichiers suivants :

    <ul>
      <li>binary.tar</li>

      <li>sources.tar</li>

      <li>docs.tar.gz</li>

      <li>demo.tar.gz</li>

      <li>install.sh</li>
    </ul>
    <br>
    <br>
    Pour installer Free Pascal, taper juste ceci dans votre r&eacute;pertoire fpc, en
    tant que root :
<pre class="code">
[root@yourlinuxbox /]#sh install.sh
</pre>
    ou
<pre class="code">
[root@yourlinuxbox /]#./install.sh
</pre>
    Cette commande installera votre fpc tout frais dans le r&eacute;pertoire par
    d&eacute;faut mais, dans ce processus, il vous sera pos&eacute; de nombreuses
    questions &agrave; propos des chemins et de la localisation de nombreux fichiers.
    Il se termine avec succ&egrave;s lorsque vous voyez ceci :
<pre class="code">
Writing sample configuration file to /etc/fpc.cfg
End of installation.
Refer to the documentation for more information.
</pre>

    <p>L'installation va cr&eacute;er quelques nouveaux r&eacute;pertoires qui sont tr&egrave;s
    utiles pour les d&eacute;butants : </p>

    <ul>
      <li>/usr/local/doc/fpc-1.0.10</li>

      <li>/usr/local/src/fpc-1.0.10</li>

      <li>/usr/local/lib/fpc</li>

      <li>/usr/bin/fpc</li>

      <li>/usr/local/bin/fpc</li>
    </ul>
    <br>
    Maintenant, vous pouvez go&ucirc;ter aux joies d'&eacute;crire dans un langage de
    programmation excellent, tr&egrave;s structur&eacute;, de haut niveau !<br>
    <br>


    <A NAME="356lfindex4">&nbsp;</A>
<H2>Bonjour tout le monde</H2>


    <p>Dans la suite, nous allons essayer d'&eacute;crire le fameux code exemple
    appel&eacute; « Bonjour tout le monde ». Cela ne prend pas beaucoup de temps ni de
    code pour r&eacute;aliser cela, vous devez juste cr&eacute;er un fichier avec
    l'extension pp ou pas. Donc, ouvrez votre &eacute;diteur de texte favori et
    entrez ceci :</p>
<pre class="code">
  begin
    Writeln('Bonjour tout le monde, de la part de Pascal !!!');
  End.
</pre>
    Sauvegardez ce fichier sous le nom « bonjour.pas ». Ensuite, nous entrons
    dans le processus de compilation. Pour compiler ce fichier, entrez juste
    la commande :
<pre class="code">
  fpc bonjour.pas
</pre>
    Pour ex&eacute;cuter le r&eacute;sultat (incroyable, le r&eacute;sultat du processus de
    compilation est un fichier binaire !!!), une image est mieux que mille
    mots ; donc voici le processus de compilation et le r&eacute;sultat du fichier
    binaire :
    <br>
    <br>
     <img src="../../common/images2/article356/compilerun.gif" width="500"
	height="214">

    <p>Puisque le r&eacute;sultat est un fichier binaire, cela signifie que ce
    fichier est ex&eacute;cutable. Ce fichier est ind&eacute;pendant de la distribution,
    vous ne devez pas le compiler sur toutes les machines sur lesquelles vous
    voudriez distribuer ce fichier. L'exemple ci-dessus vous donnera le m&ecirc;me
    r&eacute;sultat, m&ecirc;me si vous le compilez sous Windows 98, sans changer le code.
    Cela est bien s&ucirc;r possible parce que nous n'utilisons pas de
    fonctionnalit&eacute;s sp&eacute;cifiques au syst&egrave;me d'exploitation.</p>

    <A NAME="356lfindex5">&nbsp;</A>
<H2>R&eacute;sum&eacute;</H2>

    Free Pascal est pr&ecirc;t pour une utilisation en production. Il est aussi bon
    (voire meilleur) que les produits commerciaux. L'avantage est que
    celui-ci est libre. Il vous donne plus de flexibilit&eacute; et r&eacute;duit les co&ucirc;ts
    (pas de co&ucirc;t de licence). Free Pascal est un couteau suisse. Vous pouvez
    d&eacute;velopper des programmes Linux plus facilement qu'auparavant. Il en vaut
    l'essai, croyez-moi ... Le but est de commencer une s&eacute;rie sur la
    programmation avec FPC et j'esp&egrave;re que plusieurs d'entre vous me
    rejoindrons dans l'&eacute;criture de code propre avec un compilateur propre et
    structur&eacute;.<br>
    <br>


    <A NAME="356lfindex6">&nbsp;</A>
<H2>Liens</H2>


    <ul>
      <li>[1] Le site officiel de Free Pascal : <a href=
      "http://www.freepascal.org">www.freepascal.org</a></li>
    </ul>
    <!-- vim: set sw=2 ts=2 et tw=74: -->
  


<!-- BODY_OF_THE_ARTICLE_STOP -->
<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback form for this article</h2>
Every article has its own talkback page. On this page you can submit a comment or look at comments from other readers:
<center>
    <table width="250" border=0><tr><td>
    <div class="tbbutton"><A class="nodec" href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=356">&nbsp;talkback page&nbsp;</a></div>
    </td></tr></table>
</center>

<br clear="all">
<HR size="2" noshade>
<table width="250" border=0><tr><td>
<div class="bbutton"><a class="nodec" href="../../index.shtml">&lt;--, LF Sommaire</a></div>
</td><td>
<div class="bbutton"><a class="nodec" href="index.shtml">Sommaire de ce num&eacute;ro</a></div>
</td></tr></table>
<br clear="all">
<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">Site Web maintenu par l&acute;&eacute;quipe d&acute;&eacute;dition LinuxFocus</A>
<BR><FONT COLOR="#1111aa"><a href="../../common/copy.html">&copy; Razmal Djamal</a><br>&quot;some rights reserved&quot; see <a href="../../license/index.shtml">linuxfocus.org/license/</a><br><a href="http://www.linuxfocus.org">http://www.LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Translation information:</font>
<TABLE summary="translators">
  <tr><td><font size="2">id --&gt; -- : Razmal Djamal (<a href="http://razmal.blogspot.com"><font size="1">homepage</font></a>)</font></td></tr>
  <tr><td><font size="2">id --&gt; en: Razmal Djamal (<a href="http://razmal.blogspot.com"><font size="1">homepage</font></a>)</font></td></tr>
  <tr><td><font size="2">en --&gt; fr: Jean-Etienne Poirrier (<a href="http://www.poirrier.be"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2005-01-21, generated by lfparser version 2.52</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
