<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl15</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl14.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl16.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 15</P>
</font></B><P ALIGN="CENTER"><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>Sendmail+IDA</P>
</font></u></B> 
<dir> 
    <p><font face="Verdana" size="2"><a href="garl15.htm#15.1">15.1 Acerca del 
      autor</a><br>
      <a href="garl15.htm#15.2">15.2 Reconocimientos</a><br>
      <a href="garl15.htm#15.3">15.3 Introducci&oacute;n a Sendmail+IDA</a><br>
      <a href="garl15.htm#15.4">15.4 Archivos de configuraci&oacute;n. Preliminares</a><br>
      <a href="garl15.htm#15.5">15.5 El archivo sendmail.cf</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl15.htm#15.5.1">15.5.1 Un 
          ejemplo del archivo sendmail.m4</a><br>
          <a href="garl15.htm#15.5.2">15.5.2 Par&aacute;metros de uso com&uacute;n 
          en sendmail.m4</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl15.htm#15.6">15.6 Un viaje por 
      las tablas de Sendmail+IDA</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl15.htm#15.6.1">15.6.1 mailertable</a><br>
          <a href="garl15.htm#15.6.2">15.6.2 uucpxtable</a><br>
          <a href="garl15.htm#15.6.3">15.6.3 pathtable</a><br>
          <a href="garl15.htm#15.6.4">15.6.4 domaintable</a><br>
          <a href="garl15.htm#15.6.5">15.6.5 alias</a><br>
          <a href="garl15.htm#15.6.6">15.6.6 Tablas utilizadas en raras ocasiones</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl15.htm#15.7">15.7 Instalaci&oacute;n 
      de sendmail</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl15.htm#15.7.1">15.7.1 Desempaquetado 
          de la distribuci&oacute;n ejecutable</a><br>
          <a href="garl15.htm#15.7.2">15.7.2 Elaboraci&oacute;n del fichero sendmail.cf</a><br>
          <a href="garl15.htm#15.7.3">15.7.3 Comprobando el fichero sendmail.cf</a><br>
          <a href="garl15.htm#15.7.4">15.7.4 Integraci&oacute;n global - Prueba 
          de integraci&oacute;n del fichero sendmail.cf y las tablas</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl15.htm#15.8">15.8 Trucos y trivialidades 
      sobre administraci&oacute;n de correo</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl15.htm#15.8.1">15.8.1 Reenv&iacute;o 
          de correo a un sistema inteligente</a><br>
          <a href="garl15.htm#15.8.2">15.8.2 Env&iacute;o de correo a Sistemas 
          Remotos mal configurados</a><br>
          <a href="garl15.htm#15.8.3">15.8.3 Env&iacute;o Forzado de correo a 
          trav&eacute;s de UUCP</a><br>
          <a href="garl15.htm#15.8.4">15.8.4 Prevenci&oacute;n de que el correo 
          sea enviado v&iacute;a UUCP</a><br>
          <a href="garl15.htm#15.8.5">15.8.5 Procesado de la cola de correo a 
          voluntad</a><br>
          <a href="garl15.htm#15.8.6">15.8.6 Informe sobre las estad&iacute;sticas 
          de correo</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl15.htm#15.9">15.9 Integraci&oacute;n 
      y puesta a punto de Distribuciones Ejecutables</a><br>
      <a href="garl15.htm#15.10">15.10 Donde obtener mas informaci&oacute;n</a></font></p>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="15.1"></a>15.1 Acerca del autor</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Vince Skahan (vince@victrola.wa.com) ha estado administrando un gran n&uacute;mero 
  de sistemas Unix desde 1987, y actualmente hace funcionar sendmail+IDA en aproximadamente 
  300 estaciones de trabajo Unix para unos 2000 usuarios.</P>
<P>Admite haber perdido considerablemente el sue&ntilde;o editando unos cuantos 
  ficheros sendmail.cf "por la fuerza bruta" antes de descubrir sendmail+IDA en 
  1990. Admite asimismo que aguarda ansiosamente la llegada de la primera versi&oacute;n 
  en Perl de sendmail, para todav&iacute;a mayor disfrute.</P>
<P>&nbsp;</P>
<B><U> 
<P><font color="#009999"><a name="15.2"></a>15.2 Reconocimientos</font></P>
</u></B>
<P>Gracias a Neil Rickert y Paul Pomes por la gran cantidad de ayuda proporcionada 
  a lo largo de los a&ntilde;os en lo que se refiere al cuidado y mantenimiento 
  de sendmail+IDA y a Rich Braun por hacer el porte inicial a Linux. Las mayores 
  gracias son de lejos para mi mujer Susan, por todo el apoyo en este y otros 
  proyectos.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="15.3"></a>15.3 Introducci&oacute;n a Sendmail+IDA</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Se dice que no se es un verdadero administrador de sistemas Unix hasta que se haya editado el archivo sendmail.cf. Se dice asimismo que se est&aacute; loco si se intenta hacer dos veces.</P>
<P>Sendmail es un programa incre&iacute;blemente potente. Y tambi&eacute;n, para la mayor&iacute;a de la gente, incre&iacute;blemente dif&iacute;cil de aprender y comprender. Un programa cuyo manual de referencia definitiva ocupa 792 p&aacute;ginas es suficiente para espantar justificadamente a cualquiera. (Sendmail, editado por O'Reilly and Associates)</P>
<P>Con sendmail+IDA es distinto. Se elimina la necesidad de editar el siempre cr&iacute;ptico archivo sendmail.cf, permitiendo al administrador definir la configuraci&oacute;n de las rutas y direcciones particulares de una m&aacute;quina especifica, por medio de archivos de apoyo relativamente sencillos de entender, llamados tables. Cambiar a sendmail+IDA puede ahorrarle muchas horas de trabajo y estr&eacute;s.</P>
<P>En comparaci&oacute;n con los dem&aacute;s agentes principales de transporte de correo, es probable que no haya nada que no se pueda hacer m&aacute;s r&aacute;pida y f&aacute;cilmente que con sendmail+IDA.</P>
<P>Las actividades m&aacute;s comunes, necesarias para hacer funcionar sistemas Internet o UUCP usuales, pasan a ser tareas f&aacute;ciles de llevar a cabo.</P>
<P>Configuraciones que normalmente serian extremadamente dif&iacute;ciles, son ahora simples de crear y mantener.</P>
<P>Cuando se escribi&oacute; este manual, la versi&oacute;n actual de sendmail5.67b+IDA1.5 estaba disponible por FTP an&oacute;nimo en vixen.cso.uiuc.edu. Esta versi&oacute;n compila sin parches ni modificaciones bajo Linux.</P>
<P>Todos los archivos de configuraci&oacute;n necesarios para poder compilar, instalar y hacer funcionar los fuentes de sendmail+IDA bajo Linux se hallan en el archivo newspak-2.2.tar.gz, disponible por FTP an&oacute;nimo en sunsite.unc.edu, en el directorio /pub/Linux/system/Mail.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="15.4"></a>15.4 Archivos de configuraci&oacute;n. Preliminares</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El sendmail tradicional se configura a trav&eacute;s de un archivo de configuraci&oacute;n de sistema (t&iacute;picamente /etc/sendmail.cf o /usr/lib/sendmail.cf), que no se asemeja ni de lejos a cualquier otro lenguaje que haya podido ver antes. Editar el archivo sendmail.cf para proporcionar un comportamiento personalizado puede ser una experiencia humillante.</P>
<P>Sendmail+IDA hace que este suplicio sea algo del pasado, siendo todas las opciones de configuraci&oacute;n controladas por ficheros con formato de listados (tables), con una sintaxis bastante f&aacute;cil de comprender. Estas opciones son configuradas mediante el procesado de ciertos archivos de informaci&oacute;n, que son proporcionados con los fuentes, v&iacute;a "Makefiles" que invocan a m4 (analizador de macros) o dbm (procesador de bases de datos).</P>
<P>El archivo sendmail.cf define &uacute;nicamente el comportamiento por omisi&oacute;n del sistema. Virtualmente, todos los ajustes especiales se hacen a trav&eacute;s de un n&uacute;mero de tablas opcionales en vez de editar directamente el archivo sendmail.cf. La figura 15.1 muestra todas las tablas que utiliza sendmail.</P><DIR>
<DIR>

<P><B>mailertable<BR>
</b>define un comportamiento especial para nodos o dominios remotos.</P>
<P><B>uucpxtable<BR>
</b>fuerza a UUCP a entregar el correo a los nodos que est&aacute;n en formato DNS.</P>
<P><B>pathtable<BR>
</b>define rutas de rebote UUCP a nodos o dominios remotos.</P>
<P><B>uucprelays<BR>
</b>cortocircuita el camino pathalias a nodos remotos bien conocidos.</P>
<P><B>genericfrom<BR>
</b>convierte direcciones internas a gen&eacute;ricas visibles para el mundo exterior.</P>
<P><B>xaliases<BR>
</b>convierte direcciones gen&eacute;ricas de/a direcciones internas validas.</P>
<P><B>decnetxtable<BR>
</b>convierte direcciones RFC-822 a direcciones de tipo DECnet.</P></DIR>
</DIR>

<P>Figura 15.1: Archivos de apoyo de sendmail.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="15.5"></a>15.5 El archivo sendmail.cf</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>El archivo sendmail.cf que utiliza sendmail+IDA no se edita directamente, sino 
  que se genera desde un archivo de configuraci&oacute;n m4 proporcionado por 
  el administrador del sistema local. De aqu&iacute; en adelante, siempre nos 
  referiremos a &eacute;l simplemente como sendmail.m4.</P>
<P>Este archivo contiene algunas definiciones y en otros casos simplemente apunta 
  a las tablas en donde se lleva realmente a cabo el trabajo. En general, solo 
  es necesario especificar:</P>
<P><B>o</b> las trayectorias y nombres de archivos utilizados en el sistema local.<BR>
  <B>o</B> el o los nombres de los sistemas conocidos para prop&oacute;sitos e-mail.<BR>
  <B>o</B> cual ser&aacute; el gestor de correo por defecto deseado (y quiz&aacute; 
  tambi&eacute;n alg&uacute;n nodo inteligente de reenv&iacute;o 1 de correo).</P>
<P>Hay una gran variedad de par&aacute;metros que pueden ser definidos para establecer 
  el comportamiento del sistema local o para ir m&aacute;s all&aacute; del comportamiento 
  precompilado. Estas opciones de configuraci&oacute;n se identifican en el archivo 
  ida/cf/OPTIONS del directorio fuente.</P>
<P>Un archivo sendmail.m4 para una configuraci&oacute;n m&iacute;nima (UUCP o 
  SMTP confiando todo el correo externo a anfitriones inteligentes conectados 
  directamente) puede ser tan escueto como 10 o 15 l&iacute;neas de texto excluyendo 
  los comentarios.</P>
<P>_____________________________________________<BR>
  1 N. del T.: estos nodos se conocen tambi&eacute;n como relevos, del ingl&eacute;s 
  relay</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.5.1"></a>15.5.1 Un ejemplo del archivo sendmail.m4</P>
</u></I> 
<P>A continuaci&oacute;n se muestra un ejemplo del archivo sendmail.m4 para vstout 
  en la Cervecera Virtual. vstout utiliza SMTP para hablar con todos los anfitriones 
  de la red local de la Cervecera, y env&iacute;a todo el correo para otros destinos 
  a moria, su nodo de reenv&iacute;o de Internet, v&iacute;a UUCP.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.5.2"></a>15.5.2 Par&aacute;metros de uso com&uacute;n en sendmail.m4</P>
</u></I> 
<P>Algunas partes del archivo sendmail.m4 son necesarias siempre; otras pueden 
  ser ignoradas si se acepta la configuraci&oacute;n por defecto. Las siguientes 
  secciones describir&aacute;n cada una de las partes del archivo ejemplo sendmail.m4 
  con mas detalle.</P>
<P>Partes que definen los directorios</P>
<DIR> 
  <DIR> 
    <P>dnl #define(LIBDIR,/usr/local/lib/mail)dnl # el directorio en donde est&aacute;n<BR>
      # los archivos de soporte</P>
  </DIR>
</DIR>
<P>LIBDIR define el directorio en donde sendmail+IDA espera encontrar los archivos 
  de configuraci&oacute;n, las diversas tablas dbm, y definiciones especiales 
  de &iacute;ndole local. En una t&iacute;pica distribuci&oacute;n ejecutable, 
  esto esta ya compilado en el ejecutable de sendmail y no es necesario ponerlo 
  expl&iacute;citamente en el archivo sendmail.m4.</P>
<P>El ejemplo anterior tiene una l&iacute;nea inicial dnl que significa que esta 
  l&iacute;nea es &uacute;nica y esencialmente un comentario informativo.</P>
<P>Para modificar la localizaci&oacute;n de los archivos de soporte a un lugar 
  distinto, elimine el dnl inicial de la l&iacute;nea superior, y ajuste el directorio 
  deseado, luego recompile y reinstale el archivo sendmail.cf.</P>
<P>Como definir un sistema de correo local (mailer)</P>
<DIR> 
  <DIR> 
    <P>define(LOCAL_MAILER_DEF, mailers.linux)dnl # gestor de correo para entrega 
      local<BR>
      dnl #------------------ EJEMPLO DE UN ARCHIVO SENDMAIL.M4 ---------<BR>
      dnl # (la cadena 'dnl' es la forma de escribir un comentario en m4)<BR>
      dnl # en general usted no debera ignorar LIBDIR de las trayectorias compiladas<BR>
      dnl #define(LIBDIR,/usr/local/lib/mail)dnl # lugar de los arch. de soporte<BR>
      define(LOCAL_MAILER_DEF, mailers.linux)dnl # gestor de correo para la<BR>
      # entrega local<BR>
      <BR>
      define(POSTMASTERBOUNCE)dnl # el gestor de correo obtiene los rebotes<BR>
      define(PSEUDODOMAINS, BITNET UUCP)dnl # no intente usar DNS<BR>
      # en estos casos<BR>
      dnl #-------------------------------------------------------------<BR>
      dnl #<BR>
      define(PSEUDONYMS, vstout.vbrew.com vstout.UUCP vbrew.com)<BR>
      dnl # los nombres seran conocidos por<BR>
      define(DEFAULT_HOST, vstout.vbrew.com)dnl # nuestro nombre primario,<BR>
      # 'nombre' para el correo<BR>
      <BR>
      define(UUCPNAME, vstout)dnl # nuestro nombre uucp<BR>
      dnl #<BR>
      dnl #-------------------------------------------------------------<BR>
      dnl #<BR>
      define(UUCPNODES, |uuname|sort|uniq)dnl # nuestros vecinos uucp<BR>
      define(BANGIMPLIESUUCP)dnl # aseguran que el correo<BR>
      define(BANGONLYUUCP)dnl # uucp sea tratado correctamente<BR>
      define(RELAY_HOST, moria)dnl # nuestro sistema de<BR>
      # relevo inteligente<BR>
      <BR>
      define(RELAY_MAILER, UUCP-A)dnl # alcanzamos moria via uucp<BR>
      dnl #<BR>
      dnl #--------------------------------------------------------------------<BR>
      dnl #<BR>
      dnl # varias tablas de busqueda dbm<BR>
      dnl #<BR>
      define(ALIASES, LIBDIR/aliases)dnl # alias del sistema<BR>
      define(DOMAINTABLE, LIBDIR/domaintable)dnl # distribuci&oacute;n de dominios<BR>
      # entre nodos<BR>
      <BR>
      define(PATHTABLE, LIBDIR/pathtable)dnl # base de datos de trayectorias<BR>
      define(GENERICFROM, LIBDIR/generics)dnl # directorio generico<BR>
      # de direcciones<BR>
      <BR>
      define(MAILERTABLE, LIBDIR/mailertable)dnl # gestores de correo por<BR>
      # nodo o dominio<BR>
      <BR>
      define(UUCPXTABLE, LIBDIR/uucpxtable)dnl # trayectorias a los nodos<BR>
      # que alimentamos<BR>
      <BR>
      define(UUCPRELAYS, LIBDIR/uucprelays)dnl # trayectorias de cortocircuito<BR>
      <BR>
      dnl #<BR>
      dnl #--------------------------------------------------------------------<BR>
      dnl #<BR>
      dnl # incluye el codigo 'real' que hace que todo funcione<BR>
      dnl # (provisto con el codigo fuente)<BR>
      dnl #<BR>
      include(Sendmail.mc)dnl # LINEA INDISPENSABLE !!!<BR>
      dnl #<BR>
      dnl #------------ FIN DEL ARCHIVO EJEMPLO DE SENDMAIL.M4 -------</P>
  </DIR>
</DIR>
<P>Figura 15.2: Un archivo muestra de sendmail.m4 para vstout.</P>
<P>&nbsp;</P>
<P>La mayor parte de los sistemas operativos tienen un programa encargado de la 
  gesti&oacute;n de correo local. Los programas mas comunes para la mayor parte 
  de las variantes de Unix est&aacute;n ya compiladas en el ejecutable de sendmail.</P>
<P>En Linux, es necesario definir expl&iacute;citamente el gestor local de correo 
  correspondiente, ya que, en algunas distribuciones, puede no estar incluido. 
  Esto se lleva a cabo especificando LOCAL_MAILER_DEF en el fichero sendmail.m4</P>
<P>Por ejemplo, para que el popular programa deliver 2 gestione este servicio, 
  se debe especificar en LOCAL_MAILER_DEF mailers.linux.</P>
<P>El siguiente archivo deber&aacute; ser instalado como mailers.linux en el directorio 
  al que apunta LIBDIR. Esto define expl&iacute;citamente el programa deliver, 
  como gestor de correo interno Mlocal ; por lo que con los par&aacute;metros 
  adecuados, sendmail se encargara de entregar correctamente el correo cuyo destino 
  es el sistema local. A menos que se sea un experto de sendmail, es probable 
  que no se desee modificar el siguiente ejemplo.</P>
<DIR> 
  <DIR> 
    <P># -- /usr/local/lib/mail/mailers.linux --<BR>
      # (gestores de correo locales para su uso en Linux)<BR>
      Mlocal, P=/usr/bin/deliver, F=SlsmFDMP, S=10, R=25/10, A=deliver $u<BR>
      Mprog, P=/bin/sh, F=lsDFMeuP, S=10, R=10, A=sh -c $u</P>
  </DIR>
</DIR>
<P>Hay tambi&eacute;n una opci&oacute;n compilada por defecto para deliver en 
  el archivo sendmail.mc incluida en el archivo sendmail.cf. Si se opta por ella, 
  se debe evitar el uso del archivo mailers.linux y en cambio definir lo siguiente 
  en el archivo sendmail.m4:</P>
<DIR> 
  <DIR> 
    <P>dnl --- (en sendmail.m4) ---<BR>
      define(LOCAL_MAILER_DEF, DELIVER)dnl # gestor de correo para entrega local</P>
  </DIR>
</DIR>
<P>Desafortunadamente, Sendmail.mc asume que el programa deliver esta instalado 
  en /bin, lo cual no es el caso con Slackware 1.1.1 (que lo instala en /usr/bin). 
  En este caso es necesario, ya sea enga&ntilde;arlo con un enlace simb&oacute;lico 
  o recompilar deliver a partir del c&oacute;digo fuente para que resida en /bin.</P>
<P>Gesti&oacute;n de correo rechazado</P>
<DIR> 
  <DIR> 
    <P>define(POSTMASTERBOUNCE)dnl # el correo rechazado ira dirigido<BR>
      # al postmaster o administrador de correo.</P>
  </DIR>
</DIR>
<P>_____________________________________________<BR>
  2 deliver fue escrito por Chip Salzenberg (chip%tct@ateng.com). Es parte de 
  varias distribuciones de Linux y se puede encontrar en los sistemas de FTP an&oacute;nimo 
  mas comunes como ftp.uu.net.</P>
<P>&nbsp;</P>
<P>Muchos sistemas consideran importante asegurar que el correo que se env&iacute;a 
  y se recibe tenga un 100% de fiabilidad. Aun cuando es &uacute;til que se examinen 
  los ficheros de registro syslogd(8), en general, el administrador del correo 
  necesitara ver las cabeceras del correo rechazado, de tal forma que pueda determinar 
  si el correo no fue entregado debido a un error del usuario, o a un error de 
  configuraci&oacute;n en alguno de los sistemas involucrados.</P>
<P>La definici&oacute;n de POSTMASTERBOUNCE hace que se env&iacute;e una copia 
  de cada mensaje rechazado a la persona que ha sido definida como Postmaster 
  para el sistema.</P>
<P>Desafortunadamente, al definir este par&aacute;metro, tambi&eacute;n se incluir&aacute; 
  el texto en el mensaje enviado al Postmaster, lo cual en potencia, podr&iacute;a 
  inquietar a los usuarios de correo del sistema en cuanto a su intimidad se refiere.</P>
<P>Es conveniente que los postmasters de sistema se autodisciplinen (o lo hagan 
  por la v&iacute;a de medios t&eacute;cnicos a trav&eacute;s de programitas del 
  shell que borren el texto de los mensajes rechazados que ellos reciben) a no 
  leer el correo que no esta dirigido a ellos.</P>
<P>Asuntos relacionados con el servidor de nombres o Domain Name Service</P>
<DIR> 
  <DIR> 
    <P>define(PSEUDODOMAINS, BITNET UUCP)dnl # no intente usar DNS aqu&iacute;</P>
  </DIR>
</DIR>
<P>Hay varias redes bien conocidas que son punto de referencia com&uacute;n en 
  las direcciones de correo por razones hist&oacute;ricas, pero que no son validas 
  a efectos DNS. El definir PSEUDODOMAINS evita intentos de b&uacute;squeda infructuosos 
  por parte del DNS, que siempre resultaran fallidos.</P>
<P>Como definir los nombres por los que se conoce al sistema local</P>
<DIR> 
  <DIR> 
    <P>define(PSEUDONYMS, vstout.vbrew.com vstout.UUCP vbrew.com)<BR>
      dnl # nombres por los cuales se nos conoce<BR>
      define(DEFAULT_HOST, vstout.vbrew.com)dnl # nuestro 'nombre' primario para 
      el correo</P>
  </DIR>
</DIR>
<P>Frecuentemente, los sistemas quieren ocultar su verdadera identidad, o servir 
  como pasarelas de correo, o recibir y procesar correo dirigido a los nombres 
  anteriores por los cuales se les conoc&iacute;an.</P>
<P>PSEUDONYMS especifica la lista de todos los nombres de sistema para los cuales 
  el sistema local aceptara el correo.</P>
<P>DEFAULT_HOST especifica la direcci&oacute;n de sistema que aparecer&aacute; 
  en los mensajes que se originan en el nodo local. Es importante que este par&aacute;metro 
  sea ajustado a un valor valido o todo el correo de retorno no podr&aacute; ser 
  entregado.</P>
<P>&nbsp;</P>
<P>Temas relacionados con UUCP</P>
<DIR> 
  <DIR> 
    <P>define(UUCPNAME, vstout)dnl # nuestro nombre uucp<BR>
      define(UUCPNODES, |uuname|sort|uniq)dnl # nuestros vecinos uucp<BR>
      define(BANGIMPLIESUUCP)dnl # asegur&aacute;ndonos que el correo<BR>
      define(BANGONLYUUCP)dnl # uucp sea tratado correctamente</P>
  </DIR>
</DIR>
<P>Con frecuencia, los sistemas son conocidos por un nombre a efectos DNS y otro 
  para prop&oacute;sitos de UUCP.</P>
<P>UUCPNAME permite definir que aparezca un nombre de sistema distinto en los 
  encabezados del correo enviado a trav&eacute;s de UUCP.</P>
<P>UUCPNODES define las instrucciones que proporcionan como resultado una lista 
  con las direcciones de sistemas con los cuales se esta conectado directamente 
  a trav&eacute;s de conexiones UUCP.</P>
<P>BANGIMPLIESUUCP y BANGONLYUUCP aseguran que el correo diseccionado con la sintaxis 
  "bang" de UUCP sea tratado de acuerdo con el comportamiento de UUCP en vez de 
  utilizar el DNS, mas com&uacute;n hoy en d&iacute;a en Internet.</P>
<P>Sistemas de relevo y de correo</P>
<DIR> 
  <DIR> 
    <P>define(RELAY_HOST, moria)dnl # nuestro sistema de relevo inteligente<BR>
      define(RELAY_MAILER, UUCP-A)dnl # alcanzamos moria a trav&eacute;s de UUCP</P>
  </DIR>
</DIR>
<P>Muchos administradores de sistema no quieren molestarse en llevar a cabo todo 
  el trabajo necesario para asegurar que su sistema sea capaz de encontrar todas 
  las redes (y por supuesto otros sistemas) existentes en el mundo. En lugar de 
  hacer esto, prefieren confiar todo el correo saliente a otro sistema reconocido 
  como "inteligente".</P>
<P>RELAY_HOST define el nombre UUCP del sistema vecino inteligente.</P>
<P>RELAY_MAILER define el gestor de correo utilizado para enviar los mensajes 
  hacia dicho sistema.</P>
<P>Es importante hacer notar que el ajuste de esos par&aacute;metros redunda en 
  que todo el correo de salida ser&aacute; redirigido a ese sistema remoto, lo 
  cual afectara la carga de ese sistema. Es necesario asegurarse de obtener el 
  consentimiento expl&iacute;cito del Administrador de correo del sistema remoto 
  antes de configurar el nuestro para que utilice a otro como nodo de reenv&iacute;o 
  de correo a efectos generales.</P>
<P>Tablas de configuraci&oacute;n variadas</P>
<DIR> 
  <DIR> 
    <P>define(ALIASES, LIBDIR/aliases)dnl # alias del sistema<BR>
      define(DOMAINTABLE, LIBDIR/domaintable)dnl # m&aacute;quinas bajo el dominio<BR>
      define(PATHTABLE, LIBDIR/pathtable)dnl # base de datos de los caminos<BR>
      define(GENERICFROM, LIBDIR/generics)dnl # direcci&oacute;n generica del 
      remitente<BR>
      define(MAILERTABLE, LIBDIR/mailertable)dnl # gestores de correo por nodo 
      o dominio<BR>
      define(UUCPXTABLE, LIBDIR/uucpxtable)dnl # caminos a los m&aacute;quinas 
      que surtimos<BR>
      define(UUCPRELAYS, LIBDIR/uucprelays)dnl # caminos de cortocircuito</P>
  </DIR>
</DIR>
<P>Con estas macros, se puede cambiar la localizaci&oacute;n donde sendmail+IDA 
  busca las diversas tablas dbm que definen el comportamiento "real" del sistema. 
  Es aconsejable depositarlos en LIBDIR.</P>
<P>El archivo maestro Sendmail.mc</P>
<DIR> 
  <DIR> 
    <P>include(Sendmail.mc)dnl # LINEA INDISPENSABLE!!!</P>
  </DIR>
</DIR>
<P>Los autores de sendmail+IDA proporcionan el archivo Sendmail.mc que contiene 
  las verdaderas "tripas", que ser&aacute;n convertidas al archivo sendmail.cf. 
  Peri&oacute;dicamente, se sacan nuevas versiones que corrigen errores en el 
  c&oacute;digo, o agregan funcionalidad sin necesidad de una nueva versi&oacute;n 
  y la recompilaci&oacute;n general de sendmail.</P>
<P>Es importante no editar este archivo.</P>
<P>Bueno, ¿entonces cuales son las l&iacute;neas indispensables?</P>
<P>Cuando no se est&aacute;n utilizando ninguna de las tablas dbm opcionales, 
  sendmail+IDA entrega el correo v&iacute;a el gestor de correo por omisi&oacute;n 
  DEFAULT_MAILER (y posiblemente el sistema de reenv&iacute;o RELAY_HOST y el 
  gestor de correo de reenv&iacute;o RELAY_MAILER) definidos en el archivo sendmail.m4 
  utilizado para generar sendmail.cf. Es posible modificar f&aacute;cilmente este 
  comportamiento cambiando ciertas l&iacute;neas en los archivos domaintable o 
  uucpxtable.</P>
<P>Un sistema gen&eacute;rico que este en Internet y se comunique por DNS, o uno 
  que sea solo UUCP y env&iacute;e todo su correo v&iacute;a UUCP a trav&eacute;s 
  de un RELAY_HOST inteligente, probablemente no necesite de ninguna modificaci&oacute;n 
  en una "table" especifica.</P>
<P>Virtualmente todos los sistemas deber&iacute;an configurar el DEFAULT_HOST 
  y las macros PSEUDONYMS, de tal modo que definan el nombre can&oacute;nico de 
  sistema, y alias, por los que es conocido, y su DEFAULT_MAILER. Si todo lo que 
  se tiene es un nodo de reenv&iacute;o y un gestor de correo de reenv&iacute;o, 
  no es necesario ajustar estos valores por defecto ya que trabajar&aacute; autom&aacute;ticamente.</P>
<P>Los nodos UUCP probablemente necesiten ajustar su UUCPNAME a su nombre oficial 
  UUCP. Tambi&eacute;n es probable que ajusten su RELAY_MAILER y su RELAY_HOST 
  los cuales habilitaran el encaminado de nodo inteligente a trav&eacute;s de 
  un reenv&iacute;o de correo. El transporte del correo a emplear se define en 
  RELAY_MAILER y normalmente es UUCP-A para sistemas UUCP.</P>
<P>Si su sistema es solo SMTP y emplea 'Domain Name Service' o DNS, se podr&iacute;a 
  cambiar el DEFAULT_MAILER a TCP-A y probablemente borrar las l&iacute;neas RELAY_MAILER 
  y RELAY_HOST.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="15.6"></a>15.6 Un viaje por las tablas de Sendmail+IDA</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Sendmail+IDA proporciona varias tablas que permiten modificar el comportamiento 
  por defecto de sendmail (especificado en el archivo sendmail.m4) y definir un 
  comportamiento especial para situaciones singulares, sistemas remotos y redes. 
  Estas tablas son luego procesadas con dbm, utilizando un Makefile que es parte 
  de la distribuci&oacute;n.</P>
<P>Muchos sistemas necesitaran algunas de estas tablas, otros ninguna. Si su sistema 
  no precisa estas tablas, lo mas sencillo es, probablemente, crearlas con longitud 
  cero (con la instrucci&oacute;n touch) y utilizar el archivo Makefile por defecto 
  localizado en LIBDIR en lugar de editar el Makefile en si mismo.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.6.1"></a>15.6.1 mailertable</P>
</u></I> 
<P>El archivo mailertable define un tratamiento especial para m&aacute;quinas 
  especificas o dominios que est&aacute;n basados en el nodo o nombre de la red 
  remota. Se utiliza de forma frecuente en los sistemas Internet para seleccionar 
  un nodo de reenv&iacute;o de correo intermedio, o una pasarela a trav&eacute;s 
  de la cual alcanzar una red remota, y para especificar el protocolo en particular 
  (UUCP o SMTP) que se utilizara. Los sistemas UUCP por lo general no necesitan 
  este archivo.</P>
<P>El orden es importante: sendmail lee el archivo desde el principio hacia el 
  fin, y procesa el mensaje de acuerdo con la primera regla que encuentra. Por 
  tanto, lo l&oacute;gico normalmente es poner las reglas mas expl&iacute;citas 
  al comienzo del archivo y las mas gen&eacute;ricas al final.</P>
<P>Supongamos que se quiere redirigir todo el correo para el departamento de Ciencias 
  de la Computaci&oacute;n de la Universidad Groucho Marx v&iacute;a UUCP a un 
  sistema de relevo, ada.</P>
<P>Para hacer eso, se debe agregar una l&iacute;nea en mailertable como la siguiente:</P>
<DIR> 
  <DIR> 
    <P># (in mailertable)<BR>
      #<BR>
      # redirige todo el correo para el dominio .cs.groucho.edu v&iacute;a UUCP 
      a ada <BR>
      UUCP-A,ada .cs.groucho.edu&nbsp;</P>
  </DIR>
</DIR>
<P>Suponga que se quiere redirigir todo el correo al dominio m&aacute;s grande 
  groucho.edu para que vaya a otro sistema de relevo, bighub, para la resoluci&oacute;n 
  de sus direcciones y posterior entrega. La expansi&oacute;n de las l&iacute;neas 
  que van en el archivo mailertable seria la siguiente:</P>
<DIR> 
  <DIR> 
    <P># (en mailertable)<BR>
      #<BR>
      # redirige todo el correo para el dominio cs.groucho.edu v&iacute;a UUCP 
      a ada<BR>
      UUCP-A,ada .cs.groucho.edu<BR>
      #<BR>
      # redirige todo el correo para el dominio groucho.edu v&iacute;a UUCP a 
      bighub<BR>
      UUCP-A,bighub .groucho.edu</P>
  </DIR>
</DIR>
<P>Como se menciono anteriormente, el orden es importante. Invertir el orden de 
  las dos reglas mostradas anteriormente tendr&iacute;a como consecuencia que 
  todo el correo dirigido a .cs.groucho.edu fuese a trav&eacute;s del camino mas 
  gen&eacute;rico bighub en vez de utilizar la trayectoria expl&iacute;cita ada 
  que es la que se quiere.</P>
<DIR> 
  <DIR> 
    <P># (en mailertable)<BR>
      #<BR>
      # redirige todo el correo para el dominio .groucho.edu v&iacute;a UUCP a 
      bighub<BR>
      UUCP-A,bighub .groucho.edu<BR>
      #<BR>
      # (es imposible alcanzar la siguiente l&iacute;nea porque<BR>
      # la norma que esta arriba ser&aacute; cumplida primero)<BR>
      UUCP-A,ada .cs.groucho.edu<BR>
      #</P>
  </DIR>
</DIR>
<P>En los ejemplos de mailertable anteriores, el gestor de correo UUCP-A hace 
  que sendmail utilice UUCP como medio de entrega con cabeceras "dominizadas".</P>
<P>La coma entre el gestor de correo y el sistema remoto indica que el mensaje 
  se debe redirigir a ada para la resoluci&oacute;n de su direcci&oacute;n y posterior 
  entrega.</P>
<P>Las l&iacute;neas que van en mailertable tienen el siguiente formato:</P>
<DIR> 
  <DIR> 
    <P>mailer delimitador sistema_de_relevo m&aacute;quina_o_dominio</P>
  </DIR>
</DIR>
<P>Existen diferentes gestores de correo posibles. Las diferencias radican generalmente 
  en como trataran las direcciones. Los gestores de correo t&iacute;picos son: 
  TCP-A (TCP/IP con direcciones estilo Internet), TCP-U (TCP/IP con direcciones 
  estilo UUCP), y UUCP-A (UUCP con direcciones estilo Internet).</P>
<P>El car&aacute;cter que separa al gestor de correo de la porci&oacute;n del 
  nodo en la parte izquierda de la l&iacute;nea de mailertable define como ser&aacute; 
  modificada la direcci&oacute;n por la mailertable. Lo importante aqu&iacute; 
  es que &uacute;nicamente se reescribe el "sobre" (para obtener el correo en 
  el sistema remoto). Reescribir cualquier otra cosa mas que el sobre es desaconsejable 
  debido a la alta probabilidad de arruinar la configuraci&oacute;n del correo.</P>
<P>! Un signo final de exclamaci&oacute;n elimina el nombre del nodo receptor 
  antes de redirigirlo al gestor de correo. Esto se puede usar cuando lo que se 
  desea, esencialmente, es forzar al correo a entrar en un sistema remoto mal 
  configurado.</P>
<P>, Una coma no cambia la direcci&oacute;n en modo alguno. El mensaje simplemente 
  es redirigido v&iacute;a el gestor de correo especificado al nodo o sistema 
  de reenv&iacute;o especificado.</P>
<P>: Dos puntos eliminan el nombre del sistema receptor si hay sistemas intermedios 
  entre usted y el destino. As&iacute;, foo!bar!joe eliminara foo, mientras que 
  xyzzy!janet permanecer&aacute; sin cambios.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.6.2"></a>15.6.2 uucpxtable</P>
</u></I> 
<P>Es com&uacute;n que el correo dirigido a sistemas con nombres de dominio plenamente 
  cualificados se entregue v&iacute;a formato Internet (SMTP) utilizando un servidor 
  de DNS, o mediante un sistema de reenv&iacute;o. El archivo uucpxtable fuerza 
  la entrega mediante encaminamiento UUCP, al convertir el nombre de formato dominio 
  a un nombre de nodo con estilo UUCP sin formato de dominio.</P>
<P>Esto se utiliza frecuentemente cuando se es un "repetidor"3 de correo para 
  un sistema o dominio, o cuando se desea enviar el correo a trav&eacute;s de 
  un enlace UUCP directo y seguro en lugar de arriesgarse a pasar potencialmente 
  por muchos "saltos"4 si hacemos uso del gestor de correo por omisi&oacute;n 
  y cualesquiera de los sistemas intermedios y redes.</P>
<P>Los sistemas UUCP que se comunican con sus vecinos UUCP, que utilizan cabeceras 
  de correo dominizadas, podr&iacute;an utilizar este archivo para forzar la entrega 
  del correo, a trav&eacute;s del enlace directo UUCP punto a punto entre los 
  dos sistemas, en lugar de emplear la ruta menos directa a trav&eacute;s del 
  RELAY_MAILER y el RELAY_HOST o a trav&eacute;s del DEFAULT_MAILER.</P>
<P>Los sistemas Internet que no empleen UUCP probablemente no utilicen el archivo 
  uucpxtable.</P>
<P>_____________________________________________<BR>
  3 Un an&aacute;logo de lo que se entiende por "repetidor" en telecomunicaciones.<BR>
  4 N. del T. Como hop o salto se entiende cada vez que atravesamos un sistema 
  intermedio.</P>
<P>&nbsp;</P>
<P>Supongamos que usted proporciona servicio de reenv&iacute;o de correo a un 
  sistema llamado sesame.com en DNS y sesame en los mapas UUCP. Necesitar&iacute;a 
  la siguiente l&iacute;nea en uucpxtable para forzar el direccionamiento del 
  correo para ellos a trav&eacute;s de nuestra conexi&oacute;n UUCP directa.</P>
<DIR> 
  <DIR> 
    <P>#============== /usr/local/lib/mail/uucpxtable ============<BR>
      # El correo enviado a joe@sesame.com se reescribe a<BR>
      # sesame!joe y luego se entrega v&iacute;a UUCP<BR>
      #<BR>
      sesame sesame.com<BR>
      #<BR>
      #----------------------------------------------------------</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="15.6.3"></a>15.6.3 pathtable</P>
</u></I> 
<P>El archivo pathtable se utiliza para definir el encaminamiento expl&iacute;cito 
  a sistemas o redes remotas. El archivo pathtable debe escribirse en orden alfab&eacute;tico 
  con una sintaxis similar al estilo de pathalias. Los dos campos de cada l&iacute;nea 
  deben estar separados por un TAB real; si no es as&iacute; dbm podr&iacute;a 
  "protestar".</P>
<P>La mayor parte de los sistemas no precisaran ninguna l&iacute;nea en pathtable.</P>
<DIR> 
  <DIR> 
    <P>#=============== /usr/local/lib/mail/pathtable ================<BR>
      #<BR>
      # Este archivo tiene el estilo de pathalias en cuanto a trayectorias,<BR>
      # y permite encauzar el correo dirigido a los vecinos UUCP a trav&eacute;s 
      de un camino<BR>
      # directo, de tal forma que no se tenga que hacer un rodeo hasta el<BR>
      # nodo inteligente, que se encarga de otro trafico.<BR>
      #<BR>
      # Es deseable que se utilicen espacios de tabulacion reales en cada l&iacute;nea 
      o<BR>
      # m4 podr&iacute;a quejarse.<BR>
      #<BR>
      # Se debe encaminar el correo a trav&eacute;s de uno o mas sistemas intermedios<BR>
      # a un sistema remoto utilizando el estilo de direcciones UUCP.<BR>
      #<BR>
      sesame!ernie!%s ernie<BR>
      #<BR>
      # reenviado a un sistema UUCP vecino de un sistema Internet<BR>
      # alcanzable.<BR>
      #<BR>
      swim!%s@gcc.groucho.edu swim<BR>
      #<BR>
      # Lo que sigue manda todo el correo para dos redes a trav&eacute;s de<BR>
      # distintos gateways (observe el '.' que comienza la l&iacute;nea).<BR>
      # En este ejemplo, "uugate" y "byte" son sistemas especificos que son<BR>
      # utilizados como gateways de correo a los pseudo dominios .UUCP y<BR>
      # .BITNET respectivamente.<BR>
      #<BR>
      %s@uugate.groucho.edu .UUCP<BR>
      byte!%s@mail.shift.com .BITNET<BR>
      #<BR>
      #=================== fin de pathtable =======================</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="15.6.4"></a>15.6.4 domaintable</P>
</u></I> 
<P>El archivo domaintable se utiliza generalmente para forzar cierto comportamiento 
  tras una b&uacute;squeda DNS. Permite al administrador hacer disponible una 
  lista de abreviaturas de los nombres disponibles para sistemas o dominios a 
  los que hagamos referencia con asiduidad, reemplazando la abreviatura con el 
  nombre apropiado autom&aacute;ticamente. Tambi&eacute;n puede ser utilizado 
  para sustituir los nombres de un nodo o dominio incorrectos con la informaci&oacute;n 
  correcta.</P>
<P>La mayor parte de los sistemas no necesitan l&iacute;neas en domaintable.</P>
<P>El siguiente ejemplo muestra como reemplazar una direcci&oacute;n personal 
  err&oacute;nea, intent&aacute;ndose enviar con la correcta:</P>
<DIR> 
  <DIR> 
    <P>#============= /usr/local/lib/mail/domaintable =================<BR>
      #<BR>
      #<BR>
      m&aacute;quina_mal_configurada.dominio.correcto m&aacute;quina_mal_c.dominio.erroneo 
      #<BR>
      #<BR>
      #=================== fin de domaintable ========================</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="15.6.5"></a>15.6.5 alias</P>
</u></I> 
<P>Los alias posibilitan lo siguiente:</P>
<P><B>o</b> Permiten que una abreviatura o termino f&aacute;cil de recordar act&uacute;e 
  como una direcci&oacute;n de correo, que remite lo recibido a una o varias personas.<BR>
  <B>o</B> Invocan a un programa que tomar&aacute; como entrada el mensaje.<BR>
  <B>o</B> Env&iacute;an correo a un archivo.</P>
<P>Todos los sistemas precisan alias para el Postmaster y el MAILER-DAEMON a fin 
  de cumplir con el RFC.</P>
<P>Se debe ser extremadamente cuidadoso con respecto a la seguridad cuando se 
  definan alias que invoquen a programas o escriban a programas ya que el sendmail 
  generalmente se ejecuta con los permisos setuid-root.</P>
<P>Los cambios al archivo de aliases no tienen efecto hasta que el comando</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bi</P>
  </DIR>
</DIR>
<P>se ejecuta para construir las tablas dbm necesarias. Esto tambi&eacute;n puede 
  hacerse ejecutando el comando newaliases, normalmente mediante el comando cron.</P>
<P>Para mas detalles concernientes a los alias de correo, se puede encontrar mas 
  informaci&oacute;n en la p&aacute;gina man aliases(5).</P>
<DIR> 
  <DIR> 
    <P>#--------------------- /usr/local/lib/mail/aliases ------------------<BR>
      #<BR>
      # muestra de tipos de alias comunes<BR>
      #<BR>
      usenet: janet # alias para una persona<BR>
      admin: joe,janet # alias para varias personas<BR>
      newspak-users: :include:/usr/lib/lists/newspak<BR>
      # lee los receptores de un archivo<BR>
      changefeed: | /usr/local/lib/gup # alias que invoca un programa<BR>
      complaints: /var/log/complaints # alias que escribe el<BR>
      # correo recibido a un archivo<BR>
      #<BR>
      # Los siguientes dos alias deben estar presentes para cumplir con el RFC.<BR>
      # Es importante tenerlos para asignar a una persona que lea el correo<BR>
      # rutinariamente.<BR>
      #<BR>
      postmaster: root # l&iacute;nea indispensable<BR>
      MAILER-DAEMON: postmaster # l&iacute;nea indispensable<BR>
      #<BR>
      #-------------------------------------------------------------------</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="15.6.6"></a>15.6.6 Tablas utilizadas en raras ocasiones</P>
</u></I> 
<P>Las siguientes tablas est&aacute;n disponibles, pero se utilizan muy rara vez. 
  Consulte la documentaci&oacute;n que viene con el c&oacute;digo fuente de sendmail+IDA 
  para mas detalles.</P>
<P><B>uucprelays</b><BR>
  El archivo uucprelays se utiliza para "corto-circuitar" la trayectoria del UUCP 
  a sistemas especialmente bien conocidos en vez de utilizar una trayectoria multi-salto 
  o insegura generada por el procesamiento de los mapas UUCP con pathalias.</P>
<P><B>genericfrom y xaliases<BR>
  </b>El archivo genericfrom oculta los nombres y direcciones de los usuarios 
  locales del mundo exterior convirtiendo autom&aacute;ticamente los nombres de 
  usuarios locales a direcciones gen&eacute;ricas de env&iacute;o no coincidentes 
  con los nombres internos de usuarios.</P>
<P>La utilidad asociada xalparse automatiza la generaci&oacute;n de genericfrom 
  y el archivo aliases de tal forma que las traducciones de los nombres del usuario 
  de entrada y salida tengan lugar desde el archivo maestro xaliases.</P>
<P><B>decnetxtable<BR>
  </b>El archivo decnetxtable reescribe las direcciones con formato dominio a 
  direcciones estilo DECnet muy similares al archivo domaintable, que se utiliza 
  para reescribir direcciones sin dominizar a direcciones estilo SMTP con formato 
  dominizado.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="15.7"></a>15.7 Instalaci&oacute;n de sendmail</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>En esta secci&oacute;n se ver&aacute; como instalar una distribuci&oacute;n 
  ejecutable t&iacute;pica de sendmail+IDA y un recorrido por lo necesario para 
  personalizarla y hacerla funcionar.</P>
<P>La distribuci&oacute;n binaria actual de sendmail+IDA para Linux puede obtenerse 
  de sunsite.unc.edu en /pub/Linux/system/Mail. Incluso si se tiene una versi&oacute;n 
  anterior de sendmail es muy recomendable utilizar la versi&oacute;n sendmail5.67b+IDA1.5 
  ya que todos los parches espec&iacute;ficos para Linux est&aacute;n en fuentes 
  poco revisados, y varios e importantes agujeros de seguridad han sido enmendados 
  (algunos de ellos datan del primero de diciembre de 1993).</P>
<P>Si se esta compilando sendmail desde el c&oacute;digo fuente, se deben seguir 
  las instrucciones que est&aacute;n en los archivos README que est&aacute;n incluidos 
  en la distribuci&oacute;n de los fuentes.</P>
<P>El c&oacute;digo fuente actual de sendmail+IDA esta disponible en vixen.cso.uiuc.edu. 
  Para construir sendmail+IDA en Linux, tambi&eacute;n se necesitan los archivos 
  de configuraci&oacute;n especiales para Linux newspak-2.2.tar.gz que est&aacute;n 
  en sunsite.unc.edu en el directorio /pub/Linux/system/Mail.</P>
<P>Si tenia instalado anteriormente smail u otro gestor de entrega de correo, 
  probablemente quiera borrar o renombrar todos los ficheros pertenecientes a 
  smail para mayor seguridad.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.7.1"></a>15.7.1 Desempaquetado de la distribuci&oacute;n ejecutable</P>
</u></I> 
<P>Lo primero es desempaquetar el archivo comprimido en alg&uacute;n lugar seguro:</P>
<DIR> 
  <DIR> 
    <P>$ gunzip -c sendmail5.65b+IDA1.5+mailx5.3b.tgz | tar xvf -</P>
  </DIR>
</DIR>
<P>Si se tiene un tar "moderno", por ejemplo de una distribuci&oacute;n de Slackware 
  reciente, probablemente baste con un tar -zxvf fichero .tgz y se obtendr&aacute;n 
  los mismos resultados.</P>
<P>Al desempaquetar el archivo se genera un directorio llamado sendmail5.65b+IDA1.5+mailx5.3b. 
  En este directorio encontrar&aacute; la instalaci&oacute;n completa de sendmail+IDA 
  mas un programa binario del agente para usuario mailx. Todos los directorios 
  donde se encuentran los archivos reflejan la ubicaci&oacute;n donde deben ser 
  instalados estos, as&iacute; que es mas seguro utilizar la aplicaci&oacute;n 
  tar para moverlos a otra parte:</P>
<DIR> 
  <DIR> 
    <P># cd sendmail5.65b+IDA1.5+mailx5.3b<BR>
      # tar cf - . | (cd /; tar xvvpoof -)</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="15.7.2"></a>15.7.2 Elaboraci&oacute;n del fichero sendmail.cf</P>
</u></I> 
<P>Para elaborar un fichero sendmail.cf personalizado para su sistema, se ha de 
  escribir un fichero sendmail.m4, y procesarlo posteriormente con m4.</P>
<P>En /usr/local/lib/mail/CF puede encontrar un archivo de ejemplo llamado sample.m4. 
  C&oacute;pielo a nombredesusistema .m4, y ed&iacute;telo a fin de que refleje 
  la situaci&oacute;n de su sistema.</P>
<P>El fichero de ejemplo esta configurado para un sistema solo UUCP con cabeceras 
  dominizadas y que se comunica con un sistema inteligente. Los sistemas como 
  &eacute;ste precisan de pocas variaciones.</P>
<P>En esta secci&oacute;n se se&ntilde;alaran las macros a cambiar. Si quiere 
  tener una descripci&oacute;n completa de lo que hacen, dir&iacute;jase a la 
  secci&oacute;n anterior, "Discusi&oacute;n del fichero sendmail.m4 ".</P>
<P><B>LOCAL_MAILER_DEF<BR>
  </b>Define el fichero que especifica los agentes de correo para gesti&oacute;n 
  local. Vea la secci&oacute;n previa "Definici&oacute;n del gestor local de correo" 
  para saber de que va.</P>
<P><B>PSEUDONYMS<BR>
  </b>Especifica todos los nombres por los que es conocido su sistema.</P>
<P><B>DEFAULT_HOST<BR>
  </b>Escriba su nomenclatura de dominio plenamente cualificado. Este nombre aparecer&aacute; 
  como su nombre de sistema en todo el correo saliente.</P>
<P><B>UUCPNAME</b><BR>
  Ponga su nombre de sistema sin cualificar.</P>
<P><B>RELAY_HOST y RELAY_MAILER<BR>
  </b>Si se comunica mediante UUCP con un sistema inteligente, defina RE-</P>
<P><B>LAY_HOST<BR>
  </b>como el nombre UUCP del "repetidor inteligente" de su vecino UUCP. Haga 
  uso del gestor de correo UUCP-A si desea que las cabeceras de sus mensajes contengan 
  su dominio.</P>
<P><B>DEFAULT_MAILER<BR>
  </b>Si esta conectado a Internet y se comunica mediante DNS, deber&iacute;a 
  definir esto como TCP-A. Esto le dice a sendmail que emplee TCP-A como gestor 
  de correo, que entregara el correo v&iacute;a SMTP haciendo uso del estilo RFC 
  normal en las direcciones de los receptores de correo. Los sistemas conectados 
  permanentemente a Internet probablemente no precisen definir RELAY_HOST o RELAY_MAILER.</P>
<P>Para crear el fichero sendmail.cf, ejecutar la orden</P>
<DIR> 
  <DIR> 
    <P># make nombredesusistema .cf</P>
  </DIR>
</DIR>
<P>Esto procesa el fichero nombredesusistema y crea el fichero nombredesusistema 
  .cf a partir de &eacute;l.</P>
<P>Lo pr&oacute;ximo ser&aacute; comprobar si el fichero que acaba de crear hace 
  lo que se espera de &eacute;l o no. Esto se explica en las pr&oacute;ximas dos 
  secciones.</P>
<P>Una vez se esta contento con su comportamiento, c&oacute;pielo en su sitio 
  con el comando:</P>
<DIR> 
  <DIR> 
    <P># cp nombredesusistema .cf /etc/sendmail.cf</P>
  </DIR>
</DIR>
<P>Llegados a este punto, su sistema sendmail esta listo para funcionar. Escriba 
  la siguiente l&iacute;nea en el fichero de arranque adecuado (generalmente /etc/rc.inet2 
  ). Puede ejecutarlo "a mano" para que empiece a funcionar en este momento.</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bd -q1h</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="15.7.3"></a>15.7.3 Comprobando el fichero sendmail.cf</P>
</u></I> 
<P>Para hacer que sendmail funcione en modo 'test', ha de ejecutarlo con la opci&oacute;n 
  -bt. La configuraci&oacute;n por defecto es el fichero sendmail.cf que este 
  instalado en el sistema. Puede probar un fichero de configuraci&oacute;n alternativo 
  mediante la opci&oacute;n -Cfichero_alternativo.</P>
<P>En los siguientes ejemplos, probamos vstout.cf, el fichero de configuraci&oacute;n 
  generado a partir del fichero vstout.m4 que puede ser examinado en la figura 
  15.2.</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bt -Cvstout.cf<BR>
      ADDRESS TEST MODE<BR>
      Enter &lt;ruleset&gt; &lt;address&gt;<BR>
      [Note: No initial ruleset 3 call]<BR>
      &gt;</P>
  </DIR>
</DIR>
<P>Las siguientes comprobaciones aseguran que sendmail es capaz de gestionar el 
  correo de todos los usuarios del sistema. En todos los casos, el resultado de 
  la comprobaci&oacute;n deber&aacute; ser el mismo, y apuntar al nombre del sistema 
  local como el gestor de correo en LOCAL.</P>
<P>Comprobemos primero como se gestionar&iacute;a el env&iacute;o a un usuario 
  local:</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bt -Cvstout.cf<BR>
      ADDRESS TEST MODE<BR>
      Enter &lt;ruleset&gt; &lt;address&gt;<BR>
      [Note: No initial ruleset 3 call]<BR>
      &gt; 3,0 me<BR>
      rewrite: ruleset 3 input: me<BR>
      rewrite: ruleset 7 input: me<BR>
      rewrite: ruleset 9 input: me<BR>
      rewrite: ruleset 9 returns: &lt; me &gt;<BR>
      rewrite: ruleset 7 returns: &lt; &gt; , me<BR>
      rewrite: ruleset 3 returns: &lt; &gt; , me<BR>
      rewrite: ruleset 0 input: &lt; &gt; , me<BR>
      rewrite: ruleset 8 input: &lt; &gt; , me<BR>
      rewrite: ruleset 20 input: &lt; &gt; , me<BR>
      rewrite: ruleset 20 returns: &lt; &gt; , @ vstout . vbrew . com , me<BR>
      rewrite: ruleset 8 returns: &lt; &gt; , @ vstout . vbrew . com , me<BR>
      rewrite: ruleset 26 input: &lt; &gt; , @ vstout . vbrew . com , me<BR>
      rewrite: ruleset 26 returns: $# LOCAL $@ vstout . vbrew . com $: me<BR>
      rewrite: ruleset 0 returns: $# LOCAL $@ vstout . vbrew . com $: me</P>
  </DIR>
</DIR>
<P>El resultado muestra como sendmail procesa las direcciones internamente. Esto 
  es llevado a cabo por varias rulesets que las analizan, llaman a otras involucradas, 
  y descomponen la direcci&oacute;n en sus componentes.</P>
<P>En nuestro ejemplo, le pasamos la direcci&oacute;n me a las rulesets 3 y 0 
  (esto es lo que significa el termino 3,0 introducido antes de la direcci&oacute;n).</P>
<P>La &uacute;ltima l&iacute;nea muestra la direcci&oacute;n interpretada tal 
  y como la devuelve la ruleset 0, que contiene el gestor de correo al que se 
  le encomendar&iacute;a el mensaje, y la m&aacute;quina y usuario proporcionados 
  al mismo.</P>
<P>A continuaci&oacute;n, comprobaremos el env&iacute;o de correo a un usuario 
  de nuestro sistema con sintaxis UUCP.</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bt -Cvstout.cf<BR>
      ADDRESS TEST MODE<BR>
      Enter &lt;ruleset&gt; &lt;address&gt;<BR>
      [Note: No initial ruleset 3 call]<BR>
      &gt; 3,0 vstout!me<BR>
      rewrite: ruleset 3 input: vstout ! me<BR>
      [...]<BR>
      rewrite: ruleset 0 returns: $# LOCAL $@ vstout . vbrew . com $: me<BR>
      &gt;&nbsp;</P>
  </DIR>
</DIR>
<P>A continuaci&oacute;n, comprobamos el correo dirigido a un usuario de nuestro 
  sistema con sintaxis Internet, a nuestro nombre de sistema plenamente cualificado 
  (FQDN)</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bt -Cvstout.cf<BR>
      ADDRESS TEST MODE<BR>
      Enter &lt;ruleset&gt; &lt;address&gt;<BR>
      [Note: No initial ruleset 3 call]<BR>
      &gt; 3,0 me@vstout.vbrew.com<BR>
      rewrite: ruleset 3 input: me @ vstout . vbrew . com<BR>
      [...]<BR>
      rewrite: ruleset 0 returns: $# LOCAL $@ vstout . vbrew . com $: me<BR>
      &gt;</P>
  </DIR>
</DIR>
<P>Deber&iacute;a repetir los anteriores dos pasos con cada uno de los nombres 
  especificados como par&aacute;metros PSEUDONYMS y DEFAULT_NAME del fichero sendmail.m4.</P>
<P>Por &uacute;ltimo, comprobar que puede enviar correo a su nodo de reenv&iacute;o.</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bt -Cvstout.cf<BR>
      ADDRESS TEST MODE<BR>
      Enter &lt;ruleset&gt; &lt;address&gt;<BR>
      [Note: No initial ruleset 3 call]<BR>
      &gt; 3,0 fred@moria.com<BR>
      rewrite: ruleset 3 input: fred @ moria . com<BR>
      rewrite: ruleset 7 input: fred @ moria . com<BR>
      rewrite: ruleset 9 input: fred @ moria . com<BR>
      rewrite: ruleset 9 returns: &lt; fred &gt; @ moria . com<BR>
      rewrite: ruleset 7 returns: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 3 returns: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 0 input: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 8 input: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 8 returns: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 29 input: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 29 returns: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 26 input: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 25 input: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 25 returns: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 4 input: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 4 returns: fred @ moria . com<BR>
      rewrite: ruleset 26 returns: &lt; @ moria . com &gt; , fred<BR>
      rewrite: ruleset 0 returns: $# UUCP-A $@ moria $: &lt; @ moria . com &gt; 
      , fred<BR>
      &gt;</P>
  </DIR>
</DIR>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.7.4"></a>15.7.4 Integraci&oacute;n global - Prueba de integraci&oacute;n 
  del fichero sendmail.cf y las tablas.</P>
</u></I> 
<P>Llegados a este punto, ya ha verificado que el sistema de correo tendr&aacute; 
  el comportamiento por defecto deseado, y que ser&aacute; capaz tanto de enviar 
  como de recibir correo con direcci&oacute;n valida. Para terminar la instalaci&oacute;n, 
  puede ser necesario crear las tablas dbm apropiadas para conseguir finalmente 
  los resultados deseados.</P>
<P>Tras crear las tablas necesarias para su sistema, deber&aacute; procesarlas 
  a trav&eacute;s de dbm mediante la ejecuci&oacute;n de la orden make en el directorio 
  que contenga las tablas.</P>
<P>Si su sistema es solo UUCP, no necesita crear ninguna de las tablas mencionadas 
  en el fichero README.linux. Solo tendr&aacute; que modificar los ficheros de 
  tal modo que funcione el Makefile.</P>
<P>Si su sistema es solo UUCP y "habla" con mas sistemas adem&aacute;s de su nodo 
  de reenv&iacute;o inteligente, necesitara a&ntilde;adir entradas uucpxtable 
  para cada uno (o el correo destinado a ellos se encaminara tambi&eacute;n a 
  trav&eacute;s del nodo inteligente) y ejecutar dbm sobre el reci&eacute;n modificado 
  fichero uucpxtable.</P>
<P>Para empezar, necesita asegurarse de que el correo que ha de pasar por su RELAY_HOST 
  se env&iacute;a mediante el RELAY_MAILER.</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bt -Cvstout.cf<BR>
      ADDRESS TEST MODE<BR>
      Enter &lt;ruleset&gt; &lt;address&gt;<BR>
      [Note: No initial ruleset 3 call]<BR>
      &gt; 3,0 fred@sesame.com<BR>
      rewrite: ruleset 3 input: fred @ sesame . com<BR>
      rewrite: ruleset 7 input: fred @ sesame . com<BR>
      rewrite: ruleset 9 input: fred @ sesame . com<BR>
      rewrite: ruleset 9 returns: &lt; fred &gt; @ sesame . com<BR>
      rewrite: ruleset 7 returns: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 3 returns: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 0 input: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 8 input: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 8 returns: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 29 input: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 29 returns: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 26 input: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 25 input: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 25 returns: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 4 input: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 4 returns: fred @ sesame . com<BR>
      rewrite: ruleset 26 returns: &lt; @ sesame . com &gt; , fred<BR>
      rewrite: ruleset 0 returns: $# UUCP-A $@ moria $: &lt; @ sesame . com &gt; 
      , fred<BR>
      &gt;</P>
  </DIR>
</DIR>
<P>Si tiene mas vecinos UUCP, adem&aacute;s de su RELAY_HOST, necesita asegurarse 
  de que el correo para ellos experimenta un procesamiento adecuado. El correo 
  con direcciones de sintaxis tipo UUCP dirigido a otro sistema con el que se 
  comunique tambi&eacute;n mediante UUCP, ira a ellos directamente (a menos de 
  que lo impida expl&iacute;citamente mediante una entrada domaintable). Asumimos 
  que el sistema swim es un vecino UUCP directo para nosotros. Pasar a sendmail 
  un mensaje swim!fred deber&aacute; producir el siguiente resultado:</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bt -Cvstout.cf<BR>
      ADDRESS TEST MODE<BR>
      Enter &lt;ruleset&gt; &lt;address&gt;<BR>
      [Note: No initial ruleset 3 call]<BR>
      &gt; 3,0 swim!fred<BR>
      rewrite: ruleset 3 input: swim ! fred<BR>
      [...lines omitted...]<BR>
      rewrite: ruleset 0 returns: $# UUCP $@ swim $: &lt; &gt; , fred<BR>
      &gt;</P>
  </DIR>
</DIR>
<P>Si tiene entradas uucpxtable para forzar la gesti&oacute;n de correo UUCP a 
  ciertos vecinos UUCP que env&iacute;an su correo con cabeceras dominizadas tipo 
  Internet, tambi&eacute;n tiene que verificarlo.</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/sendmail -bt -Cvstout.cf<BR>
      ADDRESS TEST MODE<BR>
      Enter &lt;ruleset&gt; &lt;address&gt;<BR>
      [Note: No initial ruleset 3 call]<BR>
      &gt; 3,0 dude@swim.2birds.com<BR>
      rewrite: ruleset 3 input: dude @ swim . 2birds . com<BR>
      [...lines omitted...]<BR>
      rewrite: ruleset 0 returns: $# UUCP $@ swim . 2birds $: &lt; &gt; , dude<BR>
      &gt;</P>
  </DIR>
</DIR>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="15.8"></a>15.8 Trucos y trivialidades sobre administraci&oacute;n 
  de correo</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Ahora que ya se ha discutido la teor&iacute;a sobre configuraci&oacute;n, instalaci&oacute;n 
  y comprobaci&oacute;n de un sistema sendmail+IDA, dediquemos unos instantes 
  al an&aacute;lisis de las cosas que suceden rutinariamente en la vida de un 
  administrador de correo.</P>
<P>Los sistemas remotos fallan a veces. Los m&oacute;dems o l&iacute;neas telef&oacute;nicas 
  fallan o las definiciones DNS son elaboradas incorrectamente debido a un error 
  humano. En estos casos, los administradores de correo han de saber como reaccionar 
  de forma r&aacute;pida, efectiva y segura para mantener el trafico del correo 
  a trav&eacute;s de rutas alternativas hasta que los sistemas remotos o los proveedores 
  de acceso puedan restablecer sus servicios habituales.</P>
<P>El resto de este cap&iacute;tulo pretende proporcionarle soluciones para las 
  "emergencias con el correo electr&oacute;nico" mas frecuentes.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.8.1"></a>15.8.1 Reenv&iacute;o de correo a un sistema inteligente</P>
</u></I> 
<P>Para redirigir el correo para un sistema o dominio particular hacia el sistema 
  de reenv&iacute;o inteligente designado, se empleara normalmente el fichero 
  mailertable.</P>
<P>Por ejemplo, para redirigir el correo para backwood.org a su sistema de pasarela 
  UUCP backdoor, tendr&aacute; que poner la siguiente entrada en mailertable:</P>
<DIR> 
  <DIR> 
    <P>UUCP-A,backdoor backwood.org</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="15.8.2"></a>15.8.2 Env&iacute;o de correo a Sistemas Remotos mal configurados</P>
</u></I> 
<P>Los sistemas Internet tendr&aacute;n frecuentemente problemas a la hora de 
  hacer entrar el correo en sistemas mal configurados. Existen varios casos, pero 
  el s&iacute;ntoma general es que el correo es devuelto por el sistema remoto 
  o que nunca lo alcanza.</P>
<P>Estos problemas pueden colocar al administrador local del sistema en una situaci&oacute;n 
  critica, ya que sus usuarios generalmente no tienen en cuenta que usted no administra 
  todos los sistemas a lo largo y ancho del mundo (o que usted no sepa como hacer 
  que el administrador remoto solucione el problema). Ellos tan solo sabr&aacute;n 
  que su correo no lleg&oacute; al destinatario deseado en el otro extremo, y 
  usted ser&aacute; la persona mas cercana a la que pedir responsabilidades.</P>
<P>La configuraci&oacute;n de un sistema remoto es problema de sus administradores, 
  no de usted. En cualquier caso, aseg&uacute;rese de no estropear la configuraci&oacute;n 
  de su sistema a fin de comunicarse con un sistema remoto mal configurado. Si 
  no puede ponerse en contacto con el administrador (Postmaster) del sistema remoto 
  a fin de que arreglen su configuraci&oacute;n lo antes posible, tiene dos opciones:</P>
<P><B>o</b> Generalmente es posible forzar el correo hacia el interior del sistema 
  remoto con &eacute;xito, aunque el sistema remoto este mal configurado; las 
  respuestas provenientes del otro extremo posiblemente no funcionen. . . pero 
  ese es problema del administrador remoto.</P>
<P>Puede corregir las cabeceras err&oacute;neas de sus destinatarios de correo 
  saliente simplemente usando una entrada domaintable para su sistema/dominio, 
  lo que redundar&aacute; en que la informaci&oacute;n no v&aacute;lida sea corregida 
  en el correo originado desde su sistema:</P>
<DIR> 
  <DIR> 
    <P>descerebrado.dominio.correcto.com descerebrado.dominio.erroneo.com</P>
  </DIR>
</DIR>
<P><B>o</b> Los sistemas mal configurados devuelven con frecuencia el correo al 
  sistema que lo origino, argumentando que "este correo no es para este sistema" 
  ya que no tienen debidamente configurado su PSEUDONYMNS o equivalente. Es posible 
  quitar toda informaci&oacute;n relativa al nombre y dominio del sistema en los 
  destinatarios de correo saliente de nuestro sistema hacia ellos.</P>
<P>El ! de la siguiente mailertable gestiona el correo hacia su sistema remoto</P>
<DIR> 
  <DIR> 
    <P>TCP!descerebrados.dominio.correcto.com descerebrados.dominio.erroneo.com</P>
  </DIR>
</DIR>
<P>No obstante, y aunque se consiga que el correo entre en su sistema, no hay 
  garant&iacute;as de que ellos puedan responder a nuestros mensajes (su sistema 
  esta mal configurado, recu&eacute;rdelo...) pero para entonces sus usuarios 
  estar&aacute;n quej&aacute;ndose a sus administradores, que es mejor que los 
  suyos se enfaden con usted.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.8.3"></a>15.8.3 Env&iacute;o Forzado de correo a trav&eacute;s 
  de UUCP </P>
</u></I> 
<P>En un mundo ideal (desde la perspectiva Internet), todas las m&aacute;quinas 
  tendr&aacute;n registro en el Servicio de Nombres de Dominio (DNS) y env&iacute;an 
  su correo con nombres de dominio plenamente cualificados.</P>
<P>Si se da la circunstancia de que se comunica v&iacute;a UUCP con un sistema 
  de estas caracter&iacute;sticas, puede forzar el correo a ser enviado directamente 
  a trav&eacute;s de la conexi&oacute;n punto-a-punto UUCP en lugar de hacerlo 
  a trav&eacute;s de su gestor de correo habitual, esencialmente "desdominizando" 
  su nombre de sistema mediante el fichero uucpxtable.</P>
<P>Para forzar el env&iacute;o de correo a la m&aacute;quina sesame.com, deber&aacute; 
  poner lo siguiente en el fichero uucpxtable:</P>
<DIR> 
  <DIR> 
    <P># desdominizamos sesame.com para forzar el env&iacute;o UUCP<BR>
      sesame sesame.com</P>
  </DIR>
</DIR>
<P>El resultado es que sendmail determinara entonces (a trav&eacute;s de UUCPNODES 
  del fichero sendmail.m4 ) que se esta conectado directamente al sistema remoto, 
  y encolara el correo saliente para ser enviado v&iacute;a UUCP.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.8.4"></a>15.8.4 Prevenci&oacute;n de que el correo sea enviado 
  v&iacute;a UUCP</P>
</u></I> 
<P>La condici&oacute;n contraria tambi&eacute;n se da. Con frecuencia, los sistemas 
  tienen cierto n&uacute;mero de conexiones UUCP que rara vez se emplean o que 
  no siempre son tan fiables, o que no est&aacute;n tan disponibles como el gestor 
  de correo por defecto o el sistema de reenv&iacute;o.</P>
<P>Por ejemplo, en el &aacute;rea de Seattle hay varios sistemas que intercambian 
  las distintas distribuciones Linux v&iacute;a UUCP an&oacute;nimo conforme se 
  van liberando las distribuciones. Estos sistemas se comunican mediante UUCP 
  solo cuando es necesario, por lo que es generalmente m&aacute;s r&aacute;pido 
  y fiable enviar el correo a trav&eacute;s de m&uacute;ltiples saltos muy fiables 
  y nodos de reenv&iacute;o (que siempre est&aacute;n disponibles).</P>
<P>Se puede evitar f&aacute;cilmente el env&iacute;o directo de correo a una m&aacute;quina 
  a la que se esta directamente conectado. Si el sistema remoto posee un nombre 
  de dominio plenamente cualificado, se puede a&ntilde;adir una entrada como &eacute;sta 
  en el fichero domaintable:</P>
<DIR> 
  <DIR> 
    <P># Evitamos que se env&iacute;e el correo v&iacute;a UUCP a un sistema vecino<BR>
      snorkel.com snorkel</P>
  </DIR>
</DIR>
<P>Esto reemplazar&aacute; cualquier aparici&oacute;n del nombre UUCP con el nombre 
  FQDN, impidiendo por tanto cualquier concordancia con la l&iacute;nea UUCPNODES 
  del fichero sendmail.m4. El resultado es, generalmente, que el correo se enviar&aacute; 
  v&iacute;a RELAY_MAILER y RELAY_HOST (o DEFAULT_MAILER).</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.8.5"></a>15.8.5 Procesado de la cola de correo a voluntad</P>
</u></I> 
<P>Para procesar los mensajes de la cola de correo saliente inmediatamente, no 
  hay m&aacute;s que teclear '/usr/lib/runq'5. Esto llamara a sendmail con las 
  opciones apropiadas para hacer que procese inmediatamente la cola de procesos 
  pendientes en lugar de esperar al pr&oacute;ximo procesamiento programado.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="15.8.6"></a>15.8.6 Informe sobre las estad&iacute;sticas de correo</P>
</u></I> 
<P>Muchos administradores de sistema (y las personas para las que trabajan) est&aacute;n 
  interesados en el volumen de correo que es enviado, recibido o que pasa a trav&eacute;s 
  de nuestro sistema.</P>
<P>Hay varios m&eacute;todos de cuantificar el trafico de correo.</P>
<P><B>o</b> El paquete sendmail incorpora una utilidad llamada mailstats que lee 
  un fichero llamado /usr/local/lib/mail/sendmail.st 6 e informa sobre el n&uacute;mero 
  de mensajes y bytes transferidos por cada uno de los gestores de correo que 
  se empleen y que aparezcan en el fichero sendmail.st. Este fichero debe ser 
  creado manualmente por el administrador local para que el registro tenga lugar 
  por parte de sendmail. Los totales se reinicializan borrando y volviendo a crear 
  el fichero sendmail.st. Un m&eacute;todo para hacer esto es el siguiente;</P>
<DIR> 
  <DIR> 
    <P># cp /dev/null /usr/lib/local/mail/sendmail.st</P>
  </DIR>
</DIR>
<P><B>o</b> Probablemente la mejor forma de obtener informes de calidad acerca 
  de quien usa el correo y la cantidad de volumen que pasa hacia, por, y a trav&eacute;s 
  del sistema local sea activar el depurado de correo (debugging) mediante el 
  uso de syslogd(8). Esto generalmente conlleva el tener que arrancar el demonio 
  syslogd desde su fichero de inicializaci&oacute;n del sistema (de todos modos 
  lo deber&iacute;a estar haciendo), y a&ntilde;adir una l&iacute;nea al fichero 
  /etc/syslog.conf(5) que tiene el siguiente aspecto:</P>
<DIR> 
  <DIR> 
    <P>mail.debug /var/log/syslog.mail</P>
  </DIR>
</DIR>
<P>_____________________________________________<BR>
  5 La llamada a sendmail con el par&aacute;metro '-q' tiene id&eacute;nticos 
  efectos ('sendmail -q')<BR>
  6 N. del T.: En ciertas distribuciones actuales, como por ejemplo RedHat, la 
  localizaci&oacute;n es /var/log/sendmail.st; esto depender&aacute; de la filosof&iacute;a 
  de la distribuci&oacute;n que emplee; el LFS (Linux Filesystem Standards, anterior 
  FSSTND) al ser un fichero de log o de registro, recomienda el directorio /var/log</P>
<P>&nbsp;</P>
<P>Si emplea mail.debug, y recibe un volumen de correo medio/alto, el resultado 
  proporcionado por syslog puede hacerse bastante grande. Los ficheros de registro 
  generados por syslogd necesitan generalmente ser purgados rutinariamente por 
  crond(8). </P>
<P>Existen cierto n&uacute;mero de utilidades disponibles com&uacute;nmente que 
  pueden resumir el resultado del registro de correo procedente de syslogd. Una 
  de las mas conocidas es syslog-stat.pl, un script en Perl que se distribuye 
  con los fuentes de sendmail+IDA.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="15.9"></a>15.9 Integraci&oacute;n y puesta a punto de Distribuciones 
  Ejecutables</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>A pesar de que el Est&aacute;ndar de Sistema de Ficheros de Linux esta en desarrollo, 
  todav&iacute;a no esta ni terminado ni aceptado universalmente. Mi intenci&oacute;n 
  aqu&iacute; es mostrar que todav&iacute;a no somos7 un est&aacute;ndar, y proporcionar 
  una idea de cuales son los lugares donde aparecen problemas con mayor frecuencia</P>
<P>No existe ninguna configuraci&oacute;n aut&eacute;nticamente est&aacute;ndar 
  del transporte de correo electr&oacute;nico y sus agentes, as&iacute; como no 
  hay una "&uacute;nica estructura de directorios."</P>
<P>De acuerdo con esto, es necesario asegurarse de que todas las distintas partes 
  del sistema (USENET news, mail, TCP/IP) est&aacute;n de acuerdo con la localizaci&oacute;n 
  del gestor de correo local (lmail, deliver, etc.), el gestor de correo remoto 
  (rmail), y el programa de transporte de correo (sendmail o smail ). Estas suposiciones 
  generalmente no est&aacute;n documentadas; no obstante, el uso del comando strings 
  puede ayudarnos a determinar que ficheros y directorios son los esperados. A 
  continuaci&oacute;n vienen algunos problemas que hemos observado en el pasado 
  con algunas de las distribuciones ejecutables y fuentes disponibles com&uacute;nmente 
  para Linux.</P>
<P><B>o</b> Algunas versiones de la distribuci&oacute;n de NET-2 de TCP/IP tienen 
  servicios definidos para un programa llamado umail en lugar de para sendmail.</P>
<P><B>o</b> Existen varios portes de elm y mailx que buscan al gestor de correo 
  (env&iacute;o) /usr/bin/smail en lugar de a sendmail.</P>
<P><B>o</b> Sendmail+IDA tiene un gestor de correo local interno para deliver, 
  pero espera que este en /bin en lugar de la localizaci&oacute;n mas t&iacute;pica 
  en Linux /usr/bin.</P>
<P>En lugar de pasar por la trabajosa tarea de compilar todos los clientes de 
  correo a partir de sus fuentes, generalmente los enga&ntilde;aremos con los 
  enlaces simb&oacute;licos apropiados.</P>
<P>_____________________________________________<BR>
  7 N. del T.: Esto ha cambiado desde que esta gu&iacute;a fue escrita, el LFS 
  (Linux Filesystem Standards) o anterior FSSTND est&aacute; en v&iacute;as de 
  ser aceptado, si es que no lo est&aacute; ya.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="15.10"></a>15.10 Donde obtener m&aacute;s informaci&oacute;n</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Existen muchos lugares donde buscar mas informaci&oacute;n sobre sendmail. 
  Si se quiere un listado completo, vea el "Linux MAIL Howto", que se env&iacute;a 
  regularmente a comp.answers.</P>
<P>Tambi&eacute;n esta disponible por FTP en rtfm.mit.edu. De todos modos, el 
  lugar definitivo son los fuentes de sendmail+IDA. Busque en el directorio ida/cf 
  que cuelga del directorio de los fuentes, los ficheros DBM-GUIDE, OPTIONS, y 
  Sendmail.mc.</P>
</FONT> 
</BODY>
</HTML>
