<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl10</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
  <TR>
    <TD WIDTH="46%" VALIGN="TOP"> 
      <P><a href="garl09.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a> 
    </TD>
    <TD WIDTH="11%" VALIGN="TOP"> 
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a> 
    </TD>
    <TD WIDTH="43%" VALIGN="TOP"> 
      <P ALIGN="RIGHT"><a href="garl11.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a> 
    </TD>
  </TR>
</TABLE>
<FONT FACE="Verdana" SIZE=2>
<P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080">
<P ALIGN="CENTER">Cap&iacute;tulo 10</P>
</font></B>
<P>
<HR>
<p></P>
<B><U><FONT FACE="Verdana" SIZE=2>
<P>El Sistema de Informaci&oacute;n de Red (NIS)</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Cuando se usa una red de &aacute;rea local, su objetivo fundamental es, normalmente, 
  proporcionar a sus usuarios un entorno que haga a la red transparente. Para 
  este fin una importante piedra de toque es mantener datos vitales, como la informaci&oacute;n 
  de cuentas de usuario, sincronizadas entre todos los nodos. Vimos anteriormente 
  que para resolver nombres de nodos existe un potente y sofisticado servicio 
  denominado DNS. Para otras tareas, sin embargo, no existe un servicio especializado 
  similar. Mas aun, si usted s&oacute;lo est&aacute; administrando una peque&ntilde;a 
  LAN sin conexi&oacute;n a Internet, puede que no le merezca la pena el esfuerzo 
  de instalar un DNS.</P>
<P>Esta es la raz&oacute;n por la que Sun desarroll&oacute; NIS, el Sistema de 
  Informaci&oacute;n de Red. NIS proporciona facilidades de acceso gen&eacute;rico 
  a bases de datos que pueden ser usadas para distribuir informaci&oacute;n como 
  la contenida en los ficheros passwd y groups entre todos los nodos de su red. 
  Esto hace que la red aparezca como un sistema &uacute;nico, con las mismas cuentas 
  en todos los nodos. De forma similar usted puede usar NIS para distribuir el 
  fichero de informaci&oacute;n de nombres de nodos /etc/hosts entre todas las 
  m&aacute;quinas de la red.</P>
<P>NIS est&aacute; basado en RPC, e incluye un servidor, una biblioteca para la 
  parte del cliente, y varias herramientas de administraci&oacute;n. Originalmente 
  NIS se llamaba Yellow Pages1, o YP, que todav&iacute;a son t&eacute;rminos ampliamente 
  usados para referirse informalmente a este servicio. Por otra parte Yellow Pages 
  es una marca registrada de la compa&ntilde;&iacute;a British Telecom, la cual 
  pidi&oacute; que Sun dejara de utilizar ese nombre. Pero, como algunos nombres 
  impactan mucho entre la gente, YP contin&uacute;a viviendo como prefijo en los 
  nombres de la mayor&iacute;a de los comandos relacionados con NIS como ypserv, 
  ypbind, etc.</P>
<P>_____________________________________________<BR>
  1 N. del T.: P&aacute;ginas Amarillas</P>
<P>&nbsp;</P>
<P>Hoy en d&iacute;a NIS est&aacute; disponible en pr&aacute;cticamente todos 
  los sistemas UNIX, y hay incluso implementaciones gratuitas de &eacute;l. Una 
  de ellas es de la edici&oacute;n BSD Net-2, derivada de una implementaci&oacute;n 
  de referencia de dominio p&uacute;blico donada por Sun. El c&oacute;digo de 
  la biblioteca cliente de esta versi&oacute;n existe en la GNU libc desde hace 
  mucho tiempo, mientras que los programas de administraci&oacute;n han sido recientemente 
  portados a Linux por Swen Th&uuml;mmler.2 Falta, sin embargo, un servidor NIS 
  en la implementaci&oacute;n de referencia. Tobias Reber ha escrito otro paquete 
  NIS incluyendo todas las herramientas y un servidor; se llama yps.3</P>
<P>Actualmente, el c&oacute;digo de NIS est&aacute; siendo reescrito por completo 
  por Peter Eriksson4, se denominar&aacute; NYS y soportar&aacute; tanto el NIS 
  normal como la revisi&oacute;n ampliada de Sun, el NIS+. NYS no solo proporciona 
  un conjunto de herramientas NIS y un servidor, sino que tambi&eacute;n a&ntilde;ade 
  un nuevo y completo conjunto de funciones de biblioteca que muy probablemente 
  se incluir&aacute;n con el tiempo en la libc est&aacute;ndar. Esto incluye un 
  nuevo sistema de configuraci&oacute;n para resolver nombres de nodos que reemplace 
  el sistema actual que usa el fichero host.conf. Las caracter&iacute;sticas de 
  estas funciones ser&aacute;n discutidas m&aacute;s adelante.</P>
<P>Este cap&iacute;tulo se centrar&aacute; en NYS m&aacute;s que en los otros 
  dos paquetes, a los que nos referiremos como el c&oacute;digo NIS "tradicional". 
  Si usted desea utilizar alguno de esos paquetes, las instrucciones de este cap&iacute;tulo 
  podr&iacute;an ser suficientes o tal vez no. Para obtener informaci&oacute;n 
  adicional, por favor, consiga un libro est&aacute;ndar sobre NIS como el NFS 
  y NIS de Hal Stern (v&eacute;ase [Stern92]).</P>
<P>Por el momento NYS est&aacute; todav&iacute;a en desarrollo y por lo tanto 
  las utilidades est&aacute;ndar de Linux como los programas de red o el programa 
  de login todav&iacute;a no tienen en cuenta el sistema de configuraci&oacute;n 
  de NYS. Por lo tanto, hasta que NYS no sea incluido en la libc principal tendr&aacute; 
  que compilar todos esos programas usted mismo si quiere conseguir que usen NYS. 
  Para ello, en los Makefiles de cualquiera de esas aplicaciones deber&aacute; 
  especificar -lnsl como la &uacute;ltima opci&oacute;n antes de libc al enlazador. 
  Esto enlazar&aacute; las funciones relevantes de libnsl, la biblioteca NYS, 
  en lugar de la biblioteca C est&aacute;ndar.</P>
</FONT> 
<blockquote>
  <p><font face="Verdana" size="2"><a href="garl10.htm#10.1">10.1 Familiarizaci&oacute;n 
    con NIS</a><br>
    <a href="garl10.htm#10.2">10.2 NIS frente a NIS+</a><br>
    <a href="garl10.htm#10.3">10.3 El lado cliente de NIS</a><br>
    <a href="garl10.htm#10.4">10.4 Ejecuci&oacute;n de un servidor NIS</a><br>
    <a href="garl10.htm#10.5">10.5 Configurar un Cliente NIS con NYS</a><br>
    <a href="garl10.htm#10.6">10.6 Elecci&oacute;n de los Mapas Correctos</a><br>
    <a href="garl10.htm#10.7">10.7 Uso de los mapas passwd y group</a><br>
    <a href="garl10.htm#10.8">10.8 Uso de NIS con Soporte Shadow</a><br>
    <a href="garl10.htm#10.9">10.9 Uso del C&oacute;digo NIS Tradicional</a></font></p>
</blockquote>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="10.1"></a>10.1 Familiarizaci&oacute;n con NIS</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>NIS mantiene informaci&oacute;n de la base de datos en los llamados mapas que 
  contienen pares clave-valor. Los mapas se almacenan en un nodo central que est&aacute; 
  ejecutando el servidor NIS y del que los clientes pueden obtener la informaci&oacute;n 
  a trav&eacute;s de varias llamadas RPC.</P>
<P>Muy frecuentemente, los mapas se almacenan en ficheros DBM.5</P>
<P>_____________________________________________<BR>
  2 Que puede ser localizado en swen@uni-paderborn.de. Los clientes NIS est&aacute;n 
  disponibles como yp-linux.tar.gz en metalab.unc.edu en el directorio system/Network.3 
  La &uacute;ltima versi&oacute;n (en la fecha en que se escribi&oacute; este 
  documento) es yps-0.21 y puede obtenerse en ftp.lysator.liu.se, en el directorio 
  /pub/NYS.<BR>
  4 Localizable en pen@lysator.liu.se.</P>
<P>&nbsp;</P>
<P>Los mapas en s&iacute; mismos suelen ser generados a partir de ficheros de 
  texto maestros como /etc/hosts o /etc/passwd. Para algunos ficheros se crean 
  varios mapas, uno por cada tipo de clave de b&uacute;squeda. Por ejemplo, usted 
  podr&iacute;a buscar en el fichero hosts tanto por un nombre de nodo como por 
  su direcci&oacute;n IP. As&iacute; pues, de &eacute;l se derivan dos mapas NIS, 
  llamados hosts.byname y hosts.byaddr respectivamente. La tabla 10.1 lista los 
  mapas t&iacute;picos y los ficheros de los que son generados.</P>
</FONT> 
<P ALIGN="CENTER"> 
<CENTER>
  <TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=465>
    <TR> 
      <TD WIDTH="37%" VALIGN="TOP" BGCOLOR="#008080"> 
        <P ALIGN="CENTER"><B><FONT FACE="Verdana" SIZE=2 COLOR="#ffffff">Fichero 
          Maestro</font></B> 
      </TD>
      <TD WIDTH="63%" VALIGN="TOP" BGCOLOR="#008080"> <B><FONT FACE="Verdana" SIZE=2 COLOR="#ffffff"> 
        <P ALIGN="CENTER">Mapa(s) 
        </font></B></TD>
    </TR>
    <TR> 
      <TD WIDTH="37%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">/etc/hosts 
        </FONT></TD>
      <TD WIDTH="63%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">hosts.byname hosts.byaddr 
        </FONT></TD>
    </TR>
    <TR> 
      <TD WIDTH="37%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">/etc/networks 
        </FONT></TD>
      <TD WIDTH="63%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">networks.byname networks.byaddr 
        </FONT></TD>
    </TR>
    <TR> 
      <TD WIDTH="37%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">/etc/passwd 
        </FONT></TD>
      <TD WIDTH="63%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">passwd.byname passwd.byuid 
        </FONT></TD>
    </TR>
    <TR> 
      <TD WIDTH="37%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">/etc/group 
        </FONT></TD>
      <TD WIDTH="63%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">group.byname group.bygid 
        </FONT></TD>
    </TR>
    <TR> 
      <TD WIDTH="37%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">/etc/services 
        </FONT></TD>
      <TD WIDTH="63%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">services.byname services.bynumber 
        </FONT></TD>
    </TR>
    <TR> 
      <TD WIDTH="37%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">/etc/rpc 
        </FONT></TD>
      <TD WIDTH="63%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">rpc.byname rpc.bynumber 
        </FONT></TD>
    </TR>
    <TR> 
      <TD WIDTH="37%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">/etc/protocols 
        </FONT></TD>
      <TD WIDTH="63%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">protocols.byname protocols.bynumber 
        </FONT></TD>
    </TR>
    <TR> 
      <TD WIDTH="37%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">/usr/lib/aliases 
        </FONT></TD>
      <TD WIDTH="63%" VALIGN="TOP"> <FONT FACE="Verdana" SIZE=2> 
        <P ALIGN="CENTER">mail.aliases 
        </FONT></TD>
    </TR>
  </TABLE>
</CENTER>
<p></P>
<FONT FACE="Verdana" SIZE=2> 
<P ALIGN="CENTER">Tabla 10.1: Algunos mapas NIS est&aacute;ndar y los ficheros 
  correspondientes.</P>
<P>&nbsp;</P>
<P>Hay otros ficheros y mapas para los que puede encontrar soporte en uno u otro 
  paquete NIS. Estos pueden contener informaci&oacute;n sobre aplicaciones no 
  tratadas en este libro, como el mapa bootparams6 que puede ser usado por algunos 
  servidores BOOTP, o mapas que actualmente no tienen ninguna funci&oacute;n en 
  Linux (como los mapas ethers.byname y ethers.byaddr).</P>
<P>La gente usa habitualmente apodos para algunos mapas, ya que son m&aacute;s 
  cortos y por lo tanto m&aacute;s f&aacute;ciles de escribir. Para obtener una 
  lista completa de los apodos7 reconocidos por sus herramientas NIS, ejecute 
  el siguiente comando:</P>
<DIR> 
  <DIR> 
    <P>$ ypcat -x<BR>
      NIS map nickname translation table:<BR>
      "passwd" -&gt; "passwd.byname"<BR>
      "group" -&gt; "group.byname"<BR>
      "networks" -&gt; "networks.byaddr"<BR>
      "hosts" -&gt; "hosts.byname"<BR>
      "protocols" -&gt; "protocols.bynumber"<BR>
      "services" -&gt; "services.byname"<BR>
      "aliases" -&gt; "mail.aliases"<BR>
      "ethers" -&gt; "ethers.byname"<BR>
      "rpc" -&gt; "rpc.bynumber"<BR>
      "netmasks" -&gt; "netmasks.byaddr"<BR>
      "publickey" -&gt; "publickey.byname"<BR>
      "netid" -&gt; "netid.byname"<BR>
      "passwd.adjunct" -&gt; "passwd.adjunct.byname"<BR>
      "group.adjunct" -&gt; "group.adjunct.byname"<BR>
      "timezone" -&gt; "timezone.byname"</P>
  </DIR>
</DIR>
<P>_____________________________________________<BR>
  5 DBM es una biblioteca de manejo de bases de datos sencillas que usa t&eacute;cnicas 
  hashing para acelerar operaciones de b&uacute;squeda. Existe una implementaci&oacute;n 
  gratuita de DBM perteneciente al proyecto GNU llamada gdbm, que forma parte 
  de la mayor&iacute;a de las distribuciones de Linux.<BR>
  6 N. del T.: relacionado con los par&aacute;metros de arranque<BR>
  7 N. del T.: del ingl&eacute;s nicknames</P>
<P>&nbsp;</P>
<P>El servidor NIS suele llamarse ypserv. Para una red de tipo medio un &uacute;nico 
  servidor suele ser suficiente; en redes mayores pueden elegir ejecutar varios 
  en m&aacute;quinas diferentes y en diferentes segmentos para aliviar la carga 
  en los servidores y en los encaminadores.</P>
<P>Estos servidores est&aacute;n sincronizados haciendo que uno de ellos sea el 
  servidor maestro y que los dem&aacute;s sean servidores esclavos. Los mapas 
  se crear&aacute;n solo en la m&aacute;quina del servidor maestro. A partir de 
  ah&iacute; son distribuidos a todos los esclavos.</P>
<P>Habr&aacute; notado usted que hemos estado hablando de "redes" todo el rato 
  muy vagamente; por supuesto existe un concepto diferenciado en NIS sobre lo 
  que es un dominio en la red: es el conjunto de todos los nodos que comparten 
  parte de sus datos de configuraci&oacute;n del sistema mediante NIS. Desafortunadamente 
  los dominios NIS no tienen absolutamente nada que ver con los dominios que podemos 
  encontrar en DNS. Por ello, para evitar cualquier tipo de ambig&uuml;edad a 
  lo largo de este cap&iacute;tulo, especificaremos en todo momento el tipo de 
  dominio al que nos estemos refiriendo.</P>
<P>Los dominios NIS tienen solo una funci&oacute;n puramente administrativa. Son, 
  adem&aacute;s, invisibles para los usuarios. Por ello el nombre dado a un dominio 
  NIS es solo relevante para administradores. Por lo general cualquier nombre 
  valdr&aacute; con tal de que sea distinto de cualquier otro nombre de dominio 
  NIS de su red local. Por ejemplo, el administrador de la Cervecera Virtual puede 
  decidir crear dos dominios NIS, uno para la Cervecera en s&iacute;, y otro para 
  la Vinatera, a los que llama cervecera y vinatera respectivamente. Otra idea 
  bastante utilizada es usar simplemente el nombre de dominio DNS tambi&eacute;n 
  para el NIS. Para establecer y ver el nombre de dominio NIS de su nodo puede 
  usar el comando domainname.</P>
<P>Cuando se ejecuta sin ning&uacute;n argumento, muestra el nombre de dominio 
  NIS actual; para establecer el nombre de dominio, debe usted entrar como superusuario 
  y escribir:</P>
<DIR> 
  <DIR> 
    <P># domainname cervecera</P>
  </DIR>
</DIR>
<P>Los dominios NIS determinan a que servidor NIS preguntar&aacute;n las aplicaciones. 
  Por ejemplo, el programa login de un nodo de la Vinatera deber&iacute;a, por 
  supuesto, pedir informaci&oacute;n de la contrase&ntilde;a de un usuario solo 
  al servidor NIS de la Vinatera (o a uno de ellos si es que hay varios), mientras 
  que una aplicaci&oacute;n de un nodo de la Cervecera deber&iacute;a arregl&aacute;rselas 
  con el servidor de la Cervecera.</P>
<P>Queda un misterio por resolver: como sabe un cliente a que servidor conectarse. 
  La soluci&oacute;n m&aacute;s simple seria tener un fichero de configuraci&oacute;n 
  que diga el nodo en el que encontrar el servidor. Sin embargo, esta soluci&oacute;n 
  es bastante inflexible porque no permite a los clientes usar servidores diferentes 
  (del mismo dominio, se entiende), dependiendo de su disponibilidad. Por ello 
  las implementaciones tradicionales de NIS se apoyan en un demonio especial denominado 
  ypbind para detectar un servidor NIS adecuado dentro de su dominio NIS. Cualquier 
  aplicaci&oacute;n, antes de poder realizar cualquier consulta NIS, debe averiguar 
  primero, a trav&eacute;s de ypbind, qu&eacute; servidor usar.</P>
<P>ypbind busca los servidores mandando un mensaje de difusi&oacute;n por toda 
  la red IP local. El primero en responder se supone que ser&aacute; el m&aacute;s 
  r&aacute;pido potencialmente y ser&aacute; el que se use en todas las consultas 
  NIS subsiguientes. Despu&eacute;s de un cierto intervalo de tiempo, o si el 
  servidor se vuelve inaccesible, ypbind volver&aacute; a buscar los servidores 
  activos.</P>
<P>Ahora bien, hay dos aspectos discutibles sobre el enlazado din&aacute;mico: 
  uno es que raramente es necesario y el otro es que introduce un problema de 
  seguridad: ypbind cree a ciegas a cualquiera que conteste, que podr&iacute;a 
  ser lo mismo un humilde servidor NIS que un intruso malicioso. No hace falta 
  decir que esto es especialmente problem&aacute;tico si usted maneja sus bases 
  de datos de contrase&ntilde;as a trav&eacute;s de NIS. Para protegerse contra 
  esto, NYS no usa ypbind por defecto, sino que obtiene el nombre de nodo del 
  servidor de un fichero de configuraci&oacute;n.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="10.2"></a>10.2 NIS frente a NIS+</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>NIS y NIS+ comparten poco m&aacute;s que su nombre y un objetivo com&uacute;n. 
  NIS+ est&aacute; estructurado de una forma completamente diferente. En lugar 
  de un simple espacio de nombres con dominios NIS inconexos, usa un espacio de 
  nombres jer&aacute;rquico similar al de DNS. En lugar de mapas, usa tablas que 
  est&aacute;n compuestas por filas y columnas, donde cada fila representa un 
  objeto en la base de datos NIS+, mientras que las columnas cubren aquellas propiedades 
  de los objetos que NIS+ conoce y que le interesan. Cada tabla de un dominio 
  NIS+ dado incluye las de sus dominios padre. Adem&aacute;s, una entrada en una 
  tabla puede contener un enlace a otra tabla. Todas estas caracter&iacute;sticas 
  hacen posible la estructuraci&oacute;n de la informaci&oacute;n de muchas formas.</P>
<P>El NIS tradicional tiene un n&uacute;mero de versi&oacute;n RPC de 2, mientras 
  que NIS+ tiene un n&uacute;mero de versi&oacute;n RPC de 3. NIS+ no parece ser 
  ampliamente usado todav&iacute;a 8, y no conozco tanto sobre &eacute;l realmente 
  (bueno, pr&aacute;cticamente nada). Por esta raz&oacute;n, no lo trataremos 
  aqu&iacute;. Si esta interesado en aprender mas sobre &eacute;l, por favor, 
  refi&eacute;rase al manual de administraci&oacute;n de NIS+ de Sun ([NISPlus]).</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="10.3"></a>10.3 El lado cliente de NIS</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Si est&aacute; usted familiarizado con la escritura o el portado de aplicaciones 
  de red, notar&aacute; que la mayor&iacute;a de los mapas NIS listados arriba 
  corresponden a funciones de la biblioteca C.</P>
<P>Por ejemplo, para obtener informaci&oacute;n del fichero passwd, se suelen 
  usar normalmente las funciones getpwnam(3) y getpwuid(3) que devuelven informaci&oacute;n 
  de la cuenta asociada al nombre de usuario dado, o al identificador de usuario 
  dado, respectivamente. En circunstancias normales, estas funciones realizar&aacute;n 
  la b&uacute;squeda requerida en el fichero est&aacute;ndar /etc/passwd.</P>
<P>Una implementaci&oacute;n de estas funciones que tenga en cuenta NIS, sin embargo, 
  modificar&aacute; este comportamiento, y realizar&aacute; una llamada RPC para 
  que sea el servidor NIS el que realice la b&uacute;squeda del nombre o identificador 
  de usuario. Esto ocurre de forma completamente transparente a la aplicaci&oacute;n. 
  La funci&oacute;n podr&iacute;a "a&ntilde;adir" el mapa NIS o "sustituir" el 
  fichero original con &eacute;l. Por supuesto, esto no implica una modificaci&oacute;n 
  real del fichero, solo significa que a la aplicaci&oacute;n le parece que el 
  fichero ha sido sustituido o que le han a&ntilde;adido algo.</P>
<P>En las implementaciones tradicionales de NIS sol&iacute;a haber ciertas convenciones 
  sobre que mapas se sustitu&iacute;an y cuales eran a&ntilde;adidos a la informaci&oacute;n 
  original. Alguno, como el mapa passwd, requer&iacute;a modificaciones extra&ntilde;as 
  del fichero passwd que, si se hac&iacute;an mal, podr&iacute;an abrir agujeros 
  de seguridad. Para evitar estos obst&aacute;culos, NYS usa un modo general de 
  configuraci&oacute;n que determina si un conjunto de funciones cliente en particular 
  usa los ficheros originales, NIS o NIS+, y en que orden. Esto ser&aacute; descrito 
  en otra secci&oacute;n mas adelante en este mismo cap&iacute;tulo.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="10.4"></a>10.4 Ejecuci&oacute;n de un servidor NIS</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Despu&eacute;s de todo este parloteo t&eacute;cnico te&oacute;rico, ya empieza 
  a ser hora de que metamos mano al verdadero trabajo de configuraci&oacute;n. 
  En esta secci&oacute;n cubriremos la configuraci&oacute;n de un servidor NIS. 
  Si ya hay un servidor NIS corriendo en su red, no necesita configurar su propio 
  servidor; en este caso puede usted saltarse esta secci&oacute;n.</P>
<P>_____________________________________________<BR>
  8 N. del T.: En el momento de escribirse este manual esta afirmaci&oacute;n 
  era cierta. Sin embargo, hoy en d&iacute;a NIS+ es ampliamente usado por sus 
  ventajas frente a NIS.</P>
<P>&nbsp;</P>
<P>3 Observe que si &uacute;nicamente va usted a experimentar con el servidor, 
  tiene que asegurarse de que no lo configura con un nombre de dominio NIS que 
  ya est&eacute; en uso en su red. Ello podr&iacute;a desbaratar todo el servicio 
  de red y hacer a mucha gente desdichada, y muy enfadada.</P>
<P>Actualmente hay disponibles dos servidores NIS de forma gratuita para Linux, 
  uno contenido en el paquete yps de Tobias Reber, y el otro en el paquete ypserv 
  de Peter Eriksson. No deber&iacute;a importar cual utilice usted, independientemente 
  de que usted use NYS o el c&oacute;digo de cliente NIS est&aacute;ndar que existe 
  actualmente en libc. En el momento de escribir esto, el c&oacute;digo para manejar 
  servidores NIS esclavos parece ser m&aacute;s completo en yps. As&iacute; que 
  si tiene que tratar con servidores esclavo, yps puede ser una opci&oacute;n 
  mejor.</P>
<P>Tras instalar el programa servidor (ypserv) en /usr/sbin, deber&aacute; crear 
  el directorio que va a contener los ficheros mapa que su servidor va a distribuir. 
  Al establecer un dominio NIS para el dominio cervecera, los mapas ir&iacute;an 
  al fichero /var/yp/cervecera. El servidor determina si est&aacute; sirviendo 
  un dominio NIS en particular comprobando si el directorio mapa est&aacute; presente. 
  Si va a deshabilitar el servicio para alg&uacute;n dominio NIS, aseg&uacute;rese 
  de eliminar el directorio tambi&eacute;n.</P>
<P>Los mapas normalmente se almacenan en ficheros DBM para acelerar las b&uacute;squedas. 
  Se crean a partir de los ficheros maestro usando un programa llamado makedbm 
  (para el servidor de Tobias) o dbmload (para el servidor de Peter). Estos pueden 
  no ser intercambiables. Transformar un fichero maestro a una forma entendible 
  por dbmload normalmente requiere un poco de magia awk o sed, lo que tiende a 
  ser un poco tedioso de escribir y dif&iacute;cil de recordar. Por ello, el paquete 
  ypserv de Peter Eriksson contiene un Makefile (llamado ypMakefile) que realiza 
  todos esos trabajos por usted. Deber&iacute;a instalarlo como Makefile en su 
  directorio de mapas, y editarlo para que refleje los mapas que desee distribuir. 
  Hacia el principio del fichero encontrar&aacute; la etiqueta all que lista los 
  servicios que ypserv ofrece. Por defecto, la l&iacute;nea es algo parecido a 
  esto:</P>
<DIR> 
  <DIR> 
    <P>all: ethers hosts networks protocols rpc services passwd group netid</P>
  </DIR>
</DIR>
<P>Si no desea producir los mapas ethers.byname y ethers.byaddr, por ejemplo, 
  simplemente elimine la palabra ethers de la l&iacute;nea. Para probar su configuraci&oacute;n, 
  puede ser suficiente con empezar con solo uno o dos mapas, como los mapas services.*.</P>
<P>Tras editar el Makefile, y sin salir del directorio de mapas, teclee "make". 
  Esto generar&aacute; e instalar&aacute; autom&aacute;ticamente los mapas. Debe 
  asegurarse de actualizar los mapas cada vez que cambie los ficheros maestros, 
  de otro modo los cambios seguir&aacute;n siendo invisibles para la red.</P>
<P>La siguiente secci&oacute;n explica como configurar el c&oacute;digo de cliente 
  NIS. Si su configuraci&oacute;n no funciona, deber&iacute;a comprobar si llega 
  alguna petici&oacute;n a su servidor o no. Si especifica el par&aacute;metro 
  -D al servidor NYS, &eacute;ste imprimir&aacute; mensajes de depuraci&oacute;n 
  en la consola sobre todas las peticiones NIS entrantes, y los resultados devueltos. 
  Esto deber&iacute;a darle una idea sobre donde puede estar el problema. El servidor 
  de Tobias no tiene esa opci&oacute;n.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="10.5"></a>10.5 Configurar un Cliente NIS con NYS</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>A lo largo de lo que queda de este cap&iacute;tulo, cubriremos la configuraci&oacute;n 
  de un cliente NIS.</P>
<P>Su primer paso deber&iacute;a ser indicarle a NYS que servidor usar para el 
  servicio NIS, estableci&eacute;ndolo en el fichero de configuraci&oacute;n /etc/yp.conf. 
  Un fichero de ejemplo muy sencillo para un nodo en la red de la Vinatera seria 
  algo as&iacute;:</P>
<DIR> 
  <DIR> 
    <P># yp.conf - Configuraci&oacute;n YP para la biblioteca NYS.<BR>
      #<BR>
      domainname vinatera<BR>
      ypserver vbardolino</P>
  </DIR>
</DIR>
<P>La primera sentencia indica a los clientes NIS que pertenecen al dominio NIS 
  vinatera. Si omite esta l&iacute;nea, NYS usar&aacute; el nombre de dominio 
  que usted asign&oacute; a su sistema con el comando domainname. La sentencia 
  ypserver indica el servidor a usar. Por supuesto, la direcci&oacute;n IP correspondiente 
  a vbardolino debe estar establecida en el fichero hosts; alternativamente, podr&iacute;a 
  usar directamente la direcci&oacute;n IP en la sentencia ypserver.</P>
<P>En el fichero mostrado arriba, el comando ypserver indica a NYS que use el 
  servidor indicado sea cual sea el dominio NIS actual. Sin embargo, si mueve 
  frecuentemente su m&aacute;quina entre diferentes dominios NIS, tal vez le interesar&iacute;a 
  mantener la informaci&oacute;n de varios dominios en el fichero yp.conf. Puede 
  tener informaci&oacute;n sobre los servidores para varios dominios NIS en yp.conf 
  a&ntilde;adiendo el nombre de dominio NIS a la sentencia ypserver.</P>
<P>Por ejemplo, podr&iacute;a cambiar el fichero del ejemplo anterior para que 
  sea algo as&iacute;:</P>
<DIR> 
  <DIR> 
    <P># yp.conf - Configuraci&oacute;n YP para la biblioteca NYS.<BR>
      #<BR>
      ypserver vbardolino vinatera<BR>
      ypserver vstout cervecera</P>
  </DIR>
</DIR>
<P>Esto le permite mover su m&aacute;quina a cualquiera de los dos dominios simplemente 
  con establecer el dominio NIS deseado durante el arranque con el comando domainname.</P>
<P>Una vez creado este fichero de configuraci&oacute;n b&aacute;sico y de asegurarse 
  de que tiene permiso de lectura para todo el mundo, deber&iacute;a realizar 
  su primera prueba para comprobar si puede conectar con su servidor. Aseg&uacute;rese 
  de elegir cualquier mapa que su servidor distribuya, como hosts.byname, e intente 
  obtenerlo usando la utilidad ypcat. ypcat, como todas las dem&aacute;s herramientas 
  NIS, debe encontrarse en /usr/sbin.</P>
<DIR> 
  <DIR> 
    <P># ypcat hosts.byname<BR>
      191.72.2.2 vbeaujolais vbeaujolais.linus.lxnet.org<BR>
      191.72.2.3 vbardolino vbardolino.linus.lxnet.org<BR>
      191.72.1.1 vlager vlager.linus.lxnet.org<BR>
      191.72.2.1 vlager vlager.linus.lxnet.org<BR>
      191.72.1.2 vstout vstout.linus.lxnet.org<BR>
      191.72.1.3 vale vale.linus.lxnet.org<BR>
      191.72.2.4 vchianti vchianti.linus.lxnet.org</P>
  </DIR>
</DIR>
<P>La salida que obtenga debe ser algo parecido a lo expuesto arriba. Si recibe 
  un mensaje de error en su lugar que diga "Can't bind to server which serves 
  domain" (no se puede conectar al servidor del dominio), o algo similar, entonces, 
  o el nombre de dominio NIS que ha establecido no tiene definido su servidor 
  correspondiente en yp.conf, o el servidor, por alguna raz&oacute;n, no est&aacute; 
  disponible. En este &uacute;ltimo caso, aseg&uacute;rese que un ping a esa m&aacute;quina 
  da un resultado positivo, y de que est&aacute; en efecto ejecutando un servidor 
  NIS.</P>
<P>Puede verificar esto &uacute;ltimo usando rpcinfo, que deber&iacute;a producir 
  la siguiente salida:</P>
<DIR> 
  <DIR> 
    <P># rpcinfo -u servidor ypserv<BR>
      program 100004 version 2 ready and waiting</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="10.6"></a>10.6 Elecci&oacute;n de los Mapas Correctos</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Una vez que este seguro de que puede llegar al servidor NIS, debe decidir que 
  ficheros de configuraci&oacute;n sustituir o aumentar con mapas NIS. Normalmente 
  desear&aacute; usar mapas NIS para las funciones de b&uacute;squeda de nodos 
  y de claves de usuario. El primero es especialmente &uacute;til si no utiliza 
  DNS. El segundo permite a todos los usuarios entrar en su cuenta desde cualquier 
  sistema dentro del dominio NIS; esto suele requerir compartir un directorio 
  /home central entre todos los nodos mediante NFS. Todo esto se explica en detalle 
  en la secci&oacute;n 10.7 m&aacute;s abajo. Otros mapas, como services.byname, 
  no proporcionan una ganancia tan clara, pero ahorran algo de trabajo de edici&oacute;n 
  si instala alguna aplicaci&oacute;n de red que use un nombre de servicio que 
  no est&eacute; en el fichero services est&aacute;ndar.</P>
<P>Por lo general, usted desear&aacute; tener alguna libertad de elecci&oacute;n 
  acerca de cuando una funci&oacute;n de b&uacute;squeda usar&aacute; ficheros 
  locales y cuando har&aacute; una petici&oacute;n al servidor NIS.</P>
<P>NYS le permite configurar el orden en que una funci&oacute;n accede a estos 
  servicios. Esto se controla mediante el fichero /etc/nsswitch.conf, que quiere 
  decir Selector del Servicio de Nombrado9 pero por supuesto no est&aacute; limitado 
  a los servicios de nombres. Para cualquiera de las funciones de b&uacute;squeda 
  de datos soportadas por NYS, contiene una l&iacute;nea citando los servicios 
  a usar.</P>
<P>El orden correcto de los servicios depende del tipo de datos. Es improbable 
  que el mapa services.byname contenga entradas diferentes que las que se encuentran 
  en el fichero services local; &uacute;nicamente podr&iacute;a contener m&aacute;s. 
  As&iacute; que una buena elecci&oacute;n seria consultar los ficheros locales 
  primero, y probar con NIS solo si el nombre del servicio no fue encontrado.</P>
<P>Por otro lado, la informaci&oacute;n de nombres de nodos puede cambiar muy 
  frecuentemente, de forma que el DNS o el servidor NIS tendr&iacute;an siempre 
  la informaci&oacute;n mas precisa, mientras que el fichero hosts local solo 
  se mantiene como copia de respaldo por si el DNS y NIS fallasen. En este caso, 
  habr&iacute;a que comprobar el fichero local en &uacute;ltimo lugar.</P>
<P>El siguiente ejemplo muestra como configurar las funciones gethostbyname(2), 
  gethostbyaddr(2), y getservbyname(2) de la forma descrita anteriormente. Probar&aacute;n 
  los servicios listados por orden; si una b&uacute;squeda es satisfactoria, se 
  devuelve el resultado, si no, se intentar&aacute; con el siguiente servicio.</P>
<DIR> 
  <DIR> 
    <P># /etc/nsswitch.conf de ejemplo<BR>
      #<BR>
      hosts: nis dns files<BR>
      services: files nis</P>
  </DIR>
</DIR>
<P>M&aacute;s abajo se muestra la lista completa de servicios que pueden ser usados 
  en una entrada del fichero nsswitch.conf. Los mapas, ficheros, servidores y 
  objetos que se pueden consultar dependen del nombre de la entrada.</P>
<DIR> 
  <DIR> 
    <P>nisplus o nis+</P>
  </DIR>
</DIR>
<P>Usa el servidor NIS+ para este dominio. La situaci&oacute;n del servidor se 
  obtiene del fichero /etc/nis.conf.</P>
<P><b>nis</b> Usa el servidor NIS actual de este dominio. La situaci&oacute;n 
  del servidor consultado esta configurada en el fichero yp.conf como se mostr&oacute; 
  en la secci&oacute;n previa. Para la entrada hosts se consultan los mapas hosts.byname 
  y hosts.byaddr.</P>
<P><b>dns</b> Usa el servidor de nombres DNS. Este tipo de servicio solo es &uacute;til 
  con la entrada hosts. Los servidores de nombres consultados siguen estando determinados 
  por el fichero est&aacute;ndar resolv.conf.</P>
<P><b>files</b> Usa el fichero local. Como el fichero /etc/hosts para la entrada 
  hosts.</P>
<P><b>dbm</b> Busca la informaci&oacute;n en ficheros DBM localizados en /var/dbm. 
  El nombre usado para el fichero es el del mapa NIS correspondiente.</P>
<P>_____________________________________________<BR>
  9 N. del T.: del ingl&eacute;s Name Service Switch.</P>
<P>&nbsp;</P>
<P>Actualmente NYS soporta las siguientes entradas en nsswitch.conf : hosts, networks, 
  passwd, group, shadow, gshadow, services, protocols, rpc y ethers. Es probable 
  que se a&ntilde;adan m&aacute;s entradas.</P>
<P>La figura 10.1 muestra un ejemplo mas completo que introduce otra caracter&iacute;stica 
  del fichero nsswitch.conf : la palabra clave [NOTFOUND=return] en la entrada 
  hosts indica a NYS que retorne si el elemento deseado no pudo ser encontrado 
  en la base de datos NIS o DNS. Esto es, NYS continuar&aacute; y buscar&aacute; 
  en los ficheros locales solo si las llamadas a los servidores NIS y DNS fallaron 
  por alguna otra raz&oacute;n. Los ficheros locales ser&aacute;n usados entonces 
  solo durante el arranque y como copia de respaldo cuando el servidor NIS se 
  haya ca&iacute;do.</P>
<DIR> 
  <DIR> 
    <P># /etc/nsswitch.conf<BR>
      #<BR>
      hosts: nis dns [NOTFOUND=return] files<BR>
      networks: nis [NOTFOUND=return] files<BR>
      <BR>
      services: files nis<BR>
      protocols: files nis<BR>
      rpc: files nis</P>
  </DIR>
</DIR>
<P>Figura 10.1: Fichero nsswitch.conf de ejemplo.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="10.7"></a>10.7 Uso de los mapas passwd y group</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Uno de los usos m&aacute;s importantes de NIS es sincronizar usuarios e informaci&oacute;n 
  de cuentas en todos los nodos de un dominio NIS. Para este fin, solo se suele 
  mantener un peque&ntilde;o fichero local /etc/passwd, al que se le a&ntilde;ade 
  informaci&oacute;n de todas las dem&aacute;s cuentas mediante los mapas NIS. 
  Sin embargo, solo con habilitar b&uacute;squedas NIS para este servicio en nsswitch.conf 
  no es suficiente.</P>
<P>Cuando se base en la informaci&oacute;n de contrase&ntilde;as distribuida por 
  NIS, debe primero cerciorarse de que los n&uacute;meros identificadores de cualquier 
  usuario que tenga en su fichero passwd local coincidan con la idea que tiene 
  el servidor NIS de identificadores de usuarios. Usted tambi&eacute;n desear&aacute; 
  esto para otros prop&oacute;sitos, como montar vol&uacute;menes NFS de otros 
  nodos de su red.</P>
<P>Si alguno de los n&uacute;meros de usuario de /etc/passwd o de /etc/group son 
  distintos de los que aparecen en los mapas, tiene que ajustar el propietario 
  de todos los ficheros que pertenezcan a ese usuario. Primero deber&iacute;a 
  cambiar todos los n&uacute;meros de uid y gid en passwd y group a los nuevos 
  valores; despu&eacute;s, encontrar todos los ficheros que pertenezcan a los 
  usuarios reci&eacute;n modificados, y finalmente cambiarles el propietario. 
  Supongamos que news tenia un n&uacute;mero de usuario de 9, y que okir tenia 
  un n&uacute;mero de usuario de 103, y que estos fueron cambiados a alg&uacute;n 
  otro valor; entonces deber&iacute;a teclear los siguientes comandos:</P>
<DIR> 
  <DIR> 
    <P># find / -uid 9 -print &gt;/tmp/uid.9<BR>
      # find / -uid 103 -print &gt;/tmp/uid.103<BR>
      # cat /tmp/uid.9 | xargs chown news<BR>
      # cat /tmp/uid.103 | xargs chown okir</P>
  </DIR>
</DIR>
<P>Es importante que ejecute estos comandos con el nuevo fichero passwd ya instalado, 
  y que recoja todos los nombres de ficheros antes de cambiar el propietario de 
  cualquiera de ellos. Para cambiar el grupo propietario de los ficheros, se usar&aacute; 
  un comando similar.</P>
<P>Una vez hecho esto, los n&uacute;meros de uid y gid de su sistema estar&aacute;n 
  de acuerdo con los de los dem&aacute;s nodos de su dominio NIS. El siguiente 
  paso ser&aacute; a&ntilde;adir las l&iacute;neas de configuraci&oacute;n a nsswitch.conf 
  que habiliten las b&uacute;squedas NIS de informaci&oacute;n de usuario y grupo.</P>
<DIR> 
  <DIR> 
    <P># /etc/nsswitch.conf - tratamiento de contrase~a y grupo<BR>
      passwd: nis files<BR>
      group: nis files</P>
  </DIR>
</DIR>
<P>Esto hace que el comando login y otros de esta familia consulten primero los 
  mapas NIS cuando un usuario intenta entrar, y si esta b&uacute;squeda falla, 
  sigan con los ficheros locales.</P>
<P>Normalmente usted borrar&aacute; la mayor parte de los usuarios de sus ficheros 
  locales y solo dejar&aacute; en ellos entradas para root y para cuentas gen&eacute;ricas 
  como mail. Esto es porque algunas tareas vitales del sistema pueden requerir 
  mapear uids a nombres de usuario o viceversa. Por ejemplo, las tareas cron administrativas 
  pueden ejecutar el comando su para convertirse temporalmente en news, o el subsistema 
  UUCP puede enviar un informe de estado en un mensaje. Si news y uucp no tienen 
  entradas en el fichero passwd local, estas tareas fallar&aacute;n miserablemente 
  durante un apag&oacute;n de NIS.</P>
<P>Dos observaciones importantes: por un lado, la configuraci&oacute;n descrita 
  hasta aqu&iacute; solo funciona para sistemas de login que no usan contrase&ntilde;a 
  shadow, como los incluidos en el paquete util-linux. Los intrincados m&eacute;todos 
  para usar contrase&ntilde;as shadow con NIS ser&aacute;n cubiertos m&aacute;s 
  adelante. Por otro lado, los comandos login no son los &uacute;nicos que acceden 
  al fichero passwd - por ejemplo la orden ls que la mayor parte de la gente usa 
  constantemente.</P>
<P>Cada vez que se saca un listado con la opci&oacute;n -l, ls mostrara los nombres 
  simb&oacute;licos del propietario y del grupo; esto es, por cada uid y gid que 
  encuentre, deber&aacute; hacer una petici&oacute;n al servidor NIS. Esto ralentizar&aacute; 
  mucho todo el sistema cuando su red local se atasque, o, aun peor, cuando el 
  servidor NIS no est&eacute; en la misma red f&iacute;sica, de forma que los 
  datagramas tengan que pasar a trav&eacute;s de un encaminador o puente.</P>
<P>Y esto no es todo. Imagine lo que pasa si un usuario quiere cambiar su contrase&ntilde;a. 
  Normalmente invocar&aacute; el comando passwd, que leer&aacute; la nueva contrase&ntilde;a 
  y actualizar&aacute; el fichero passwd local. Esto es imposible con NIS, puesto 
  que ese fichero no est&aacute; disponible localmente, y tampoco es una opci&oacute;n 
  que los usuarios entren en el servidor NIS cada vez que quieran cambiar la clave. 
  Por ello, NIS proporciona un sustituto para passwd llamado yppasswd, que realiza 
  una tarea an&aacute;loga en NIS. Para cambiar la contrase&ntilde;a en la m&aacute;quina 
  servidora, contacta con el demonio yppasswdd en ese nodo mediante RPC, y le 
  proporciona informaci&oacute;n de la contrase&ntilde;a actualizada. Generalmente, 
  yppasswd se instala sobre el programa normal haciendo algo as&iacute;:</P>
<DIR> 
  <DIR> 
    <P># cd /bin<BR>
      # mv passwd passwd.old<BR>
      # ln yppasswd passwd</P>
  </DIR>
</DIR>
<P>Al mismo tiempo tendr&aacute; que instalar rpc.yppasswdd en el servidor y arrancarlo 
  desde los guiones rc. Esto ocultar&aacute; de forma efectiva todas las complicaciones 
  de NIS a sus usuarios.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="10.8"></a>10.8 Uso de NIS con Soporte Shadow</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Todav&iacute;a no existe soporte NIS para instalaciones que usan el conjunto 
  de utilidades shadow password. John F. Haugh, el autor del conjunto shadow, 
  publico recientemente una versi&oacute;n de las funciones de biblioteca shadow 
  en comp.sources.misc, cubiertas por la licencia LGPL de GNU. Ya tiene alg&uacute;n 
  soporte para NIS, pero no est&aacute; completa, y los ficheros no han sido a&ntilde;adidos 
  todav&iacute;a a la biblioteca C est&aacute;ndar. Por otro lado, publicar la 
  informaci&oacute;n de /etc/shadow v&iacute;a NIS rompe de alguna manera con 
  el prop&oacute;sito del conjunto shadow.</P>
<P>Aunque las funciones de b&uacute;squeda de contrase&ntilde;a en NYS no usan 
  un mapa shadow.byname ni nada parecido, NYS soporta el uso de un fichero /etc/shadow 
  local de forma transparente. Cuando la implementaci&oacute;n NYS de getpwnam 
  es llamada para buscar informaci&oacute;n relacionada con un login dado, se 
  consultan las facilidades especificadas por la entrada passwd en nsswitch.conf. 
  El servicio nis seguir&aacute; mirando en el mapa passwd.byname del servidor 
  NIS. En cambio, el servicio files mirar&aacute; si existe /etc/shadow y lo intentar&aacute; 
  abrir.</P>
<P>Si no existe, o si el usuario no tiene privilegios de root, volver&aacute; 
  al comportamiento tradicional de mirar la informaci&oacute;n del usuario solo 
  en /etc/passwd. Sin embargo, si el fichero shadow existe y puede ser abierto, 
  NYS extraer&aacute; la contrase&ntilde;a del usuario de shadow. La funci&oacute;n 
  getpwuid se implementa similarmente. De esta forma, los binarios compilados 
  con NYS funcionar&aacute;n de forma transparente con una instalaci&oacute;n 
  shadow local.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="10.9"></a>10.9 Uso del C&oacute;digo NIS Tradicional</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Si est&aacute; usando el c&oacute;digo de cliente existente en la libc est&aacute;ndar, 
  la configuraci&oacute;n de un cliente NIS es un poco diferente. Por un lado, 
  se usa un demonio ypbind para buscar por la red servidores activos en vez de 
  obtener esta informaci&oacute;n de un fichero de configuraci&oacute;n.</P>
<P>Usted tendr&aacute; por ello que cerciorarse de que arranca ypbind durante 
  la inicializaci&oacute;n del sistema. Debe ser invocado despu&eacute;s de que 
  el dominio NIS haya sido establecido y de que el mapeador de puertos RPC haya 
  sido arrancado. Despu&eacute;s podr&aacute; invocar ypcat para comprobar el 
  servidor como se mostr&oacute; mas arriba.</P>
<P>Recientemente ha habido numerosos informes de error indicando que NIS falla 
  con un mensaje de error que dice: "clntudp_create: RPC: portmapper failure - 
  RPC: unable to receive". Estos mensajes de error son debidos a un cambio incompatible 
  en el modo en que ypbind comunica la informaci&oacute;n de enlazado a las funciones 
  de biblioteca. Con obtener las fuentes m&aacute;s recientes de las utilidades 
  NIS y recompilarlas se deber&iacute;a solucionar este problema.10</P>
<P>Del mismo modo, la forma en que el NIS tradicional decide si hay que mezclar 
  informaci&oacute;n NIS, y como, con la de los ficheros locales es distinta que 
  la usada por NYS. Por ejemplo, para usar los mapas de contrase&ntilde;a NIS, 
  debe incluir la siguiente l&iacute;nea en alg&uacute;n lugar de su mapa /etc/passwd 
  :</P>
<DIR> 
  <DIR> 
    <P>+:*:0:0:::</P>
  </DIR>
</DIR>
<P>Esto marca el lugar donde las funciones de b&uacute;squeda de contrase&ntilde;as 
  "insertan" los mapas NIS. Insertando una l&iacute;nea similar (menos los dos 
  &uacute;ltimos dos puntos) en /etc/group obtenemos lo mismo para los mapas group.*. 
  Para usar los mapas hosts.* distribuidos por NIS, cambie la l&iacute;nea order 
  del fichero host.conf. Por ejemplo, si desea usar NIS, DNS, y el fichero /etc/hosts 
  (por ese orden), necesita cambiar esa l&iacute;nea por:</P>
<DIR> 
  <DIR> 
    <P>order yp bind hosts</P>
  </DIR>
</DIR>
<P>La implementaci&oacute;n NIS tradicional no soporta ning&uacute;n otro mapa 
  m&aacute;s por el momento.</P>
<P>_____________________________________________<BR>
  10 El c&oacute;digo fuente de yp-linux puede obtenerse de ftp.uni-paderborn.de, 
  en el directorio /pub/Linux/LOCAL.</P>
</FONT> 
</BODY>
</HTML>
