<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl12</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl11.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl13.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 12</P>
</font></B><P ALIGN="CENTER"><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>Administraci&oacute;n de Taylor UUCP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
</FONT>
<dir> 
    <p><font face="Verdana" size="2"><a href="garl12.htm#12.1">12.1 Historia</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl12.htm#12.1.1">12.1.1 M&aacute;s 
          Informaci&oacute;n Sobre UUCP</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl12.htm#12.2">12.2 Introducci&oacute;n</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl12.htm#12.2.1">12.2.1 Disposici&oacute;n 
          de Transferencias de UUCP y Ejecuci&oacute;n Remota</a><br>
          <a href="garl12.htm#12.2.2">12.2.2 El Funcionamiento Interno de uucico</a><br>
          <a href="garl12.htm#12.2.3">12.2.3 Opciones de la l&iacute;nea de comandos 
          de uucico</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl12.htm#12.3">12.3 Ficheros de 
      configuraci&oacute;n de UUCP</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl12.htm#12.3.1">12.3.1 Una 
          Ligera Introducci&oacute;n a Taylor UUCP</a><br>
          <a href="garl12.htm#12.3.2">12.3.2 Lo que UUCP necesita saber</a><br>
          <a href="garl12.htm#12.3.3">12.3.3 Nomenclatura de nodos</a><br>
          <a href="garl12.htm#12.3.4">12.3.4 Ficheros de configuraci&oacute;n 
          Taylor</a><br>
          <a href="garl12.htm#12.3.5">12.3.5 Opciones Generales de Configuraci&oacute;n 
          - el Fichero config</a><br>
          <a href="garl12.htm#12.3.6">12.3.6 Como informar a UUCP sobre otros 
          sistemas - el fichero sys</a><br>
          <a href="garl12.htm#12.3.7">12.3.7 Que dispositivos hay - el fichero 
          port</a><br>
          <a href="garl12.htm#12.3.8">12.3.8 Como marcar un n&uacute;mero - el 
          fichero dial</a><br>
          <a href="garl12.htm#12.3.9">12.3.9 UUCP sobre TCP</a><br>
          <a href="garl12.htm#12.3.10">12.3.10 Uso de una conexi&oacute;n directa</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl12.htm#12.4">12.4 Los sies y 
      noes de UUCP - Ajuste de Permisos</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl12.htm#12.4.1">12.4.1 Ejecuci&oacute;n 
          de comandos</a><br>
          <a href="garl12.htm#12.4.2">12.4.2 Transferencias de Ficheros</a><br>
          <a href="garl12.htm#12.4.3">12.4.3 Reenv&iacute;o</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl12.htm#12.5">12.5 Configuraci&oacute;n 
      de su sistema para ser llamado</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl12.htm#12.5.1">12.5.1 Configuraci&oacute;n 
          de getty</a><br>
          <a href="garl12.htm#12.5.2">12.5.2 Proveer Cuentas de UUCP</a><br>
          <a href="garl12.htm#12.5.3">12.5.3 Protecci&oacute;n contra estafadores</a><br>
          <a href="garl12.htm#12.5.4">12.5.4 Vu&eacute;lvase Loco - Comprobaci&oacute;n 
          de Secuencia de Llamadas</a><br>
          <a href="garl12.htm#12.5.5">12.5.5 UUCP An&oacute;nimo</a></font></p>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl12.htm#12.6">12.6 Protocolos 
      de bajo nivel de UUCP</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl12.htm#12.6.1">12.6.1 Resumen 
          del protocolo</a><br>
          <a href="garl12.htm#12.6.2">12.6.2 Ajuste del protocolo de transmisi&oacute;n</a><br>
          <a href="garl12.htm#12.6.3">12.6.3 Selecci&oacute;n de protocolos espec&iacute;ficos</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl12.htm#12.7">12.7 Soluci&oacute;n 
      de problemas</a><br>
      <a href="garl12.htm#12.8">12.8 Archivos de registro hist&oacute;rico (Log 
      Files)</a></font></p>
  </dir>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="12.1"></a>12.1 Historia</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>UUCP fue dise&ntilde;ado a finales de los a&ntilde;os setenta por Mike Lesk 
  en los laboratorios Bell de AT&amp;T con el objetivo de crear una simple red 
  sobre l&iacute;neas de tel&eacute;fonos para conectarse mediante llamadas telef&oacute;nicas. 
  Dado que la mayor&iacute;a de la gente que quiere tener correo electr&oacute;nico 
  y noticias de Usenet en sus ordenadores personales todav&iacute;a se comunican 
  por m&oacute;dem, UUCP ha seguido siendo muy popular. Aunque hay muchas implementaciones 
  funcionando en una gran variedad de plataformas y sistemas operativos, todas 
  son bastante compatibles.</P>
<P>Sin embargo, como con cualquier programa que se ha convertido en "est&aacute;ndar" 
  con el tiempo, no hay un UUCP que se pueda denominar el UUCP. Ha sufrido un 
  continuo proceso de evoluci&oacute;n desde la primera versi&oacute;n que fue 
  implementada en 1976. En la actualidad hay dos especies principales que se diferencian 
  principalmente en su soporte del hardware y en su configuraci&oacute;n. A su 
  vez, hay varias implementaciones de estas dos clases, todas con ligeras diferencias 
  respecto a sus familiares.</P>
<P>Una de las clases es la llamada "UUCP Version 2", que es una implementaci&oacute;n 
  de 1977 de Mike Lesk, David A. Novitz, y Greg Chesson. Aunque es bastante antigua, 
  todav&iacute;a se usa frecuentemente. Las implementaciones mas recientes de 
  la Version 2 ofrecen muchas de las caracter&iacute;sticas de los tipos mas nuevos 
  de UUCP.</P>
<P>La segunda clase de UUCP se desarroll&oacute; en 1983, y se conoce com&uacute;nmente 
  como BNU (Utilidades B&aacute;sicas de Red)1, HoneyDanBer UUCP, o HDB abreviado. 
  El nombre fue derivado de los nombres de los autores, P. Honeyman, D. A. Novitz, 
  y B. E. Redman. HDB fue creado para eliminar algunas deficiencias de la Version 
  2. Por ejemplo, se a&ntilde;adieron nuevos protocolos de transferencia, y el 
  directorio de cola fue dividido de manera que ahora solo haya un directorio 
  para cada ordenador con el que mantenga tr&aacute;fico de UUCP.</P>
<P>_____________________________________________<BR>
  1 N. del T.: BNU son las siglas de Basic Network Utilities.</P>
<P>&nbsp;</P>
<P>La implementaci&oacute;n de UUCP que se distribuye con Linux es Taylor UUCP 
  1.04,2 que es la versi&oacute;n en la que se basa este cap&iacute;tulo. La versi&oacute;n 
  1.04 de Taylor UUCP esta disponible desde Febrero de 1993. Adem&aacute;s de 
  los tradicionales ficheros de configuraci&oacute;n, Taylor UUCP tambi&eacute;n 
  se puede compilar para que use ficheros de configuraci&oacute;n de un nuevo 
  estilo: el estilo "Taylor".</P>
<P>La versi&oacute;n 1.05 ha aparecido recientemente, y pronto se incluir&aacute; 
  en la mayor&iacute;a de las distribuciones. Las diferencias entre estas versiones 
  afectan en su mayor parte a aspectos que usted nunca usara, as&iacute; que con 
  lo poco que contamos aqu&iacute; le deber&iacute;a bastar para configurar Taylor 
  UUCP 1.05 en su sistema.</P>
<P>Tal y como se incluye en la mayor&iacute;a de las distribuciones de Linux, 
  el Taylor UUCP viene compilado para ser compatible con BNU, con el estilo de 
  configuraci&oacute;n de Taylor, o ambos.</P>
<P>Dado que el segundo es mucho m&aacute;s flexible, y probablemente m&aacute;s 
  f&aacute;cil de entender que los usualmente oscuros ficheros de configuraci&oacute;n 
  de BNU, describir&eacute; aqu&iacute; el estilo Taylor.</P>
<P>El prop&oacute;sito de este cap&iacute;tulo no es ofrecer una explicaci&oacute;n 
  exhaustiva de las opciones de la l&iacute;nea de comando para los comandos de 
  UUCP y lo que hacen, sino darle una introducci&oacute;n sobre como poner en 
  marcha un nodo de UUCP. La primera secci&oacute;n presenta una introducci&oacute;n 
  de como UUCP implementa ejecuci&oacute;n remota y transmisi&oacute;n de ficheros. 
  Si usted tiene ya algunos conocimientos de UUCP, quiz&aacute; desee saltarse 
  esto y continuar con la secci&oacute;n "Ficheros de configuraci&oacute;n de 
  UUCP", que explica los distintos ficheros usados para configurar UUCP.</P>
<P>Sin embargo, asumiremos que usted est&aacute; familiarizado con los programas 
  de usuario del paquete UUCP. Estos son uucp y uux. Si no los conoce suficientemente, 
  consulte las correspondientes p&aacute;ginas de manual.</P>
<P>Aparte de los programas de usuario, uux y uucp, el paquete UUCP contiene algunos 
  comandos m&aacute;s, usados solamente para fines administrativos. Se usan para 
  observar el tr&aacute;fico de UUCP en su nodo, deshacerse de viejos ficheros 
  de registro, o crear estad&iacute;sticas.</P>
<P>No describiremos ninguna de estas utilidades, porque son perif&eacute;ricas 
  a las tareas principales de UUCP. Dichas utilidades est&aacute;n bien documentadas 
  y son bastante f&aacute;ciles de entender. Sin embargo, hay una tercera categor&iacute;a, 
  que forma los "motores" del UUCP. Estas son uucico (donde "cico" significa "copy-in 
  copy-out"), y uuxqt, que ejecuta trabajos enviados desde sistemas remotos.</P>
<P>_____________________________________________<BR>
  2 Escrito por Ian Taylor en 1993.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="12.1.1"></a>12.1.1 M&aacute;s Informaci&oacute;n Sobre UUCP</P>
</u></I>
<P>Aquellos que no encuentren todo lo que necesiten en este cap&iacute;tulo pueden 
  leer la documentaci&oacute;n que viene con el paquete. Viene en un grupo de 
  ficheros de texinfo que describen la configuraci&oacute;n usando el estilo de 
  configuraci&oacute;n de Taylor. Los ficheros texinfo se pueden convertir a DVI 
  y a ficheros "GNU info" usando tex y makeinfo respectivamente.</P>
<P>Si quiere usar ficheros de configuraci&oacute;n de BNU o incluso de la Version 
  2 (!), existe un libro muy recomendable, "Managing UUCP and Usenet" ([OReilly89]). 
  Es muy &uacute;til. Otra buena fuente de informaci&oacute;n sobre UUCP en Linux 
  es el UUCP-HOWTO de Vince Skahan, que aparece regularmente en comp.os.linux.announce.</P>
<P>Tambi&eacute;n hay un grupo de noticias sobre UUCP, llamado comp.mail.uucp. 
  Si usted tiene preguntas especificas sobre Taylor UUCP, puede que sea mejor 
  que las pregunte en ese grupo, en vez de en los grupos comp.os.linux.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="12.2"></a>12.2 Introducci&oacute;n</P>
</font></u></B><U><I><FONT FACE="Verdana" SIZE=2> 
<P><a name="12.2.1"></a>12.2.1 Disposici&oacute;n de Transferencias de UUCP y 
  Ejecuci&oacute;n Remota</P>
</font></I></U><FONT FACE="Verdana" SIZE=2> 
<P>El concepto de trabajos es vital para entender el UUCP. Cada transferencia 
  que un usuario inicia con uucp o uux se denomina un trabajo. Se compone de un 
  comando para ser ejecutado en un sistema remoto, y una colecci&oacute;n de ficheros 
  para ser transferidos entre redes. Una de estas partes puede faltar.</P>
<P>Por ejemplo, el siguiente comando describe un trabajo UUCP, que conlleva copiar 
  el fichero netguide.ps en el ordenador pablo, y ejecutar luego el comando lpr 
  para imprimir el fichero.</P>
<DIR> 
  <DIR> 
    <P>$ uux -r pablo!lpr !netguide.ps</P>
  </DIR>
</DIR>
<P>Generalmente UUCP no llama al sistema remoto inmediatamente para ejecutar el 
  trabajo (se puede hacer con kermit). En lugar de esto, UUCP guarda la descripci&oacute;n 
  del trabajo temporalmente. Esto se denomina spooling.3 El &aacute;rbol de directorios 
  en el que se almacenan los trabajos se llama directorio de cola, y se encuentra 
  normalmente en /var/spool/uucp.</P>
<P>En nuestro ejemplo, la descripci&oacute;n del trabajo contendr&iacute;a informaci&oacute;n 
  sobre el comando remoto que hay que ejecutar (lpr ), el usuario que ha iniciado 
  la ejecuci&oacute;n, y otro par de cosas. Adem&aacute;s de la descripci&oacute;n 
  del trabajo, UUCP tiene que guardar el fichero de datos netguide.ps.</P>
<P>_____________________________________________<BR>
  3 N. del T.: spooling puede traducirse por "poner en una cola". Spooling se 
  refiere a la acci&oacute;n de poner varios trabajos en una cola para ser usados 
  mas tarde.</P>
<P>&nbsp;</P>
<P>La localizaci&oacute;n exacta y la nomenclatura de los ficheros de cola puede 
  variar, dependiendo de las opciones de compilaci&oacute;n. Los UUCPs que son 
  compatibles con HDB generalmente guardan los ficheros de cola en un directorio 
  llamado /var/spool/uucp/maquina, donde maquina es el nombre del ordenador remoto. 
  Si fue compilado para usar ficheros de configuraci&oacute;n de Taylor, UUCP 
  crea subdirectorios bajo el directorio de cola especifico a un ordenador para 
  diferentes tipos de ficheros de cola.</P>
<P>En intervalos regulares UUCP se conecta al sistema remoto. Cuando se ha establecido 
  una conexi&oacute;n, UUCP transfiere los ficheros que describen el trabajo, 
  junto con los ficheros de datos. Los trabajos que entran en el ordenador remoto 
  no se ejecutan de inmediato, sino despu&eacute;s de que la conexi&oacute;n haya 
  finalizado. Esto lo hace uuxqt, que tambi&eacute;n se ocupa de reenviar cualquier 
  trabajo que este designado para otro ordenador diferente.</P>
<P>Para diferenciar trabajos importantes y trabajos menos importantes, UUCP asocia 
  un nivel a cada trabajo. El nivel es una sola letra o d&iacute;gito, de 0 a 
  9, de A a Z y de a a z, con precedencia decreciente. El correo se suele poner 
  en cola con nivel B o C, mientras que las noticias se suelen poner con nivel 
  N. Los trabajos con un nivel mas alto se transfieren mas pronto. Los niveles 
  pueden ser asignados usando la opci&oacute;n -q cuando se ejecuta uucp o uux.</P>
<P>Tambi&eacute;n se puede prohibir la transferencia de trabajos bajo un cierto 
  nivel a horas determinadas. Esto tambi&eacute;n se llama m&aacute;ximo nivel 
  de cola permitido durante una conversaci&oacute;n y el valor por defecto es 
  z. Perc&aacute;tese de la ambig&uuml;edad de esta terminolog&iacute;a: un fichero 
  se transfiere solo si es igual o mayor que el m&aacute;ximo nivel de cola.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.2.2"></a>12.2.2 El Funcionamiento Interno de uucico</P>
</u></I> 
<P>3 Para comprender por que uucico necesita saber ciertas cosas, hemos de revisar 
  como se conecta a un sistema remoto.</P>
<P>Cuando usted ejecuta uucico -s sistema desde la l&iacute;nea de comandos, primero 
  tiene que conectarse f&iacute;sicamente. Las acciones a tomar dependen del tipo 
  de conexi&oacute;n a usar, por ejemplo, cuando se usa una l&iacute;nea telef&oacute;nica, 
  tiene que encontrar un m&oacute;dem, y marcar un n&uacute;mero de tel&eacute;fono. 
  Sobre TCP, tiene que llamar gethostbyname(3) para convertir el nombre a una 
  direcci&oacute;n de red, averiguar que puerto abrir, y conectar la direcci&oacute;n 
  al puerto correspondiente.</P>
<P>Una vez que se ha establecido la conexi&oacute;n, hay que pasar un proceso 
  de autorizaci&oacute;n. Normalmente consiste en que el sistema remoto pide un 
  nombre de usuario y posiblemente una clave. Esto se llama el di&aacute;logo 
  de entrada. El proceso de autorizaci&oacute;n se lleva a cabo mediante el usual 
  getty/login, o - en conexiones TCP - por el propio uucico. Si la autorizaci&oacute;n 
  es permitida, la parte remota de la conexi&oacute;n ejecuta uucico. La copia 
  local de uucico que inicio la conexi&oacute;n se denomina maestro, y la copia 
  remota se denomina esclavo.</P>
<P>A continuaci&oacute;n viene la fase de negociacion4: El maestro env&iacute;a 
  su nombre, adem&aacute;s de varias opciones. El esclavo comprueba el nombre 
  para ver si tiene permiso para conectarse, para enviar y recibir ficheros, etc. 
  Las opciones describen (entre otras cosas) el nivel m&aacute;ximo de ficheros 
  de cola que hay que transferir. Si esta opci&oacute;n esta activada, tiene lugar 
  una cuenta de conversaci&oacute;n, o comprobaci&oacute;n de la secuencia de 
  llamada. Con esta caracter&iacute;stica, ambos ordenadores mantienen una cuenta 
  de conexiones exitosas, que se comparan. Si las cuentas no son iguales, la negociaci&oacute;n 
  de protocolos no tendr&aacute; lugar. Esto es &uacute;til para protegerse de 
  impostores.</P>
<P>Finalmente los dos uucico tratan de ponerse de acuerdo en un protocolo de transferencia 
  com&uacute;n. Este protocolo gobierna la manera en que los datos se transfieren, 
  la manera en que se comprueba la consistencia de los datos, y la manera en que 
  se retransmiten en caso de error. Hacen falta protocolos diferentes debido a 
  los diferentes tipos de conexiones que se soportan. Por ejemplo, las l&iacute;neas 
  de tel&eacute;fono precisan un protocolo "seguro" que es pesimista respecto 
  a errores, mientras que una transmisi&oacute;n de TCP es fiable y puede usar 
  un protocolo mas eficiente que carece de la mayor&iacute;a de las comprobaciones 
  de errores.</P>
<P>Una vez que las negociaciones se han completado, comienza la fase de la verdadera 
  transmisi&oacute;n. Ambos extremos ponen en funcionamiento el controlador del 
  protocolo elegido. Los controladores posiblemente lleven a cabo alguna secuencia 
  especifica del protocolo para la inicializaci&oacute;n.</P>
<P>Primero el maestro env&iacute;a todos los ficheros en la cola de este sistema 
  remoto cuyo nivel de cola es suficientemente alto. Cuando ha finalizado, informa 
  al esclavo que ha terminado, y que el esclavo puede ahora colgar. El esclavo 
  puede entonces colgar, o tomar el control de la conversaci&oacute;n. Esto es 
  un cambio de papeles: ahora el sistema remoto se convierte en maestro y el local 
  en esclavo. El nuevo maestro env&iacute;a ahora sus ficheros. Cuando ha terminado, 
  ambos uucicos intercambian mensajes de terminaci&oacute;n, y cierran la comunicaci&oacute;n.</P>
<P>No vamos a profundizar en mas detalle: para esto, dir&iacute;jase a las fuentes 
  o a cualquier buen libro sobre UUCP. Tambi&eacute;n existe un articulo muy antiguo 
  en la red, escrito por David A. Novitz, que da una descripci&oacute;n detallada 
  del protocolo UUCP. La FAQ5 de Taylor UUCP tambi&eacute;n trata algunos detalles 
  de como UUCP esta implementado. Se puede encontrar regularmente en comp.mail.uucp.</P>
<P>_____________________________________________<BR>
  4 N. del. T.: Literalmente, del ingles handshake o "apret&oacute;n de manos". 
  En este contexto significa "negociaci&oacute;n de protocolos", fase en la que 
  los programas uucico de cada extremo de comunicaci&oacute;n deciden que protocolo 
  com&uacute;n usar para enviar los ficheros.<BR>
  5 N. del T.: Del ingles Frecuently Asked Questions o Lista de Preguntas Comunes.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.2.3"></a>12.2.3 Opciones de la l&iacute;nea de comandos de uucico</P>
</u></I> 
<P>En esta secci&oacute;n de describen las opciones mas importantes de la l&iacute;nea 
  de comandos del programa uucico. Para obtener una lista completa, consulte la 
  p&aacute;gina del manual de uucico(1).</P>
<DIR> 
  <DIR> 
    <P>-s sistema<BR>
      Llamar al mencionado sistema si no esta prohibido por restricci&oacute;n 
      de la hora de llamada.</P>
    <P>-S sistema<BR>
      Llamar al sistema incondicionalmente.</P>
    <P>-r1<BR>
      Comenzar uucico en modo master. Este es el valor por defecto cuando se usa 
      -s o -S. Por si sola, la opci&oacute;n -r1 hace que uucico intente llamar 
      todos los sistemas en sys, a no ser que este prohibido por la hora de llamada 
      o el n&uacute;mero permitido de reintentos.</P>
    <P>-r0<BR>
      Comenzar uucico en modo esclavo. Este es el valor por defecto cuando no 
      se usan -s ni -S. En modo esclavo, las entrada y salida est&aacute;ndar 
      se suponen conectadas a un puerto serie, o al puerto de TCP especificado 
      por la opci&oacute;n -p si se usa &eacute;sta.</P>
    <P>-x tipo, -X tipo</P>
    <P>Activar la informaci&oacute;n para resolver problemas del tipo especificado. 
      Se pueden especificar varios tipos en una lista separada por comas. Los 
      siguientes son tipos validos: abnormal, chat, handshake, uucp-proto, proto, 
      port, config, spooldir, execute, incoming y outgoing. Usando all, todas 
      las opciones se activan. Por razones de compatibilidad con otras implementaciones 
      de UUCP, se puede especificar un n&uacute;mero en vez del tipo, lo cual 
      activa las n primeras opciones de la anterior lista.<BR>
      Los mensajes generados se registran en el fichero Debug bajo /var/spool/uucp.</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="12.3"></a>12.3 Ficheros de configuraci&oacute;n de UUCP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Al contrario que programas de transferencia de ficheros mas simples, UUCP fue 
  dise&ntilde;ado para ser capaz de llevar a cabo todas las transferencias autom&aacute;ticamente. 
  Una vez que esta correctamente configurado, no es necesaria una constante participaci&oacute;n 
  del administrador. La informaci&oacute;n necesaria para esto se guarda en un 
  par de ficheros de configuraci&oacute;n que residen en el directorio /usr/lib/uucp. 
  La mayor&iacute;a de estos ficheros se usan solo para conectarse a otro ordenador.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="12.3.1"></a>12.3.1 Una Ligera Introducci&oacute;n a Taylor UUCP</P>
</u></I>
<P>Decir que la configuraci&oacute;n de UUCP es dif&iacute;cil seria una descripci&oacute;n 
  insuficiente. Es cierto que es un asunto peliagudo, y el formato a veces demasiado 
  conciso de los ficheros de configuraci&oacute;n no hace las cosas mas f&aacute;ciles 
  (aunque el formato de Taylor es casi f&aacute;cil de leer comparado con los 
  formatos mas antiguos en HDB o Version 2).</P>
<P>Para darle una idea de como se interact&uacute;a con estos ficheros, le introduciremos 
  los mas importantes, y echaremos un vistazo a algunos ejemplos. No explicaremos 
  ahora todo en detalle; una explicaci&oacute;n mas precisa se describe en secciones 
  posteriores. Si quiere configurar su ordenador para UUCP, puede comenzar con 
  los ficheros de ejemplo, y adaptarlos gradualmente. Puede elegir los que se 
  muestran a continuaci&oacute;n, o los que se incluyen en su distribuci&oacute;n 
  de Linux preferida.</P>
<P>Todos los ficheros descritos en esta secci&oacute;n se guardan en /usr/lib/uucp 
  o un subdirectorio de &eacute;ste. Algunas distribuciones de Linux contienen 
  programas de UUCP que tienen soporte para ambos ficheros de HDB y Taylor, y 
  usan diferentes subdirectorios para cada grupo de ficheros de configuraci&oacute;n. 
  Normalmente hay un fichero README en /usr/lib/uucp.</P>
<P>Para que UUCP funcione correctamente, estos ficheros tienen que pertenecer 
  al usuario uucp. Algunos de ellos tienen claves y n&uacute;meros de tel&eacute;fono, 
  y por lo tanto deber&iacute;an tener permisos de 600.6</P>
<P>El fichero central de configuraci&oacute;n es /usr/lib/uucp/config, y se usa 
  para establecer los par&aacute;metros generales. El mas importante de ellos 
  (y por ahora, el &uacute;nico), es el nombre de su ordenador anfitri&oacute;n 
  de UUCP. En la Cervecera Virtual, se usa vstout como su ordenador de conexi&oacute;n 
  a UUCP.</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/uucp/config - Fichero principal de configuraci&oacute;n de UUCP<BR>
      hostname vstout</P>
  </DIR>
</DIR>
<P>El siguiente fichero de configuraci&oacute;n en importancia es el fichero sys. 
  Este contiene toda la informaci&oacute;n especifica al sistema de los ordenadores 
  con los que usted se conecta. Esto incluye el nombre del ordenador, e informaci&oacute;n 
  sobre la propia conexi&oacute;n, tal como el n&uacute;mero de tel&eacute;fono 
  cuando se usa una conexi&oacute;n por m&oacute;dem. Un ejemplo t&iacute;pico 
  para un ordenador llamado pablo que se conecta por m&oacute;dem seria:</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/uucp/sys - Vecinos UUCP<BR>
      # system: pablo<BR>
      system pablo<BR>
      time Any<BR>
      phone 123-456<BR>
      port serial1<BR>
      speed 38400<BR>
      chat ogin: neruda ssword: lorca</P>
  </DIR>
</DIR>
<P>_____________________________________________<BR>
  6 Aunque la mayor&iacute;a de los comandos de UUCP tienen que tener el setuid 
  a uucp, tiene que asegurarse de que el programa uuchk no lo es. Si no, los usuarios 
  serian capaces de ver las claves aunque tengan modo 600.</P>
<P>&nbsp;</P>
<P>port especifica el puerto a usar, y time especifica las horas a las que se 
  puede llamar a ese ordenador. chat describe la macro del di&aacute;logo de entrada 
  - la secuencia de caracteres que hay que intercambiar para permitir a uucico 
  que conecte con pablo. Volveremos a las macros mas tarde. El comando port no 
  usa un nombre de fichero de un dispositivo como /dev/cua1, sino que usa el nombre 
  de una entrada en el fichero port. Se pueden asignar estos nombres como se desee 
  siempre y cuando hagan referencia a una entrada v&aacute;lida en port.</P>
<P>El fichero port contiene informaci&oacute;n especifica a la propia conexi&oacute;n. 
  Para conexiones por m&oacute;dem, describe el fichero de dispositivo a usar, 
  el conjunto de velocidades soportadas, y el tipo de equipo de marcaci&oacute;n 
  conectado al puerto. La entrada a continuaci&oacute;n describe /dev/cua1 (o 
  sea, el puerto COM 2), en el cual hay un m&oacute;dem NakWell conectado que 
  es capaz de funcionar a velocidades de hasta 38400 bps. El nombre de la entrada 
  se puede elegir para que coincida con el nombre usado en el fichero sys.</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/uucp/port - puertos de UUCP<BR>
      # /dev/cua1 (COM2)<BR>
      port serial1<BR>
      type modem<BR>
      device /dev/cua1<BR>
      speed 38400<BR>
      dialer nakwell</P>
  </DIR>
</DIR>
<P>La informaci&oacute;n que afecta al propio marcador se mantiene en otro fichero, 
  llamado dial. Para cada tipo de marcador, contiene b&aacute;sicamente la secuencia 
  de comandos necesarios para llamar a otro ordenador, dado el n&uacute;mero de 
  tel&eacute;fono. Una vez mas, esto se especifica como una macro de di&aacute;logo. 
  Por ejemplo, la entrada para el anterior NakWell puede parecerse a esta:</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/uucp/dial - informaci&oacute;n por marcador.<BR>
      # NakWell modems<BR>
      dialer nakwell<BR>
      chat "" ATZ OK ATDT\T CONNECT</P>
  </DIR>
</DIR>
<P>La l&iacute;nea que empieza con chat especifica el di&aacute;logo del m&oacute;dem, 
  que no es sino la secuencia de comandos enviados y recibidos del m&oacute;dem 
  para inicializarlo, y para hacerle marcar el n&uacute;mero deseado. La secuencia 
  "\T " ser&aacute; reemplazada con el n&uacute;mero de tel&eacute;fono por el 
  programa uucico.</P>
<P>&nbsp;</P>
</FONT>
<P ALIGN="CENTER"><IMG SRC="fig12.1.gif" WIDTH=382 HEIGHT=348></P>
<FONT FACE="Verdana" SIZE=2> 
<P>Figura 12.1: Interacciones de los Ficheros de Configuraci&oacute;n de Taylor 
  UUCP.</P>
<P>&nbsp;</P>
<P>Para darle una idea a grandes rasgos de como uucico utiliza estos ficheros 
  de configuraci&oacute;n, suponga que utiliza el comando </P>
<DIR> 
  <DIR> 
    <P>$ uucico -s pablo</P>
  </DIR>
</DIR>
<P>en la l&iacute;nea de comandos. Lo primero que uucico hace es buscar pablo 
  en el fichero sys. A partir de la entrada en el fichero sys para pablo, el programa 
  ve que deber&iacute;a usar el puerto serial1 para establecer la conexi&oacute;n. 
  El fichero port le dice que ese puerto es un puerto de m&oacute;dem, y que tiene 
  un m&oacute;dem NakWell conectado.</P>
<P>uucico busca ahora en dial la entrada que describe el m&oacute;dem NakWell, 
  y al encontrar una, abre el puerto serie /dev/cua1 y ejecuta el di&aacute;logo 
  de marcaci&oacute;n. Esto es, env&iacute;a "ATZ", espera a que el m&oacute;dem 
  responda con "OK", etc. Cuando se encuentre los caracteres "\T ", sustituye 
  el n&uacute;mero de tel&eacute;fono (123-456) obtenido del fichero sys.</P>
<P>Cuando el m&oacute;dem devuelve CONNECT, la conexi&oacute;n se ha establecido, 
  y el di&aacute;logo de marcaci&oacute;n se ha completado. uucico ahora vuelve 
  al fichero sys y ejecuta el di&aacute;logo de entrada. En nuestro ejemplo, esperar&iacute;a 
  la pregunta "login:", enviar&iacute;a su nombre de usuario (neruda), esperar&iacute;a 
  la pregunta "password:", y enviar&iacute;a la clave, "lorca".</P>
<P>Tras completar la autorizaci&oacute;n, se supone que el sistema remoto ejecuta 
  su propio uucico. Los dos entrar&aacute;n entonces en la fase de negociaci&oacute;n 
  de protocolos descrita en la secci&oacute;n anterior.</P>
<P>La relaci&oacute;n de dependencia de los ficheros de configuraci&oacute;n se 
  puede ver en la figura 12.1.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.3.2"></a>12.3.2 Lo que UUCP necesita saber</P>
</u></I> 
<P>Antes de empezar a escribir los ficheros de configuraci&oacute;n, debe conseguir 
  cierta informaci&oacute;n que UUCP necesita.</P>
<P>Primero tiene que saber en que dispositivo serie esta su m&oacute;dem. Normalmente, 
  los puertos (de DOS) COM1 hasta COM4 se corresponden con los ficheros de dispositivos 
  /dev/cua0 hasta /dev/cua3. La mayor&iacute;a de las distribuciones, como Slackware, 
  crean un enlace simb&oacute;lico /dev/modem al fichero de dispositivo donde 
  est&aacute; el m&oacute;dem, y configuran kermit, seyon, etc, para que usen 
  este fichero. En este caso, usted tambi&eacute;n deber&iacute;a usar /dev/modem 
  en la configuraci&oacute;n de UUCP.</P>
<P>La raz&oacute;n para esto es que todos los programas, para llamar por tel&eacute;fono, 
  usan unos ficheros cerrojo para indicar cuando un puerto serie esta en uso. 
  Los nombres de estos ficheros cerrojo son una concatenaci&oacute;n del texto 
  LCK.. y el nombre del fichero de dispositivo, por ejemplo, LCK..cua1. Si los 
  programas usasen nombres diferentes para un mismo dispositivo, no podr&iacute;an 
  reconocer los ficheros cerrojo de los otros programas. En consecuencia, perturbar&iacute;an 
  la sesi&oacute;n de conexi&oacute;n de cada uno si se ejecutan a la vez. Esto 
  no es raro que ocurra cuando organiza sus llamadas de UUCP usando una entrada 
  en el fichero crontab.</P>
<P>Para obtener mas detalles sobre como configurar sus puertos serie, lea el cap&iacute;tulo 
  4.</P>
<P>A continuaci&oacute;n tiene que averiguar a que velocidad se comunicaran su 
  m&oacute;dem y Linux. Tendr&aacute; que ajustar este valor a la velocidad de 
  transferencia efectiva m&aacute;xima que espere obtener. La velocidad efectiva 
  puede ser mucho mayor que la velocidad f&iacute;sica de transferencia de su 
  m&oacute;dem. Por ejemplo, muchos m&oacute;dems env&iacute;an y reciben datos 
  a 2400bps (bits por segundo). Usando protocolos de compresi&oacute;n como V.42bis, 
  la velocidad real de transferencia puede alcanzar los 9600bps.</P>
<P>Por supuesto, si quiere que UUCP sirva de algo, necesitara el n&uacute;mero 
  de tel&eacute;fono al que llamar. Tambi&eacute;n necesitara un nombre de usuario 
  valido y probablemente una clave en el sistema remoto.7</P>
<P>_____________________________________________<BR>
  7 Si solo quiere probar UUCP, obtenga el n&uacute;mero de un sistema cercano 
  a usted. Apunte el nombre de usuario y la clave - son p&uacute;blicos para permitir 
  posibles transferencias an&oacute;nimas. En la mayor&iacute;a de los casos, 
  son algo como uucp/uucp o nuucp/uucp.</P>
<P>&nbsp;</P>
<P>Tambi&eacute;n necesitara saber exactamente como entrar en el sistema. Por 
  ejemplo, ¿tiene que pulsar la tecla BREAK antes de que aparezca la pregunta 
  de nombre de usuario?. ¿Muestra el sistema remoto un login: o user:?. Esto es 
  necesario para escribir la macro de di&aacute;logo, que es un script que le 
  dice a uucico como entrar. Si no lo sabe, o si la macro de di&aacute;logo normal 
  no funciona, intente llamar al sistema con un programa como kermit o minicom, 
  y apunte exactamente lo que tiene que hacer.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.3.3"></a>12.3.3 Nomenclatura de nodos</P>
</u></I> 
<P>Al igual que en redes basadas en TCP/IP, todas las maquinas necesitan tener 
  un nombre para la red de UUCP. Mientras solo quiera usar UUCP para transferencia 
  de ficheros desde y a ordenadores que usted llama directamente, o en una red 
  local, el nombre no tiene que ajustarse a ninguna regla.8</P>
<P>Sin embargo, si usa UUCP para tener una conexi&oacute;n a correo y noticias, 
  se deber&iacute;a pensar en registrar el nombre con el proyecto de Mapa de UUCP, 
  que se describe en el cap&iacute;tulo 13.</P>
<P>Incluso si usted participa en un dominio, podr&iacute;a considerar el tener 
  un nombre oficial de UUCP para su ordenador.</P>
<P>Frecuentemente la gente elige su nombre de UUCP para que corresponda con el 
  primer componente de su nombre de dominio completamente cualificado. Suponga 
  que la direcci&oacute;n de su dominio es swim.twobirds.com, entonces su nombre 
  de UUCP podr&iacute;a ser swim.</P>
<P>Piense en los nodos de UUCP como si se conociesen entre ellos por el nombre 
  propio. Por supuesto, tambi&eacute;n puede usar un nombre de UUCP completamente 
  desvinculado de su nombre de dominio, y por consiguiente, un nombre no cualificado.</P>
<P>Sin embargo, aseg&uacute;rese de no usar el nombre no cualificado en direcciones 
  de correo a no ser que lo haya registrado como su nombre de UUCP oficial.9 Lo 
  mejor que puede pasar es que el correo dirigido a un nombre de UUCP no registrado 
  se pierda en alg&uacute;n agujero negro digital. Si utiliza un nombre que alguien 
  ya esta usando, este correo ser&aacute; dirigido a ese sitio, y le causara al 
  administrador del correo un sinf&iacute;n de dolores de cabeza.</P>
<P>Los programas de UUCP usan el nombre devuelto por hostname como el nombre de 
  UUCP por defecto. Este nombre se encuentra normalmente en la macro /etc/rc.local. 
  Si su nombre de UUCP es diferente del que le dio a su ordenador, tiene que usar 
  la opci&oacute;n hostname en el fichero config para indicar a uucico su nombre 
  de UUCP. Esto se describe a continuaci&oacute;n.</P>
<P>_____________________________________________<BR>
  8 La &uacute;nica limitaci&oacute;n es que no puede ser mas largo que 7 caracteres, 
  para no confundir a algunos nodos con sistemas de ficheros que imponen un estrecho 
  limite en los nombres de ficheros.<BR>
  9 El Proyecto de Mapa de UUCP registra todos los nodos de UUCP de todo el mundo 
  y comprueba que sean &uacute;nicos. Para registrar su nombre de UUCP, preg&uacute;ntele 
  a los responsables del nodo que gestiona su correo; ellos podr&aacute;n ayudarle.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.3.4"></a>12.3.4 Ficheros de configuraci&oacute;n Taylor</P>
</u></I> 
<P>Volvemos ahora a los ficheros de configuraci&oacute;n. Taylor UUCP obtiene 
  su informaci&oacute;n de los siguientes ficheros:</P>
<P><b>config</b><BR>
  Este es el fichero principal de configuraci&oacute;n. Aqu&iacute; puede definir 
  el nombre de UUCP de su ordenador.</P>
<P><b>sys</b><BR>
  Este fichero describe todos los nodos conocidos por el sistema. Por cada nodo, 
  especifica su nombre, a que horas llamarlo, que n&uacute;mero marcar, que tipo 
  de dispositivo usar, y como entrar.</P>
<P><b>port</b><BR>
  Contiene entradas que describen cada puerto disponible, junto con la velocidad 
  de l&iacute;nea soportada y las instrucciones de marcaci&oacute;n.</P>
<P><b>dial</b><BR>
  Describe las instrucciones de marcaci&oacute;n usados para establecer una conexi&oacute;n 
  telef&oacute;nica.</P>
<P><b>dialcode</b><BR>
  Contiene expansiones simb&oacute;licas para c&oacute;digos de marcaci&oacute;n.</P>
<P><b>call</b><BR>
  Contiene el nombre de usuario y la clave a usar cuando llame a un sistema. No 
  se suele usar.</P>
<P><b>passwd</b> <br>
  Contiene nombres de usuario y claves que los sistemas pueden usar cuando entren 
  en su ordenador. Este fichero se usa solo cuando uucico hace su propia comprobaci&oacute;n 
  de claves.</P>
<P>Los ficheros de configuraci&oacute;n de Taylor se componen generalmente de 
  l&iacute;neas que contienen pares palabra - valor. Una almohadilla (#) indica 
  un comentario que ocupa toda una l&iacute;nea. Para usar una almohadilla por 
  si misma, puede poner una barra invertida delante de la almohadilla.</P>
<P>Hay unas cuantas opciones que puede ajustar con estos ficheros de configuraci&oacute;n. 
  No podemos repasar todos los par&aacute;metros, sino que cubriremos solo los 
  mas importantes. Con estos usted podr&aacute; configurar una conexi&oacute;n 
  de UUCP por m&oacute;dem. Otras secciones describir&aacute;n las modificaciones 
  necesarias si quiere usar UUCP en TCP/IP o sobre una l&iacute;nea serie.</P>
<P>Junto con el c&oacute;digo fuente de Taylor UUCP se incluye una referencia 
  de comandos completa en los documentos Texinfo.</P>
<P>Cuando crea que ha configurado su sistema de UUCP completamente, puede comprobarlo 
  usando la utilidad uuchk (que se encuentra en /usr/lib/uucp). uuchk lee sus 
  ficheros de configuraci&oacute;n, e imprime un informe detallado de los valores 
  de configuraci&oacute;n usados para cada sistema.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.3.5"></a>12.3.5 Opciones Generales de Configuraci&oacute;n - el 
  Fichero config</P>
</u></I> 
<P>Normalmente no usara este fichero para otra cosa que describir su nombre de 
  nodo UUCP. Por defecto, UUCP usara el nombre establecido con el comando hostname, 
  pero generalmente es una buena idea configurar el nombre de UUCP expl&iacute;citamente. 
  A continuaci&oacute;n mostramos un fichero de ejemplo:</P>
<DIR> 
  <DIR> 
    <P># /usr/lib/uucp/config - fichero principal de configuraci&oacute;n de UUCP<BR>
      hostname vstout</P>
  </DIR>
</DIR>
<P>Por supuesto, tambi&eacute;n existen otros par&aacute;metros configurables 
  aqu&iacute;, como los referentes al nombre del directorio de colas, o los derechos 
  de acceso para el UUCP an&oacute;nimo. Esto ultimo se describir&aacute; en una 
  secci&oacute;n posterior.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.3.6"></a>12.3.6 Como informar a UUCP sobre otros sistemas - el 
  fichero sys</P>
</u></I> 
<P>El fichero sys describe los sistemas que su ordenador conoce. Una entrada comienza 
  con la palabra system; las l&iacute;neas siguientes hasta la siguiente system 
  proporcionan detalles sobre los par&aacute;metros espec&iacute;ficos sobre ese 
  sistema o nodo. Com&uacute;nmente, una entrada de un sistema definir&aacute; 
  par&aacute;metros tales como el n&uacute;mero de tel&eacute;fono y el di&aacute;logo 
  de entrada.</P>
<P>Los par&aacute;metros antes de la primera l&iacute;nea con system determinan 
  los valores por defecto usados para todos los sistemas. Lo normal es que los 
  par&aacute;metros de protocolos y similares se incluyan en la secci&oacute;n 
  por defecto.</P>
<P>A continuaci&oacute;n se tratan los campos m&aacute;s importantes con cierto 
  detalle.</P>
</FONT><B><I></i></B> 
<P><FONT FACE="Verdana" SIZE=2 COLOR="#800080"><I><B>Nombre del sistema<BR>
</b></i></font><FONT FACE="Verdana" SIZE=2>El comando system especifica el nombre del sistema remoto. Tiene que especificar el nombre correcto del sistema remoto, no un alias que usted se invente, porque uucico lo verificara con la informaci&oacute;n que reciba del otro sistema una vez se conecte.10</font></P><FONT FACE="Verdana" SIZE=2>
<P>Cada nombre de sistema puede aparecer una sola vez. Si quiere usar varias configuraciones para un mismo sistema (por ejemplo, n&uacute;meros de tel&eacute;fono diferentes que uucico puede usar alternativamente), puede especificar alternavias, que se describen mas adelante.</P>
<P>_____________________________________________<BR>
10 Algunas de las versiones 2 de UUCP antiguas no env&iacute;an su nombre cuando son llamadas; sin embargo, las implementaciones mas recientes si lo hacen, y Taylor UUCP tambi&eacute;n.</P>
<P>&nbsp;</P>
</FONT><B><I></i></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#800080"><I><B>N&uacute;mero de tel&eacute;fono<BR>
</b></i></font><FONT FACE="Verdana" SIZE=2>Si para conectar con el sistema remoto hace falta una l&iacute;nea de tel&eacute;fono, el campo phone especifica el n&uacute;mero que tiene que marcar el m&oacute;dem. Puede incluir varios separadores que son interpretados por el proceso de marcaci&oacute;n efectuado por uucico. Un signo igual (=) significa esperar un tono secundario, y un gui&oacute;n genera una pausa de un segundo. Por ejemplo, algunas instalaciones de tel&eacute;fono se atascan si no deja una pausa entre un prefijo de una compa&ntilde;&iacute;a y el n&uacute;mero de tel&eacute;fono.</font></P><FONT FACE="Verdana" SIZE=2>
<P>Cualquier lista de caracteres se puede usar para esconder informaci&oacute;n que depende de cada nodo, como el prefijo de provincia. Estos caracteres se traducen en un c&oacute;digo de marcaci&oacute;n usando el fichero dialcode. Suponga que tiene el siguiente fichero dialcode:</P><DIR>
<DIR>

<P># /usr/lib/uucp/dialcode - traducci&oacute;n de c&oacute;digos de marcaci&oacute;n<BR>
Bogoham 024881<BR>
Coxton 035119</P></DIR>
</DIR>

<P>Con estas traducciones, se puede usar un n&uacute;mero de tel&eacute;fono como Bogoham7732 en el fichero sys, lo cual hace las cosas un poco mas legibles.</P>
<P>&nbsp;</P>
</FONT><B><I></i></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#800080"><I><B>Puerto y Velocidad<BR>
</b></i></font><FONT FACE="Verdana" SIZE=2>Las opciones port y speed se usan para elegir el dispositivo usado para llamar al sistema remoto, y la velocidad m&aacute;xima del dispositivo.11 Una entrada system puede usar cualquiera de las dos opciones solas, o ambas. Cuando se busca un dispositivo apropiado en el fichero port, solo se eligen aquellos puertos cuyo nombre y/o velocidad coinciden.</font></P><FONT FACE="Verdana" SIZE=2>
<P>Normalmente es suficiente con usar la opci&oacute;n speed. Si solo tiene un dispositivo serie definido en port, uucico, de cualquier modo, siempre escoger&aacute; el correcto, as&iacute; que solo tiene que especificar la velocidad deseada. Si tiene varios m&oacute;dems conectados a su sistema, tampoco es una buena idea nombrar un puerto en particular, porque si uucico encuentra que hay varios puertos con el mismo nombre, trata de usarlos todos hasta que encuentra uno que no esta en uso.</P>
<P>&nbsp;</P>
</FONT><B><I></i></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#800080"><I><B>El di&aacute;logo de entrada<BR>
</b></i></font><FONT FACE="Verdana" SIZE=2>Antes ya nos encontramos con la macro del di&aacute;logo de entrada, que le dice a uucico como entrar en el sistema remoto. Consiste de una lista de palabras clave, que especifican el texto que se espera y el que se env&iacute;a por el proceso local de uucico. El objetivo es hacer que uucico espere hasta que la maquina remota env&iacute;e una l&iacute;nea pidiendo el nombre de usuario, y entonces enviar el nombre de usuario, luego esperar a que pida la palabra clave, y enviar dicha clave. Los textos de espera y de env&iacute;o se dan alternativamente. Uucico autom&aacute;ticamente a&ntilde;ade un avance de l&iacute;nea (\r) a cualquier texto enviado. Por lo tanto, una macro de di&aacute;logo sencilla seria parecida a esta:</font></P><FONT FACE="Verdana" SIZE=2><DIR>
<DIR>

<P>ogin: vstout ssword: catch22</P></DIR>
</DIR>

<P>_____________________________________________<BR>
11 La velocidad en baudios del terminal (tty) tiene que ser por lo menos igual o mayor que la velocidad m&aacute;xima de transmisi&oacute;n.</P>
<P>&nbsp;</P>
<P>D&eacute;se cuenta de que los campos de texto de espera (ogin: y ssword:) no contienen el texto completo. Esto es as&iacute; para asegurarse de que el proceso de entrada se lleve a cabo aunque el sistema remoto nos env&iacute;e Login: en vez de login:.</P>
<P>uucico tambi&eacute;n permite usar estructuras condicionales, por ejemplo en el caso de que el programa getty de la maquina remota necesite ser reinicializado antes de enviar una pregunta. Por esta raz&oacute;n, usted puede a&ntilde;adir un sub-di&aacute;logo a un texto de espera, separado con un gui&oacute;n. El sub-di&aacute;logo se ejecuta solo si el primer texto de espera falla, ej. si expira un temporizador (timeout). Una manera de usar esta caracter&iacute;stica es enviar un BREAK si el sistema remoto no env&iacute;a una pregunta de nombre de usuario. El siguiente ejemplo muestra un ejemplo de una macro de di&aacute;logo que deber&iacute;a funcionar tambi&eacute;n en el caso de que usted tenga que pulsar return antes de que aparezca la pregunta de entrada.</P><DIR>
<DIR>

<P>"" \n\r\d\r\n\c ogin:-BREAK-ogin: vstout ssword: catch22</P></DIR>
</DIR>

<P>Hay un par de tiras de caracteres especiales y caracteres de escape que pueden aparecer en la macro de di&aacute;logo. Esta es una lista incompleta de caracteres legales en la pregunta de espera:</P>
<P>"" La tira vac&iacute;a. Le dice a uucico que no espere nada, sino que siga con la siguiente tira de enviado inmediatamente.</P>
<P>\t Un car&aacute;cter de tabulador.</P>
<P>\r Un car&aacute;cter de retorno de l&iacute;nea.</P>
<P>\s El car&aacute;cter de espacio. Lo necesitamos para incluir espacios en un di&aacute;logo.</P>
<P>\n Car&aacute;cter de nueva l&iacute;nea.</P>
<P>\\ Car&aacute;cter de barra invertida.</P>
<P>En tiras de caracteres de env&iacute;o se pueden incluir, adem&aacute;s de los mencionados anteriormente, los siguientes caracteres:</P>
<P>EOT Car&aacute;cter de fin de la transmisi&oacute;n (^D).</P>
<P>BREAK Car&aacute;cter Break.</P>
<P>\c Suprime el env&iacute;o del car&aacute;cter nueva l&iacute;nea al final de cada tira de caracteres.</P>
<P>\d Retrasar el env&iacute;o 1 segundo.</P>
<P>\E Activar la comprobaci&oacute;n de eco. De esta forma, uucico esperar&aacute; a leer el eco de todo lo que escribe en el dispositivo antes de que contin&uacute;e con el di&aacute;logo. Se usa principalmente en di&aacute;logos de m&oacute;dems (que veremos mas adelante). La comprobaci&oacute;n de eco esta desactivada por defecto.</P>
<P>\e Desactivar la comprobaci&oacute;n de eco.</P>
<P>\K Lo mismo que BREAK.</P>
<P>\p Pausa de una fracci&oacute;n de un segundo.</P>
<P>&nbsp;</P>
</FONT><B><I></i></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#800080"><I><B>Alternativas<BR>
</b></i></font><FONT FACE="Verdana" SIZE=2>A veces es deseable tener m&uacute;ltiples entradas para un mismo sistema, por ejemplo si se puede acceder al sistema en diferentes l&iacute;neas de m&oacute;dem. Con Taylor UUCP se puede hacer esto definiendo una alternativa.</font></P><FONT FACE="Verdana" SIZE=2>
<P>Una entrada alternativa mantiene todas las caracter&iacute;sticas de la entrada principal, y especifica solamente aquellos valores que tienen que ser cambiados, o a&ntilde;adidos. Una alternativa esta separada de la entrada principal por una l&iacute;nea que contiene la palabra clave alternate.</P>
<P>Para usar dos n&uacute;meros de tel&eacute;fono para pablo, habr&iacute;a que modificar su entrada sys de la siguiente manera:</P><DIR>
<DIR>

<P>system pablo<BR>
phone 123-456<BR>
... lo mismo que antes ...<BR>
alternate<BR>
phone 123-455</P></DIR>
</DIR>

<P>Ahora, cuando llame a pablo, el programa uucico marcara primero el 123-456, y si no funciona, probara la alternativa. La entrada alternativa retiene toda la otra informaci&oacute;n de la entrada de sistema principal, y altera solo el n&uacute;mero de tel&eacute;fono.</P>
<P>&nbsp;</P>
</FONT><B><I><FONT FACE="Verdana" SIZE=2 COLOR="#800080"><P>Restringir horas de llamada</P>
</font></i></B><FONT FACE="Verdana" SIZE=2> 
<P>Taylor UUCP proporciona varios m&eacute;todos para restringir las horas a las 
  que se pueden efectuar llamadas a un sistema remoto. Una raz&oacute;n para hacer 
  esto seria por las limitaciones que el sistema remoto impone en sus servicios 
  durante horas de oficina, o simplemente para evitar las horas mas caras. Siempre 
  se pueden desactivar las restricciones con la opci&oacute;n -S o -f en el programa 
  uucico.</P>
<P>Por defecto, Taylor UUCP no permite conexiones a ninguna hora, as&iacute; que 
  usted tiene que especificar alg&uacute;n horario en el fichero sys. Si no le 
  importan las restricciones, puede especificar la opci&oacute;n time con un valor 
  de Any en su fichero sys.</P>
<P>La manera mas sencilla de restringir horas de llamada es con la entrada time, 
  seguida de una tira de caracteres que consta de dos campos, d&iacute;a y hora. 
  El d&iacute;a puede ser cualquiera de los siguientes: Mo, Tu, We, Th, Fr, Sa, 
  Su (que corresponden a Lunes, Martes, Mi&eacute;rcoles, Jueves, Viernes, S&aacute;bado 
  y Domingo, respectivamente) combinados, Any (cualquiera), Never (nunca), o Wk 
  para los d&iacute;as laborables. La hora consiste en dos n&uacute;meros de un 
  reloj de 24 horas, separados por un gui&oacute;n. Especifican el grupo de horas 
  durante las que se pueden efectuar llamadas. La combinaci&oacute;n de los s&iacute;mbolos 
  se escribe sin ning&uacute;n espacio en blanco entre ellos. Se pueden especificar 
  varios grupos de dia-hora separados por comas. Por ejemplo,</P>
<DIR> 
  <DIR> 
    <P>time MoWe0300-0730,Fr1805-2000</P>
  </DIR>
</DIR>
<P>permite llamadas en Lunes y Mi&eacute;rcoles, de 3 de la ma&ntilde;ana a 7:30, 
  y los Viernes entre las 6:05 y las 8:00 de la tarde. Cuando un campo de hora 
  incluye la medianoche, como Mo1830-0600, en realidad quiere decir el Lunes, 
  entre medianoche y las 6 de la ma&ntilde;ana, y entre las 6:30 de la tarde y 
  medianoche.</P>
<P>Las palabras especiales Any y Never significan que se pueden hacer llamadas 
  siempre o nunca, respectivamente.</P>
<P>El comando time tiene un segundo argumento opcional que describe el tiempo 
  a esperar para reintentar en minutos. Cuando un intento de conexi&oacute;n falla, 
  uucico no permitir&aacute; otro intento de llamar al ordenador remoto hasta 
  que transcurra un cierto tiempo. Por defecto, uucico usa un algoritmo de espera 
  exponencial, seg&uacute;n el cual el intervalo de espera se incrementa con cada 
  intento fallido. Por ejemplo, si especifica un tiempo de reintento de 5 minutos, 
  uucico no aceptara llamar otra vez en los 5 minutos despu&eacute;s del &uacute;ltimo 
  intento fallido.</P>
<P>El comando timegrade le permite a&ntilde;adir un rango m&aacute;ximo de cola 
  a un calendario. Por ejemplo, asumiendo que usted tiene los siguientes comandos 
  timegrade en una entrada system:</P>
<DIR> 
  <DIR> 
    <P>timegrade N Wk1900-0700,SaSu<BR>
      timegrade C Any</P>
  </DIR>
</DIR>
<P>Esto permite que los trabajos con rango de cola de C o mayor (normalmente el 
  correo se pone en la cola con rango B o C) sean transferidos siempre que se 
  establece una comunicaci&oacute;n, mientras que las noticias (news) (normalmente 
  con rango N) ser&aacute;n transferidas solo durante la noche y los fines de 
  semana.</P>
<P>Al igual que time, el comando timegrade acepta un intervalo de reintento en 
  minutos como un tercer argumento opcional.</P>
<P>Sin embargo, hay que hacer una observaci&oacute;n: la opci&oacute;n timegrade 
  solo se aplica a lo que su sistema env&iacute;a; el sistema remoto puede transferir 
  todo lo que le plazca. Usted puede usar la opci&oacute;n call-timegrade para 
  forzar expl&iacute;citamente que env&iacute;e solamente trabajos sobre cierto 
  rango de cola; pero no hay ninguna garant&iacute;a de que obedecer&aacute; esta 
  peticion.12</P>
<P>Igualmente, el campo timegrade no se comprueba cuando un sistema remoto hace 
  una llamada a &eacute;ste, de manera que cualquier trabajo puesto en la cola 
  para el sistema que llama al nuestro ser&aacute; enviado. Sin embargo, el sistema 
  remoto puede pedir expl&iacute;citamente a nuestro uucico que se mantenga a 
  si mismo en un cierto rango de cola.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.3.7"></a>12.3.7 Que dispositivos hay - el fichero port</P>
</u></I> 
<P>El fichero port indica a uucico que puertos tiene disponibles. Pueden ser puertos 
  de m&oacute;dem, pero cualquier otro tipo, como l&iacute;neas serie directas 
  o sockets de TCP tambi&eacute;n se pueden usar.</P>
<P>Al igual que el fichero sys, el fichero port consta de entradas separadas que 
  empiezan con la palabra port, seguida del nombre del puerto. Este nombre puede 
  ser usado por la palabra port en el fichero sys. El nombre no tiene por que 
  ser &uacute;nico; si hay varios puertos con el mismo nombre, uucico intentara 
  cada uno de los puertos hasta que encuentre uno que no esta siendo utilizado.</P>
<P>El comando port tiene que estar seguido por el comando type que especifica 
  que tipo de puerto se esta describiendo. Tipos validos son m&oacute;dem, direct 
  para comunicaciones directas, y tcp para sockets de TCP. Por defecto, cuando 
  el comando port no se incluye en el fichero, el tipo de puerto asumido ser&aacute; 
  m&oacute;dem.</P>
<P>En esta secci&oacute;n solo hablaremos de puertos de m&oacute;dem; los puertos 
  de TCP y las l&iacute;neas directas ser&aacute;n tratados en una secci&oacute;n 
  posterior.</P>
<P>_____________________________________________<BR>
  12 Si el sistema remoto esta ejecutando Taylor UUCP, obedecer&aacute;.</P>
<P>&nbsp;</P>
<P>Para puertos directos y de m&oacute;dem, tiene que especificar el dispositivo 
  para llamar usando la directiva device. Usualmente es el nombre de un fichero 
  de dispositivo en el directorio /dev, como por ejemplo /dev/cua1.13</P>
<P>En el caso de un dispositivo de m&oacute;dem, la directiva port tambi&eacute;n 
  determina que tipo de m&oacute;dem esta conectado al puerto. Cada tipo de m&oacute;dem 
  tiene que configurarse de manera diferente. Incluso los m&oacute;dems que dicen 
  ser compatibles con Hayes no tienen por que ser realmente compatibles entre 
  si mismos. Por lo tanto, tiene que decirle a uucico como inicializar el m&oacute;dem 
  y como hacer que marque el n&uacute;mero deseado. Taylor UUCP mantiene las descripciones 
  de todos los marcadores en un fichero llamado dial. Para usar cualquiera de 
  &eacute;stos, tiene que especificar el nombre del marcador usando el comando 
  dialer.</P>
<P>Es posible que usted quiera usar el m&oacute;dem de maneras diferentes, dependiendo 
  del sistema al que esta llamando. Por ejemplo, algunos m&oacute;dems antiguos 
  no entienden cuando un m&oacute;dem r&aacute;pido trata de conectar a 14400bps; 
  simplemente desconectan la l&iacute;nea en vez de negociar la conexi&oacute;n 
  a 9600bps por ejemplo. Si sabe que el ordenador plasta usa un m&oacute;dem tan 
  tonto, usted tiene que configurar su m&oacute;dem de manera diferente cuando 
  llame a ese ordenador. Para hacer esto, necesita una entrada adicional del comando 
  port en el fichero port que especifica un marcador diferente. Ahora puede dar 
  un nombre diferente al nuevo puerto, como por ejemplo serial1-lento, y usar 
  la directiva port en la entrada del sistema plasta en el fichero sys.</P>
<P>Otra manera de distinguir los puertos es por la velocidad que usan. Por ejemplo, 
  las dos entradas port de la situaci&oacute;n anterior pueden ser as&iacute;:</P>
<DIR> 
  <DIR> 
    <P># NakWell modem; conexi&oacute;n a velocidad alta.<BR>
      port serial1 # nombre del puerto<BR>
      type modem # puerto modem<BR>
      device /dev/cua1 # esto es COM2<BR>
      speed 38400 # velocidad soportada<BR>
      dialer nakwell # marcador normal<BR>
      <BR>
      # NakWell modem; conexi&oacute;n lenta<BR>
      port serial1 # nombre del puerto<BR>
      type modem # puerto modem<BR>
      device /dev/cua1 # esto es COM2<BR>
      speed 9600 # velocidad soportada<BR>
      dialer nakwell-slow # no intentar alta velocidad</P>
  </DIR>
</DIR>
<P>La entrada de sistema para el ordenador plasta usar&iacute;a ahora serial1 
  como el nombre del puerto, pero pedir&iacute;a usar la velocidad de 9600bps 
  solamente. uucico usara autom&aacute;ticamente la segunda entrada de port. Todos 
  los otros ordenadores con velocidad de 38400bps en la entrada de sistema ser&aacute;n 
  llamados usando la primera entrada de port.</P>
<P>_____________________________________________<BR>
  13 Hay quien usa los dispositivos ttyS*, que son solamente para aceptar llamadas.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.3.8"></a>12.3.8 Como marcar un n&uacute;mero - el fichero dial</P>
</u></I> 
<P>El fichero dial describe como se usan los distintos marcadores. Tradicionalmente, 
  UUCP habla de "marcadores" en vez de m&oacute;dems, porque en los viejos tiempos 
  era normal que un dispositivo de marcaci&oacute;n autom&aacute;tico (que era 
  caro) sirviese un banco entero de m&oacute;dems.</P>
<P>Hoy, la mayor&iacute;a de los m&oacute;dems tienen soporte para marcar incluido, 
  as&iacute; que la distinci&oacute;n tiende a desaparecer. De cualquier modo, 
  cada marcador o m&oacute;dem puede necesitar una configuraci&oacute;n diferente.</P>
<P>Se puede describir cada uno de ellos en el fichero dial. Las entradas en dial 
  empiezan con el comando dialer que indica el nombre del marcador.</P>
<P>La entrada mas importante, aparte de &eacute;sta, es el di&aacute;logo del 
  m&oacute;dem, especificado por el comando chat. Similar al di&aacute;logo de 
  entrada (login), consta de una secuencia de caracteres que uucico env&iacute;a 
  al marcador y de la secuencia que espera recibir como respuesta. Se usa normalmente 
  para reiniciar el m&oacute;dem a un estado conocido, y marcar el n&uacute;mero. 
  El siguiente ejemplo de una entrada de un marcador muestra un di&aacute;logo 
  t&iacute;pico para un m&oacute;dem compatible con Hayes:</P>
<DIR> 
  <DIR> 
    <P># NakWell modem; conexi&oacute;n a alta velocidad<BR>
      dialer nakwell # nombre del marcador<BR>
      chat "" ATZ OK\r ATH1E0Q0 OK\r ATDT\T CONNECT<BR>
      chat-fail BUSY<BR>
      chat-fail ERROR<BR>
      chat-fail NO\sCARRIER<BR>
      dtr-toggle true</P>
  </DIR>
</DIR>
<P>El di&aacute;logo del m&oacute;dem comienza con "", es decir, que espera una 
  cadena vac&iacute;a. uucico entonces env&iacute;a el primer comando (ATZ) de 
  inmediato. ATZ es el comando de Hayes para reiniciar el m&oacute;dem. Entonces 
  espera hasta que el m&oacute;dem env&iacute;e OK, y a continuaci&oacute;n env&iacute;a 
  el siguiente comando que desactiva el eco local, y cosas parecidas. Despu&eacute;s 
  de que el m&oacute;dem env&iacute;e OK otra vez, uucico env&iacute;a el comando 
  de marcaci&oacute;n (ATDT). La secuencia de escape \T en esta cadena es reemplazada 
  con el n&uacute;mero de tel&eacute;fono obtenido de la entrada de sistema en 
  el fichero sys. uucico espera a que el m&oacute;dem devuelva la cadena CONNECT, 
  que indica que se ha establecido una conexi&oacute;n exitosa con el m&oacute;dem 
  remoto.</P>
<P>A menudo el m&oacute;dem no puede conectarse con el sistema remoto, por ejemplo 
  si el otro sistema esta conectado con otro ordenador y la l&iacute;nea esta 
  ocupada. En este caso, el m&oacute;dem devuelve alg&uacute;n mensaje de error 
  indicando la raz&oacute;n. Los di&aacute;logos de m&oacute;dem no pueden detectar 
  estos mensajes; uucico seguir&aacute; esperando la cadena esperada hasta que 
  un temporizador se agote. El fichero de recopilaci&oacute;n de informaci&oacute;n 
  (log) de UUCP mostrar&aacute; solamente el mensaje "timed out in chat script" 
  (tiempo agotado en la macro de di&aacute;logo) en vez de la raz&oacute;n real.</P>
<P>Sin embargo, Taylor UUCP le permite informar a uucico sobre estos mensajes 
  de error usando el comando chat-fail como se ve en el ejemplo. Cuando uucico 
  detecta una cadena de caracteres de error en el di&aacute;logo mientras lo ejecuta, 
  interrumpe la llamada y anota el error en el fichero log de UUCP.</P>
<P>El &uacute;ltimo comando en el ejemplo anterior indica a UUCP que cambie la 
  l&iacute;nea DTR antes de empezar el di&aacute;logo de m&oacute;dem. La mayor&iacute;a 
  de los m&oacute;dems se pueden configurar para conectarse cuando detectan un 
  cambio en la l&iacute;nea DTR, y entrar en modo de comando.14</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.3.9"></a>12.3.9 UUCP sobre TCP</P>
</u></I> 
<P>Por muy absurdo que suene en principio, el uso de UUCP para transferir datos 
  sobre TCP no es una idea tan mala, especialmente cuando se transfieren grandes 
  cantidades de datos como los grupos de noticias Usenet. En conexiones basadas 
  en TCP, los grupos de noticias se transmiten generalmente usando el protocolo 
  NNTP, seg&uacute;n el cual los art&iacute;culos se piden y se transmiten individualmente, 
  sin compresi&oacute;n ni ninguna otra optimizaci&oacute;n. Aunque es una t&eacute;cnica 
  adecuada para ordenadores grandes con varias fuentes de grupos de noticias simultaneas, 
  esta t&eacute;cnica no es favorable para peque&ntilde;os sistemas que reciben 
  los grupos a trav&eacute;s de una conexi&oacute;n lenta, como RDSI. Estos ordenadores 
  normalmente desean combinar las cualidades de TCP con las ventajas de enviar 
  art&iacute;culos en grandes lotes, que se pueden comprimir y por lo tanto transferir 
  con muy poco gasto. Un m&eacute;todo est&aacute;ndar de enviar estos lotes es 
  usando UUCP sobre TCP.</P>
<P>En el fichero sys, hay que especificar al sistema a llamar con TCP de la siguiente 
  forma:</P>
<DIR> 
  <DIR> 
    <P>system gmu<BR>
      address news.groucho.edu<BR>
      time Any<BR>
      port tcp-conn<BR>
      chat ogin: vstout word: clouseau</P>
  </DIR>
</DIR>
<P>El comando address da la direcci&oacute;n de internet (IP) del ordenador, o 
  su nombre de dominio completo (FQDN). La entrada correspondiente en el fichero 
  port seria as&iacute;:</P>
<DIR> 
  <DIR> 
    <P>port tcp-conn<BR>
      type tcp<BR>
      service 540</P>
  </DIR>
</DIR>
<P>_____________________________________________<BR>
  14 Tambi&eacute;n se pueden configurar algunos m&oacute;dems para que se reinicien 
  a si mismos cuando detecten una transici&oacute;n en DTR. Sin embargo, a algunos 
  m&oacute;dems no parece gustarles esto y en ocasiones se bloquean.</P>
<P>&nbsp;</P>
<P>Esta entrada indica que hay que usar una conexi&oacute;n de TCP cuando una 
  entrada en el fichero sys hace referencia a tcp-conn, y que el programa uucico 
  deber&aacute; tratar de conectarse al puerto TCP 540 en el sistema remoto. Este 
  es el puerto por defecto del servicio UUCP. En vez del n&uacute;mero de puerto, 
  tambi&eacute;n se puede especificar un nombre de puerto simb&oacute;lico. El 
  n&uacute;mero de puerto correspondiente ser&aacute; buscado en el fichero /etc/services.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.3.10"></a>12.3.10 Uso de una conexi&oacute;n directa</P>
</u></I> 
<P>Supongamos que usted usa una l&iacute;nea directa que conecta su sistema vstout 
  con el ordenador tiny. Al igual que en el caso del m&oacute;dem, tiene que escribir 
  una entrada de sistema en el fichero sys. El comando port identifica el puerto 
  serie en el que tiny esta conectado.</P>
<DIR> 
  <DIR> 
    <P>system tiny<BR>
      time Any<BR>
      port direct1<BR>
      speed 38400<BR>
      chat ogin: cathcart word: catch22</P>
  </DIR>
</DIR>
<P>En el fichero port, tiene que describir el puerto serie para la conexi&oacute;n 
  directa. La entrada dialer no hace falta porque no hay que marcar ning&uacute;n 
  n&uacute;mero.</P>
<DIR> 
  <DIR> 
    <P>port direct1<BR>
      type direct<BR>
      speed 38400</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="12.4"></a>12.4 Los sies y noes de UUCP - Ajuste de Permisos</P>
</font></u></B><U><I><FONT FACE="Verdana" SIZE=2> 
<P><a name="12.4.1"></a>12.4.1 Ejecuci&oacute;n de comandos</P>
</font></I></U><FONT FACE="Verdana" SIZE=2> 
<P>La tarea de UUCP es copiar ficheros de un sistema a otro, y pedir la ejecuci&oacute;n 
  de ciertos comandos en sistemas remotos. Por supuesto, usted como administrador 
  querr&aacute; control sobre los derechos que concede a otros sistemas - permitirles 
  que ejecuten cualquier comando en su sistema no es una buena idea en absoluto.</P>
<P>Los &uacute;nicos comandos que Taylor UUCP permite a otros sistemas ejecutar 
  en su ordenador son rmail y rnews, que se usan com&uacute;nmente para intercambiar 
  correo y noticias de Usenet sobre UUCP. El directorio en el que uuxqt busca 
  es una opci&oacute;n que se elige al compilar el programa, pero normalmente 
  incluye /bin, /usr/bin, y /usr/local/bin. Para cambiar el conjunto de comandos 
  para un sistema en particular, se puede usar la palabra commands en el fichero 
  sys. Igualmente, el directorio de b&uacute;squeda se puede cambiar con el comando 
  command-path. Por ejemplo, usted puede querer dar acceso al sistema pablo para 
  que ejecute el comando rsmtp adem&aacute;s de mail y rnews:15</P>
<DIR> 
  <DIR> 
    <P>system pablo<BR>
      ...<BR>
      commands rmail rnews rsmtp</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="12.4.2"></a>12.4.2 Transferencias de Ficheros</P>
</u></I> 
<P>Taylor UUCP tambi&eacute;n le permite ajustar, en gran medida, las transferencias 
  de ficheros. Por un lado, usted puede desactivar las transferencias hacia y 
  desde un sistema determinado.</P>
<P>Simplemente necesita dar el valor no al comando request, y el sistema remoto 
  no ser&aacute; capaz de obtener ficheros de su sistema ni de poner otros ficheros. 
  De igual modo, puede prohibir que sus usuarios transfieran ficheros desde o 
  hacia otro sistema poniendo la palabra no en el campo transfer. Por defecto, 
  los usuarios del sistema local y el remoto pueden enviar y obtener ficheros.</P>
<P>Adem&aacute;s, usted puede configurar los directorios de y a los que quiere 
  que se puedan copiar ficheros. Usualmente se prohibe el acceso de sistemas remotos 
  a una sola estructura de directorios, pero aun as&iacute; se permite a los usuarios 
  locales que env&iacute;en ficheros de sus directorios. Com&uacute;nmente, a 
  los usuarios remotos se les permite que reciban ficheros solo del directorio 
  publico de UUCP, /var/spool/uucppublic. Este es el lugar tradicional para poner 
  los ficheros disponibles p&uacute;blicamente; muy parecido a un servidor de 
  FTP en Internet.</P>
<P>Normalmente se refiere a este directorio con el car&aacute;cter tilde.</P>
<P>Por lo tanto, Taylor UUCP provee cuatro comandos diferentes para configurar 
  los directorios para enviar y recibir ficheros. Estos son local-send, que especifica 
  la lista de directorios desde los que un usuario puede pedir a UUCP que env&iacute;e 
  ficheros; local-receive, que da la lista de directorios donde un usuario puede 
  pedir que se reciban los ficheros; y remote-send y remote-receive, que hacen 
  lo correspondiente para las peticiones que vienen de un sistema remoto. Consideremos 
  el siguiente ejemplo:</P>
<DIR> 
  <DIR> 
    <P>system pablo<BR>
      ...<BR>
      local-send /home ~<BR>
      local-receive /home ~/recibir<BR>
      remote-send ~ !~/entrada !~/recibir<BR>
      remote-receive ~/entrada</P>
  </DIR>
</DIR>
<P>_____________________________________________<BR>
  15 El programa rsmtp se usa para manejar el correo con SMTP por lotes. Esto 
  se explica en los cap&iacute;tulos sobre correo.</P>
<P>&nbsp;</P>
<P>El comando local-send permite a los usuarios de su sistema que env&iacute;en 
  cualquier fichero bajo /home y en el directorio publico de UUCP al sistema pablo. 
  El comando local-receive les permite recibir ficheros bien en el directorio 
  recibir con permiso de escritura universal en uucppublic, o en cualquier directorio 
  que tenga permiso de escritura universal bajo /home. La directiva remote-send 
  permite que el sistema pablo obtenga ficheros de /var/spool/uucppublic, excepto 
  los ficheros bajo los directorios entrada y recibir. Esto se indica a uucico 
  poniendo un signo de exclamaci&oacute;n delante de los nombres de los directorios.</P>
<P>Finalmente, la &uacute;ltima l&iacute;nea permite que pablo ponga ficheros 
  en entrada.&nbsp;</P>
<P>Uno de los mayores problemas con la transferencia de ficheros usando UUCP es 
  que solo recibe ficheros en los directorios con permiso de escritura universal. 
  Esto puede tentar a algunos usuarios a poner trampas para otros usuarios, etc. 
  Sin embargo, no hay salida a este problema excepto la desactivaci&oacute;n total 
  de la transferencia de ficheros por UUCP.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.4.3"></a>12.4.3 Reenv&iacute;o</P>
</u></I> 
<P>UUCP provee un mecanismo para que otros sistemas ejecuten transferencias de 
  ficheros por usted. Por ejemplo, esto le permite que el sistema seci obtenga 
  un fichero de uchile por usted, y lo env&iacute;e a su sistema. El siguiente 
  comando har&iacute;a esto:</P>
<DIR> 
  <DIR> 
    <P>$ uucp -r seci!uchile!~/find-ls.gz ~/uchile.files.gz</P>
  </DIR>
</DIR>
<P>Esta t&eacute;cnica de pasar un trabajo a trav&eacute;s de varios sistemas 
  se llama forwarding (reenv&iacute;o). En el ejemplo anterior, la raz&oacute;n 
  para usar el reenv&iacute;o puede ser que seci tiene acceso por UUCP a uchile, 
  pero su sistema no lo tiene. Sin embargo, si usted tiene un sistema de UUCP, 
  es deseable limitar el servicio de reenv&iacute;o a unos pocos sistemas en que 
  usted conf&iacute;a, para que no se le acumule una factura telef&oacute;nica 
  horrenda cuando alguien use su sistema para obtener la &uacute;ltima versi&oacute;n 
  de X11R6.</P>
<P>Por defecto, Taylor UUCP no permite el reenv&iacute;o. Para permitirlo para 
  un sistema en particular, puede usar el comando forward. Este comando especifica 
  una lista de ordenadores desde y hacia los cuales el sistema remoto puede pedirle 
  que reenv&iacute;e trabajos. Por ejemplo, el administrador de UUCP del sistema 
  seci tendr&iacute;a que a&ntilde;adir las siguientes l&iacute;neas al fichero 
  sys para permitir que pablo obtenga ficheros de uchile:</P>
<DIR> 
  <DIR> 
    <P>####################<BR>
      # pablo<BR>
      system pablo<BR>
      ...<BR>
      forward uchile</P>
    <P>####################<BR>
      # uchile<BR>
      system uchile<BR>
      ...<BR>
      forward-to pablo</P>
  </DIR>
</DIR>
<P>La entrada forward-to para uchile es necesaria para que cualquier fichero devuelto 
  por el sea en efecto pasado a pablo. De otro modo, UUCP se deshar&iacute;a del 
  fichero. Esta entrada usa una variaci&oacute;n del comando forward que permite 
  que uchile solo env&iacute;e ficheros a pablo a trav&eacute;s de seci, no al 
  rev&eacute;s.</P>
<P>Para permitir el reenv&iacute;o a cualquier sistema, use el comando especial 
  ANY (tiene que estar en may&uacute;sculas).</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="12.5"></a>12.5 Configuraci&oacute;n de su sistema para ser llamado.</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Si quiere configurar su sistema para que otros se conecten a &eacute;ste llam&aacute;ndole, 
  tiene que permitir conexiones en su puerto serie, y modificar ciertos ficheros 
  del sistema para proveer cuentas de UUCP. Este es el tema de esta secci&oacute;n.</P>
<I><U> 
<P><a name="12.5.1"></a>12.5.1 Configuraci&oacute;n de getty</P>
</u></I> 
<P>Si quiere usar una l&iacute;nea serie como un puerto de entrada, tiene que 
  activar un proceso getty en ese puerto. Sin embargo, algunas implementaciones 
  de getty no son v&aacute;lidas para esto porque normalmente se desea usar un 
  puerto para entrada y para salida. Por lo tanto tiene que asegurarse de usar 
  un getty que es capaz de compartir la l&iacute;nea con otros programas como 
  uucico, o minicom. Un programa que se comporta as&iacute; es uugetty del paquete 
  getty_ps. La mayor&iacute;a de las distribuciones de Linux lo tienen; busque 
  uugetty en el directorio /sbin. Otro programa que existe es mgetty, de Gert 
  Doering, que adem&aacute;s hace recepci&oacute;n de facs&iacute;miles.</P>
<P>Tambi&eacute;n puede obtener la &uacute;ltima versi&oacute;n de estos programas 
  en sunsite.unc.edu, tanto en binario como en c&oacute;digo fuente.</P>
<P>La explicaci&oacute;n de las diferencias de como uugetty y mgetty manejan la 
  entrada al sistema esta mas all&aacute; del alcance de esta peque&ntilde;a secci&oacute;n; 
  para mas informaci&oacute;n, vea el HOWTO Serial de Greg Hankins16 , as&iacute; 
  como la documentaci&oacute;n que viene con getty_ps y mgetty.</P>
<P>_____________________________________________<BR>
  16 Tambi&eacute;n disponible en Castellano (Serial-COMO), en LuCAS</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.5.2"></a>12.5.2 Proveer Cuentas de UUCP</P>
</u></I> 
<P>A continuaci&oacute;n tiene que configurar las cuentas de usuarios que permiten 
  a sistemas remotos entrar en su sistema y establecer una conexi&oacute;n de 
  UUCP. Generalmente tendr&aacute; que suministrar un nombre de usuario para cada 
  sistema que se conecte con usted. Cuando configura una cuenta para el sistema 
  pablo, puede darle el nombre de usuario Upablo.</P>
<P>Para los sistemas que se conectan con el suyo a trav&eacute;s del puerto serie, 
  usualmente tiene que a&ntilde;adir estas cuentas al fichero de claves del sistema, 
  /etc/passwd. Es buena idea poner todos los usuarios de UUCP en un grupo especial 
  como uuguest. El directorio ra&iacute;z de cada cuenta de UUCP tiene que ser 
  el directorio publico /var/spool/uucppublic; el shell de entrada tiene que ser 
  uucico.</P>
<P>Si tiene el paquete de claves ocultadas (shadow password) instalado, podremos 
  hacer esto con el comando useradd:</P>
<DIR> 
  <DIR> 
    <P># useradd -d /var/spool/uucppublic -G uuguest -s /usr/lib/uucp/uucico Upablo</P>
  </DIR>
</DIR>
<P>Si no utiliza la aplicaci&oacute;n de claves ocultas, probablemente tendr&aacute; 
  que editar /etc/passwd a mano, a&ntilde;adiendo una l&iacute;nea como la siguiente, 
  donde 5000 y 150 son el n&uacute;mero de identificaci&oacute;n de usuario (uid) 
  y el n&uacute;mero de grupo asignado al usuario Upablo y al grupo uuguest, respectivamente.</P>
<DIR> 
  <DIR> 
    <P>Upablo:*:5000:150:Cuenta de UUCP:/var/spool/uucppublic:/usr/lib/uucp/uucico</P>
  </DIR>
</DIR>
<P>Una vez creada la cuenta, tiene que activarla asign&aacute;ndole una clave 
  con el comando passwd.</P>
<P>Para servir a sistemas de UUCP que se conectan a su sistema por TCP, tiene 
  que configurar inetd para que reconozca correctamente conexiones en el puerto 
  uucp. Esto se consigue a&ntilde;adiendo la siguiente l&iacute;nea al fichero 
  /etc/inetd.conf :17</P>
<DIR> 
  <DIR> 
    <P>uucp stream tcp nowait root /usr/sbin/tcpd /usr/lib/uucp/uucico -l</P>
  </DIR>
</DIR>
<P>La opci&oacute;n -l hace que uucico haga su propia autorizaci&oacute;n de entrada. 
  Pedir&aacute; un nombre de usuario y una clave, igual que el programa est&aacute;ndar 
  login, pero usara su propia base de datos de claves, en vez de /etc/passwd. 
  Este fichero privado de claves se llama /usr/lib/uucp/passwd y contiene pares 
  de nombres de entrada y claves:</P>
<DIR> 
  <DIR> 
    <P>Upablo IslaNegra<BR>
      Ulorca cordoba</P>
  </DIR>
</DIR>
<P>Por supuesto, este fichero tiene que pertenecer al usuario uucp y tener permiso 
  600.</P>
<P>_____________________________________________<BR>
  17 Normalmente, tcpd tiene modo 700, as&iacute; que tiene que invocarlo como 
  usuario root, no como usuario uucp, como har&iacute;a normalmente.</P>
<P>&nbsp;</P>
<P>Si esta base de datos parece una idea tan buena que le gustar&iacute;a usarla 
  en verificaci&oacute;n normal de entrada (login) por serie tambi&eacute;n, se 
  desilusionara al saber que esto no es posible por el momento de manera sencilla. 
  Para empezar, necesita Taylor UUCP 1.05 para hacer esto, porque permite a getty 
  que pase el nombre del usuario que llama al programa uucico usando la opci&oacute;n 
  -u.18 Luego tiene que enga&ntilde;ar al programa getty que este usando para 
  que llame a uucico en vez del usual login. Con getty_ps, esto se puede hacer 
  poniendo la opci&oacute;n LOGIN en el fichero de configuraci&oacute;n. Sin embargo, 
  esto desactiva los logins interactivos por completo. mgetty, por otro lado, 
  tiene una caracter&iacute;stica atractiva que le permite invocar diferentes 
  comandos de entrada (login) seg&uacute;n el nombre de usuario suministrado.</P>
<P>Por ejemplo, puede decirle a mgetty que use uucico para todos los usuarios 
  cuyo nombre de usuario comience con una U may&uacute;scula, pero dejar que todos 
  los dem&aacute;s usen el comando est&aacute;ndar login.</P>
<P>Para proteger a sus usuarios de UUCP de otros que den un nombre de sistema 
  falso y les lean todo el correo, tiene que a&ntilde;adir comandos called-login 
  a cada entrada de sistema en el fichero sys. Esto se describe en la secci&oacute;n 
  siguiente.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.5.3"></a>12.5.3 Protecci&oacute;n contra estafadores</P>
</u></I> 
<P>Uno de los mayores problemas con UUCP es que el sistema que nos llama puede 
  mentir acerca de su nombre; comunica su nombre al sistema que llama despu&eacute;s 
  de entrar, pero el servidor no tiene manera de comprobarlo. Por consiguiente, 
  un atacante podr&iacute;a entrar con su propia cuenta de UUCP, pretender ser 
  otra persona, y coger el correo de esa otra persona.</P>
<P>Esto representa un grave problema, especialmente si usted ofrece entrada mediante 
  UUCP an&oacute;nimo, que tiene una clave publica.</P>
<P>A menos que usted sepa que puede confiar en todos los sistemas que llaman al 
  suyo, usted tiene que protegerse de esta clase de impostores. La cura de esta 
  enfermedad es requerir que cada sistema use un nombre de entrada particular, 
  poniendo un comando called-login en el fichero sys. Un ejemplo de esto podr&iacute;a 
  ser as&iacute;:</P>
<DIR> 
  <DIR> 
    <P>system pablo<BR>
      ... opciones usuales ...<BR>
      called-login Upablo</P>
  </DIR>
</DIR>
<P>_____________________________________________<BR>
  18 La opci&oacute;n -u tambi&eacute;n existe en 1.04, pero no hace nada.</P>
<P>&nbsp;</P>
<P>La ventaja de este m&eacute;todo es que cuando un sistema entra y pretende 
  ser pablo, el programa uucico comprobara que haya entrado como usuario Upablo. 
  Si no es as&iacute;, el sistema que nos llama ser&aacute; desconectado. Deber&iacute;a 
  acostumbrarse a incluir el comando called-login en todas las entradas de sistema 
  que a&ntilde;ada a su fichero sys. Es importante que haga esto para todos los 
  sistemas, independientemente de si llamaran a su sistema o no. Para aquellos 
  sistemas que nunca le llamaran, usted puede indicar en called-login un nombre 
  ficticio, como nuncallama.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.5.4"></a>12.5.4 Vu&eacute;lvase Loco - Comprobaci&oacute;n de Secuencia 
  de Llamadas</P>
</u></I> 
<P>Otra manera de defenderse de impostores es usando la comprobaci&oacute;n de 
  secuencia de llamadas. La comprobaci&oacute;n de secuencia de llamadas le ayuda 
  a protegerse de intrusos que de alguna manera consiguieron la clave con la que 
  usted entra en su sistema de UUCP.</P>
<P>Cuando usa comprobaci&oacute;n de secuencia de llamadas, ambas maquinas mantienen 
  una cuenta del n&uacute;mero de conexiones establecidas hasta el momento. Se 
  incrementa con cada conexi&oacute;n. Despu&eacute;s de entrar, el llamador env&iacute;a 
  su n&uacute;mero de secuencia de llamadas y el sistema llamado lo comprueba 
  con su propio n&uacute;mero. Si no son iguales, el intento de conexi&oacute;n 
  es rechazado. Si el n&uacute;mero inicial se elige aleatoriamente, los atacantes 
  lo tendr&aacute;n mas dif&iacute;cil para adivinar el n&uacute;mero de secuencia 
  de llamadas correcto.</P>
<P>Pero la comprobaci&oacute;n de la secuencia de llamada sirve para mas que esto: 
  aunque una persona muy inteligente descubriese su n&uacute;mero de secuencia 
  de llamada as&iacute; como su clave, usted sabr&aacute; que esto ha ocurrido. 
  Cuando el atacante llama al sistema de UUCP que le provee el correo a usted 
  y roba su correo, esto incrementa el n&uacute;mero de secuencia de llamada en 
  uno. La siguiente vez que usted se conecta con su proveedor de correo e intenta 
  entrar, el uucico remoto le rechazara, porque los n&uacute;meros de secuencia 
  ya no son iguales.</P>
<P>Si usted activa la comprobaci&oacute;n de secuencia de llamadas, deber&iacute;a 
  comprobar los ficheros hist&oacute;ricos regularmente para buscar mensajes de 
  error que puedan significar posibles ataques. Si su sistema rechaza el n&uacute;mero 
  de secuencia de llamada que el sistema remoto le ofrece, uucico pondr&aacute; 
  un mensaje en el fichero hist&oacute;rico que dir&aacute; algo como "Out of 
  sequence call rejected" ("Llamada fuera de secuencia rechazada"). Si su sistema 
  es rechazado por el proveedor de correo porque los n&uacute;mero de secuencia 
  no est&aacute;n sincronizados, pondr&aacute; un mensaje en el fichero hist&oacute;rico 
  que dice "Handshake failed (RBADSEQ)" ("Negociaci&oacute;n fallida (RBADSEQ)").</P>
<P>Para activar la comprobaci&oacute;n del n&uacute;mero de secuencia, tiene que 
  a&ntilde;adir el siguiente comando en la entrada de sistema:</P>
<DIR> 
  <DIR> 
    <P># activar comprobaci&oacute;n de n&uacute;mero de secuencia<BR>
      sequence true</P>
  </DIR>
</DIR>
<P>Aparte de esto, tiene que crear el fichero que contiene el n&uacute;mero de 
  secuencia. Taylor UUCP mantiene el n&uacute;mero de secuencia en un fichero 
  llamado .Sequence en el directorio de cola (spool) del sistema remoto. Tiene 
  que pertenecer al usuario uucp, y debe tener permisos 600 (es decir, visible 
  y escribible solo por uucp). Lo mejor es inicializar este fichero con un valor 
  arbitrario que ambas partes hayan acordado. De otro modo el atacante podr&iacute;a 
  apa&ntilde;&aacute;rselas para adivinar el n&uacute;mero probando todos los 
  valores menores que, digamos, 60.</P>
<DIR> 
  <DIR> 
    <P># cd /var/spool/uucp/pablo<BR>
      # echo 94316 &gt; .Sequence<BR>
      # chmod 600 .Sequence<BR>
      # chown uucp.uucp .Sequence</P>
  </DIR>
</DIR>
<P>Por supuesto, el sistema remoto tambi&eacute;n tiene que activar la comprobaci&oacute;n 
  del n&uacute;mero de secuencia, y empezar usando el mismo n&uacute;mero que 
  usted.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.5.5"></a>12.5.5 UUCP An&oacute;nimo</P>
</u></I> 
<P>Si quiere ofrecer acceso an&oacute;nimo de UUCP a su sistema, primero tiene 
  que establecer una cuenta especial como se describi&oacute; anteriormente. Es 
  practica com&uacute;n darle a esta cuenta el nombre y la clave uucp.</P>
<P>Adem&aacute;s, tiene que especificar algunas opciones de seguridad para sistemas 
  desconocidos. Por ejemplo, usted podr&iacute;a querer prohibirles que ejecuten 
  comandos en su sistema. Sin embargo, estos par&aacute;metros no se pueden poner 
  en una entrada del fichero sys, porque el comando system requiere el nombre 
  del sistema, que en este caso no tenemos. Taylor UUCP resuelve este dilema con 
  el comando unknown. unknown se puede usar en el fichero config para especificar 
  cualquier comando que puede aparecer normalmente en una entrada de sistema:</P>
<DIR> 
  <DIR> 
    <P>unknown remote-receive ~/incoming<BR>
      unknown remote-send ~/pub<BR>
      unknown max-remote-debug none<BR>
      unknown command-path /usr/lib/uucp/anon-bin<BR>
      unknown commands rmail</P>
  </DIR>
</DIR>
<P>Esto limita a los sistemas desconocidos a que se bajen ficheros del directorio 
  pub y que dejen ficheros en el directorio incoming bajo /var/spool/uucppublic. 
  La siguiente l&iacute;nea hace que uucico ignore cualquier petici&oacute;n del 
  sistema remoto de activar la comprobaci&oacute;n de errores (debugging) localmente. 
  Las dos &uacute;ltimas l&iacute;neas permiten que los sistemas desconocidos 
  ejecuten rmail ; pero el camino de b&uacute;squeda de comandos especificado 
  hace que uucico busque el comando rmail solamente en un directorio privado llamado 
  anon-bin. Esto le permite a usted suministrar alg&uacute;n programa rmail especial 
  que, por ejemplo, reenv&iacute;e todo el correo al superusuario para examinarlo. 
  Esto permite a los usuarios an&oacute;nimos contactar con el administrador del 
  sistema, pero al mismo tiempo evita que ellos manden correo a otros sistemas.</P>
<P>Para activar UUCP an&oacute;nimo, tiene que especificar por lo menos un comando 
  unknown en el fichero config. Si no, uucico rechazara cualquier sistema desconocido.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="12.6"></a>12.6 Protocolos de bajo nivel de UUCP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Para negociar el control de la sesi&oacute;n y las transferencias de ficheros 
  con el sistema remoto, uucico usa un grupo de mensajes est&aacute;ndar. Esto 
  es lo que se llama normalmente protocolo de alto nivel. Durante la fase de inicializaci&oacute;n 
  y la fase de desconexi&oacute;n &eacute;stos se env&iacute;an simplemente como 
  tiras de caracteres. Sin embargo, durante la fase de transferencia, se usa tambi&eacute;n 
  un protocolo de bajo nivel, que resulta transparente para los niveles superiores. 
  De esta manera es posible comprobar errores cuando se usan l&iacute;neas poco 
  fiables, por ejemplo.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.6.1"></a>12.6.1 Resumen del protocolo</P>
</u></I> 
<P>Dado que UUCP se usa sobre diferentes tipos de conexiones, como l&iacute;neas 
  serie, TCP, o incluso X.25, es preciso usar protocolos de bajo nivel espec&iacute;ficos. 
  Adem&aacute;s, varias implementaciones de UUCP han introducido diferentes protocolos 
  para hacer lo mismo.</P>
<P>Los protocolos se pueden dividir en dos categor&iacute;as: de corriente o flujo 
  (streaming) y por paquetes. La primera clase de protocolos transfiere un fichero 
  entero, posiblemente calculando una suma de comprobaci&oacute;n (checksum). 
  Esto apenas supone un gasto extra de tiempo, pero precisa una conexi&oacute;n 
  fiable, porque cualquier error causar&iacute;a que todo el fichero tenga que 
  volver a ser enviado. Estos protocolos se suelen usar sobre conexiones de TCP, 
  pero no sobre l&iacute;neas telef&oacute;nicas. Aunque los m&oacute;dems modernos 
  hacen un buen trabajo corrigiendo errores, no son perfectos, y tampoco lo es 
  la detecci&oacute;n de errores entre el ordenador y el m&oacute;dem.</P>
<P>Por su lado, los protocolos por paquetes parten el fichero en varias partes 
  de igual tama&ntilde;o. Cada paquete se env&iacute;a y recibe por separado, 
  se realiza una suma de comprobaci&oacute;n, y se devuelve al origen un paquete 
  de confirmaci&oacute;n. Para que sea mas eficiente, se inventaron protocolos 
  de ventanas deslizantes, que permiten un n&uacute;mero limitado (una ventana) 
  de paquetes sin esperar confirmaci&oacute;n en un momento dado. Esto reduce 
  considerablemente la cantidad de tiempo que uucico tiene que esperar durante 
  una transmisi&oacute;n. Aun as&iacute;, todos los c&aacute;lculos extra necesarios 
  en comparaci&oacute;n a un protocolo de flujo hace que los protocolos de paquetes 
  sean ineficientes sobre TCP.</P>
<P>El ancho de los datos tambi&eacute;n supone una diferencia. A veces, el env&iacute;o 
  de caracteres de ocho bits sobre una conexi&oacute;n serie es imposible, por 
  ejemplo si la conexi&oacute;n atraviesa un est&uacute;pido servidor de terminales. 
  En este caso, los caracteres con el octavo bit igual a uno tienen que ser especialmente 
  tratados. Cuando se env&iacute;an caracteres de ocho bits sobre una conexi&oacute;n 
  de siete bits, tienen que estar bajo la suposici&oacute;n del peor caso posible. 
  Esto duplica la cantidad de datos a transmitir, aunque la compresi&oacute;n 
  que se hace por hardware puede compensar esto. Las l&iacute;neas que pueden 
  transmitir caracteres de ocho bits se llaman preparadas para ocho bits. Este 
  es el caso de todas las conexiones TCP, as&iacute; como la mayor&iacute;a de 
  los m&oacute;dems.</P>
<P>Existen los siguientes protocolos con Taylor UUCP 1.04:</P>
<P><b>g</b> Este es el protocolo mas com&uacute;n y deber&iacute;a ser entendido 
  por pr&aacute;cticamente todos los uucico's. Hace comprobaci&oacute;n de errores 
  en profundidad y es, por lo tanto, apropiado para las ruidosas conexiones telef&oacute;nicas. 
  g require una conexi&oacute;n preparada para ocho bits. Es un protocolo orientado 
  a paquetes que usa una t&eacute;cnica de ventana deslizante.</P>
<P><b>i</b> Este es un protocolo bidireccional de paquetes que puede enviar y 
  recibir ficheros al mismo tiempo. Requiere una conexi&oacute;n que permita comunicaci&oacute;n 
  bidireccional simultanea (full-duplex) y preparada para ocho bits. Actualmente 
  solo es usado por Taylor UUCP.</P>
<P><b>t</b> Este es un protocolo dise&ntilde;ado para usarse sobre una conexi&oacute;n 
  de TCP, u otras redes libres de errores. Usa paquetes de 1024 bytes y requiere 
  una conexi&oacute;n de ocho bits.</P>
<P><b>e</b> Este protocolo b&aacute;sicamente hace lo mismo que t. La principal 
  diferencia es que e es un protocolo de flujo.</P>
<P><b>f</b> Este protocolo esta pensado para usarse sobre conexiones fiables X.25. 
  Es un protocolo de flujo y espera una conexi&oacute;n de siete bits. Los caracteres 
  de ocho bits son codificados, lo cual lo hace muy ineficiente.</P>
<P><b>G</b> Esta es la versi&oacute;n del Unix SVR419 del protocolo g. Tambi&eacute;n 
  se utiliza en algunas otras versiones de UUCP.</P>
<P><b>a</b> Este protocolo es similar a ZMODEM. Requiere una conexi&oacute;n de 
  ocho bits, pero codifica ciertos caracteres como XON y XOFF.</P>
<P>_____________________________________________<BR>
  19 N. del T.: Unix Sistema V Version 4</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.6.2"></a>12.6.2 Ajuste del protocolo de transmisi&oacute;n</P>
</u></I> 
<P>Todos los protocolos permiten alguna variaci&oacute;n en el tama&ntilde;o de 
  los paquetes, el cronometro y similares. Usualmente, los valores por defecto 
  funcionan bien, pero puede no ser &oacute;ptimo para su configuraci&oacute;n. 
  El protocolo g, por ejemplo, usa tama&ntilde;os de ventanas de 1 a 7, y tama&ntilde;os 
  de paquetes en potencias de 2 desde 64 a 4096.20 Si su l&iacute;nea telef&oacute;nica 
  es tan ruidosa que ignora el 5 por ciento de los paquetes, probablemente deber&iacute;a 
  disminuir el tama&ntilde;o de los paquetes y de la ventana. Sin embargo, en 
  l&iacute;neas de tel&eacute;fono muy buenas el hecho de enviar acuses de recibo 
  por cada 128 bytes puede resultar un desperdicio, as&iacute; que podr&iacute;a 
  incrementar el tama&ntilde;o de los paquetes a 512 o incluso 1024.</P>
<P>Taylor UUCP provee un mecanismo para satisfacer sus necesidades mediante el 
  ajuste de estos par&aacute;metros con el comando protocol-parameter en el fichero 
  sys. Por ejemplo, para ajustar el tama&ntilde;o de los paquetes del protocolo 
  g a 512 cuando se conecte con el sistema pablo, tiene que a&ntilde;adir:</P>
<DIR> 
  <DIR> 
    <P>system pablo<BR>
      ...<BR>
      protocol-parameter g packet-size 512</P>
  </DIR>
</DIR>
<P>Los par&aacute;metros ajustables y sus nombres var&iacute;an entre protocolos. 
  Para ver una lista completa de &eacute;stos puede consultar la documentaci&oacute;n 
  que acompa&ntilde;a al c&oacute;digo fuente de Taylor UUCP.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="12.6.3"></a>12.6.3 Selecci&oacute;n de protocolos espec&iacute;ficos</P>
</u></I> 
<P>No todas las implementaciones de uucico hablan y entienden cada protocolo, 
  de modo que durante la fase de negociaci&oacute;n de protocolos, ambos procesos 
  tienen que ponerse de acuerdo en uno com&uacute;n. El uucico maestro ofrece 
  al esclavo una lista de protocolos soportados enviando Pprotlist , de la cual 
  el esclavo elige uno.</P>
<P>Seg&uacute;n el tipo de puerto usado (m&oacute;dem, TCP o directo), uucico 
  crea una lista por defecto de protocolos. Para m&oacute;dem y conexiones directas, 
  esta lista normalmente incluye i, a, g, G, y j. Para conexiones TCP, la lista 
  es t, e, i, a, g, G, j, y f. Esto se puede cambiar con el comando protocols, 
  que se puede especificar en una entrada de sistema o en una de puerto.</P>
<P>Por ejemplo, usted podr&iacute;a modificar la entrada del fichero port para 
  su puerto de m&oacute;dem de esta manera:</P>
<P>port serial1<BR>
  ...<BR>
  protocols igG</P>
<P>Esto requiere que cualquier conexi&oacute;n entrante o saliente en este puerto 
  use i, g o G. Si el sistema remoto no soporta ninguno de &eacute;stos, la negociaci&oacute;n 
  fallara.</P>
<P>_____________________________________________<BR>
  20 La mayor&iacute;a de los programas incluidos en las distribuciones de Linux 
  usan por defecto un tama&ntilde;o de ventana de 7 y paquetes de 128 bytes.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="12.7"></a>12.7 Soluci&oacute;n de problemas</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Esta secci&oacute;n describe lo que puede ir mal con su conexi&oacute;n de UUCP y sugiere donde buscar el error. Sin embargo, solo he puesto las preguntas que se me han ocurrido, por lo que pueden surgir otras muchas cosas que no diga aqu&iacute;.</P>
<P>En cualquier caso, active la opci&oacute;n de encontrar errores con -xall, y observe el resultado en el fichero Debug del directorio de cola. Esto deber&iacute;a ayudarle r&aacute;pidamente a reconocer donde reside el problema. Siempre me ha servido de ayuda el activar el altavoz del m&oacute;dem cuando no se conecta. Con un m&oacute;dem compatible Hayes, esto se consigue a&ntilde;adiendo "ATL1M1 OK" en el di&aacute;logo del m&oacute;dem en el fichero dial.</P>
<P>La primera cosa a comprobar siempre deber&iacute;a ser si todos los permisos de los ficheros est&aacute;n ajustados correctamente. uucico debe tener identificaci&oacute;n de usuario uucp, y todos los ficheros en /usr/lib/uucp, /var/spool/uucp y /var/spool/uucppublic tienen que pertenecer a uucp. Tambi&eacute;n hay algunos ficheros ocultos21 en el directorio de cola que tienen que pertenecer a uucp.</P>
<P>uucico dice constantemente "Wrong time to call": Esto probablemente significa que en la entrada de sistema en sys, usted no especifico el comando time que determina a que horas se puede llamar al sistema remoto, o bien especifico unas horas que en realidad prohiben llamar en este momento. Si no se especifica cuando se puede llamar, uucico asume que no se puede llamar nunca a ese sistema.</P>
<P>uucico se queja de que el sistema ya esta en uso: Esto significa que uucico detecto un fichero cerrojo (lock) para el sistema remoto en /var/spool/uucp. El fichero cerrojo puede pertenecer a una llamada anterior al sistema que fue interrumpida. Sin embargo, tambi&eacute;n es posible que haya otro uucico ejecut&aacute;ndose en el sistema que este intentando llamar al sistema remoto y se atasco en una macro de di&aacute;logo, etc. Si este uucico no consigue conectarse al sistema remoto, m&aacute;telo con una se&ntilde;al de colgar (SIGHUP), y borre cualquier fichero de bloqueo que haya dejado.</P>
<P>Me puedo conectar al sistema remoto, pero la macro de di&aacute;logo falla: Mire el texto que recibe del sistema remoto. Si esta salteado, esto puede ser un problema relacionado con la velocidad. Si no, confirme que realmente env&iacute;a lo que su macro de di&aacute;logo espera recibir. Recuerde, la macro de di&aacute;logo empieza con una cadena de caracteres esperada. Si usted recibe la invitaci&oacute;n de entrada al sistema (login), despu&eacute;s env&iacute;a su nombre pero luego no se le pregunta por la clave de acceso, inserte un retraso antes de enviarlo, o incluido entre las letras. Puede ser que usted sea demasiado r&aacute;pido para su m&oacute;dem.</P>
<P>_____________________________________________<BR>
21 Es decir, ficheros cuyo nombre empieza con un punto. Estos ficheros normalmente no aparecen con un comando ls.</P>
<P>&nbsp;</P>
<P>Mi m&oacute;dem no marca: Si su m&oacute;dem no indica que la l&iacute;nea DTR ha sido elevada cuando uucico hace una llamada, posiblemente no le ha dado el dispositivo correcto a uucico. Si su m&oacute;dem reconoce DTR, compruebe con un programa terminal que usted puede escribir comandos. Si esto funciona, active el eco con el comando \E al comienzo del di&aacute;logo del m&oacute;dem. Si esto no produce un eco de sus comandos durante el di&aacute;logo del m&oacute;dem, compruebe si la velocidad de la l&iacute;nea es demasiado alta o demasiado baja para su m&oacute;dem. Si que ve el eco, compruebe si ha desactivado las respuestas del m&oacute;dem, o las ha configurado como c&oacute;digos num&eacute;ricos. Verifique que la macro de di&aacute;logo en si misma es v&aacute;lida. Recuerde que tiene que poner dos barras invertidas para enviar una al m&oacute;dem.</P>
<P>Mi m&oacute;dem intenta marcar, pero la llamada no sale: Inserte un retraso en el n&uacute;mero de tel&eacute;fono. Esto es especialmente &uacute;til cuando se llama fuera de la red interna de una compa&ntilde;&iacute;a. Para la gente en Europa, que normalmente marca con pulsos (pulse-tone), pruebe con tonos (touch-tone). En ciertos pa&iacute;ses, los servicios telef&oacute;nicos han actualizado sus redes recientemente. "touch-tone" ayuda a veces.</P>
<P>El fichero de registro (log) dice que tengo un ratio de paquetes perdidos extremadamente alto: Esto parece un problema de velocidad. Puede ser que la conexi&oacute;n entre su ordenador y su m&oacute;dem sea demasiado lenta (recuerde adaptarla a la mayor velocidad efectiva posible). O puede ser que su hardware sea demasiado lento para servir las interrupciones a tiempo. Con un chip NSC 16550A en su puerto serie, 38kbps puede funcionar razonablemente bien; sin embargo, sin FIFOs (como el chip 16450), el limite es 9600. Tambi&eacute;n tiene que asegurarse de que la negociaci&oacute;n hardware esta incluida en la l&iacute;nea serie.</P>
<P>Otra posible causa es que la negociaci&oacute;n hardware no este activada en el puerto. Taylor UUCP 1.04 no tiene mecanismos para activar la negociaci&oacute;n de RTS/CTS. Tiene que activarla expl&iacute;citamente en el fichero rc.serial usando el siguiente comando:</P><DIR>
<DIR>

<P>$ stty crtscts &lt; /dev/cua3</P></DIR>
</DIR>

<P>Puedo entrar en el otro sistema, pero la negociaci&oacute;n falla: Bien, puede ser debido a muchas causas. Los mensajes en el fichero de registro deber&iacute;an decirle un mont&oacute;n de cosas. Mire que protocolos ofrece el sistema remoto (env&iacute;a un Pprotlist durante la negociaci&oacute;n). A lo mejor no tienen nada en com&uacute;n (¿seleccion&oacute; alg&uacute;n protocolo en sys o port?).</P>
<P>Si el sistema remoto env&iacute;a RLCK, hay un fichero de bloqueo (lock) para su sistema en el sistema remoto. Si no es porque usted ya esta conectado al sistema remoto en otra l&iacute;nea, pida que lo borren.</P>
<P>Si env&iacute;a RBADSEQ, el otro sistema tiene la comprobaci&oacute;n de la cuenta de conversaci&oacute;n activada para su sistema, pero los n&uacute;meros no se corresponden. Si env&iacute;a RLOGIN, no le fue permitido entrar con ese nombre de usuario.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="12.8"></a>12.8 Archivos de registro hist&oacute;rico (Log Files)</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Cuando se compila el paquete de UUCP para usar ficheros de registro al estilo Taylor-UUCP, se tendr&aacute;n tres ficheros hist&oacute;ricos globales, y todos residir&aacute;n en el directorio de cola. El fichero principal se llama Log y contiene toda la informaci&oacute;n sobre las conexiones establecidas y los ficheros transferidos. Un extracto t&iacute;pico podr&iacute;a ser como el siguiente (despu&eacute;s de formatearlo para que quepa en la p&aacute;gina):</P><DIR>
<DIR>

<P>uucico pablo - (1994-05-28 17:15:01.66 539) Calling system pablo (port cua3)<BR>
uucico pablo - (1994-05-28 17:15:39.25 539) Login successful<BR>
uucico pablo - (1994-05-28 17:15:39.90 539) Handshake successful<BR>
(protocol 'g' packet size 1024 window 7)<BR>
uucico pablo postmaster (1994-05-28 17:15:43.65 539) Receiving D.pabloB04aj<BR>
uucico pablo postmaster (1994-05-28 17:15:46.51 539) Receiving X.pabloX04ai<BR>
uucico pablo postmaster (1994-05-28 17:15:48.91 539) Receiving D.pabloB04at<BR>
uucico pablo postmaster (1994-05-28 17:15:51.52 539) Receiving X.pabloX04as<BR>
uucico pablo postmaster (1994-05-28 17:15:54.01 539) Receiving D.pabloB04c2<BR>
uucico pablo postmaster (1994-05-28 17:15:57.17 539) Receiving X.pabloX04c1<BR>
uucico pablo - (1994-05-28 17:15:59.05 539) Protocol 'g' packets: sent 15,<BR>
resent 0, received 32<BR>
uucico pablo - (1994-05-28 17:16:02.50 539) Call complete (26 seconds)<BR>
uuxqt pablo postmaster (1994-05-28 17:16:11.41 546) Executing X.pabloX04ai<BR>
(rmail okir)<BR>
uuxqt pablo postmaster (1994-05-28 17:16:13.30 546) Executing X.pabloX04as<BR>
(rmail okir)<BR>
uuxqt pablo postmaster (1994-05-28 17:16:13.51 546) Executing X.pabloX04c1<BR>
(rmail okir)</P></DIR>
</DIR>

<P>El siguiente fichero importante es Stats, que lista las estad&iacute;sticas de transferencias de ficheros. La secci&oacute;n de Stats que corresponde a la transferencia anterior se muestra aqu&iacute;:</P><DIR>
<DIR>

<P>postmaster pablo (1994-05-28 17:15:44.78)<BR>
received 1714 bytes in 1.802 seconds (951 bytes/sec)<BR>
postmaster pablo (1994-05-28 17:15:46.66)<BR>
received 57 bytes in 0.634 seconds (89 bytes/sec)<BR>
postmaster pablo (1994-05-28 17:15:49.91)<BR>
received 1898 bytes in 1.599 seconds (1186 bytes/sec)<BR>
postmaster pablo (1994-05-28 17:15:51.67)<BR>
received 65 bytes in 0.555 seconds (117 bytes/sec)<BR>
postmaster pablo (1994-05-28 17:15:55.71)<BR>
received 3217 bytes in 2.254 seconds (1427 bytes/sec)<BR>
postmaster pablo (1994-05-28 17:15:57.31)<BR>
received 65 bytes in 0.590 seconds (110 bytes/sec)</P></DIR>
</DIR>

<P>Como en el caso anterior, las l&iacute;neas han sido partidas para que quepan en la p&aacute;gina.</P>
<P>El tercer fichero es Debug. Este es el sitio donde se incluye toda la informaci&oacute;n para buscar errores. Si usted usa detecci&oacute;n de errores (debugging), tiene que asegurarse de que este fichero tenga modo de protecci&oacute;n de 600. Dependiendo del modo de b&uacute;squeda de errores que haya elegido, este fichero puede incluir el nombre de usuario y la clave que usted usa para conectarse al sistema remoto.</P>
<P>Algunos programas de UUCP que incluyen algunas distribuciones de Linux han sido compilados para usar el estilo de fichero de registro hist&oacute;rico de HDB. HDB UUCP usa muchos ficheros de registro archivados bajo /var/spool/uucp/.Log. Este directorio contiene tres directorios mas, llamados uucico, uuxqt y uux. Estos contienen el resultado de informaci&oacute;n hist&oacute;rica generada por cada uno de los comandos correspondientes, ordenada en diferentes ficheros para cada sistema. Por lo tanto, la salida del programa uucico cuando se llama a pablo acabara en .Log/uucico/pablo, mientras que el uuxqt correspondiente escribir&aacute; en .Log/uuxqt/pablo. Las l&iacute;neas escritas a cada uno de estos ficheros son sin embargo iguales que en Taylor UUCP.</P>
<P>Cuando active la opci&oacute;n de b&uacute;squeda de errores con el estilo HDB, la informaci&oacute;n ser&aacute; escrita en el directorio .Admin bajo /var/spool/uucp. Durante llamadas salientes, la informaci&oacute;n se env&iacute;a al fichero .Admin/audit.local, mientras que la salida de uucico cuando alguien nos llama se graba en .Admin/audit.</P></FONT></BODY>
</HTML>
