<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl5</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl04.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl06.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 5</P>
</font></B><P ALIGN="CENTER"><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>Configuraci&oacute;n del Protocolo TCP/IP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>En este cap&iacute;tulo recorreremos todos los pasos necesarios para configurar 
  el protocolo TCP/IP en su m&aacute;quina. Empezando en la asignaci&oacute;n 
  de direcciones IP, iremos describiendo la configuraci&oacute;n de las interfaces 
  TCP/IP e introduciremos unas cuantas herramientas que resultan bastante &uacute;tiles 
  a la hora de resolver problemas surgidos durante la instalaci&oacute;n de la 
  red.</P>
<P>La mayor&iacute;a de las tareas descritas en este cap&iacute;tulo, generalmente, 
  solo habr&aacute; de ejecutarlas una &uacute;nica vez. Una vez hecho esto, solo 
  tendr&aacute; que tocar alguno de los ficheros de configuraci&oacute;n cuando 
  a&ntilde;ada un nuevo sistema a su red, o si decide reconfigurar el sistema 
  completamente. Algunos de los comandos usados para configurar el protocolo TCP/IP, 
  sin embargo, deben ser ejecutados cada vez que se arranca el sistema. La forma 
  usual de llevar esto a cabo es a trav&eacute;s de los scripts /etc/rc.</P>
<P>Generalmente, las partes especificas de la red est&aacute;n contenidas en una 
  macro llamada rc.net o rc.inet. A veces tambi&eacute;n son llamadas rc.inet1 
  o rc.inet2, siendo la primera la encargada de inicializar la parte del n&uacute;cleo 
  que se ocupa de las comunicaciones, mientras que la segunda es la que se encarga 
  de arrancar los servicios b&aacute;sicos y las aplicaciones. En todo lo que 
  sigue, asumir&eacute; que es &eacute;sta la estructura presente en el sistema.</P>
<P>M&aacute;s abajo describir&eacute; las acciones llevadas a cabo por rc.inet1, 
  mientras que las aplicaciones son cubiertas por los cap&iacute;tulos posteriores. 
  Al finalizar este cap&iacute;tulo, deber&iacute;a usted haber establecido la 
  secuencia de comandos que configuran correctamente el protocolo TCP/IP en su 
  ordenador. Sustituya los comandos de ejemplo en rc.inet1 por los suyos propios; 
  aseg&uacute;rese de que rc.inet1 es ejecutada en el arranque y rearranque su 
  m&aacute;quina. Los scripts rc que acompa&ntilde;en a su distribuci&oacute;n 
  de Linux favorita deber&iacute;an ser un buen ejemplo.</P>
</FONT>
<blockquote>
  <p><FONT FACE="Verdana" SIZE=2><font face="Verdana" size="2"><a href="garl05.htm#5.1">5.1 
    Configuraci&oacute;n del Sistema de Ficheros proc</a><br>
    <a href="garl05.htm#5.2">5.2 Instalaci&oacute;n de los Ejecutables</a><br>
    <a href="garl05.htm#5.3">5.3 Otro Ejemplo</a><br>
    <a href="garl05.htm#5.4">5.4 Establecimiento del Nombre de la M&aacute;quina</a><br>
    <a href="garl05.htm#5.5">5.5 Asignaci&oacute;n de una direcci&oacute;n IP</a><br>
    <a href="garl05.htm#5.6">5.6 Preparaci&oacute;n de los ficheros hosts y networks</a><br>
    <a href="garl05.htm#5.7">5.7 Configuraci&oacute;n de la Interface para IP</a></font></FONT></p>
</blockquote>
<dir> 
  <dir> 
    <blockquote>
      <p><font face="Verdana" size="2"><a href="garl05.htm#5.7.1">5.7.1 La Interface 
        de Bucle o Loopback</a><br>
        <a href="garl05.htm#5.7.2">5.7.2 Interfaces Ethernet</a><br>
        <a href="garl05.htm#5.7.3">5.7.3 Encaminamiento a trav&eacute;s de una 
        Pasarela</a><br>
        <a href="garl05.htm#5.7.4">5.7.4 Configuraci&oacute;n de una Pasarela</a><br>
        <a href="garl05.htm#5.7.5">5.7.5 La Interface PLIP</a><br>
        <a href="garl05.htm#5.7.6">5.7.6 Las Interfaces SLIP y PPP</a><br>
        <a href="garl05.htm#5.7.7">5.7.7 La Interface Comod&iacute;n</a></font></p>
    </blockquote>
  </dir>
</dir>
<blockquote>
  <p><font face="Verdana" size="2"><a href="garl05.htm#5.8">5.8 Todo sobre ifconfig</a><br>
    <a href="garl05.htm#5.9">5.9 Comprobaci&oacute;n mediante netstat</a></font></p>
</blockquote>
<dir> 
  <dir> 
    <blockquote>
      <p><font face="Verdana" size="2"><a href="garl05.htm#5.9.1">5.9.1 Consulta 
        de la Tabla de Encaminamiento</a><br>
        <a href="garl05.htm#5.9.2">5.9.2 Consulta de las Estad&iacute;sticas de 
        una Interface</a><br>
        <a href="garl05.htm#5.9.3">5.9.3 Mostrar Conexiones</a></font></p>
    </blockquote>
  </dir>
</dir>
<blockquote>
  <p><font face="Verdana" size="2"><a href="garl05.htm#5.10">5.10 Comprobaci&oacute;n 
    de las Tablas ARP</a><br>
    <a href="garl05.htm#5.11">5.11 El Futuro</a></font></p>
</blockquote>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="5.1"></a>5.1 Configuraci&oacute;n del Sistema de Ficheros proc</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Algunas de las herramientas de configuraci&oacute;n de Net-2 utilizan el sistema de ficheros proc para comunicarse con el n&uacute;cleo. Se trata de una interface que permite el acceso a la informaci&oacute;n del kernel en funcionamiento a trav&eacute;s de un sistema de ficheros. Una vez ha sido montado, se pueden listar los ficheros y ver su contenido como en cualquier otro sistema de ficheros. Normalmente aparecen ficheros como loadavg, que contiene la carga media del sistema, o meminfo, que contiene informaci&oacute;n sobre la memoria f&iacute;sica y virtual.</P>
<P>El c&oacute;digo de redes a&ntilde;ade a esto el directorio net. Este directorio contiene una serie de ficheros con informaci&oacute;n sobre las tablas ARP del n&uacute;cleo, el estado de las conexiones TCP y las tablas de encaminamiento. La mayor&iacute;a de las herramientas de administraci&oacute;n de redes utilizan estos ficheros para acceder a la informaci&oacute;n que precisan.</P>
<P>El sistema de ficheros proc (tambi&eacute;n llamado procfs) es montado generalmente en /proc durante el arranque. El mejor m&eacute;todo consiste en a&ntilde;adir la siguiente l&iacute;nea al fichero /etc/fstab:</P><DIR>
<DIR>

<P># Lugar de montaje de procfs:<BR>
none /proc proc defaults</P></DIR>
</DIR>

<P>y ejecutar "mount /proc" desde uno de los macros /etc/rc.</P>
<P>El procfs viene configurado actualmente en la mayor&iacute;a de los n&uacute;cleos por defecto. Si no tiene el procfs en su n&uacute;cleo, al intentar montarlo obtendr&aacute; el mensaje "mount: fs type procfs not supported by kernel". De ser as&iacute; tiene que recompilar el n&uacute;cleo asegur&aacute;ndose de configurarlo incluyendo el soporte para procfs.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="5.2"></a>5.2 Instalaci&oacute;n de los Ejecutables</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Si est&aacute; utilizando alguna de las distribuciones de Linux, probablemente incluir&aacute; las aplicaciones y utilidades de red fundamentales as&iacute; como un conjunto coherente de ficheros de configuraci&oacute;n de ejemplo. El &uacute;nico caso en el que tendr&iacute;a que conseguir e instalar las nuevas utilidades es en el caso de instalar una nueva versi&oacute;n del n&uacute;cleo. De forma ocasional, esto supone cambios en la capa de comunicaciones del n&uacute;cleo. Eso significar&iacute;a tener que actualizar tambi&eacute;n las herramientas de configuraci&oacute;n. Esto se traduce en, al menos, la necesidad de recompilar, aunque a veces es posible conseguir un conjunto de ejecutables actualizados en ficheros llamados net-XXX.tar.gz, donde XXX es la versi&oacute;n de que se trate. En el caso de Linux 1.0 es la n&uacute;mero 0.32b, y la versi&oacute;n del n&uacute;cleo en el momento en que se escribi&oacute; este libro (1.1.12 y posterior) requiere 0.32d.</P>
<P>Si quiere compilar e instalar las aplicaciones est&aacute;ndar de comunicaciones TCP/IP, puede obtener los ficheros fuente de la mayor&iacute;a de los servidores FTP de Linux. Se trata de versiones modificadas de las fuentes de Net-BSD y otros. Otras aplicaciones, como Xmosaic, xarchie, o Gopher y los clientes IRC deben obtenerse por separado. La mayor&iacute;a compila sin necesidad de modificaciones si se siguen las instrucciones particulares.</P>
<P>El servidor FTP oficial de Net-3 es sunacm.swan.ac.uk, que es replicado en sunsite.unc.edu bajo system/Network/sunacm. El &uacute;ltimo parche y los ejecutables de Net-2e est&aacute;n disponibles en ftp.aris.com. El c&oacute;digo derivado de BSD, de Matthias Urlichs, se encuentra en ftp.ira.uka.de, en el directorio /pub/system/linux/netbsd.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="5.3"></a>5.3 Otro Ejemplo</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Para lo que queda de este libro, voy a utilizar un ejemplo menos complejo que el de la Universidad Groucho Marx, y que puede acercarse mas a las tareas que realmente tendr&aacute; que realizar. La Cervecera Virtual, es una peque&ntilde;a compa&ntilde;&iacute;a que produce, como su nombre indica, cerveza virtual. Para gestionar su negocio mas eficientemente, los cerveceros virtuales quieren conectar sus ordenadores, que casualmente son PCs bajo Linux 1.0, en red.</P>
<P>En el mismo piso, justo al otro lado del edificio se, encuentra la Vinatera Virtual, que trabaja de cerca con la cervecera. La vinatera tiene una red Ethernet propia. Naturalmente, ambas compa&ntilde;&iacute;as quieren unir sus redes una vez que &eacute;stas se encuentren operacionales.</P>
<P>Como un primer paso, quieren establecer una pasarela que pase los datagramas de una subred a otra. Para mas tarde, tienen planeado establecer un enlace UUCP con el exterior, a trav&eacute;s del cual intercambiaran noticias y correo electr&oacute;nico. A largo plazo, quieren establecer una conexi&oacute;n ocasional usando SLIP con la Internet.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="5.4"></a>5.4 Establecimiento del Nombre de la M&aacute;quina</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>La mayor&iacute;a de las aplicaciones de red, si no todas, asumen que el nombre dado a la m&aacute;quina local tiene un valor razonable. Este proceso tiene lugar durante el arranque cuando se ejecuta el comando hostname. Para llamar nodo1 a un ordenador ejecutar&iacute;a </P><DIR>
<DIR>

<P># hostname nodo1</P></DIR>
</DIR>

<P>Es una pr&aacute;ctica com&uacute;n usar el nombre sin cualificarlo con el dominio de red. As&iacute; pues, supongamos que las m&aacute;quinas de la Cervecera Virtual se llamaran vale.vbrew.com, vlager.vbrew.com, etc. Estos son los nombres oficiales, los nombres completamente cualificados de dominio (FQDN1). Los nombres locales ser&iacute;an, por tanto, &uacute;nicamente el primer componente del nombre, como por ejemplo vale. Sin embargo, dado que el nombre local se usa frecuentemente para buscar la direcci&oacute;n IP correspondiente, debe asegurarse de que la tabla que contiene esa informaci&oacute;n sea capaz de encontrarla. Esto generalmente equivale a a&ntilde;adir el nombre local al fichero /etc/hosts (ver m&aacute;s abajo).</P>
<P>Algunas personas sugieren la utilizaci&oacute;n del comando domainname para fijar el valor del dominio para el n&uacute;cleo. As&iacute;, para obtener el FQDN combinar&iacute;amos la salida de hostname y domainname. Sin embargo, esto es, en el mejor de los casos, una verdad a medias. domainname se usa por lo general para establecer el domino NIS al que pertenece la m&aacute;quina que puede ser completamente diferente al del servidor de nombres (DNS). Hablaremos de NIS en el cap&iacute;tulo 10.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="5.5"></a>5.5 Asignaci&oacute;n de una direcci&oacute;n IP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Si configura su software de red para operar su m&aacute;quina de forma aislada (por ejemplo con el objeto de utilizar el software de noticias de red INN) puede saltarse esta secci&oacute;n pues solo necesita la direcci&oacute;n de la interface de lazo.</P>
<P>Las cosas son algo mas complicadas en redes reales como las Ethernets. Si quiere conectar su ordenador a una red, tiene que pedir a los administradores de la misma que le asignen una direcci&oacute;n IP para esa red. Cuando es usted mismo el que esta estableciendo la red, tendr&aacute; que ser usted quien asigne las direcciones IP seg&uacute;n se describe a continuaci&oacute;n.</P>
<P>Las m&aacute;quinas de una red local deben generalmente compartir direcciones de una subred l&oacute;gica. Por ello lo primero es asignar una direcci&oacute;n IP para la red. Si tiene varias redes f&iacute;sicas, deber&aacute; asignar n&uacute;meros de red completamente diferentes a cada una o dividir el rango de direcciones IP disponibles en varias subredes.</P>
<P>Si su red no esta conectada con Internet, es libre de elegir cualquier direcci&oacute;n (valida). S&oacute;lo tiene que asegurarse de elegir una de entre los tipos A, B, o C, o, de otro modo, no ir&aacute;n bien las cosas. Sin embargo, si planea conectarse a la Internet en un futuro cercano, tiene usted que obtener una direcci&oacute;n IP oficial ya. La mejor forma es pedir ayuda a su proveedor de servicios de Internet. Si quiere pedir una direcci&oacute;n oficial en previsi&oacute;n de que se conecte a la Internet alg&uacute;n d&iacute;a, pida un formulario de solicitud de direcci&oacute;n de red a hostmaster@internic.net.</P>
<P>Para operar varias redes Ethernet (o de otro tipo una vez que el controlador correspondiente este disponible), debe dividir su red en subredes. Es importante notar que esto es &uacute;nicamente necesario si tiene mas de una direcci&oacute;n de "difusi&oacute;n" (broadcast) en la red; las conexiones punto-a-punto no cuentan. As&iacute;, por ejemplo, si tiene una red Ethernet y uno o mas enlaces SLIP con el exterior no hace falta que divida su red. La raz&oacute;n se explica en el cap&iacute;tulo 7.</P>
<P>_____________________________________________<BR>
1 N. del T.: Del ingl&eacute;s fully qualified domain name</P>
<P>&nbsp;</P>
</FONT><P ALIGN="CENTER"><IMG SRC="fig5.1.gif" WIDTH=358 HEIGHT=226></P>
<FONT FACE="Verdana" SIZE=2><P>Figura 5.1: Cervecera Virtual y Vinatera Virtual - las dos subredes.</P>
<P>&nbsp;</P>
<P>A modo de ejemplo, el administrador de la red de la cervecera solicita al NIC una direcci&oacute;n de red de tipo B, si&eacute;ndole asignada la n&uacute;mero 191.72.0.0. Para acomodar dos redes ethernet, decide usar ocho bits de la parte de la direcci&oacute;n correspondiente a los ordenadores como direcci&oacute;n de subred. Eso deja otros ocho bits para las m&aacute;quinas lo que equivale a 254 por cada subred. La red de la cervecera se convierte as&iacute; en la subred 1 y la de la vinatera en la subred 2. Las direcciones de red ser&aacute;n por tanto 191.72.1.0 y 191.72.2.0. La m&aacute;scara de red ser&aacute; 255.255.255.0.</P>
<P>A vlager, que act&uacute;a de pasarela entre las redes, se le asigna el n&uacute;mero de m&aacute;quina 1 en ambas redes, lo que significa que tiene las direcciones IP, 191.72.1.1 y 191.72.2.1, respectivamente. La figura 5.1 muestra las dos subredes y la m&aacute;quina que act&uacute;a de enlace.</P>
<P>Es importante notar que en este ejemplo estamos usando una red de clase B para simplificar; una red de tipo C seria mas realista. Con el nuevo c&oacute;digo de red, la divisi&oacute;n en subredes no esta limitada a nivel de byte, de forma que incluso una red de clase C puede dividirse en varias subredes. Por ejemplo, podr&iacute;a usar 2 bits del byte de los nodos para designar la subred lo que permite implementar cuatro subredes de 64 m&aacute;quinas cada una.2</P>
<P>_____________________________________________<BR>
2 La ultima direcci&oacute;n en realidad se reserva como direcci&oacute;n de difusi&oacute;n, aquella a la que se env&iacute;an mensajes destinados a todas las m&aacute;quinas de la red correspondiente, lo cual en realidad deja solo 63 por subred.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="5.6"></a>5.6 Preparaci&oacute;n de los ficheros hosts y networks</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Una vez ha dividido su red en subredes, debe habilitar un mecanismo simple de resoluci&oacute;n de nombres usando el fichero /etc/hosts. Si no va a usar los sistemas DNS o NIS para la resoluci&oacute;n de nombres, debe poner todos los nombres de las diferentes m&aacute;quinas en el fichero hosts.</P>
<P>Incluso si planea utilizar los servicios DNS y NIS en condiciones normales de operaci&oacute;n, es conveniente tener un reducido n&uacute;mero de m&aacute;quinas en /etc/hosts. Por un lado, hay situaciones en las que es necesario resolver algunos nombres incluso cuando no hay servicios de red ejecut&aacute;ndose. Este es el caso del arranque. Se trata, no solo de una cuesti&oacute;n de conveniencia, sino que permite el uso de nombres simb&oacute;licos para las m&aacute;quinas citadas en las macros rc.inet. De esta forma, para cambiar las direcciones IP, solo tiene que copiar el fichero hosts modificado a todas las m&aacute;quinas y rearrancar, en vez de tener que modificar un gran n&uacute;mero de macros rc por separado. Generalmente, tambi&eacute;n debe incluir los nombres y direcciones locales en hosts, a&ntilde;adiendo los de las m&aacute;quinas que enlacen varias redes y los servidores NIS si existen.3</P>
<P>Tambi&eacute;n, en la fase inicial de pruebas, deber&iacute;a asegurarse de que el subsistema de resoluci&oacute;n utiliza la informaci&oacute;n del fichero hosts &uacute;nicamente. Su software DNS o NIS puede incluir ficheros de configuraci&oacute;n a modo de ejemplo que pueden producir resultados extra&ntilde;os si son usados. Para forzar a que todas las aplicaciones utilicen /etc/hosts de forma exclusiva cuando buscan una direcci&oacute;n IP, debe editar el fichero /etc/host.conf. Desactive con comentarios cualquier l&iacute;nea que comience por order a&ntilde;adiendo una almohadilla (#) e incluya la siguiente l&iacute;nea</P><DIR>
<DIR>

<P>order hosts</P></DIR>
</DIR>

<P>La configuraci&oacute;n de la librer&iacute;a de resoluci&oacute;n se describe en detalle en el cap&iacute;tulo 6.</P>
<P>El fichero hosts contiene un registro por l&iacute;nea, consistente en una direcci&oacute;n IP, un nombre de m&aacute;quina y de forma opcional, una lista de alias para esa m&aacute;quina. Los campos se separan por tabuladores o espacios y el campo con la direcci&oacute;n debe empezar en la primera columna. Cualquier cosa a continuaci&oacute;n de una almohadilla (#) es interpretada como un comentario y es consecuentemente ignorado.</P>
<P>Los nombres de las m&aacute;quinas pueden ser con cualificaci&oacute;n completa, o relativos al dominio actual. Para la m&aacute;quina vale, el registro generalmente incluir&iacute;a el nombre con cualificaci&oacute;n completa, vale.vbrew.com, y vale en el fichero hosts, de forma que pueda ser referido usando el nombre oficial y el nombre local que es mas corto.</P>
<P>_____________________________________________<BR>
3 Solo necesita incluir las direcciones de los servidores NIS si utiliza el servidor NYS de Peter Eriksonn. Otras implementaciones de servidores NIS son capaces de localizar los servidores cuando est&aacute;n siendo ejecutados, utilizando ypbind.</P>
<P>&nbsp;</P>
<P>Este es un ejemplo del aspecto que el fichero hosts de la Cervecera Virtual podr&iacute;a tener. Hay dos nombres especiales vlager-if1 y vlager-if2, correspondientes a las direcciones de ambas interfaces de la m&aacute;quina existentes en vlager.</P><DIR>
<DIR>

<P>#<BR>
# Fichero Hosts de la Cervecera Virtual/Vinatera Virtual<BR>
#<BR>
# IP local fully qualified domain name<BR>
#<BR>
127.0.0.1 localhost<BR>
#<BR>
191.72.1.1 vlager vlager.vbrew.com<BR>
191.72.1.1 vlager-if1<BR>
191.72.1.2 vstout vstout.vbrew.com<BR>
191.72.1.3 vale vale.vbrew.com<BR>
#<BR>
191.72.2.1 vlager-if2<BR>
191.72.2.2 vbeaujolais vbeaujolais.vbrew.com<BR>
191.72.2.3 vbardolino vbardolino.vbrew.com<BR>
191.72.2.4 vchianti vchianti.vbrew.com</P>
<P>&nbsp;</P></DIR>
</DIR>

<P>Del mismo modo que con las direcciones IP, a veces tambi&eacute;n puede interesarle usar nombres simb&oacute;licos para los n&uacute;meros de red. Con este objeto, el fichero hosts tiene un compa&ntilde;ero llamado /etc/networks, que asocia nombres de red con los n&uacute;meros correspondientes y viceversa. En la Cervecera Virtual, podr&iacute;amos instalar un fichero networks como &eacute;ste:4</P><DIR>
<DIR>

<P># /etc/networks para la Cervecera Virtual<BR>
brew-net 191.72.1.0<BR>
wine-net 191.72.2.0</P>
<P>&nbsp;</P></DIR>
</DIR>

</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="5.7"></a>5.7 Configuraci&oacute;n de la Interface para IP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Una vez ha configurado su hardware seg&uacute;n se ha explicado en el cap&iacute;tulo 
  anterior, debe asegurarse de que el software de red del n&uacute;cleo conoce 
  esos dispositivos. Hay una serie de comandos que se usan con objeto de configurar 
  las interfaces de red e inicializar la tabla de encaminamiento. Esas tareas 
  son ejecutadas generalmente por la macro rc.inet1 cada vez que el sistema es 
  arrancado. Las herramientas b&aacute;sicas son ifconfig (donde "if" significa 
  interface), y route.</P>
<P>_____________________________________________<BR>
  4 Es importante notar que los nombres en networks no deben coincidir con nombres 
  de m&aacute;quinas en hosts, o algunos programas pueden producir resultados 
  extra&ntilde;os.</P>
<P>&nbsp;</P>
<P>ifconfig se usa para dar acceso al n&uacute;cleo a una interface. Esto incluye 
  la asignaci&oacute;n de una direcci&oacute;n IP y otros par&aacute;metros, as&iacute; 
  como la activaci&oacute;n de la interface. Por activaci&oacute;n nos referimos 
  a permitir que el n&uacute;cleo env&iacute;a y recibe datagramas IP a trav&eacute;s 
  de la interface. </P>
<P>El modo mas sencillo de invocar esta herramienta es</P>
<DIR> 
  <DIR> 
    <P>ifconfig interface direccion-ip</P>
  </DIR>
</DIR>
<P>que asigna direccion-ip a interface y la activa. Los otros par&aacute;metros 
  toman valores asignados por defecto. Por ejemplo, la mascara de subred toma 
  el valor correspondiente al tipo de red al que pertenece la direcci&oacute;n 
  IP. As&iacute;, tendr&iacute;amos 255.255.0.0 para una direcci&oacute;n de clase 
  B. ifconfig es descrito en detalle al final del cap&iacute;tulo.</P>
<P>&nbsp;</P>
<P>route permite a&ntilde;adir o quitar rutas de la tabla de encaminamiento del 
  n&uacute;cleo. Se puede invocar como</P>
<DIR> 
  <DIR> 
    <P>route [add|del] destino</P>
  </DIR>
</DIR>
<P>donde los argumentos add y del determinan, respectivamente si se debe a&ntilde;adir 
  o borrar la ruta hacia destino.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="5.7.1"></a>5.7.1 La Interface de Bucle o Loopback</P>
</u></I> 
<P>La primera interface en ser activada es la interface de lazo o loopback:</P>
<DIR> 
  <DIR> 
    <P># ifconfig lo 127.0.0.1</P>
  </DIR>
</DIR>
<P>Ocasionalmente, tambi&eacute;n vera que el nombre comod&iacute;n localhost 
  es usado en vez de la direcci&oacute;n de IP. ifconfig buscara el nombre en 
  el fichero hosts que debe contener un registro declarando localhost como nombre 
  valido para la direcci&oacute;n 127.0.0.1:</P>
<DIR> 
  <DIR> 
    <P># Registro ejemplo de localhost en /etc/hosts<BR>
      localhost 127.0.0.1</P>
  </DIR>
</DIR>
<P>Para ver la configuraci&oacute;n de una interface, basta ejecutar el programa 
  ifconfig usando el nombre de la interface como argumento:</P>
<DIR> 
  <DIR> 
    <P>$ ifconfig lo<BR>
      lo Link encap Local Loopback<BR>
      inet addr 127.0.0.1 Bcast [NONE SET] Mask 255.0.0.0<BR>
      UP BROADCAST LOOPBACK RUNNING MTU 2000 Metric 1<BR>
      RX packets 0 errors 0 dropped 0 overrun 0<BR>
      TX packets 0 errors 0 dropped 0 overrun 0</P>
  </DIR>
</DIR>
<P>Como podr&aacute; observar, la mascara asignada a la interface de lazo es 255.0.0.0, 
  debido a que 127.0.0.1 es una direcci&oacute;n de clase A. La interface no tiene 
  establecida ninguna direcci&oacute;n de difusi&oacute;n, ya que &eacute;sta 
  no suele ser demasiado &uacute;til para lazos. Sin embargo, si va a ejecutar 
  el demonio rwhod en su m&aacute;quina, tendr&aacute; seguramente que fijar la 
  direcci&oacute;n de difuon del dispositivo de lazo para que rwho funcione correctamente. 
  El modo de fijar dicha direcci&oacute;n se explica en la secci&oacute;n "5.8", 
  mas abajo.</P>
<P>Ahora, ya casi puede empezar a jugar con su "mini-red". Solo resta a&ntilde;adir 
  una entrada en la tabla de encaminamiento que comunique al IP que puede usar 
  esa interface como ruta hacia 127.0.0.1. Para llevar esto a cabo, basta escribir:</P>
<DIR> 
  <DIR> 
    <P># route add 127.0.0.1</P>
  </DIR>
</DIR>
<P>Tambi&eacute;n aqu&iacute; puede usar localhost en lugar de la direcci&oacute;n 
  IP.</P>
<P>Lo siguiente es comprobar que todo funciona como es debido, por ejemplo usando 
  ping. </P>
<P>ping es el equivalente a un sonar en una red5 y se usa para verificar que una 
  direcci&oacute;n dada es accesible y para medir el retraso entre el env&iacute;o 
  de un datagrama y su recepci&oacute;n de vuelta. Este tiempo es conocido como 
  tiempo de ida y vuelta.</P>
<DIR> 
  <DIR> 
    <P># ping localhost<BR>
      PING localhost (127.0.0.1): 56 data bytes<BR>
      64 bytes from 127.0.0.1: icmp_seq=0 ttl=32 time=1 ms<BR>
      64 bytes from 127.0.0.1: icmp_seq=1 ttl=32 time=0 ms<BR>
      64 bytes from 127.0.0.1: icmp_seq=2 ttl=32 time=0 ms<BR>
      ^C</P>
    <P>--- localhost ping statistics ---<BR>
      3 packets transmitted, 3 packets received, 0% packet loss<BR>
      round-trip min/avg/max = 0/0/1 ms</P>
  </DIR>
</DIR>
<P>Cuando se ejecuta ping seg&uacute;n se muestra aqu&iacute;, la emisi&oacute;n 
  de paquetes continua a menos que sea interrumpida por el usuario. El ^C marca 
  el momento en el que se apret&oacute; Ctrl-C.</P>
<P>_____________________________________________<BR>
  5 ¿Alguno recuerda "Echoes" de Pink Floyd?</P>
<P>&nbsp;</P>
<P>Este ejemplo muestra que los paquetes dirigidos a la m&aacute;quina 127.0.0.1 
  est&aacute;n siendo entregados correctamente y la respuesta a ping es recibida 
  de forma casi instant&aacute;nea. Esto significa que ha establecido con &eacute;xito 
  su primera interface de red.</P>
<P>Si la salida de ping no se parece a la de m&aacute;s arriba, tiene usted problemas. 
  Compruebe la posibilidad de que alg&uacute;n fichero no haya sido instalado 
  correctamente. Compruebe que los ejecutables ifconfig y route son compatibles 
  con la versi&oacute;n del n&uacute;cleo que usa y sobre todo que &eacute;ste 
  ha sido compilado con la opci&oacute;n de red activada (esto se puede ver comprobando 
  que existe el directorio /proc/net). Si el mensaje de error es "network unreachable"(red 
  inaccesible), seguramente ejecuto el comando route incorrectamente. Aseg&uacute;rese 
  de que es la misma direcci&oacute;n que la que uso con ifconfig.</P>
<P>Los pasos descritos arriba son suficientes para poder ejecutar aplicaciones 
  de red en una m&aacute;quina aislada. Una vez esas l&iacute;neas son a&ntilde;adidas 
  a rc.inet1 y despu&eacute;s de asegurarse de que las dos macros rc.inet son 
  ejecutadas desde /etc/rc, puede proceder a rearrancar su m&aacute;quina y probar 
  las diferentes aplicaciones de red. Por ejemplo "telnet localhost " deber&iacute;a 
  establecer una conexi&oacute;n telnet con su m&aacute;quina, pidi&eacute;ndole 
  el nombre de usuario y la contrase&ntilde;a.</P>
<P>Sin embargo, la interface de lazo es &uacute;til, no solo como ejemplo en libros 
  de redes, o como m&eacute;todo de pruebas durante el desarrollo: tambi&eacute;n 
  la utilizan algunas aplicaciones como modo normal de operacion.6 Por ello, debe 
  usted configurarla siempre, independientemente de que su m&aacute;quina este 
  conectada a una red o no.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="5.7.2"></a>5.7.2 Interfaces Ethernet</P>
</u></I> 
<P>La configuraci&oacute;n de una interface Ethernet es mas o menos igual que 
  la de la interface de lazo. Solo requiere algunos par&aacute;metros mas cuando 
  esta usando varias subredes.</P>
<P>En la Cervecera Virtual, hemos dividido la red IP, originalmente de clase B, 
  en subredes de clase C. Para que la interface reconozca esto, el comando usando 
  ifconfig seria:</P>
<DIR> 
  <DIR> 
    <P># ifconfig eth0 vstout netmask 255.255.255.0</P>
  </DIR>
</DIR>
<P>Esto asigna a la interface eth0 la direcci&oacute;n IP de la m&aacute;quina 
  vstout(191.72.1.2). Si hubi&eacute;semos omitido la mascara de red, ifconfig 
  habr&iacute;a deducido la mascara de la clase de la red IP, tomando por tanto 
  255.255.0.0. Una comprobaci&oacute;n r&aacute;pida nos da:</P>
<DIR> 
  <DIR> 
    <P># ifconfig eth0<BR>
      eth0 Link encap 10Mps Ethernet HWaddr 00:00:C0:90:B3:42<BR>
      inet addr 191.72.1.2 Bcast 191.72.1.255 Mask 255.255.255.0<BR>
      UP BROADCAST RUNNING MTU 1500 Metric 1<BR>
      RX packets 0 errors 0 dropped 0 overrun 0<BR>
      TX packets 0 errors 0 dropped 0 overrun 0</P>
  </DIR>
</DIR>
<P>_____________________________________________<BR>
  6 Por ejemplo, todas las aplicaciones basadas en RPC utilizan la interface de 
  lazo para registrarse en el demonio portmapper(mapa de puertos) durante el arranque.</P>
<P>&nbsp;</P>
<P>Puede ver que ifconfig ha fijado la direcci&oacute;n de difusi&oacute;n autom&aacute;ticamente 
  (el campo Bcast de arriba) a su valor usual, que es el de la red con todos los 
  bits de la m&aacute;quina activados. Adem&aacute;s se fija la unidad de transferencia 
  de mensajes (tama&ntilde;o m&aacute;ximo que el n&uacute;cleo va a generar para 
  esa interface) a un m&aacute;ximo de 1500 bytes. Todos estos valores pueden 
  ser especificados mediante opciones especiales que se explican mas tarde.</P>
<P>De forma semejante al caso de la interface de lazo, debe tambi&eacute;n ahora 
  establecer una entrada en la tabla de encaminamiento que informe al n&uacute;cleo 
  de que la red es accesible mediante eth0. Para la Cervecera Virtual, ejecutar&iacute;a</P>
<DIR> 
  <DIR> 
    <P># route add -net 191.72.1.0</P>
  </DIR>
</DIR>
<P>Inicialmente podr&iacute;a parecer algo m&aacute;gico, pues no esta claro como 
  route detecta cual es la interface que debe usar. Sin embargo el truco es sencillo: 
  el n&uacute;cleo comprueba todas las interfaces que han sido configuradas hasta 
  el momento y compara la direcci&oacute;n de destino (191.72.1.0 en este caso) 
  con la parte de red de las direcciones de las interfaces (o, lo que es lo mismo, 
  ejecuta un "Y" l&oacute;gico de la direcci&oacute;n de la interface y la mascara 
  de red). La &uacute;nica interface que cumple esto es eth0.</P>
<P>Veamos, ¿que significa la opci&oacute;n -net? Esta opci&oacute;n es necesaria 
  porque el programa route es capaz de trabajar con rutas a redes o a m&aacute;quinas 
  concretas (como vimos arriba en el caso de localhost). Cuando la direcci&oacute;n 
  es dada en notaci&oacute;n de cuaterna, intenta adivinar si se trata de una 
  red o una m&aacute;quina fij&aacute;ndose en los bits de m&aacute;quina de la 
  direcci&oacute;n. Si esa parte es nula, route asume que se trata de una red, 
  y de otro modo lo toma como direcci&oacute;n de una m&aacute;quina. Por tanto, 
  route supondr&iacute;a que 191.72.1.0 es la direcci&oacute;n de una m&aacute;quina 
  en vez de una red, debido a que no sabe que hemos dividido el espacio de direcciones 
  en subredes. Por tanto hemos de dec&iacute;rselo de forma expl&iacute;cita utilizando 
  el indicador -net.</P>
<P>Por supuesto, escribir el comando route es tedioso y susceptible de muchos 
  errores de escritura. Un m&eacute;todo mas conveniente es usar los nombres definidos 
  en /etc/networks como vimos mas arriba. Esto hace el comando mas inteligible; 
  de este modo incluso podemos evitar escribir el indicador -net, porque route 
  sabe que 191.72.1.0 representa una red.</P>
<DIR> 
  <DIR> 
    <P># route add brew-net</P>
  </DIR>
</DIR>
<P>Una vez finalizados los pasos b&aacute;sicos de configuraci&oacute;n, debemos 
  asegurarnos de que la interface Ethernet esta funcionando correctamente. Elija 
  una m&aacute;quina de su red, por ejemplo vlager, y escriba</P>
<DIR> 
  <DIR> 
    <P># ping vlager<BR>
      PING vlager: 64 byte packets<BR>
      64 bytes from 191.72.1.1: icmp_seq=0. time=11. Ms<BR>
      64 bytes from 191.72.1.1: icmp_seq=1. time=7. Ms<BR>
      64 bytes from 191.72.1.1: icmp_seq=2. time=12. Ms<BR>
      64 bytes from 191.72.1.1: icmp_seq=3. time=3. Ms<BR>
      ^C</P>
    <P>----vstout.vbrew.com PING Statistics----<BR>
      4 packets transmitted, 4 packets received, 0% packet loss<BR>
      round-trip (ms) min/avg/max = 3/8/12</P>
  </DIR>
</DIR>
<P>Si el resultado no es similar a &eacute;ste, algo va mal, obviamente. Una tasa 
  de perdida de paquetes7 inusualmente alta, sugiere un problema de hardware, 
  como terminaciones en mal estado o incluso la ausencia de las mismas, etc. Si 
  no recibe ning&uacute;n paquete, debe comprobar la configuraci&oacute;n de la 
  interface mediante netstat. Las estad&iacute;sticas de paquetes producidas por 
  ifconfig le indican si alg&uacute;n paquete ha sido enviado mediante esa interface. 
  Si tiene acceso a una m&aacute;quina remota, tambi&eacute;n deber&iacute;a dirigirse 
  a esa m&aacute;quina y comprobar las estad&iacute;sticas de la interface. De 
  este modo puede determinar exactamente en que momento se han descartado los 
  paquetes. Adem&aacute;s, debe consultar la informaci&oacute;n de encaminamiento 
  con route para ver si ambas m&aacute;quinas han registrado &eacute;sta correctamente 
  en sus tablas. route imprime la tabla de encaminamiento del n&uacute;cleo completa 
  si se ejecuta sin argumentos (la opci&oacute;n -n hace que utilice la notaci&oacute;n 
  de cuaternas en vez de los nombres de las m&aacute;quinas):</P>
<DIR> 
  <DIR> 
    <P># route -n<BR>
      Kernel routing table<BR>
      Destination Gateway Genmask Flags Metric Ref Use Iface<BR>
      127.0.0.1 * 255.255.255.255 UH 1 0 112 lo<BR>
      191.72.1.0 * 255.255.255.0 U 1 0 10 eth0</P>
  </DIR>
</DIR>
<P>El significado de cada uno de los campos se detalla mas adelante en la secci&oacute;n 
  "Comprobaci&oacute;n mediante netstat ". La columna Flags contiene una lista 
  de los indicadores activos en cada interface. U indica que la interface esta 
  activa y H indica que la direcci&oacute;n de destino es una m&aacute;quina. 
  Si encuentra que el indicador H se ha activado para una ruta que pretend&iacute;a 
  usar para una red, entonces debe usar la opci&oacute;n -net con el comando route. 
  Para comprobar si alguna ruta esta siendo usada o no, debe mirar si el campo 
  Use en la pen&uacute;ltima columna se incrementa entre dos ejecuciones sucesivas 
  de ping.</P>
<P>_____________________________________________<BR>
  7 N. del T.: Del ingl&eacute;s packet loss rate</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="5.7.3"></a>5.7.3 Encaminamiento a trav&eacute;s de una Pasarela</P>
</u></I> 
<P>En la secci&oacute;n anterior, cubr&iacute; solo el caso en el que la m&aacute;quina 
  solo tiene una &uacute;nica Ethernet. Frecuentemente, es posible encontrar redes 
  conectadas unas a otras a trav&eacute;s de pasarelas o m&aacute;quinas de enlace. 
  Estas pasarelas pueden simplemente unir dos o mas Ethernets, pero pueden tambi&eacute;n 
  servir de enlace con el exterior, con la Internet. Para usar una pasarela, es 
  necesario a&ntilde;adir informaci&oacute;n adicional a la capa de red.</P>
<P>Por ejemplo, las Ethernets de la Cervecera Virtual y de la Vinatera Virtual 
  est&aacute;n unidas a trav&eacute;s de una pasarela, vlager. Suponiendo que 
  la m&aacute;quina vlager ha sido configurada ya, solo tenemos que a&ntilde;adir 
  otro registro a la tabla de encaminamiento de la m&aacute;quina vstout que le 
  comunique al n&uacute;cleo que puede acceder a todos las m&aacute;quinas de 
  la red de la Vinatera a trav&eacute;s de vlager. La orden apropiada usando route 
  se muestra a continuaci&oacute;n; la palabra clave gw indica que el argumento 
  siguiente es una pasarela:</P>
<DIR> 
  <DIR> 
    <P># route add wine-net gw vlager</P>
  </DIR>
</DIR>
<P>Por supuesto, cualquier host en la red de la Vinatera al que quiera dirigirse 
  debe tener un registro an&aacute;logo referido a la red de la Cervecera, o de 
  otro modo solo podr&iacute;a enviar datos de vstout a vbardolino, pero la respuesta 
  del segundo ir&iacute;a a parar al cubo de la basura.</P>
<P>Este ejemplo describe &uacute;nicamente una pasarela que conmuta paquetes entre 
  dos redes Ethernet aisladas. Supongamos ahora que vlager tambi&eacute;n tiene 
  una conexi&oacute;n a la Internet (digamos que a trav&eacute;s de un enlace 
  SLIP). Nos gustar&iacute;a que los datagramas destinados a cualquier direcci&oacute;n 
  fuera de la red de la Cervecera fueran entregados a vlager. Esto se puede conseguir 
  convirti&eacute;ndolo en la pasarela por defecto para vstout:</P>
<DIR> 
  <DIR> 
    <P># route add default gw vlager</P>
  </DIR>
</DIR>
<P>El nombre de red default es una abreviatura que representa la red 0.0.0.0, 
  o ruta por defecto. No es necesario a&ntilde;adir este nombre a /etc/networks, 
  porque esta informaci&oacute;n esta contenida en el c&oacute;digo de route.</P>
<P>Una tasa alta de perdida de paquetes usando ping hacia una m&aacute;quina situada 
  detr&aacute;s de una o mas pasarelas, puede deberse a que la red esta muy congestionada. 
  La p&eacute;rdida de paquetes no se debe tanto a deficiencias t&eacute;cnicas 
  como a exceso temporal de carga en las m&aacute;quinas que act&uacute;an de 
  enlace, provocando retrasos o incluso el descarte de datagramas entrantes.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="5.7.4"></a>5.7.4 Configuraci&oacute;n de una Pasarela</P>
</u></I> 
<P>Configurar una m&aacute;quina para conmutar paquetes entre dos Ethernets es 
  bastante sencillo. Suponga que nos encontramos en vlager, que contiene dos tarjetas 
  Ethernet, respectivamente conectadas a cada una de las dos redes. Todo lo que 
  necesitara hacer es configurar ambas interfaces de forma separada, d&aacute;ndole 
  a cada una su direcci&oacute;n IP correspondiente, y eso es todo.</P>
<P>Es bastante &uacute;til incluir la informaci&oacute;n de ambas interfaces en 
  el fichero hosts del modo indicado a continuaci&oacute;n, de forma que tengamos 
  nombres para referirnos a ellas tambi&eacute;n:</P>
<DIR> 
  <DIR> 
    <P>191.72.1.1 vlager vlager.vbrew.com<BR>
      191.72.1.1 vlager-if1<BR>
      191.72.2.1 vlager-if2</P>
  </DIR>
</DIR>
<P>La secuencia de comandos necesaria para establecer ambas interfaces ser&aacute; 
  por tanto:</P>
<DIR> 
  <DIR> 
    <P># ifconfig eth0 vlager-if1<BR>
      # ifconfig eth1 vlager-if2<BR>
      # route add brew-net<BR>
      # route add wine-net</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="5.7.5"></a>5.7.5 La Interface PLIP</P>
</u></I> 
<P>Si usa un enlace PLIP para conectar dos m&aacute;quinas, las cosas son un poco 
  diferentes de lo visto para una Ethernet. En caso de PLIP se trata de un enlace 
  conocido como punto-a-punto, porque solo requiere dos m&aacute;quinas ("puntos"), 
  en contraposici&oacute;n a las redes de difusi&oacute;n.</P>
<P>A modo de ejemplo, consideremos un ordenador port&aacute;til de un empleado 
  en la Cervecera Virtual que se conecta a vlager mediante PLIP. El port&aacute;til 
  se llama vlite, y tiene un &uacute;nico puerto paralelo. Durante el arranque, 
  este puerto ser&aacute; registrado como plip1. Para activar el enlace, ha de 
  configurar la interface plip1 mediante los siguientes comandos:</P>
<DIR> 
  <DIR> 
    <P># ifconfig plip1 vlite pointopoint vlager<BR>
      # route add default gw vlager</P>
  </DIR>
</DIR>
<P>El primer comando configura la interface, dici&eacute;ndole al n&uacute;cleo 
  que se trata de un enlace punto-a-punto, donde la parte remota tiene la direcci&oacute;n 
  vlager. El segundo instala la ruta por defecto que usa a vlager como pasarela. 
  En vlager, se necesita ejecutar ifconfig con argumentos similares para activar 
  el enlace (en este caso no es necesario usar route):</P>
<DIR> 
  <DIR> 
    <P># ifconfig plip1 vlager pointopoint vlite</P>
  </DIR>
</DIR>
<P>Es interesante notar que la interface plip1 en vlager no necesita tener una 
  direcci&oacute;n IP diferente, sino que puede usar la misma direcci&oacute;n 
  191.72.1.1.8</P>
<P>Una vez hemos configurado el encaminamiento desde el port&aacute;til a la red 
  de la Cervecera, solo resta arbitrar un modo para que cualquier m&aacute;quina 
  en esa red pueda acceder a vlite. Un modo particularmente enrevesado seria a&ntilde;adir 
  una ruta a las tablas de encaminamiento de cada una de las m&aacute;quinas de 
  la red para usar vlager como pasarela hacia vlite:</P>
<DIR> 
  <DIR> 
    <P># route add vlite gw vlager</P>
  </DIR>
</DIR>
<P>Una opci&oacute;n mejor cuando tenemos que trabajar con rutas temporales es 
  usar encaminamiento din&aacute;mico. Una forma de conseguirlo es usando gated, 
  un demonio de encaminamiento, que deber&aacute; instalar en cada una de las 
  m&aacute;quinas de la red de modo que distribuya la informaci&oacute;n de encaminamiento 
  de forma din&aacute;mica. La forma mas sencilla, sin embargo, consiste en usar 
  ARP sustituto (proxy ARP). Con ARP sustituto, vlager responde a cualquier pregunta 
  ARP dirigida a vlite enviando su propia direcci&oacute;n Ethernet. El efecto 
  conseguido es que todos los paquetes dirigidos a vlite terminan yendo a vlager, 
  que se encarga de reenvi&aacute;rselos al port&aacute;til. Volveremos a hablar 
  de ARP sustituto en la secci&oacute;n "Comprobaci&oacute;n de las Tablas ARP", 
  mas adelante.</P>
<P>Las versiones futuras de Net-3 contendr&aacute;n una herramienta llamada plipconfig 
  capaz de fijar el n&uacute;mero de IRQ del puerto de la impresora. Mas tarde 
  se sustituir&aacute; por un comando ifconfig mas general.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="5.7.6"></a>5.7.6 Las Interfaces SLIP y PPP</P>
</u></I> 
<P>A pesar de que los enlaces SLIP y PPP son simples enlaces punto-a-punto igual 
  que las conexiones PLIP, hay mucho mas que decir de ellas. Generalmente, el 
  establecimiento de un enlace SLIP incluye una llamada a un lugar de conexi&oacute;n 
  remoto y el establecimiento del modo SLIP en la l&iacute;nea de comunicaciones 
  serie. El uso de PPP es similar. Las herramientas necesarias para establecer 
  un enlace SLIP o PPP se describen en los cap&iacute;tulos 7 y 8.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="5.7.7"></a>5.7.7 La Interface Comod&iacute;n</P>
</u></I> 
<P>La interface comod&iacute;n (dummy) parece un tanto ex&oacute;tica y sin embargo 
  es bastante &uacute;til. Resulta especialmente ventajosa para m&aacute;quinas 
  aisladas que se conectan a una red IP mediante un enlace telef&oacute;nico. 
  Se trata en realidad de m&aacute;quinas que trabajan de forma aislada la mayor 
  parte del tiempo.</P>
<P>_____________________________________________<BR>
  8 Simplemente por precauci&oacute;n, deber&iacute;a configurar de todos modos 
  sus enlaces PLIP o SLIP una vez que ha completado la configuraci&oacute;n de 
  la tabla de encaminamiento de las Ethernets. Con algunos n&uacute;cleos mas 
  antiguos, la tabla de encaminamiento para la red puede acabar apuntando a su 
  enlace punto-a-punto.</P>
<P>&nbsp;</P>
<P>El dilema con las m&aacute;quinas aisladas es que el &uacute;nico dispositivo 
  activo es el de lazo, al que generalmente se le asigna la direcci&oacute;n 127.0.0.1. 
  En ocasiones, sin embargo, le resultara necesario enviar datos a la direcci&oacute;n 
  IP "oficial" de la m&aacute;quina. Supongamos, por ejemplo, el caso del port&aacute;til 
  vlite cuando no esta conectado a ninguna red. Una aplicaci&oacute;n en vlite 
  que busque su direcci&oacute;n IP en el fichero /etc/hosts dar&aacute; como 
  resultado 191.72.1.65, y por tanto intentara enviar los datos a esa direcci&oacute;n. 
  Como la &uacute;nica interface activa en ese momento es la de lazo, el n&uacute;cleo 
  no sabe que la direcci&oacute;n se refiere a la misma m&aacute;quina. En consecuencia 
  el n&uacute;cleo descarta el datagrama y genera un error en la aplicaci&oacute;n.</P>
<P>En esta situaci&oacute;n es cuando la interface comod&iacute;n es &uacute;til, 
  resolviendo el dilema actuando como alter ego de la interface de lazo. En el 
  caso de vlite, simplemente debe asignarle la direcci&oacute;n 191.72.1.65 y 
  a&ntilde;adir una ruta que apunte a ella. La forma correcta es pues:</P>
<DIR> 
  <DIR> 
    <P># ifconfig dummy vlite<BR>
      # route add vlite</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="5.8"></a>5.8 Todo sobre ifconfig</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El programa ifconfig tiene muchos mas par&aacute;metros que los descritos hasta ahora. Generalmente se ejecuta en la forma:</P><DIR>
<DIR>

<P>ifconfig interface [[-net|-host] direcci&oacute;n [par&aacute;metros ]]</P></DIR>
</DIR>

<P>interface es el nombre de la interface y direcci&oacute;n es la direcci&oacute;n IP que se asigna a dicha interface. La direcci&oacute;n puede estar en forma de cuaterna o usando un nombre que ifconfig buscara en /etc/hosts y /etc/networks. La opciones -net y -host fuerzan a ifconfig a tratar las direcciones dadas como direcciones de red o de m&aacute;quina respectivamente.</P>
<P>Si ifconfig es ejecutado a&ntilde;adiendo &uacute;nicamente el nombre de la interface, presentar&aacute; la informaci&oacute;n de la configuraci&oacute;n de dicha interface. Si se ejecuta sin par&aacute;metros, presenta todas las interfaces configuradas hasta el momento; usando la opci&oacute;n -a fuerza a ifconfig a incluir la informaci&oacute;n de las interfaces inactivas. A modo de ejemplo, la consulta de la configuraci&oacute;n de la interface Ethernet eth0 seria:</P><DIR>
<DIR>

<P># ifconfig eth0<BR>
eth0 Link encap 10Mbps Ethernet HWaddr 00:00:C0:90:B3:42<BR>
inet addr 191.72.1.2 Bcast 191.72.1.255 Mask 255.255.255.0<BR>
UP BROADCAST RUNNING MTU 1500 Metric 0<BR>
RX packets 3136 errors 217 dropped 7 overrun 26<BR>
TX packets 1752 errors 25 dropped 0 overrun 0</P></DIR>
</DIR>

<P>Los campos MTU y Metric informan sobre los valores actuales de la MTU (Unidad M&aacute;xima de Transferencia) y de la m&eacute;trica para una interface dada. El valor de la m&eacute;trica es usado tradicionalmente por algunos sistemas operativos para calcular el coste de una ruta. Linux no usa este valor por el momento, pero lo define por razones de compatibilidad.</P>
<P>Las l&iacute;neas RX y TX dan idea de los paquetes recibidos o transmitidos sin errores, del n&uacute;mero de errores ocurridos, de cuantos paquetes han sido descartados, seguramente por memoria insuficiente, y cuantos han sido perdidos por desbordamiento, condici&oacute;n que ocurre cuando la recepci&oacute;n de paquetes es demasiado r&aacute;pida y el n&uacute;cleo es incapaz de dar servicio al paquete anterior antes de la llegada del nuevo paquete. Los nombres de los campos que genera ifconfig coinciden mas o menos con los par&aacute;metros con los que se puede ejecutar; estos par&aacute;metros son explicados mas abajo.</P>
<P>A continuaci&oacute;n tenemos una lista de los par&aacute;metros reconocidos por ifconfig. Los nombres de los indicadores correspondientes aparecen entre par&eacute;ntesis. Las opciones que simplemente activan alguna caracter&iacute;stica pueden usarse para desactivarla precedi&eacute;ndolas de un gui&oacute;n (-).</P>
</FONT><B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>up</b></font><FONT FACE="Verdana" SIZE=2><BR>
Marca la interface como "up" o activa, es decir, disponible para que sea usada por la capa IP. Esta opci&oacute;n va impl&iacute;cita cuando lo que se da en la l&iacute;nea de comandos es una direcci&oacute;n . Tambi&eacute;n permite reactivar una interface que se ha desactivado temporalmente mediante la opci&oacute;n "down". Esta opci&oacute;n corresponde a los indicadores UP RUNNING.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>down</b></font><FONT FACE="Verdana" SIZE=2><BR>
Marca la interface como "down" o inactiva, es decir, inaccesible a la capa IP. Esto inhabilita cualquier trafico IP a trav&eacute;s de la interface. Es importante darse cuenta que esto no borra los registros de la tabla de encaminamiento correspondientes a esa interface de forma autom&aacute;tica. Si pretende desactivar una interface de forma permanente, deber&iacute;a borrar estos registros de encaminamiento, aportando rutas alternativas si es posible.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>netmask mascara<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esto asigna una mascara de subred a una interface. Se puede dar como un valor de 32 bits en hexadecimal precedido del prefijo 0x, o en notaci&oacute;n de cuaterna usando n&uacute;meros decimales separados por puntos.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>pointopoint direcci&oacute;n<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esta opci&oacute;n se usa para enlaces IP punto-a-punto en los que intervienen &uacute;nicamente dos m&aacute;quinas. Esta opci&oacute;n es necesaria para, por ejemplo, configurar las interfaces SLIP o PLIP.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>ifconfig <BR>
</b></font><FONT FACE="Verdana" SIZE=2>confirma el establecimiento de una direcci&oacute;n punto-a-punto incluyendo el indicador POINTOPOINT.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>broadcast direcci&oacute;n<BR>
</b></font><FONT FACE="Verdana" SIZE=2>La direcci&oacute;n de difusi&oacute;n se obtiene, generalmente, usando la parte de red de la direcci&oacute;n y activando todos los bits de la parte correspondiente a la m&aacute;quina. Algunas implementaciones de los protocolos IP utilizan un esquema diferente; esta opci&oacute;n proporciona un m&eacute;todo para adaptarse a esos entornos mas raros. (ifconfig confirma el establecimiento de una direcci&oacute;n de difusi&oacute;n incluyendo el indicador BROADCAST.)</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>metric n&uacute;mero<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esta opci&oacute;n puede ser usada para asignar un valor de m&eacute;trica a la tabla de encaminamiento creada para la interface. Esta m&eacute;trica es usada por el Protocolo de Informaci&oacute;n de Encaminamiento (RIP, como ya hemos visto en cap&iacute;tulos anteriores) para construir las tablas de encaminamiento para la red. El valor usado por defecto por ifconfig es cero. Si no esta ejecutando un demonio RIP, no necesita usar esta opci&oacute;n para nada; si por el contrario si lo usa, al menos solo tendr&aacute; que modificar este valor en contadas ocasiones.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>mtu bytes<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esto fija la unidad m&aacute;xima de transferencia, o lo que es lo mismo, el m&aacute;ximo n&uacute;mero de octetos que la interface es capaz de manejar en una &uacute;nica transacci&oacute;n. Para Ethernets, la MTU toma el valor 1500 por defecto; para interfaces tipo SLIP, el valor por defecto es 296.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>arp<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esta opci&oacute;n es especifica de redes de difusi&oacute;n como las Ethernets o las de radio-paquetes. Permite el uso de ARP, el Protocolo de Resoluci&oacute;n de Direcciones, para detectar la direcci&oacute;n f&iacute;sica de las m&aacute;quinas conectadas a la red. Para redes de difusi&oacute;n, esta opci&oacute;n es habilitada por defecto.</font></P><FONT FACE="Verdana" SIZE=2>
<P>ifconfig avisa que ARP ha sido inhabilitado mediante el indicador NOARP.</P>
<P>-arp Inhabilita el uso de ARP para esta interface.</P>
</FONT><B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>promisc<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Pone la interface en modo promiscuo. En una red de difusi&oacute;n, esto hace que la interface reciba todos los paquetes, independientemente de si eran para ella o no. Esto permite el an&aacute;lisis del trafico de red utilizando utilidades como filtros de paquetes, tambi&eacute;n llamado fisgar 9. Se trata de una buena t&eacute;cnica para localizar problemas de red que de otra forma resultan dif&iacute;ciles.</font></P><FONT FACE="Verdana" SIZE=2>
<P>_____________________________________________<BR>
9 N. del T.: Del ingl&eacute;s snooping</P>
<P>&nbsp;</P>
<P>Por otro lado, esto tambi&eacute;n posibilita ataques, permitiendo al atacante analizar el tr&aacute;fico de la red en busca de claves u otras cosas peligrosas. Una protecci&oacute;n posible contra este tipo de ataques es impedir que cualquiera pueda conectarse a la Ethernet. Otra es la utilizaci&oacute;n de protocolos de autentificaci&oacute;n seguros como Kerberos, o los programas SRA de ingreso en el sistema.10</P>
<P>Esta opci&oacute;n corresponde al indicador PROMISC.</P>
<P>-promisc Desactiva el modo promiscuo.</P>
</FONT><B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>allmulti</b></font><FONT FACE="Verdana" SIZE=2><BR>
Las direcciones de env&iacute;o m&uacute;ltiple son un tipo de difusi&oacute;n pero a un grupo de m&aacute;quinas que no tienen necesariamente que pertenecer a la misma subred. El n&uacute;cleo no soporta todav&iacute;a direcciones de env&iacute;o m&uacute;ltiple o de multidifusion11 .</font></P><FONT FACE="Verdana" SIZE=2>
<P>Esta opci&oacute;n corresponde al indicador ALLMULTI.</P>
<P>-allmulti Desactiva las direcciones de env&iacute;o m&uacute;ltiple.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="5.9"></a>5.9 Comprobaci&oacute;n mediante netstat</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>A continuaci&oacute;n describir&eacute; una herramienta &uacute;til para comprobar 
  la configuraci&oacute;n y actividad de su red. Se llama netstat, aunque se trata 
  en realidad de una colecci&oacute;n de herramientas combinadas. Describiremos 
  cada una de las funciones en las secciones siguientes.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="5.9.1"></a>5.9.1 Consulta de la Tabla de Encaminamiento</P>
</u></I> 
<P>Si ejecuta netstat usando el indicador -r, puede ver la informaci&oacute;n 
  de la tabla de encaminamiento del n&uacute;cleo igual que hemos venido haciendo 
  hasta ahora con route. Para vstout, tendr&iacute;amos:</P>
<DIR> 
  <DIR> 
    <P># netstat -nr<BR>
      Kernel routing table<BR>
      Destination Gateway Genmask Flags Metric Ref Use Iface<BR>
      127.0.0.1 * 255.255.255.255 UH 1 0 50 lo<BR>
      191.72.1.0 * 255.255.255.0 U 1 0 478 eth0<BR>
      191.72.2.0 191.72.1.1 255.255.255.0 UGN 1 0 250 eth0</P>
  </DIR>
</DIR>
<P>La opci&oacute;n -n hace que netstat imprima las direcciones IP en notaci&oacute;n 
  de cuaterna en vez de usar los nombres simb&oacute;licos de las m&aacute;quinas 
  o las redes. Esto es especialmente &uacute;til si pretende evitar consultas 
  para esos nombres a trav&eacute;s de la red (por ejemplo consultas a un servidor 
  NFS o NIS).</P>
<P>_____________________________________________<BR>
  10 SRA se puede obtener del servidor ftp.tamu.edu en el directorio /pub/sec/TAMU<BR>
  11 N.T.: Las versiones actuales del n&uacute;cleo (2.X) si permiten el uso de 
  direcciones de env&iacute;o m&uacute;ltiple.</P>
<P>&nbsp;</P>
<P>La segunda columna de la salida producida por netstat informa sobre las pasarelas 
  a las que apunta la informaci&oacute;n de encaminamiento. Si una ruta no usa 
  pasarela, el programa imprime un asterisco. La tercera columna imprime el nivel 
  de generalizaci&oacute;n de una ruta.</P>
<P>Dada una direcci&oacute;n IP, el n&uacute;cleo recorre la tabla registro a 
  registro haciendo un "Y" l&oacute;gico de la direcci&oacute;n y la mascara de 
  nivel de generalizaci&oacute;n antes de compararla con el destino que muestra 
  dicho registro.</P>
<P>La cuarta columna muestra varios indicadores que describen la ruta:</P>
<DIR> 
  <DIR> 
    <P>G La ruta utiliza una pasarela.<BR>
      U La interface esta activa.<BR>
      H Esta interface permite el acceso a una sola m&aacute;quina. Este es el 
      caso de la interface de lazo 127.0.0.1 en nuestro ejemplo.<BR>
      D Este indicador se activa cuando el registro es generado por un mensaje 
      de redirecci&oacute;n ICMP (ver secci&oacute;n 2.5).<BR>
      M Presente cuando este registro ha sido modificado por un mensaje de redirecci&oacute;n 
      ICMP.</P>
  </DIR>
</DIR>
<P>La columna Ref de la salida de netstat muestra el n&uacute;mero de referencias 
  a esta ruta, esto es, cuantas otras rutas dependen de &eacute;sta (por ejemplo 
  a trav&eacute;s de pasarelas). Las dos &uacute;ltimas columnas muestran el n&uacute;mero 
  de veces que cada ruta ha sido usada y la interface que procesa los datagramas 
  para dicha ruta.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="5.9.2"></a>5.9.2 Consulta de las Estad&iacute;sticas de una Interface</P>
</u></I> 
<P>Cuando se ejecuta con el indicador -i, netstat presenta las estad&iacute;sticas 
  de cada una de las interfaces de red configuradas en ese momento. Si se usa 
  tambi&eacute;n la opci&oacute;n -a, el resultado son todas las interfaces presentes 
  en el n&uacute;cleo, no solo aquellas que ya han sido configuradas. En vstout, 
  netstat producir&aacute;:</P>
<DIR> 
  <DIR> 
    <P>$ netstat -i<BR>
      Kernel Interface table<BR>
      Iface MTU Met RX-OK RX-ERR RX-DRP RX-OVR TX-OK TX-ERR TX-DRP TX-OVR Flags<BR>
      lo 0 0 3185 0 0 0 3185 0 0 0 BLRU<BR>
      eth0 1500 0 972633 17 20 120 628711 217 0 0 BRU</P>
  </DIR>
</DIR>
<P>Los campos MTU y Met informan de los valores de MTU y m&eacute;trica configurados 
  en la interface. Las columnas RX y TX muestran el total de paquetes recibidos 
  y enviados respectivamente sin errores (RX-OK/TX-OK), da&ntilde;ados (RX-ERR/TX-ERR), 
  cuantos han sido descartados (RX-DRP/TX-DRP), y cuantos se han perdido por desbordamiento 
  (RX-OVR/TX-OVR).</P>
<P>La &uacute;ltima columna muestra los indicadores activos para cada interface. 
  Se trata de abreviaturas de una sola letra correspondientes a los nombres de 
  los indicadores usados para configurar la interface mediante ifconfig.</P>
<DIR> 
  <DIR> 
    <P>B Direcci&oacute;n de difusi&oacute;n activa.<BR>
      L Interface correspondiente a un dispositivo de lazo.<BR>
      M Recepci&oacute;n de todos los paquetes (modo promiscuo).<BR>
      N No se usan pistas12<BR>
      O ARP esta desactivado en esta interface.<BR>
      P Se trata de una conexi&oacute;n punto-a-punto.<BR>
      R Interface en uso.<BR>
      U Interface activa.</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U> 
<P><a name="5.9.3"></a>5.9.3 Mostrar Conexiones</P>
</u></I> 
<P>netstat soporta una serie de opciones que permiten mostrar los sockets13 activos 
  y pasivos. Las opciones -t, -u, -w, y -x muestran conexiones con sockets TCP, 
  UDP, RAW, o UNIX.</P>
<P>Si, adicionalmente incluye el indicador -a, tambi&eacute;n se muestran sockets 
  en espera de una conexi&oacute;n (a la escucha). Esto le permite listar todos 
  los servidores que se ejecutan en su sistema.</P>
<P>La ejecuci&oacute;n de netstat -ta en vlager produce lo siguiente:</P>
<DIR> 
  <DIR> 
    <P>$ netstat -ta<BR>
      Active Internet connections<BR>
      Proto Recv-Q Send-Q Local Address Foreign Address (State)<BR>
      tcp 0 0 *:domain *:* LISTEN<BR>
      tcp 0 0 *:time *:* LISTEN<BR>
      tcp 0 0 *:smtp *:* LISTEN<BR>
      tcp 0 0 vlager:smtp vstout:1040 ESTABLISHED<BR>
      tcp 0 0 *:telnet *:* LISTEN<BR>
      tcp 0 0 localhost:1046 vbardolino:telnet ESTABLISHED<BR>
      tcp 0 0 *:chargen *:* LISTEN<BR>
      tcp 0 0 *:daytime *:* LISTEN<BR>
      tcp 0 0 *:discard *:* LISTEN<BR>
      tcp 0 0 *:echo *:* LISTEN<BR>
      tcp 0 0 *:shell *:* LISTEN<BR>
      tcp 0 0 *:login *:* LISTEN</P>
  </DIR>
</DIR>
<P>_____________________________________________<BR>
  12 N.T.: Pistas aqu&iacute; se refiere a un m&eacute;todo de encapsulado de 
  los datagramas IP en los que la informaci&oacute;n de la cabecera se coloca 
  al final del paquete. Se usan en redes Ethernet para ayudar en el alineamiento 
  de datos en los bordes de p&aacute;gina.<BR>
  13 N. del T.: Literalmente significa enchufe en ingl&eacute;s, y se refiere 
  a los descriptores de fichero abiertos para comunicaciones.</P>
<P>&nbsp;</P>
<P>Vemos que la mayor&iacute;a de los servidores est&aacute;n simplemente esperando 
  una conexi&oacute;n entrante. Sin embargo, la cuarta l&iacute;nea muestra una 
  conexi&oacute;n entrante SMTP desde vstout, y la sexta informa que hay una conexi&oacute;n 
  saliente tipo telnet hacia vbardolino.14</P>
<P>El uso del indicador -a &uacute;nicamente genera informaci&oacute;n de los 
  sockets de todas las clases.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="5.10"></a>5.10 Comprobaci&oacute;n de las Tablas ARP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>En ciertas ocasiones, resulta &uacute;til poder ver o incluso alterar parte de las tablas ARP del n&uacute;cleo, por ejemplo cuando sospecha que una direcci&oacute;n IP duplicada causa problemas intermitentes en su red. La herramienta arp fue creada con este objeto. Sus opciones son:</P><DIR>
<DIR>

<P>arp [-v] [-t tipohw ] -a [m&aacute;quina ]<BR>
arp [-v] [-t tipohw ] -s m&aacute;quina direccionhw<BR>
arp [-v] -d m&aacute;quina [m&aacute;quina ...]</P></DIR>
</DIR>

<P>Todos los argumentos m&aacute;quina pueden ser nombres simb&oacute;licos o direcciones IP en notaci&oacute;n de cuaterna.</P>
<P>Si usamos el primer comando, obtendremos el registro de la tabla correspondiente a la direcci&oacute;n IP o m&aacute;quina especificada o, en el caso de que no se especifique ninguna, se muestran todas. As&iacute;, si ejecut&aacute;ramos arp en vlager obtendr&iacute;amos:</P><DIR>
<DIR>

<P># arp -a<BR>
IP address HW type HW address<BR>
191.72.1.3 10Mbps Ethernet 00:00:C0:5A:42:C1<BR>
191.72.1.2 10Mbps Ethernet 00:00:C0:90:B3:42<BR>
191.72.2.4 10Mbps Ethernet 00:00:C0:04:69:AA</P></DIR>
</DIR>

<P>que muestra las direcciones Ethernet de vlager, vstout y vale.</P>
<P>_____________________________________________<BR>
14 Para saber si la conexi&oacute;n es entrante o saliente basta mirar los puertos. El puerto correspondiente a la m&aacute;quina que llama es siempre un entero simple, mientras que la m&aacute;quina receptora utiliza el puerto correspondiente al servicio en uso y que adem&aacute;s es representado por netstat usando el nombre simb&oacute;lico contenido en /etc/services.</P>
<P>&nbsp;</P>
<P>Se puede usar la opci&oacute;n -t para mostrar la informaci&oacute;n referente a un tipo especifico de hardware. Los valores posibles son ether, ax25, o pronet, y se refieren a Ethernet a 10Mbps, AMPR AX.25, y equipos token ring IEEE 802.5, respectivamente.</P>
<P>La opci&oacute;n -s se usa para a&ntilde;adir de forma permanente la direcci&oacute;n de hardware de m&aacute;quina a las tablas ARP. direccionhw es la direcci&oacute;n de hardware y por defecto se supone que es Ethernet, especificada como una cadena de seis bytes en hexadecimal separados entre medias por dos puntos. Se puede tambi&eacute;n especificar la direcci&oacute;n de otro tipo de hardware usando la opci&oacute;n -t.</P>
<P>Un tipo de problema que puede requerir a&ntilde;adir una direcci&oacute;n IP manualmente a las tablas ARP es cuando, por alguna raz&oacute;n, una consulta ARP a una m&aacute;quina remota falla, por ejemplo debido a que su controlador ARP no funciona correctamente o cuando alguna otra m&aacute;quina en la red se identifica err&oacute;neamente como si ella misma tuviera esa direcci&oacute;n IP.</P>
<P>Tambi&eacute;n es un modo, aunque algo dr&aacute;stico, de protegerse frente a m&aacute;quinas que, conectadas a la misma Ethernet, tratan de hacerse pasar por otras.</P>
<P>El uso de arp con el modificador -d borra todos los registros ARP que se refieran a la m&aacute;quina dada. De este modo se puede forzar a una interface a que intente obtener de nuevo la direcci&oacute;n Ethernet que corresponda a la direcci&oacute;n IP en cuesti&oacute;n. Esto resulta &uacute;til cuando un sistema mal configurado ha emitido una informaci&oacute;n ARP incorrecta (por supuesto, primero habr&aacute; de asegurarse de que el error de configuraci&oacute;n ha sido subsanado).</P>
<P>La opci&oacute;n -s se puede usar tambi&eacute;n para implementar ARP sustituto o proxy ARP. Se trata de una t&eacute;cnica especial en la que una m&aacute;quina, digamos gate, act&uacute;a como pasarela para otra diferente llamada fnord, haciendo como que ambas direcciones pertenecen a la misma m&aacute;quina, en este caso gate. Esto se consigue haciendo publico un registro ARP para fnord que apunta a su propia interface Ethernet. De este modo, cuando cualquier m&aacute;quina de la red realiza una consulta sobre fnord, gate responde con un registro que contiene su propia direcci&oacute;n Ethernet. La m&aacute;quina que ha realizado la consulta enviara los datagramas a gate, quien se los pasa a fnord.</P>
<P>Este tipo de cosas puede ser necesario si, por ejemplo, pretende acceder a fnord mediante una m&aacute;quina DOS que tiene una implementaci&oacute;n de TCP incorrecta que no entiende el encaminamiento demasiado bien. Cuando usa ARP sustituto, a todos los efectos la m&aacute;quina DOS ve a fnord en la subred local y, por tanto, no necesita preocuparse de como realizar el encaminamiento a trav&eacute;s de una pasarela.</P>
<P>Otro aplicaci&oacute;n muy &uacute;til del ARP sustituto es cuando una de sus m&aacute;quinas act&uacute;a como pasarela para otra m&aacute;quina aunque solo de forma temporal, por ejemplo, en el caso de un enlace telef&oacute;nico. En un ejemplo anterior, ya nos encontramos con el port&aacute;til vlite que se conectaba a vlager mediante un enlace PLIP de vez en cuando. Por supuesto, esto s&oacute;lo funcionar&aacute; si la direcci&oacute;n de la m&aacute;quina para la que quiere actuar de sustituto ARP se encuentra en la misma subred IP que su pasarela. As&iacute;, por ejemplo, vstout podr&iacute;a ser el sustituto ARP de cualquier m&aacute;quina de la subred de la Cervecera (191.72.1.0), pero nunca para m&aacute;quinas de la subred de la Vinatera (191.72.2.0).</P>
<P>Abajo vemos el comando correcto para activar un ARP sustituto para fnord; por supuesto, la direcci&oacute;n Ethernet dada debe ser la de gate.</P><DIR>
<DIR>

<P># arp -s fnord 00:00:c0:a1:42:e0 pub</P></DIR>
</DIR>

<P>Para borrar el registro de ARP sustituto bastara:</P><DIR>
  <DIR> 
    <p># arp -d fnord</p>
    <p>&nbsp;</p>
  </DIR>
</DIR>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"></font></u></B><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="5.11"></a>5.11 El Futuro</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Las comunicaciones en red con Linux est&aacute;n en continua evoluci&oacute;n. 
  Cambios fundamentales en el n&uacute;cleo permitir&aacute;n un esquema de configuraci&oacute;n 
  muy flexible que permitir&aacute; que configure los dispositivos de red en tiempo 
  de ejecuci&oacute;n. Por ejemplo, ifconfig tendr&aacute; argumentos que permitan 
  fijar la l&iacute;nea IRQ y el canal DMA.</P>
<P>Otro cambio que se espera pronto es el indicador adicional mtu en el comando 
  route, que permita establecer la Unidad de Transferencia M&aacute;xima para 
  una ruta en particular. Esta MTU especifica de una ruta invalida el valor especificado 
  para la interface. El uso t&iacute;pico de esta opci&oacute;n es para rutas 
  a trav&eacute;s de pasarelas, en las que el enlace entre la pasarela y la m&aacute;quina 
  destinataria requiere un MTU muy bajo. Por ejemplo, supongamos que la m&aacute;quina 
  wanderer este conectada a vlager a trav&eacute;s de un enlace SLIP. Entonces, 
  al enviar datos de vstout a wanderer, la capa de red en wanderer enviar&iacute;a 
  paquetes de hasta 1500 bytes, porque los paquetes son transmitidos mediante 
  una Ethernet. El enlace SLIP, sin embargo, opera con una MTU de 296, as&iacute; 
  que la capa de red en vlager tendr&iacute;a que dividir los paquetes IP en fragmentos 
  mas peque&ntilde;os que quepan en 296 bytes. Si en vez de eso, configura la 
  interface en vstout para que use una MTU de 296 desde el principio, se puede 
  evitar el proceso de divisi&oacute;n, que es relativamente costoso.:</P>
<DIR> 
  <DIR> 
    <P># route add wanderer gw vlager mtu 296</P>
  </DIR>
</DIR>
<P>Debe notar que la opci&oacute;n mtu tambi&eacute;n permite que, de forma selectiva, 
  evite los efectos de la pol&iacute;tica las "Subredes son locales" (SNARL15). 
  Se trata de una opci&oacute;n de configuraci&oacute;n del n&uacute;cleo descrita 
  en el cap&iacute;tulo 3.</P>
<P>_____________________________________________<BR>
  15 Del ingl&eacute;s Subnets Are Local Policy</P>
</FONT>
</BODY>
</HTML>
