<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl19</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl18.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garla.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 19</P>
</font></B><P ALIGN="CENTER"><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>Configuraci&oacute;n del lector de noticias</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Los lectores de noticias est&aacute;n pensados para ofrecer al usuario un acceso 
  f&aacute;cil a las funciones de un sistema de noticias, tales como publicar 
  art&iacute;culos, o purgar los contenidos de un grupo de una manera c&oacute;moda. 
  El mayor o menor acierto en cumplir este objetivo es objeto de interminables 
  discusiones en los grupos de noticias.</P>
<P>Algunos de los lectores disponibles que han sido portados a Linux. A continuaci&oacute;n 
  se describir&aacute; la instalaci&oacute;n b&aacute;sica para tres de los mas 
  populares: tin, trn, y nn.</P>
<P>Uno de los lectores m&aacute;s efectivos es</P>
<DIR> 
  <DIR> 
    <P>$ find /var/spool/news -name '[0-9]*' -exec cat {} \; | more</P>
  </DIR>
</DIR>
<P>As&iacute; es como los unixeros a ultranza leen sus noticias.</P>
<P>La mayor&iacute;a de los lectores de noticias, sin embargo, son mucho mas sofisticados. 
  Generalmente ofrecen un interfaz a pantalla completa con niveles separados para 
  mostrar todos los grupos a los que el usuario esta suscrito, para mostrar una 
  lista de todos los art&iacute;culos de un grupo, y para art&iacute;culos individuales.</P>
<P>En el nivel del grupo, la mayor&iacute;a de los lectores muestran una lista 
  de art&iacute;culos en la que aparece el tema de los mismos y el autor. En los 
  grupos grandes es imposible para el usuario caer en la cuenta de los art&iacute;culos 
  que se refieren unos a otros, aunque es posible identificar las respuestas a 
  un art&iacute;culo anterior.</P>
<P>Una respuesta normalmente repite el titulo del art&iacute;culo original precedido 
  por "Re: ".</P>
<P>Adicionalmente, el identificativo del mensaje al que se responde puede indicarse 
  en el campo References:. Ordenar los art&iacute;culos por esos dos criterios 
  genera peque&ntilde;os &aacute;rboles llamados hebras1. Una de las tareas al 
  escribir un lector de noticias es dise&ntilde;ar un algoritmo eficiente para 
  ordenar los art&iacute;culos, ya que el tiempo requerido para ello es proporcional 
  al cuadrado del n&uacute;mero de art&iacute;culos.</P>
<P>_____________________________________________<BR>
  1 N. del T.: Son los llamados popularmente threads</P>
<P>&nbsp;</P>
<P>No discutiremos aqu&iacute; como se construyen los interfaces de usuario. Todos 
  los lectores actualmente disponibles para Linux tienen una buena funci&oacute;n 
  de ayuda, as&iacute; que el usuario puede apa&ntilde;&aacute;rselas solo.</P>
<P>En lo sucesivo, solo trataremos cuestiones administrativas. La mayor&iacute;a 
  de ellas relacionadas con la creaci&oacute;n de bases de datos y contabilidad.</P>
</FONT>
<dir> 
    <p><font face="Verdana" size="2"><a href="garl19.htm#19.1">19.1 Configuraci&oacute;n 
      de tin</a><br>
      <a href="garl19.htm#19.2">19.2 Configuraci&oacute;n de trn</a><br>
      <a href="garl19.htm#19.3">19.3 Configuraci&oacute;n de nn</a></font></p>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="19.1"></a>19.1 Configuraci&oacute;n de tin</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El lector mas vers&aacute;til en lo que al tratamiento de las hebras se refiere es tin. Fue escrito por Iain Lea siguiendo el modelo de un lector anterior llamado tas.2 Ordena las hebras en el momento en el que el usuario accede al grupo, y es muy r&aacute;pido haci&eacute;ndolo, salvo que se haga por NNTP.</P>
<P>En un 486DX50 se tarda unos 30 segundos en ordenar mil art&iacute;culos, ley&eacute;ndolos directamente desde el disco. Mediante NNTP con un servidor ocupado, rondar&iacute;a los cinco minutos.3 Se puede mejorar este tiempo actualizando regularmente los ficheros &iacute;ndice con la opci&oacute;n -u, o llamando a tin con la opci&oacute;n -U.</P>
<P>Normalmente tin guarda la informaci&oacute;n sobre las hebras en el directorio del usuario, bajo .tin/index. Esto puede ser costoso en t&eacute;rminos de espacio en disco, as&iacute; que es posible que quiera Vd. mantener una sola copia para todos los usuarios. Esto se puede lograr haciendo a tin setuid news, por ejemplo, o alg&uacute;n otro usuario sin privilegios.4 tin guardara todos los ficheros &iacute;ndice bajo /var/spool/news/.index. Para los accesos a ficheros o salidas al shell, volver&aacute; a ser del usuario real que lo invoc&oacute;.5</P>
<P>Una soluci&oacute;n mejor es instalar el demonio indexador tind, que se ejecuta como tarea de fondo y actualiza regularmente los ficheros &iacute;ndice. Sin embargo, este demonio no se incluye en ninguna distribuci&oacute;n para Linux, as&iacute; que tendr&aacute; que compilarlo Vd. mismo. Si esta Vd. trabajando con una red local con un servidor central de noticias, puede ejecutar tind en el servidor, y hacer que los clientes reciban los &iacute;ndices por NNTP. Esto, por supuesto, requiere una extensi&oacute;n del NNTP. Los parches necesarios para que nntpd soporte esta extensi&oacute;n se incluyen en las fuentes de tin.</P>
<P>_____________________________________________<BR>
2 Escrito por Rich Skrenta.<BR>
3 El tiempo se reduce dr&aacute;sticamente si el servidor NNTP crea las hebras por s&iacute; mismo y permite al cliente recibir estos datos. Un servidor que permite hacer esto es INN-1.4, por ejemplo.<BR>
4 Sin embargo, no utilice el usuario nobody. Como norma, ning&uacute;n fichero o programa deber&iacute;a ser asociado con este usuario.<BR>
5 Esta es la raz&oacute;n por la que se obtendr&aacute;n feos mensajes de error al invocar a tin como superusuario. De todas formas, no se deber&iacute;a trabajar como root, es una cuenta para administraci&oacute;n.</P>
<P>&nbsp;</P>
<P>La versi&oacute;n de tin incluida en algunas distribuciones de Linux no tiene soporte NNTP, pero la mayor&iacute;a si lo incorporan. Cuando se le invoca como rtin o con la opci&oacute;n -r, tin trata de conectar con el servidor especificado en el fichero /etc/nntpserver o en la variable de entorno NNTPSERVER. El fichero nntpserver simplemente contiene el nombre del servidor en una sola l&iacute;nea.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="19.2"></a>19.2 Configuraci&oacute;n de trn</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>trn es tambi&eacute;n el sucesor de un programa anterior, rn (siglas de read news6). La "t" en su nombre significa threaded7. Fue escrito por Wayne Davidson.</P>
<P>Al contrario que tin, trn no tiene opci&oacute;n para generar bases de datos sobre las hebras en el momento de ejecuci&oacute;n. En cambio, usa las bases de datos creadas por un programa llamado mthreads, el cual debe ser ejecutado regularmente desde cron para actualizar los ficheros &iacute;ndice.</P>
<P>No ejecutar mthreads, sin embargo, no significa que no se pueda acceder a los art&iacute;culos nuevos, solo significa que tendr&aacute; Vd. todos esos art&iacute;culos sobre "¡¡Novell compra Linux!!" esparcidos por el men&uacute; de selecci&oacute;n de art&iacute;culos en vez de una sola hebra que pueda evitar f&aacute;cilmente.</P>
<P>Para activar la ordenaci&oacute;n en hebras de un grupo particular, mthreads se invoca con la lista de grupos desde la l&iacute;nea de comandos. La lista se hace exactamente de la misma manera que la del fichero sys:</P><DIR>
<DIR>

<P>mthreads comp,rec,!rec.games.go</P></DIR>
</DIR>

<P>ordenar&aacute; en hebras todos los grupos comp y rec, excepto rec.games.go (la gente que juega al Go no necesita bonitas hebras). Despu&eacute;s de esto, simplemente se le invoca sin ninguna opci&oacute;n para que ordene todos los art&iacute;culos que vayan llegando. El ordenamiento de todos los grupos del fichero active puede ser activado llamando al programa mthreads con la lista de grupos all.</P>
<P>Si recibe Vd. las noticias durante la noche, bastar&iacute;a con ejecutar mthreads una vez por la ma&ntilde;ana, pero tambi&eacute;n puede hacerlo mas frecuentemente si es necesario. En sistemas con un tr&aacute;fico muy denso, puede ser deseable ejecutar mthreads como tarea de fondo (modo daemon). Si se le llama al arrancar con la opci&oacute;n -d, se pone como tarea de fondo, comprobando cada diez minutos si han llegado nuevos art&iacute;culos, y orden&aacute;ndolos si este es el caso. Para ejecutar mthreads como tarea de fondo, ponga la siguiente l&iacute;nea en el script rc.news:</P><DIR>
<DIR>

<P>/usr/local/bin/rn/mthreads -deav</P></DIR>
</DIR>

<P>La opci&oacute;n -a hace que mthreads ordene autom&aacute;ticamente los nuevos grupos seg&uacute;n se vayan creando. La opci&oacute;n -v habilita los mensajes largos en el archivo de registro, llamado mt.log y situado en el directorio donde este instalado trn.</P>
<P>_____________________________________________<BR>
6 N. del T.: Leer noticias.<BR>
7 N. del T.: Ordenado en hebras.</P>
<P>&nbsp;</P>
<P>Los art&iacute;culos viejos que ya no est&eacute;n disponibles en el sistema deben ser eliminados de los ficheros &iacute;ndice regularmente. Por defecto, solo los art&iacute;culos cuyo n&uacute;mero este por debajo de la l&iacute;nea de flotaci&oacute;n ser&aacute;n eliminados.8 Los art&iacute;culos que a pesar de estar por encima de este n&uacute;mero hayan caducado (porque tengan el campo Expires: en la cabecera) pueden ser purgados usando la opci&oacute;n -e del programa mthreads. Cuando mthreads esta ejecut&aacute;ndose como tarea de fondo, esta opci&oacute;n hace que use un modo mejorado de purga una vez al d&iacute;a, poco despu&eacute;s de la media noche.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="19.3"></a>19.3 Configuraci&oacute;n de nn</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>nn, escrito por Kim F. Storm, proclama ser un lector cuya &uacute;ltima finalidad es no leer noticias. Su nombre significa "No News"9, y su lema es "falta de noticias, buenas noticias. nn es mejor".</P>
<P>Para alcanzar su ambiciosa meta, nn viene equipado con gran cantidad de herramientas de mantenimiento que no solo permiten la creaci&oacute;n de hebras, sino tambi&eacute;n comprobaciones extensivas de la consistencia de tales bases de datos, contabilidad, recopilaci&oacute;n de estad&iacute;sticas, y restricciones de acceso. Existe tambi&eacute;n un programa de administraci&oacute;n llamado nnadmin, que permite llevar a cabo estas tareas interactivamente. Es muy intuitivo, por lo que no profundizaremos estos aspectos, sino que nos limitaremos a la creaci&oacute;n de los ficheros &iacute;ndice.</P>
<P>El programa encargado de manejar las bases de datos para nn se llama nnmaster. Generalmente trabaja en modo daemon, invocado desde el script rc.news o rc.inet2. Se le invoca de la siguiente manera:</P><DIR>
<DIR>

<P>/usr/local/lib/nn/nnmaster -l -r -C</P></DIR>
</DIR>

<P>Esto habilita la indexaci&oacute;n para todos los grupos presentes en el fichero active.</P>
<P>De manera equivalente, se puede ejecutar nnmaster peri&oacute;dicamente desde cron, pas&aacute;ndole la lista de grupos sobre la que actuar. Esta lista es muy parecida a la lista de subscripciones del fichero sys, salvo que usa espacios en blanco en vez de comas. En vez del nombre all, se debe usar un argumento vac&iacute;o de "" para referirse a todos los grupos. Un ejemplo es:</P><DIR>
<DIR>

<P># /usr/local/lib/nn/nnmaster !rec.games.go rec comp</P></DIR>
</DIR>

<P>Tenga en cuenta que el orden es significativo: la especificaci&oacute;n de grupo que concuerde y este mas a la izquierda es la que vale. Por tanto, si ponemos !rec.games.go despu&eacute;s de rec, los art&iacute;culos de este grupo se indexar&iacute;an de todos modos.</P>
<P>nn ofrece varios m&eacute;todos para borrar los art&iacute;culos caducados de sus bases de datos. El primero es actualizar la base comprobando los directorios de los grupos, y desechando las entradas cuyo art&iacute;culo correspondiente ya no este disponible. Este es el m&eacute;todo por defecto obtenido al invocar a nnmaster con la opci&oacute;n -E. Es razonablemente r&aacute;pido, a menos que se haga por NNTP.</P>
<P>_____________________________________________<BR>
8 Tenga en cuenta que Cnews no actualiza su l&iacute;nea de flotaci&oacute;n autom&aacute;ticamente; hay que ejecutar updatemin para ello. V&eacute;ase el cap&iacute;tulo 17.<BR>
9 N. del T.: Sin noticias.</P>
<P>&nbsp;</P>
<P>El segundo m&eacute;todo act&uacute;a exactamente como la opci&oacute;n por defecto de mthreads: solo elimina las entradas referidas a art&iacute;culos cuyo n&uacute;mero esta por debajo de la l&iacute;nea de flotaci&oacute;n en el fichero active. Puede ser habilitado con la opci&oacute;n -e.</P>
<P>Finalmente, el tercer m&eacute;todo consiste en desechar toda la base de datos y catalogar todos los art&iacute;culos. Esto puede hacerse pas&aacute;ndole la opci&oacute;n -E3 a nnmaster.</P>
<P>La lista de grupos sobre los que actuar se especifica mediante la opci&oacute;n -F, del mismo modo que se describi&oacute; anteriormente. Sin embargo, si nnmaster esta ejecut&aacute;ndose como tarea de fondo, hay que matarlo (con la opci&oacute;n -k) antes de proceder a purgar, y reiniciarlo despu&eacute;s con las opciones originales. Por lo tanto, los comandos apropiados para purgar los &iacute;ndices de todos los grupos usando el primer m&eacute;todo es:</P><DIR>
<DIR>

<P># nnmaster -kF ""<BR>
# nnmaster -lrC</P></DIR>
</DIR>

<P>Hay muchas mas opciones que pueden ser utilizadas para ajustar el comportamiento de nn. Si le interesa saber como eliminar art&iacute;culos err&oacute;neos o agrupar los art&iacute;culos resumen, lea la p&aacute;gina de manual de nnmaster.</P>
<P>nnmaster se gu&iacute;a usando un fichero llamado GROUPS, situado en /usr/local/lib/nn. Si no existe inicialmente, se crea. Para cada grupo, contiene una l&iacute;nea que comienza con el nombre del mismo, opcionalmente seguido de una anotaci&oacute;n de tiempo y diversos indicadores. Es posible editar dichos indicadores para habilitar un determinado comportamiento para el grupo en cuesti&oacute;n, pero no se debe cambiar el orden en que aparecen los grupos.10 Los indicadores permitidos y sus efectos tambi&eacute;n vienen detallados en la p&aacute;gina de manual de nnmaster.</P>
<P>_____________________________________________<BR>
10 Esto se debe a que el orden debe coincidir con el del fichero binario MASTER.</P></FONT></BODY>
</HTML>
