<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl2</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl01.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl03.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 2</P>
</font></B><P ALIGN="CENTER"><HR>
<B><U><FONT FACE="Verdana" SIZE=2> 
<P>Cuestiones sobre redes TCP/IP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Vamos a entrar en los detalles que deben tenerse en cuenta cuando se conecta 
  una m&aacute;quina Linux a una red TCP/IP. De este modo, hablaremos de direcciones 
  IP, nombres y cuestiones sobre el encaminamiento. Este cap&iacute;tulo le ense&ntilde;ar&aacute; 
  la base con la que podr&aacute; entender los pasos para su configuraci&oacute;n 
  particular, pasos que son cubiertos exhaustivamente en otros cap&iacute;tulos.</P>
</FONT>
<dir> 
    <p><font face="Verdana" size="2"><a href="garl01.htm#2.1">2.1 Interfaces de 
      Red</a><br>
      <a href="garl01.htm#2.2">2.2 Direcciones IP</a><br>
      <a href="garl01.htm#2.3">2.3 Resoluci&oacute;n de direcciones</a><br>
      <a href="garl01.htm#2.4">2.4 Encaminamiento IP</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl01.htm#2.4.1">2.4.1 Redes 
          IP</a><br>
          <a href="garl01.htm#2.4.2">2.4.2 Subredes</a><br>
          <a href="garl01.htm#2.4.3">2.4.3 Pasarelas</a><br>
          <a href="garl01.htm#2.4.4">2.4.4 Tablas de Encaminamiento</a><br>
          <a href="garl01.htm#2.4.5">2.4.5 M&eacute;tricas de Encaminamiento</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl01.htm#2.5">2.5 Protocolo de 
      Mensajes de Control de Internet (ICMP)</a><br>
      <a href="garl01.htm#2.6">2.6 El sistema de nombres DNS</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl01.htm#2.6.1">2.6.1 Resoluci&oacute;n 
          de nombres</a><br>
          <a href="garl01.htm#2.6.2">2.6.2 Introducci&oacute;n al DNS</a><br>
          <a href="garl01.htm#2.6.3">2.6.3 B&uacute;squedas de nombres con DNS</a><br>
          <a href="garl01.htm#2.6.4">2.6.4 Servidores de Nombres</a><br>
          <a href="garl01.htm#2.6.5">2.6.5 La Base de Datos DNS</a><br>
          <a href="garl01.htm#2.6.6">2.6.6 Resoluci&oacute;n inversa</a></font></p>
      </dir>
    </dir>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="2.1"></a>2.1 Interfaces de Red</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Para ocultar la diversidad de hardware que puede usarse en una red, TCP/IP define una interfaz a trav&eacute;s de la cual accedemos al hardware. Esta interfaz ofrece un conjunto de operaciones id&eacute;nticas en cualquier tipo de hardware y que b&aacute;sicamente consisten en operaciones para enviar y recibir paquetes.</P>
<P>Para cada dispositivo que quiera utilizarse para conectarse a la red, se mantendr&aacute; en el n&uacute;cleo del sistema la correspondiente interfaz. Por ejemplo, las interfaces con Ethernet en Linux son eth0 y eth1, mientras que las interfaces SLIP se llaman sl0, sl1, etc&eacute;tera. Estos nombres de interfaz se deben conocer durante la configuraci&oacute;n de la red, cuando queramos referirnos a un dispositivo hardware concreto.</P>
<P>Para que podamos usarlo en una red TCP/IP, la interfaz deber&aacute; tener asignada una direcci&oacute;n IP que sirva como identificaci&oacute;n de &eacute;sta ante los dem&aacute;s ordenadores de la red. Esta direcci&oacute;n es diferente del nombre de interfaz considerado anteriormente; puede realizarse la siguiente analog&iacute;a: la interfaz ser&iacute;a la "puerta" de su sistema, mientras que la direcci&oacute;n vendr&iacute;a a ser un n&uacute;mero enmarcado y colgado de la "puerta".</P>
<P>Por supuesto, hay otros par&aacute;metros configurables para cada dispositivo, como el n&uacute;mero m&aacute;ximo de datagramas que pueden ser procesados por el dispositivo, conocido como Unidad M&aacute;xima de Transferencia o MTU1. Otros par&aacute;metros ser&aacute;n introducidos mas tarde.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="2.2"></a>2.2 Direcciones IP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Como se dijo en el cap&iacute;tulo anterior, las direcciones utilizadas en el protocolo de red IP la forman n&uacute;meros de 32 bits, y cada m&aacute;quina debe tener una direcci&oacute;n propia. Si las m&aacute;quinas se encuentran en una red TCP/IP que no se conecta a otras redes, dichas direcciones podr&aacute;n asignarse a las m&aacute;quinas libremente. Sin embargo, si las m&aacute;quinas se conectan a Internet, las direcciones de los ordenadores ser&aacute;n asignadas por una autoridad principal, el NIC2 o Centro de Informaci&oacute;n de la Red3.</P>
<P>Para facilitar la lectura, las direcciones IP se dividen en cuatro n&uacute;meros de 8 bits llamados octetos. Por ejemplo, si la m&aacute;quina quark.physics.groucho.edu tiene una direcci&oacute;n IP 0x954C0C04, normalmente la escribiremos con la notaci&oacute;n de puntos divisorios, que separa los octetos, de esta forma: 149.76.12.4.</P>
<P>Otra raz&oacute;n para usar esta notaci&oacute;n es que las direcciones IP se pueden dividir en el n&uacute;mero de red y el n&uacute;mero de nodo. Cuando pedimos al NIC un conjunto de direcciones, este organismo nos conceder&aacute;, no una direcci&oacute;n para nuestra m&aacute;quina, sino un rango de direcciones validas, que en realidad es un n&uacute;mero de red concreto (el n&uacute;mero de nodo lo pondremos nosotros, contando con todos esos nodos disponibles).</P>
<P>Dependiendo del tama&ntilde;o de la red, la parte de la direcci&oacute;n correspondiente al nodo puede ser mas o menos grande. Para adaptarse a diferentes necesidades, se conceden diferentes clases de redes, que definen diferentes maneras de dividir la direcci&oacute;n IP en parte de red y parte del nodo.</P>
<P><B>Clase A</b> La clase A comprende redes desde 1.0.0.0 hasta 127.0.0.0. El n&uacute;mero de red esta en el primer octeto, con lo que solo hay 127 redes de este tipo, pero cada una tiene 24 bits disponibles para identificar a los nodos, lo que se corresponde con poder distinguir en la red unos 16 millones de nodos distintos.</P>
<P><B>Clase B</b> La clase B comprende redes desde 128.0.0.0 hasta 191.255.0.0; siendo el n&uacute;mero de red de 16 bits (los dos primeros octetos). Esto permite 16320 redes de 65024 nodos cada una.</P>
<P><B>Clase C</b> Las redes de clase C tienen el rango de direcciones desde 192.0.0.0 hasta 223.255.255.0, contando con tres octetos para identificar la red. Por lo tanto, hay cerca de 2 millones de redes de este tipo con un m&aacute;ximo de 254 nodos cada una.</P>
<P><B>Clases D, E, y F</b> Comprenden las direcciones entre 224.0.0.0 y 254.0.0.0, y est&aacute;n reservadas para uso futuro, o con fines experimentales4. No especifican, pues, ninguna red de Internet.</P>
<P>_____________________________________________<BR>
1 N. del T.: MTU son las siglas de "Maximum Transfer Unit".<BR>
2 N. del T.: Network Information Center<BR>
3 Frecuentemente, las direcciones IP le ser&aacute;n asignadas directamente por el proveedor que le conecte a la red. No obstante, se puede contactar directamente con el NIC para obtener direcciones, escribiendo a hostmaster@internic.net.</P>
<P>&nbsp;</P>
<P>Volviendo al ejemplo del cap&iacute;tulo anterior, veremos que en la direcci&oacute;n 149.76.12.4 de la m&aacute;quina quark, 12.4 es el identificativo del nodo dentro de la red de clase B 149.76.0.0. &nbsp;</P>
<P>Se puede observar que en la lista anterior no se consideraban todas las posibilidades en la parte que identifica al nodo; concretamente, se exclu&iacute;an siempre el identificador 0 y el 255. Estos dos identificadores se reservan para prop&oacute;sitos especiales. Una direcci&oacute;n con los bits del nodo a cero identifica a la red, mientras que si tiene todos los bits a uno, identifica a todos los nodos de la red (lo que se conoce como direcci&oacute;n de broadcast, lo que indica que un mensaje enviado a esa direcci&oacute;n ser&aacute; procesado por todos los nodos de la red). As&iacute; pues, en nuestro ejemplo la direcci&oacute;n de la red ser&iacute;a 149.76.0.0 y la de broadcast, la 149.76.255.255.</P>
<P>Adem&aacute;s, otras dos direcciones de red est&aacute;n reservadas: la 0.0.0.0 y la 127.0.0.0. La primera se conoce como direcci&oacute;n de encaminamiento por defecto, y la segunda, como direcci&oacute;n de loopback. El encaminamiento por defecto se utiliza para saber a donde enviar los datagramas por defecto, tema que abordaremos despu&eacute;s.</P>
<P>La red 127.0.0.0 se reserva para el tr&aacute;fico local, dirigido al propio nodo. Normalmente, se asigna la direcci&oacute;n 127.0.0.1 a un dispositivo de la m&aacute;quina llamado interfaz de loopback 5 o de circuito cerrado. Cualquier paquete enviado a esa direcci&oacute;n ser&aacute; recibido por el propio nodo. Esto permite probar aplicaciones de red con uno mismo, sin estar conectado a una red "real". Otra aplicaci&oacute;n &uacute;til es la de ejecutar aplicaciones de red que afectan solo al nodo local. Por ejemplo, muchos sistemas UUCP no tienen conexi&oacute;n IP pero ejecutan un sistema de noticias INN. Para que esto funcione, INN utiliza la interfaz de loopback.</P>
<P>_____________________________________________<BR>
4 Por ejemplo, se esta utilizando la red 224.0.0.0 para la Internet multidestino o multicast<BR>
5 N. del T.: Tambi&eacute;n conocida como interfaz de lazo</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="2.3"></a>2.3 Resoluci&oacute;n de direcciones</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Ahora que conocemos que son las direcciones IP, nos preguntaremos como se utilizan en una red Ethernet. Despu&eacute;s de todo, el protocolo Ethernet usa direcciones identificativas de seis octetos que no tienen que ver con los n&uacute;meros IP.</P>
<P>En efecto, se necesita un mecanismo de traducci&oacute;n de direcciones IP a direcciones Ethernet o f&iacute;sicas. Esto se hace con el Protocolo de Resoluci&oacute;n de Direcciones o ARP6. ARP no se limita a las redes Ethernet, sino que se extiende a otros tipos de redes como las de radio paquetes. La idea es la misma que tendr&iacute;amos para localizar al se&ntilde;or X entre 150 personas: preguntar por su nombre a todo el mundo; y el se&ntilde;or X nos responder&aacute;.</P>
<P>Cuando queremos localizar la direcci&oacute;n f&iacute;sica correspondiente a una direcci&oacute;n IP, haremos uso de una caracter&iacute;stica de la red Ethernet, que es la posibilidad de enviar mensajes a escuchar por todos los nodos, o mensajes broadcast. En el mensaje ARP, que es de este tipo, se incluye la direcci&oacute;n IP cuyo propietario estamos buscando. El nodo que posea esa direcci&oacute;n enviara una respuesta ARP al nodo llamante, con su direcci&oacute;n f&iacute;sica.</P>
<P>Por supuesto, le preocupara saber como puede funcionar esto para localizar un nodo entre millones de Ethernets conectadas en el mundo. Esto se trata en la pr&oacute;xima secci&oacute;n: se trata del encaminamiento.</P>
<P>Sigamos hablando, de momento, sobre ARP. Una vez que se conoce la direcci&oacute;n f&iacute;sica del nodo, el que hizo la petici&oacute;n guardara la informaci&oacute;n obtenida en una cache ARP, para as&iacute; no preguntar por lo mismo cada vez que env&iacute;e un paquete a ese nodo. Sin embargo, no podemos guardar esa direcci&oacute;n para siempre ya que puede perder su validez (por ejemplo, si cambiamos la tarjeta de red a los nodos por aver&iacute;a, sus nuevas direcciones f&iacute;sicas ser&aacute;n distintas). Por ello, cada cierto tiempo, lo que hay en la cache ARP pierde su validez, obligando a realizar de nuevo la pregunta ARP.</P>
<P>A veces, un nodo necesita tambi&eacute;n conocer su direcci&oacute;n IP a partir de su direcci&oacute;n f&iacute;sica. Por ejemplo, en terminales X o PCs sin disco, que cuando arrancan solo saben la direcci&oacute;n de su tarjeta pues esta grabada en memoria no vol&aacute;til. Para ello, se usa el Protocolo de Resoluci&oacute;n Inversa de Direcciones o RARP7: la petici&oacute;n RARP la hace el nodo cuando arranca, mediante mensaje broadcast, y es contestado por un servidor de direcciones que, a partir de la direcci&oacute;n f&iacute;sica, consulta su base de datos y conoce la direcci&oacute;n IP correspondiente. Existe adem&aacute;s otro protocolo, el BOOTP o protocolo de arranque8, que permite a las m&aacute;quinas sin disco conocer como ponerse en marcha en la red.</P>
<P>_____________________________________________<BR>
6 N. del T.: Address Resolution Protocol<BR>
7 N. del T.: Reverse Address Resolution Protocol<BR>
8 N. del T.: Del ingl&eacute;s Boot Protocol</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="2.4"></a>2.4 Encaminamiento IP</P>
</font></u></B><U><I><FONT FACE="Verdana" SIZE=2> 
<P><a name="2.4.1"></a>2.4.1 Redes IP</P>
</font></I></U><FONT FACE="Verdana" SIZE=2> 
<P>3 Cuando escribimos una carta a alguien, normalmente incluimos la direcci&oacute;n 
  completa en el sobre: pa&iacute;s, provincia, c&oacute;digo postal, etc. De 
  este modo el servicio de correos podr&aacute; llevar la carta a su destino: 
  un servicio la enviara al del pa&iacute;s que corresponda, y este &uacute;ltimo 
  la entregara al de la provincia o ciudad de destino. La ventaja de este esquema 
  jer&aacute;rquico es que el servicio postal del remitente apenas tiene que saber 
  acerca del destino final, sino solo a que pa&iacute;s entregarla.</P>
<P>Las redes IP se organizan de manera similar. Internet consta de varias redes, 
  conocidas como sistemas aut&oacute;nomos y cada una realiza por su cuenta el 
  encaminamiento interno entre sus nodos miembro. Cuando un paquete tiene como 
  destino un nodo de otra red, se entregara al encaminador correspondiente, sin 
  preocuparse del destino final del paquete.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="2.4.2"></a>2.4.2 Subredes</P>
</u></I>
<P>La estructura de subredes se obtiene al dividir las direcciones IP en parte 
  del nodo y parte de la red, como ya hemos explicado. Por defecto, la red de 
  destino se deriva de la parte de red de la direcci&oacute;n IP. Es decir, los 
  nodos con la misma direcci&oacute;n de red se encontraran en la misma red TCP/IP9.</P>
<P>Pero en una red puede interesar hacer una divisi&oacute;n en cientos de peque&ntilde;as 
  redes, por ejemplo segmentos de Ethernet. Para ello se subdivide la red en subredes.</P>
<P>Una subred tiene la responsabilidad de la entrega de los datagramas a un determinado 
  rango de direcciones IP de la red en la que se encuentra. Como sucede con las 
  clases A, B o C, se identifica en la parte del n&uacute;mero IP correspondiente 
  a la red. Sin embargo, esa parte incluir&aacute; ahora algunos bits de la parte 
  del nodo. Los bits que se interpretan como direcci&oacute;n de subred se obtienen 
  con la llamada m&aacute;scara de red. Es un n&uacute;mero de 32 bits que especifica 
  una m&aacute;scara para identificar los bits de la subred.</P>
<P>La red del campus de la Universidad de Groucho Marx es un ejemplo de red de 
  clase B, poseedora de la red 149.76.0.0, con m&aacute;scara 255.255.0.0.</P>
<P>Internamente, la red de la UGM se divide en peque&ntilde;as subredes, como 
  las LAN de cada departamento. Concretamente se divide en 254 subredes, desde 
  la 149.76.1.0 hasta la 149.76.254.0. Por ejemplo, el Departamento de F&iacute;sica 
  Te&oacute;rica tendr&aacute; asignada la subred 149.76.12.0. La dorsal del campus 
  es en si mismo una subred, la 149.76.1.0. Las subredes comparten el mismo n&uacute;mero 
  de red, pero se usa el tercer octeto de &eacute;sta para distinguir las distintas 
  subredes. Por lo tanto, tendr&aacute;n una m&aacute;scara de subred igual a 
  255.255.255.0.</P>
<P>_____________________________________________<BR>
  9 Los sistemas aut&oacute;nomos son algo mas generales. Pueden tener m&aacute;s 
  de una red IP.</P>
<P>&nbsp;</P>
</FONT> 
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=224>
<TR><TD WIDTH="50%" VALIGN="TOP" COLSPAN=2>
<P ALIGN="CENTER"><FONT FACE="Verdana" SIZE=2>Parte de la Red</FONT></TD>
<TD WIDTH="50%" VALIGN="TOP" COLSPAN=2>
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">Parte del Nodo</FONT></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149 </FONT></TD>
<TD WIDTH="26%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">76</FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">12 </FONT></TD>
<TD WIDTH="24%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149 </FONT></TD>
<TD WIDTH="26%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">76</FONT></TD>
<TD WIDTH="26%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">12 </FONT></TD>
<TD WIDTH="24%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
</TR>
<TR><TD WIDTH="50%" VALIGN="TOP" COLSPAN=2>
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">Parte de la Red</FONT></TD>
<TD WIDTH="50%" VALIGN="TOP" COLSPAN=2>
<FONT FACE="Verdana" SIZE=2><P ALIGN="RIGHT">Parte del Nodo</FONT></TD>
</TR>
</TABLE>
  <a name="i.2.1"></a>
</CENTER><p></P>

<FONT FACE="Verdana" SIZE=2>
<P ALIGN="CENTER">Figura 2.1: Divisi&oacute;n de una red clase B en subredes</P>
<P>&nbsp;</P>
<P>En la figura 2.1 se muestra como el nodo quark (149.76.12.4) se ve de distinta 
  forma seg&uacute;n se vea desde el punto de vista de la red de clase B, o desde 
  el punto de vista de las subredes.</P>
<P>N&oacute;tese que la divisi&oacute;n en subredes es visible solo internamente 
  a la red. Normalmente las organiza el administrador de red para reflejar diferentes 
  ubicaciones geogr&aacute;ficas, distinguir segmentos de red, o bien por motivos 
  administrativos (departamentos, redes de alumnos, etc.). Pero esta divisi&oacute;n 
  es totalmente invisible desde fuera de la organizaci&oacute;n.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="2.4.3"></a>2.4.3 Pasarelas</P>
</u></I>
<P>La organizaci&oacute;n en subredes no s&oacute;lo se hace por motivos administrativos, 
  tambi&eacute;n es consecuencia de cuestiones del hardware. Lo que ve un nodo 
  en una red es limitado: solo ve los nodos con los que directamente este conectado 
  (por ejemplo, en la Ethernet), mientras que a los dem&aacute;s los accede a 
  trav&eacute;s de lo que se conoce como pasarela10, que no es mas que un nodo 
  conectado a dos o mas redes f&iacute;sicas, configurado para pasar paquetes 
  de una red a otra.</P>
<P>Para reconocer si una direcci&oacute;n IP se encuentra en la red local f&iacute;sica, 
  cada LAN debe tener una direcci&oacute;n de red IP diferente. Por ejemplo, las 
  m&aacute;quinas de la (sub)red 149.76.4.0 serian las que est&aacute;n en la 
  LAN del Departamento de Matem&aacute;ticas. Cuando se env&iacute;a un datagrama 
  a la m&aacute;quina quark, el software de red de erdos ve que su direcci&oacute;n 
  de red es otra (149.76.12.4) con lo que sabe que tiene que enviar los datagramas 
  a trav&eacute;s de la pasarela (sophus por defecto).</P>
<P>sophus se encuentra conectado a dos subredes: la del Departamento de Matem&aacute;ticas 
  y la de la dorsal del campus, accediendo a cada una a trav&eacute;s de una interfaz 
  diferente, respectivamente eth0 y fddi0. Nos preguntaremos entonces, que direcci&oacute;n 
  IP debe tener la pasarela, una de la subred de Matem&aacute;ticas o bien una 
  de la dorsal.</P>
<P>_____________________________________________<BR>
  10 N. del T.: Del ingl&eacute;s gateway</P>
<P>&nbsp;</P>
<P>Pues bien, la respuesta es ambas. Cuando la pasarela comunique con un nodo 
  de la LAN de Matem&aacute;ticas, usara la direcci&oacute;n 149.76.4.1, mientras 
  que si lo hace con un nodo de la dorsal, usara 149.76.1.4.</P>
<P>Es decir, la pasarela tiene tantas direcciones IP como conexiones a redes f&iacute;sicas 
  tenga. En definitiva, este ser&aacute; el esquema de interfaces, direcciones 
  y m&aacute;scara de sophus, nuestra pasarela:</P>
</FONT> 
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=307>
<TR><TD WIDTH="29%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<P ALIGN="CENTER"><B><U><FONT FACE="Verdana" SIZE=2>interfaz</font></u></B></TD>
<TD WIDTH="34%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<B><U><FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">direcci&oacute;n</font></u></B></TD>
<TD WIDTH="37%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<B><U><FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">m&aacute;scara</font></u></B></TD>
</TR>
<TR><TD WIDTH="29%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>eth0</FONT></TD>
<TD WIDTH="34%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>149.76.4.1</FONT></TD>
<TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>255.255.255.0</FONT></TD>
</TR>
<TR><TD WIDTH="29%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>fddi0</FONT></TD>
<TD WIDTH="34%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>149.76.1.4</FONT></TD>
<TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>255.255.255.0</FONT></TD>
</TR>
<TR><TD WIDTH="29%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>lo</FONT></TD>
<TD WIDTH="34%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>127.0.0.1</FONT></TD>
<TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P>255.0.0.0</FONT></TD>
</TR>
</TABLE>
</CENTER><p></P>

<FONT FACE="Verdana" SIZE=2>
<P ALIGN="CENTER">&nbsp;</P>
<P>La &uacute;ltima entrada describe el dispositivo loopback, que se comento anteriormente.</P>
<P>En la figura 2.2 se muestra una parte de la topolog&iacute;a de la red de la 
  Universidad de Groucho Marx (UGM). Los nodos que est&aacute;n en dos subredes 
  tendr&aacute;n dos direcciones IP.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="2.4.4"></a>2.4.4 Tablas de Encaminamiento</P>
</u></I>
<P>Vamos ahora a centrarnos en como se selecciona una pasarela para entregar un 
  datagrama a una red remota.</P>
<P>Hemos visto que erdos, cuando env&iacute;a un datagrama para quark, comprueba 
  que la direcci&oacute;n destino no se encuentra en la red local, por lo que 
  lo env&iacute;a a la pasarela, sophus, quien b&aacute;sicamente hace lo mismo: 
  ve que quark no esta en una de las redes a las que se conecta directamente y 
  busca otra pasarela a quien entregarle el paquete. La elecci&oacute;n correcta 
  es niels, la pasarela del Departamento de F&iacute;sicas. sophus necesita informaci&oacute;n 
  para poder tomar estas decisiones.</P>
<P>La informaci&oacute;n de encaminamiento que se usa en IP es b&aacute;sicamente 
  una tabla donde se relacionan (sub)redes y pasarelas. Adem&aacute;s, debe incluirse 
  una entrada de encaminamiento por defecto, que se asocia en la tabla a la red 
  0.0.0.0. Todos los paquetes que van a una red desconocida, se enviaran a la 
  pasarela del encaminamiento por defecto. As&iacute; pues, esta ser&iacute;a 
  la tabla para sophus:</P>
<P>&nbsp;</P>
</FONT>
<P ALIGN="CENTER"><IMG SRC="fig2.2.gif" WIDTH=396 HEIGHT=361></P>
<FONT FACE="Verdana" SIZE=2>
<P><a name="i.2.2"></a>Figura 2.2: Vista parcial de la topolog&iacute;a de la 
  red de la UGM.</P>
<P>&nbsp;</P>
</FONT> 
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=373>
<TR><TD WIDTH="37%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<P ALIGN="CENTER"><B><U><FONT FACE="Verdana" SIZE=2>Red</font></u></B></TD>
<TD WIDTH="35%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<B><U><FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">Pasarela</font></u></B></TD>
<TD WIDTH="28%" VALIGN="TOP" BGCOLOR="#c0c0c0">
<B><U><FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">Interfaz</font></u></B></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149.76.1.0</FONT></TD>
<TD WIDTH="35%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">-</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">fddi0</FONT></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149.76.2.0</FONT></TD>
<TD WIDTH="35%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149.76.1.2</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">fddi0</FONT></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149.76.3.0</FONT></TD>
<TD WIDTH="35%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149.76.1.3</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">fddi0</FONT></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149.76.4.0</FONT></TD>
<TD WIDTH="35%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">-</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">eth0</FONT></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149.76.5.0</FONT></TD>
<TD WIDTH="35%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149.76.1.5</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">fddi0</FONT></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">. . . .</FONT></TD>
<TD WIDTH="35%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">. .</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">. . .</FONT></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">0.0.0.0</FONT></TD>
<TD WIDTH="35%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">149.76.1.2</FONT></TD>
<TD WIDTH="28%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=2><P ALIGN="CENTER">fddi0</FONT></TD>
</TR>
</TABLE>
</CENTER><p></P>

<FONT FACE="Verdana" SIZE=2>
<P ALIGN="CENTER">&nbsp;</P>
<P>Las rutas a una red a la que sophus este directamente conectado no necesitan 
  pasarela, sino que los datagramas se entregan directamente. Esto se indica en 
  la tabla anterior cuando en lugar de la pasarela aparece un "-".</P>
<P>Las tablas de encaminamiento pueden construirse de varias formas. Para redes 
  peque&ntilde;as, ser&aacute; mas eficiente construirlas a mano usando el comando 
  route de Linux (v&eacute;ase el cap&iacute;tulo 5). Para redes mas grandes, 
  las tablas se mantienen y modifican autom&aacute;ticamente mediante los demonios 
  de encaminamiento. Estos corren en nodos centrales e intercambian informaci&oacute;n 
  de encaminamiento entre ellos para tener en todo momento las rutas "optimas" 
  entre subredes.</P>
<P>Dependiendo del tama&ntilde;o de la red, se utilizan distintos protocolos de 
  encaminamiento. Dentro de los sistemas aut&oacute;nomos (como la Universidad 
  Groucho Marx) se utilizan los protocolos internos o IGP11. El mas utilizado 
  es RIP12 o protocolo de informaci&oacute;n de encaminamiento, que implementa 
  el demonio routed de BSD. Para encaminamiento entre redes se usan protocolos 
  EGP13, como BGP. Se implementan en programas como gated de la Universidad de 
  Cornell.14.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="2.4.5"></a>2.4.5 M&eacute;tricas de Encaminamiento</P>
</u></I>
<P>El encaminamiento din&aacute;mico basado en RIP elige la mejor ruta a un determinado 
  nodo o red a partir del n&uacute;mero de "saltos", es decir, las pasarelas que 
  tiene que atravesar el datagrama hasta llegar a su destino. La ruta mas corta 
  ser&aacute; la elegida, y si hay 16 o mas saltos se descartara por exceso de 
  distancia.</P>
<P>Para usar RIP tiene que ejecutar gated en todas las m&aacute;quinas. Al arrancar, 
  gated comprueba cuantas interfaces est&aacute;n activas. Si hay mas de una (sin 
  contar la de loopback) asumir&aacute; que el nodo es una pasarela. Si no, entrara 
  en modo pasivo, dedic&aacute;ndose a recibir cualquier actualizaci&oacute;n 
  RIP y cambiando sus tablas en consecuencia.</P>
<P>_____________________________________________<BR>
  11 N. del T.: Internal Gateway Protocol<BR>
  12 N. del T.: Routing Information Protocol<BR>
  13 N del T.: External Gateway Protocol<BR>
  14 gated tambi&eacute;n implementa RIP y en general se recomienda usarlo en 
  lugar de routed</P>
<P>&nbsp;</P>
<P>Para enviar a las dem&aacute;s pasarelas la informaci&oacute;n de su tabla 
  local de rutas, gated cuenta la longitud de cada una a partir de una m&eacute;trica 
  especifica (que es decidida por el administrador del sistema y debe reflejar 
  el coste de esa ruta). As&iacute;, la m&eacute;trica de una ruta a una subred 
  con conexi&oacute;n directa ser&aacute; siempre cero, mientras que una ruta 
  que atraviese dos pasarelas deber&aacute; tener un coste de dos.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="2.5"></a>2.5 Protocolo de Mensajes de Control de Internet (ICMP)</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>IP tiene otro protocolo aun no mencionado. Es el protocolo de mensajes de control de Internet o ICMP15, y lo usa el software de gesti&oacute;n de red para comunicar mensajes de error entre nodos. Por ejemplo, si estamos en la m&aacute;quina erdos y hacemos un telnet al puerto 12345 del nodo quark y no hay procesos escuchando en ese puerto, recibir&aacute; un mensaje ICMP de "puerto inalcanzable".</P>
<P>Hay mas mensajes ICMP, muchos de ellos referidos a condiciones de error. Sin embargo, hay uno interesante que es el de redirecci&oacute;n. Lo genera el modulo de encaminamiento al detectar que otro nodo esta us&aacute;ndolo como pasarela, a pesar de existir una ruta mucho mas corta. Por ejemplo, tras configurarse la tabla de encaminamiento de sophus, esta puede estar incompleta, conteniendo rutas a trav&eacute;s del encaminador por defecto gcc1. Por lo tanto, los paquetes enviados inicialmente a quark ir&aacute;n por gcc1 en lugar de niels.</P>
<P>En este caso gcc1 notificara a sophus que esta usando una ruta costosa y reenviara el datagrama a niels, al mismo tiempo que devolver&aacute; un mensaje ICMP de redirecci&oacute;n a sophus inform&aacute;ndole de la nueva ruta.</P>
<P>Con lo visto, queda claro que se puede evitar tener que establecer las rutas a mano. Sin embargo, usar solo esquemas de encaminamiento din&aacute;mico no es siempre una buena idea. La redirecci&oacute;n de ICMP y el protocolo RIP no incluyen mecanismos de verificaci&oacute;n de la autenticidad de los mensajes. Esto permite a los piratas corromper el tr&aacute;fico de la red mediante mensajes ICMP. Por ello, algunas versiones del c&oacute;digo de Linux tratan los mensajes de redirecci&oacute;n que afectan a rutas de red como si fueran redirecciones de rutas a nodos.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="2.6"></a>2.6 El sistema de nombres DNS</P>
</font></u></B><U><I><FONT FACE="Verdana" SIZE=2> 
<P><a name="2.6.1"></a>2.6.1 Resoluci&oacute;n de nombres</P>
</font></I></U><FONT FACE="Verdana" SIZE=2> 
<P>3 Como se coment&oacute; antes, el direccionamiento en TCP/IP se basa en n&uacute;meros 
  de 32 bits. Evidentemente, esos n&uacute;meros no son f&aacute;ciles de recordar, 
  mientras que si lo es el nombre que se le asigna a cada m&aacute;quina, como 
  gauss o strange. Existe una aplicaci&oacute;n que es capaz de traducir nombres 
  a direcciones IP, y es conocida como sistema de resoluci&oacute;n de nombres 
  o DNS16.</P>
<P>_____________________________________________<BR>
  15 N. del T.: Internet Control Message Protocol</P>
<P>&nbsp;</P>
<P>Una aplicaci&oacute;n que desee encontrar la direcci&oacute;n IP correspondiente 
  a una m&aacute;quina de la que conoce su nombre, no tiene que incluir rutinas 
  para ello, ya que en las librer&iacute;as est&aacute;ndares (libc) existen ya 
  rutinas preparadas, como gethostbyname(3) o gethostbyaddr(3). </P>
<P>En otros sistemas se encuentran en otras librer&iacute;as distintas de la libc 
  pero esto no sucede en Linux. Al conjunto de rutinas que hacen estas tareas 
  se les conoce como "sistema de resoluci&oacute;n".</P>
<P>En una red peque&ntilde;a no es dif&iacute;cil mantener una tabla /etc./hosts 
  en cada m&aacute;quina, y modificarla al agregar, eliminar o modificar nodos. 
  Pero resulta complicado cuando hay muchas m&aacute;quinas ya que, en principio, 
  cada una necesita una copia de /etc./hosts.</P>
<P>Una soluci&oacute;n a esto es compartir &eacute;sta y otras bases de datos 
  con el NIS, o sistema de informaci&oacute;n de red 17, desarrollado por Sun 
  Microsystems y conocido tambi&eacute;n como paginas amarillas. En este caso, 
  las bases de datos como la de /etc./hosts se mantienen en un servidor NIS central 
  y los clientes acceder&aacute;n a ellas de forma transparente al usuario. En 
  todo caso, esta soluci&oacute;n solo es aconsejable para redes peque&ntilde;as 
  o medianas, ya que implican mantener un fichero central /etc./hosts que puede 
  crecer mucho, y luego distribuirlo entre los servidores NIS.</P>
<P>En Internet, se comenz&oacute; almacenando la informaci&oacute;n en un fichero 
  similar al hosts, mantenido por el NIC, y obtenido regularmente por los dem&aacute;s 
  servidores. Cuando la red creci&oacute; comenzaron los problemas de sobrecarga 
  de servidores, adem&aacute;s de que el NIC tenia que ocuparse de todos los nombres 
  de los nodos de Internet, y evitar la duplicidad de los mismos.</P>
<P>Por esto, en 1984 se dise&ntilde;o y adopto oficialmente un nuevo sistema, 
  el DNS o sistema de nombres por dominios, dise&ntilde;ado por Paul Mockapetris.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="2.6.2"></a>2.6.2 Introducci&oacute;n al DNS</P>
</u></I>
<P>DNS organiza los nombres de los nodos en una jerarqu&iacute;a de dominios. 
  Un dominio es una colecci&oacute;n de nodos relacionados de alguna manera, como 
  estar en la misma red o pertenecer a una misma organizaci&oacute;n o pa&iacute;s. 
  Por ejemplo, las universidades norteamericanas se agrupan en el dominio edu, 
  y cada universidad mantiene un subdominio dentro de edu. Nuestro ejemplo, la 
  Universidad de Groucho Marx, mantendr&iacute;a el dominio gmu.edu y las m&aacute;quinas 
  del departamento de Matem&aacute;ticas se encontrar&iacute;an dentro del dominio 
  maths.gmu.edu.</P>
<P>_____________________________________________<BR>
  16 N. del T.: Domain Name System<BR>
  17 N. del T.: Network Information System</P>
<P>&nbsp;</P>
<P>De este modo el nombre completo de la m&aacute;quina erdos ser&aacute; erdos.maths.gmu.edu. 
  El nombre completo se conoce como nombre totalmente cualificado o FQDN18, e 
  identifica a ese nodo en todo el mundo.</P>
<P>&nbsp;</P>
</FONT>
<P ALIGN="CENTER"><IMG SRC="fig2.3.gif" WIDTH=532 HEIGHT=288></P>
<FONT FACE="Verdana" SIZE=2> 
<P><a name="i.2.3"></a>Figura 2.3: Parte del espacio de dominios</P>
<P>&nbsp;</P>
<P>En la figura 2.3 se muestra una secci&oacute;n del espacio de dominios. La 
  entrada de la ra&iacute;z del &aacute;rbol, que se indica con un punto, se puede 
  denominar dominio ra&iacute;z, y agrupa al resto de los dominios. Para indicar 
  que un nodo se expresa en notaci&oacute;n FQDN, se puede terminar el nombre 
  en un punto, indicando as&iacute; que el nombre incluye al del dominio ra&iacute;z. 
</P>
<P>Dependiendo de su localizaci&oacute;n en la jerarqu&iacute;a, un dominio puede 
  ser de primer, segundo o tercer nivel. Pueden existir otros niveles pero no 
  son frecuentes. Por ejemplo, algunos dominios de primer nivel muy usuales son 
  los siguientes:</P>
<UL>
  <LI><B>edu</b> Aqu&iacute; se incluyen casi todas las universidades o centros 
    de investigaci&oacute;n norteamericanos. </LI>
  <LI><B>com</b> Compa&ntilde;&iacute;as u organizaciones con fines comerciales. 
  </LI>
  <LI><B>org</b> Organizaciones no comerciales. Las redes UUCP privadas se encuentran 
    aqu&iacute;. </LI>
  <LI><B>net</b> Pasarelas y otros nodos administrativos de la red. </LI>
  <LI><B>mil</b> Nodos militares norteamericanos. </LI>
  <LI><B>gov</b> Nodos del gobierno norteamericano. </LI>
  <LI><B>uucp</b> Oficialmente, todos los nombres de nodos UUCP sin dominio han 
    sido movidos a este nuevo dominio, .uucp.</LI>
</UL>
<P>_____________________________________________<BR>
  18 N. del T.: Fully Qualified Domain Name</P>
<P>&nbsp;</P>
<P>En general, los dominios anteriores pertenecen a redes norteamericanas. Algo 
  especialmente cierto con los dominios mil o gov.</P>
<P>Fuera de los Estados Unidos, existe un dominio de primer nivel para cada pa&iacute;s, 
  de dos letras seg&uacute;n se define en la norma ISO-3166. Finlandia, por ejemplo, 
  usa el dominio fi; el dominio de corresponde a Alemania y el dominio es corresponde 
  a Espa&ntilde;a. Cada pa&iacute;s organiza por debajo del primer nivel, los 
  dominios de segundo nivel, de manera parecida a los americanos en algunos casos 
  (por ejemplo, con dominios com.au o edu.au) o directamente por organizaciones, 
  como sucede en Espa&ntilde;a (con dominios como upm.es para la Universidad Polit&eacute;cnica 
  de Madrid).</P>
<P>Por supuesto, un nodo dentro del dominio de un pa&iacute;s puede no estar f&iacute;sicamente 
  en &eacute;l. El dominio &uacute;nicamente identifica al nodo como registrado 
  en el NIC de ese pa&iacute;s. As&iacute;, un comerciante sueco puede tener una 
  delegaci&oacute;n en Australia, y tener sus nodos australianos registrados dentro 
  del dominio de primer nivel sueco, se.</P>
<P>Esta organizaci&oacute;n por dominios soluciona el problema de la unicidad 
  de nombres. Adem&aacute;s, los nombres totalmente cualificados no son dif&iacute;ciles 
  de recordar.</P>
<P>Pero DNS tiene otras ventajas: permite delegar la autoridad sobre un determinado 
  subdominio a sus administradores. Por ejemplo, los subdominios maths y physics 
  de la UGM son creados y mantenidos por el Centro de Calculo de dicha universidad. 
  Y si el mantenimiento del subdominio maths.gmu.edu fuese complicado (por n&uacute;mero 
  elevado de nodos, existencia de subdominios internos, etc.), el Centro de C&aacute;lculo 
  de la UGM puede delegar la autoridad sobre ese subdominio al departamento de 
  Matem&aacute;ticas. La delegaci&oacute;n de un subdominio implica el control 
  total del mismo por parte de la organizaci&oacute;n en la que se delego, con 
  total libertad para crear nuevos subdominios internos, asociar nombres a nodos, 
  etc.</P>
<P>Para este fin, el espacio de nombres se divide en zonas, cada una asociada 
  a un dominio. N&oacute;tese que existe una diferencia entre zona y dominio: 
  el dominio groucho.edu incluye todos los nodos de la UGM, mientras que la zona 
  groucho.edu incluye s&oacute;lo los nodos que mantiene directamente el Centro 
  de Calculo, ya que los nodos del subdominio physics.groucho.edu pertenecen a 
  la zona controlada por el Departamento de F&iacute;sicas. En la figura 2.3 se 
  marca el inicio de una zona con un peque&ntilde;o circulo a la derecha del nombre 
  del dominio.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="2.6.3"></a>2.6.3 B&uacute;squedas de nombres con DNS</P>
</u></I> 
<P>Trataremos aqu&iacute; el problema de como resolver el nombre de un determinado 
  nodo.</P>
<P>DNS es una gigantesca base de datos distribuida. Se implementa a trav&eacute;s 
  de los llamados servidores de nombres. Cada uno de &eacute;stos mantiene la 
  informaci&oacute;n de uno o varios dominios.</P>
<P>Para cada zona hay al menos dos (o mas) servidores de nombres que mantienen 
  informaci&oacute;n autorizada sobre los nodos de esa zona. Para obtener la direcci&oacute;n 
  IP del nodo erdos, lo que hay que hacer es contactar con el servidor de nombres 
  de la zona para groucho.edu y &eacute;ste nos devolver&aacute; los datos pedidos.</P>
<P>Esto parece f&aacute;cil de decir pero dif&iacute;cil de implementar pues nos 
  preguntaremos como localizar al servidor de nombres de la UGM. Si su ordenador 
  no implementa un adivino, le ayudara el DNS. Cuando su aplicaci&oacute;n desea 
  encontrar informaci&oacute;n acerca de erdos, contactara en primer lugar con 
  un servidor de nombres local, quien realizara una b&uacute;squeda por otros 
  servidores. Empieza por preguntar a un servidor de nombres ra&iacute;z por erdos.maths.groucho.edu. 
  Al comprobar este &uacute;ltimo que &eacute;l no mantiene ese dominio, contactar&aacute; 
  con los servidores del dominio edu y les preguntara las direcciones de los servidores 
  de nombres, que retornara al servidor local. Ahora nuestro servidor preguntara 
  a estos &uacute;ltimos y &eacute;stos a su vez ir&aacute;n haciendo llegar a 
  nuestro servidor hasta los que mantienen la zona groucho.edu. Finalmente, se 
  preguntara a uno de estos &uacute;ltimos por el nodo erdos y se enviara la respuesta 
  al usuario.</P>
<P>Aparentemente esto provoca mucho tr&aacute;fico, aunque en todo caso siempre 
  ser&aacute; menor que preguntar siempre a los mismos servidores que manten&iacute;an 
  el fichero HOSTS.TXT antes de que se dise&ntilde;ar&aacute; el DNS.</P>
<P>Sin embargo, aun se puede mejorar algo mas. La informaci&oacute;n obtenida 
  en una b&uacute;squeda puede que se necesite despu&eacute;s. Por ello, el servidor 
  de nombres local la guardara en una cache local. As&iacute;, cuando volvamos 
  a preguntar por un nodo de groucho.edu, el servidor local ya podr&aacute; dirigirse 
  directamente el servidor de nombres de esa zona sin pasar por los servidores 
  ra&iacute;z.</P>
<P>Por supuesto, el servidor de nombres no puede mantener la cache eternamente; 
  debe descartarla cada cierto tiempo. Este tiempo de expiraci&oacute;n se conoce 
  como TTL19 o tiempo de vida. En la base de datos del DNS queda especificado 
  este par&aacute;metro.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="2.6.4"></a>2.6.4 Servidores de Nombres</P>
</u></I> 
<P>Cuando un servidor de nombres mantiene toda la informaci&oacute;n acerca de 
  una zona se le llama autorizado para esa zona. Cualquier petici&oacute;n para 
  esa zona ser&aacute; enviada a uno de esos servidores maestros.</P>
<P>_____________________________________________<BR>
  19 N. del T.: Time To Live</P>
<P>&nbsp;</P>
<P>Para tener una representaci&oacute;n coherente de la zona, sus servidores maestros 
  deben estar sincronizados. Para ello, a uno de ellos se le nombra servidor primario, 
  que obtiene la informaci&oacute;n de zona a partir de unos ficheros locales, 
  y a los dem&aacute;s se les nombra servidores secundarios. Estos &uacute;ltimos 
  cargan la informaci&oacute;n de la zona pidi&eacute;ndosela al primario cada 
  cierto tiempo.</P>
<P>Las razones para que existan varios servidores autorizados por cada zona son 
  dos: repartir la carga de trabajo y lograr tolerancia a fallos. As&iacute;, 
  si un servidor cae, todas las peticiones se repartir&aacute;n entre los dem&aacute;s 
  servidores autorizados que haya. Por supuesto, esto no protege contra fallos 
  internos o bugs del propio software DNS.</P>
<P>Pero adem&aacute;s, tambi&eacute;n es posible tener servidores de nombres que 
  no mantengan informaci&oacute;n autorizada de ning&uacute;n dominio20. Este 
  tipo de servidores es &uacute;til pues, al mantener una cache con los nombres 
  que resuelven, disminuye la carga de la red y de otros servidores.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="2.6.5"></a>2.6.5 La Base de Datos DNS</P>
</u></I> 
<P>En las bases de datos del DNS se mantiene mas informaci&oacute;n que la necesaria 
  para traducir nombres a direcciones IP. Dicho de otra forma, en DNS se mantienen 
  distintos tipos de registros.</P>
<P>La unidad de informaci&oacute;n en el DNS se conoce como registro de recurso 
  o RR. Cada registro tiene un tipo asociado a &eacute;l, describiendo que clase 
  de datos contiene, y una clase indicando el tipo de red al que se aplica. Se 
  trata de acomodarse a diferentes esquemas de red, aunque para direcciones IP 
  se usa siempre la clase IN (INternet), pero hay otras como las redes Hesiod 
  (que se usan en el MIT21). El registro mas habitual es el de tipo A, que relaciona 
  un nombre totalmente cualificado con una direcci&oacute;n IP.</P>
<P>Un nodo puede admitir mas de un nombre. Pero solo uno de ellos ser&aacute; 
  "oficial" o can&oacute;nico, mientras que los dem&aacute;s son alias del primero. 
  La diferencia es que el can&oacute;nico se define en un registro de tipo A, 
  mientras que los alias se definen en registros CNAME que apuntan al nombre can&oacute;nico.</P>
<P>En un cap&iacute;tulo posterior se trata todo esto en profundidad. Aqu&iacute; 
  nos vamos a limitar a ver algunos ejemplos. En la figura 2.4 se muestra una 
  parte de la base de datos para la zona physics.groucho.edu.</P>
<P>Adem&aacute;s de los registros A y CNAME, se puede ver que hay un registro 
  especial al principio del fichero, con varias l&iacute;neas. Se trata del registro 
  SOA o de inicio de autoridad, que mantiene informaci&oacute;n general sobre 
  el servidor de nombres. Por ejemplo, el tiempo de vida por defecto de todos 
  los registros que mantiene.</P>
<P>_____________________________________________<BR>
  20 Aunque al menos deber&aacute; tener informaci&oacute;n autorizada para el 
  localhost y la resoluci&oacute;n inversa de 127.0.0.1<BR>
  21 Instituto Tecnol&oacute;gico de Massachusets</P>
<P>&nbsp;</P>
<DIR> 
  <DIR> 
    <P>;<BR>
      ; Informaci&oacute;n Autorizada de physics.groucho.edu<BR>
      @ IN SOA (<BR>
      niels.physics.groucho.edu.<BR>
      hostmaster.niels.physics.groucho.edu.<BR>
      1034 ; serial no<BR>
      360000 ; refresh<BR>
      3600 ; retry<BR>
      3600000 ; expire<BR>
      3600 ; default ttl )<BR>
      ;<BR>
      ; Servidores de nombres autorizados<BR>
      IN NS niels<BR>
      IN NS gauss.maths.groucho.edu.<BR>
      gauss.maths.groucho.edu. IN A 149.76.4.23<BR>
      ;<BR>
      ; F&iacute;sica Te&oacute;rica (subred 12)<BR>
      niels IN A 149.76.12.1<BR>
      IN A 149.76.1.12<BR>
      nameserver IN CNAME niels<BR>
      otto IN A 149.76.12.2<BR>
      quark IN A 149.76.12.4<BR>
      down IN A 149.76.12.5<BR>
      strange IN A 149.76.12.6<BR>
      ...<BR>
      ; Laboratorio Collider (subred 14)<BR>
      boson IN A 149.76.14.1<BR>
      muon IN A 149.76.14.7<BR>
      bogon IN A 149.76.14.12<BR>
      ...</P>
  </DIR>
</DIR>
<P>Figura 2.4: Extracto del fichero named.hosts del departamento de F&iacute;sicas.</P>
<P>&nbsp;</P>
<P>N&oacute;tese que aquellos nombres que no finalicen en un punto ser&aacute;n 
  interpretados como relativos al dominio en cuesti&oacute;n. El nombre especial 
  "@" usado en el registro SOA representa al dominio completo.</P>
<P>Hemos visto que los servidores para el dominio groucho.edu deben tener conocimiento 
  sobre los servidores de la zona physics para poder reenviarles las peticiones 
  para &eacute;sta. Esto se suele incluir en los registros NS que incluyen el 
  nombre de los servidores en notaci&oacute;n FQDN, y un registro A que da la 
  direcci&oacute;n IP para ese servidor. V&eacute;ase, por ejemplo, la figura 
  2.5.</P>
<DIR> 
  <DIR> 
    <P>;<BR>
      ; Datos de zona para groucho.edu.<BR>
      @ IN SOA (<BR>
      vax12.gcc.groucho.edu.<BR>
      hostmaster.vax12.gcc.groucho.edu.<BR>
      233 ; serial no<BR>
      360000 ; refresh<BR>
      3600 ; retry<BR>
      3600000 ; expire<BR>
      3600 ; default ttl )<BR>
      ....<BR>
      ;<BR>
      ; Registros de la zona.<BR>
      physics IN NS niels.physics.groucho.edu.<BR>
      IN NS gauss.maths.groucho.edu.<BR>
      niels.physics IN A 149.76.12.1<BR>
      gauss.maths IN A 149.76.4.23<BR>
      ...</P>
  </DIR>
</DIR>
<P>Figura 2.5: Extracto del fichero named.hosts de la UGM.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="2.6.6"></a>2.6.6 Resoluci&oacute;n inversa</P>
</u></I> 
<P>Adem&aacute;s de la obtenci&oacute;n de una direcci&oacute;n IP a partir del 
  nombre, a veces interesa lo contrario: conocida la direcci&oacute;n, obtener 
  el nombre can&oacute;nico. Esto se conoce como traducci&oacute;n inversa y la 
  utilizan algunas aplicaciones de red para verificar la identidad del llamante. 
  Cuando se usa un fichero hosts, la resoluci&oacute;n inversa supone una simple 
  b&uacute;squeda en el mismo.</P>
<P>En cambio, para el DNS se ha creado un dominio especial, el in-addr.arpa, que 
  contiene direcciones de los nodos en notaci&oacute;n de puntos divisorios invertida. 
  Por ejemplo, a la direcci&oacute;n IP 149.76.12.4 le corresponde el nombre 4.12.76.149.in-addr.arpa. 
  El tipo de registro para estos datos se llama PTR.</P>
<P>Cuando se crea una zona de autoridad suele significar que sus administradores 
  tienen control total sobre como asignan sus nombres. Pero a una subred se le 
  puede delegar un subdominio.</P>
<P>Esto sucede con la UGM, donde se delega la zona de F&iacute;sicas (subdominio 
  physics) al correspondiente Departamento. Las direcciones de resoluci&oacute;n 
  inversa tambi&eacute;n se delegan.</P>
<P>En la figura 2.6 se muestra el contenido del fichero de zona para el servidor 
  de la subred 12. Los registros "importantes" de delegaci&oacute;n se muestran 
  en la figura 2.7.</P>
<DIR> 
  <DIR> 
    <P>;<BR>
      ; Dominio 12.76.149.in-addr.arpa<BR>
      @ IN SOA (<BR>
      niels.physics.groucho.edu.<BR>
      hostmaster.niels.physics.groucho.edu.<BR>
      233 360000 3600 3600000 3600 )<BR>
      2 IN PTR otto.physics.groucho.edu.<BR>
      4 IN PTR quark.physics.groucho.edu.<BR>
      5 IN PTR down.physics.groucho.edu.<BR>
      6 IN PTR strange.physics.groucho.edu.</P>
  </DIR>
</DIR>
<P>Figura 2.6: Extracto del fichero named.rev de la subred 12.</P>
<P>&nbsp;</P>
<P>Una importante consecuencia de esto es que las zonas solo pueden crearse como 
  superconjuntos de redes IP, y adem&aacute;s, las m&aacute;scaras de red deber&aacute;n 
  redondearse a nivel de octeto. Es decir, las subredes de la UGM tendr&aacute;n 
  una m&aacute;scara 255.255.255.0, y para cada subred deber&aacute; existir una 
  zona in-addr.arpa. Sin embargo, si la m&aacute;scara fuese 255.255.255.128, 
  la creaci&oacute;n de zonas para la subred 149.76.12.128 ser&iacute;a imposible 
  ya que no hay forma de decir en DNS que el dominio 12.76.149.in-addr.arpa ha 
  sido dividido en dos zonas de autoridad, con nombres de nodos desde el 1 al 
  127, y desde el 128 al 255, respectivamente.</P>
<DIR> 
  <DIR> 
    <P>;<BR>
      ; Dominio 76.149.in-addr.arpa domain<BR>
      @ IN SOA (<BR>
      vax12.gcc.groucho.edu.<BR>
      hostmaster.vax12.gcc.groucho.edu.<BR>
      233 360000 3600 3600000 3600 )<BR>
      ...<BR>
      ; subred 4: Departamento de Matem&aacute;ticas<BR>
      1.4 IN PTR sophus.maths.groucho.edu.<BR>
      17.4 IN PTR erdos.maths.groucho.edu.<BR>
      23.4 IN PTR gauss.maths.groucho.edu.<BR>
      ...<BR>
      ; subred 12: Departamento de f&iacute;sicas, zona separada<BR>
      12 IN NS niels.physics.groucho.edu.<BR>
      IN NS gauss.maths.groucho.edu.<BR>
      niels.physics.groucho.edu. IN A 149.76.12.1<BR>
      gauss.maths.groucho.edu. IN A 149.76.4.23<BR>
      ...</P>
  </DIR>
</DIR>
<P>Figura 2.7: Extracto del fichero named.rev de la red 149.76.&nbsp;</P>
</FONT> 
</BODY>
</HTML>
