<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl6</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl05.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl07.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 6</P>
</font></B><P><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>Servicio de nombres. Configuraci&oacute;n</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Como se coment&oacute; en el cap&iacute;tulo 2, la red TCP/IP puede utilizar 
  diferentes m&eacute;todos para convertir nombres en direcciones IP. El mecanismo 
  m&aacute;s simple consiste en almacenar los nombres en una tabla de m&aacute;quinas 
  en el fichero /etc/hosts. Esto es &uacute;nicamente interesante en el caso de 
  peque&ntilde;as redes de &aacute;rea local que solo requieran la administraci&oacute;n 
  de una persona, y que no tengan trafico IP con el mundo exterior. Recordamos 
  que el formato del fichero hosts fue descrito en el cap&iacute;tulo 5.</P>
<P>Alternativamente, puede utilizarse BIND - el servicio de nombres Internet de 
  Berkeley o "Berkeley Internet Name Domain" - para traducir nombres de m&aacute;quinas 
  a direcciones IP (cosa que tambi&eacute;n se conoce como resoluci&oacute;n). 
  Configurar BIND puede ser una laboriosa tarea pero, una vez hecho, los cambios 
  en la topolog&iacute;a de la red ser&aacute;n mucho m&aacute;s f&aacute;ciles 
  de hacer. En Linux, como en muchos otros sistemas Unix, el servicio de nombres 
  se realiza mediante un programa llamado named. Al iniciarse, carga un conjunto 
  de ficheros maestros en su cache y espera peticiones de procesos locales o remotos. 
  Existen distintas maneras de preparar BIND, y no es necesario ejecutar un servidor 
  de nombres en cada m&aacute;quina: generalmente, uno para toda la red es suficiente.</P>
<P>&nbsp;Este cap&iacute;tulo le dar&aacute; ideas generales acerca de como configurar 
  y ejecutar un servidor de nombres. Si pretende usar BIND en un entorno mas complejo 
  que una peque&ntilde;a red local (tal vez con conexi&oacute;n a Internet) deber&iacute;a 
  echar un vistazo a un buen libro sobre BIND, como "DNS y BIND" de Cricket Liu 
  (vea [AlbitzLiu92]). Adem&aacute;s, le interesar&aacute; echar un vistazo a 
  los comentarios adicionales que aparecen junto a las fuentes de su versi&oacute;n 
  de BIND. Tambi&eacute;n existe un grupo de news para cuestiones sobre DNS: el 
  grupo comp.protocols.tcp-ip.domains.</P>
</FONT> 
<dir>
    <p><font face="Verdana" size="2"><a href="garl06.htm#6.1">6.1 La biblioteca 
      de resoluci&oacute;n</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl06.htm#6.1.1">6.1.1 El fichero 
          host.conf</a><br>
          <a href="garl06.htm#6.1.2">6.1.2 Variables de entorno</a><br>
          <a href="garl06.htm#6.1.3">6.1.3 Configuraci&oacute;n del fichero resolv.conf</a><br>
          <a href="garl06.htm#6.1.4">6.1.4 Robustez del sistema de resoluci&oacute;n</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl06.htm#6.2">6.2 Ejecuci&oacute;n 
      de named</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl06.htm#6.2.1">6.2.1 El fichero 
          named.boot</a><br>
          <a href="garl06.htm#6.2.2">6.2.2 Ficheros de base de datos DNS</a><br>
          <a href="garl06.htm#6.2.3">6.2.3 Escribiendo los ficheros</a><br>
          <a href="garl06.htm#6.2.4">6.2.4 Comprobaci&oacute;n del funcionamiento 
          del servidor de nombres</a><br>
          <a href="garl06.htm#6.2.5">6.2.5 Otras utilidades interesantes</a></font></p>
      </dir>
    </dir>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="6.1"></a>6.1 La biblioteca de resoluci&oacute;n</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Cuando hablamos del "sistema de resoluci&oacute;n", no nos referiremos a una 
  aplicaci&oacute;n en particular, sino a la biblioteca de resoluci&oacute;n: 
  un conjunto de funciones que pueden encontrarse en las bibliotecas est&aacute;ndar 
  del lenguaje C. Las rutinas principales son gethostbyname(2) y gethostbyaddr(2), 
  que buscan la direcci&oacute;n IP de una m&aacute;quina a partir del nombre 
  y viceversa. Es posible configurarlas para que simplemente miren en el fichero 
  hosts local (o remoto, si se usa NIS). Otras aplicaciones, como smail, pueden 
  incluir diferentes rutinas para esto y necesitan cierto cuidado.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="6.1.1"></a>6.1.1 El fichero host.conf</P>
</u></I>
<P>El fichero host.conf es fundamental para controlar la configuraci&oacute;n 
  del sistema de resoluci&oacute;n de nombres. Se encuentra en el directorio /etc 
  e indica al sistema de resoluci&oacute;n que servicios debe usar y en que orden.</P>
<P>Las opciones del fichero host.conf deben estar en l&iacute;neas distintas. 
  Los campos deben separarse por blancos (espacios o tabuladores). Un s&iacute;mbolo 
  almohadillado (#) supone desde ese punto hasta el final de la l&iacute;nea un 
  comentario del fichero.</P>
<P>Las opciones disponibles son las siguientes:</P>
</FONT> 
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>order</b></font><FONT FACE="Verdana" SIZE=2> Determina el orden en el que los servicios de resoluci&oacute;n se usan. Opciones validas son bind para usar el servidor de nombres, hosts para buscar en /etc/hosts y nis para buscar con NIS. Puede especificarse cualquiera de las anteriores, y el orden de aparici&oacute;n determina que servicio se prueba en primer lugar para intentar resolver el nombre.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>multi</b></font><FONT FACE="Verdana" SIZE=2> Va con las opciones on u off. Determina si una m&aacute;quina del fichero /etc/hosts puede tener distintas direcciones IP o no. Esta opci&oacute;n no tiene efecto en peticiones v&iacute;a NIS o DNS.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>nospoof</b></font><FONT FACE="Verdana" SIZE=2> Como se explic&oacute; en el cap&iacute;tulo anterior, DNS le permite encontrar un nombre de m&aacute;quina perteneciente a una direcci&oacute;n IP dada utilizando el dominio in-addr.arpa. Los intentos de los servidores de nombres de proporcionar un nombre falso se conocen en ingl&eacute;s como "spoofing"1. Para evitar esto, el sistema puede configurarse para comprobar si las direcciones IP originales est&aacute;n de hecho asociadas con el nombre obtenido. Si no, el nombre ser&aacute; rechazado y se retornar&aacute; un error. Esta opci&oacute;n se activa poniendo nospoof on.</font></P><FONT FACE="Verdana" SIZE=2>
<P>_____________________________________________<BR>
1 N. del T.: literalmente, burla</P>
<P>&nbsp;</P>
</FONT>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>alert</b></font><FONT FACE="Verdana" SIZE=2> Esta opci&oacute;n puede ir con las palabras on u off. Si se activa, cualquier intento de dar nombre falso ser&aacute; anotado con un mensaje enviado al sistema de registros syslog.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>trim</b></font><FONT FACE="Verdana" SIZE=2> Esta opci&oacute;n lleva un nombre de dominio como argumento, que se quitar&aacute; a los nombres antes de buscar su direcci&oacute;n. Es &uacute;til para las entradas del fichero hosts, que podr&aacute;n as&iacute; ir solos los nombres de m&aacute;quinas, sin el dominio.</font></P>
<FONT FACE="Verdana" SIZE=2> 
<P>Cuando se busque una m&aacute;quina con el nombre de dominio local &eacute;ste 
  ser&aacute; eliminado, haciendo que la b&uacute;squeda en el fichero /etc/hosts 
  tenga &eacute;xito. Esta opci&oacute;n puede ir repetida con varios dominios, 
  de modo que su m&aacute;quina podr&iacute;a ser local a diversos dominios.</P>
<P>Un ejemplo de este fichero para la m&aacute;quina vlager seria:</P>
<DIR> 
  <DIR> 
    <P># /etc/host.conf<BR>
      # Tenemos servidor de nombres, pero no NIS (de momento)<BR>
      order bind hosts<BR>
      # Permitir multiples direcciones<BR>
      multi on<BR>
      # Contra los nombres falsos<BR>
      nospoof on<BR>
      # Dominio local por defecto (no necesario).<BR>
      trim vbrew.com.</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<I><U>
<P><a name="6.1.2"></a>6.1.2 Variables de entorno</P>
</u></I>
<P>Existen algunas variables de entorno que establecen opciones que tienen mas 
  prioridad sobre las puestas en el fichero host.conf. Estas son:</P>
</FONT> 
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>RESOLV_HOST_CONF<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Especifica un fichero alternativo a /etc/host.conf.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>RESOLV_SERV_ORDER<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Establece la opci&oacute;n equivalente a la orden order del fichero anterior. Los servicios pueden ser hosts, bind y/o nis, separados por comas, espacios, puntos o puntos y coma.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>RESOLV_SPOOF_CHECK<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Determina la pol&iacute;tica seguida frente a los nombres falsos. Estar&aacute; completamente desactivada con la opci&oacute;n off. Con las opciones warn y warn off se realizar&aacute;n comprobaciones contra los nombres falsos, pero en el primer caso se mandar&aacute;n los avisos al registro. Un valor * activa las comprobaciones contra nombres falsos, pero las anotaciones en el registro se dejan como diga el fichero host.conf.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>RESOLV_MULTI<BR>
</b></font><FONT FACE="Verdana" SIZE=2>El valor on activa la opci&oacute;n "multi", y el valor off la desactiva.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>RESOLV_OVERRIDE_TRIM_DOMAINS<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esta variable lleva una lista de dominios por defecto, similar a la puesta en el fichero host.conf con la opci&oacute;n trim.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>RESOLV_ADD_TRIM_DOMAINS<BR>
</b></font><FONT FACE="Verdana" SIZE=2>Esta variable lleva una lista de dominios por defecto que se a&ntilde;ade a las que se dan en el fichero host.conf.</font></P>
<FONT FACE="Verdana" SIZE=2> 
<P>&nbsp;</P>
<I><U> 
<P><a name="6.1.3"></a>6.1.3 Configuraci&oacute;n del fichero resolv.conf</P>
</u></I> 
<P>Cuando se configura la librer&iacute;a de resoluci&oacute;n para utilizar los 
  servicios de BIND, tiene que indicarse tambi&eacute;n que servidores utilizar. 
  El fichero resolv.conf contiene una lista de servidores, que si est&aacute; 
  vac&iacute;a har&aacute; considerar al sistema que el servidor est&aacute; en 
  su m&aacute;quina.</P>
<P>Si ejecuta un servidor de nombres en su m&aacute;quina local, tendr&aacute; 
  que configurarlo por separado, como se explicar&aacute; despu&eacute;s. Si se 
  encuentra en una red local y puede usar un servidor de nombres existente, mejor.</P>
<P>La opci&oacute;n m&aacute;s importante del fichero resolv.conf es nameserver, 
  que tiene la direcci&oacute;n IP del servidor de nombres a usar. Si especifican 
  varios servidores poniendo varias l&iacute;neas nameserver, se intentar&aacute;n 
  usar en el orden dado; por lo que deber&iacute;a poner en primer lugar el servidor 
  de nombres m&aacute;s r&aacute;pido o cercano. Actualmente, puede ponerse un 
  m&aacute;ximo de tres servidores distintos.</P>
<P>Si no hay ninguna l&iacute;nea nameserver, se intentar&aacute; buscar el servidor 
  en la propia m&aacute;quina local.</P>
<P>Hay dos opciones m&aacute;s: domain y search, indicando la primera dominios 
  alternativos a probar si la b&uacute;squeda inicial del nombre falla. Estos 
  dominios ir&aacute;n separados por blancos o tabuladores.</P>
<P>Si no se incluye una opci&oacute;n search, se construir&aacute; una lista de 
  b&uacute;squeda por defecto por el dominio local mas todos los dominios padre 
  hasta el ra&iacute;z. El dominio local puede darse con la opci&oacute;n domain, 
  y si no se da ninguno el sistema de resoluci&oacute;n lo obtendr&aacute; mediante 
  la llamada al sistema getdomainname(2).</P>
<P>Como lo anterior puede resultar confuso, sea el siguiente ejemplo de fichero 
  resolv.conf para la Cervecera Virtual:</P>
<DIR> 
  <DIR> 
    <P># /etc/resolv.conf<BR>
      # Nuestro dominio<BR>
      domain vbrew.com<BR>
      #<BR>
      # Nuestro servidor principal va a ser vlager:<BR>
      nameserver 191.72.1.1</P>
    <P>&nbsp;</P>
  </DIR>
</DIR>
<P>Cuando se trate de traducir el nombre vale, el sistema empezar&aacute; por 
  buscar directamente vale y si falla, probar&aacute; con vale.vbrew.com y finalmente 
  vale.com.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="6.1.4"></a>6.1.4 Robustez del sistema de resoluci&oacute;n</P>
</u></I> 
<P>Si tiene en funcionamiento una red local dentro de otra m&aacute;s grande, 
  deber&aacute; usar servidores de nombres principales siempre que sea posible. 
  La ventaja de hacerlo as&iacute; es que se consiguen generosas memorias cache, 
  ya que todas las peticiones de nombres les llegan a ellos. Este esquema, sin 
  embargo, tiene un inconveniente: cuando un incendio inutiliz&oacute; el cable 
  de red dorsal de nuestro departamento en la Universidad, no pudimos trabajar, 
  pues ninguno de los servidores de nombres estaban accesibles. No funcionaban 
  ni los terminales X ni las impresoras...</P>
<P>Aunque no es muy habitual que las redes dorsales de las universidades sean 
  pasto de las llamas, deber&iacute;an tomarse precauciones para casos como &eacute;ste. 
</P>
<P>Una soluci&oacute;n es poner un servidor de nombres local que se ocupe de sus 
  nombres locales, y reenv&iacute;e todas las peticiones de otros nombres a los 
  servidores principales. Por supuesto, &eacute;sto solo es posible si usted tiene 
  un dominio propio.</P>
<P>Alternativamente, puede mantener una copia de la tabla de nombres para su dominio 
  o red local en el fichero /etc/hosts. En el fichero /etc/host.conf deber&aacute; 
  incluir la opci&oacute;n "order bind hosts" para obligar a usar el fichero local 
  si el servidor principal de nombres falla.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="6.2"></a>6.2 Ejecuci&oacute;n de named</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>El programa que proporciona servicio de nombres en las m&aacute;quinas UNIX 
  suele ser named 2. Es un servidor desarrollado inicialmente para Unix tipo BSD, 
  con el prop&oacute;sito de proporcionar servicio de nombres a m&aacute;quinas 
  clientes y posiblemente a otros servidores de nombres.</P>
<P>La versi&oacute;n actualmente utilizada en casi todos los sistemas Linux es 
  BIND-4.8.3. La nueva versi&oacute;n, BIND-4.9.3, esta en este momento en versi&oacute;n 
  Beta, y pronto estar&aacute; disponible para Linux.</P>
<P>_____________________________________________<BR>
  2 N. del T.: Pron&uacute;nciese neim-di:</P>
<P>&nbsp;</P>
<P>Esta secci&oacute;n requiere ideas acerca de como funciona el Sistema de Nombres 
  y Dominios (DNS). Si lo que sigue a continuaci&oacute;n le suena a chino, puede 
  releer el cap&iacute;tulo 2, que le dar&aacute; informaci&oacute;n acerca de 
  como funciona b&aacute;sicamente el DNS.</P>
<P>El programa named suele iniciarse al arrancar la m&aacute;quina, y ejecutarse 
  hasta que se apaga. Obtiene la informaci&oacute;n que necesita de un fichero 
  llamado /etc/named.boot, y diversos ficheros que contienen datos acerca de nombres 
  de dominio y direcciones, llamados ficheros de zona. Los formatos y sem&aacute;ntica 
  de estos ficheros ser&aacute;n explicados en la siguiente secci&oacute;n.</P>
<P>Para ejecutar named, solo tiene que teclear:</P>
<DIR> 
  <DIR> 
    <P># /usr/sbin/named</P>
  </DIR>
</DIR>
<P>El programa named se iniciar&aacute; y leer&aacute; el fichero named.boot y 
  los ficheros de zona que se especifiquen en &eacute;l. Su n&uacute;mero de proceso 
  ser&aacute; anotado en ASCII en el fichero /var/run/named.pid, recibir&aacute; 
  ficheros de zona de los servidores principales si es necesario y comenzar&aacute; 
  a escuchar las peticiones de DNS por el puerto 53.3</P>
<P>&nbsp;</P>
<I><U>
<P><a name="6.2.1"></a>6.2.1 El fichero named.boot</P>
</u></I>
<P>El fichero named.boot suele ser muy peque&ntilde;o y contiene punteros a ficheros 
  con informaci&oacute;n de zonas y a otros servidores de nombres. Los comentarios 
  en este fichero comienzan con un punto y coma y se extienden hasta el siguiente 
  fin de l&iacute;nea. Antes de que veamos con m&aacute;s detalle el formato de 
  este fichero, observaremos el ejemplo para la m&aacute;quina vlager dado en 
  la figura 6.1.4</P>
<P>Los comandos cache y primary sirven para cargar informaci&oacute;n en named. 
  Esta informaci&oacute;n se obtiene de los ficheros especificados en el segundo 
  argumento. Contienen representaciones textuales de los registros DNS, que veremos 
  a continuaci&oacute;n.</P>
<P>En este ejemplo, se configura named como el servidor de nombres principal para 
  tres dominios: los que se indican con el comando primary. La primera l&iacute;nea 
  dice que named act&uacute;e como servidor principal para vbrew.com, tomando 
  la informaci&oacute;n de zona del fichero named.hosts. El comando directory 
  dice que todos los ficheros de zona se encuentran en el directorio indicado.</P>
<P>_____________________________________________<BR>
  3 Hay varios binarios de named disponibles en los servidores de FTP, cada uno 
  configurado de forma diferente. Algunos anotan su fichero de n&uacute;mero de 
  proceso en el directorio /etc/, otros en /tmp y otros en /var/tmp.<BR>
  4 Observar que los nombres de dominio del ejemplo se dan sin el punto final. 
  Versiones anteriores del programa named parece que traten los puntos al final 
  como errores y sin avisar descartan la l&iacute;nea afectada. En la versi&oacute;n 
  BIND-4.9.3 se intenta arreglar este tema.</P>
<P>&nbsp;</P>
<DIR> 
  <DIR> 
    <P>;<BR>
      ; Fichero /etc/named.boot para vlager.vbrew.com<BR>
      ;<BR>
      directory /var/named<BR>
      ;<BR>
      ; dominio fichero<BR>
      ;---------------------------------------------------<BR>
      cache . named.ca<BR>
      primary vbrew.com named.hosts<BR>
      primary 0.0.127.in-addr.arpa named.local<BR>
      primary 72.191.in-addr.arpa named.rev</P>
  </DIR>
</DIR>
<P>Figura 6.1: El fichero named.boot para vlager.</P>
<P>La entrada iniciada con la palabra cache es muy especial y debe estar presente 
  en casi todas las m&aacute;quinas que ejecuten un servidor de nombres. Su funci&oacute;n 
  es doble: indica a named que active su cache, y tambi&eacute;n que cargue la 
  informaci&oacute;n de los servidores ra&iacute;z del fichero indicado (en este 
  caso, named.ca). Regresaremos a este concepto m&aacute;s tarde.</P>
<P>A continuaci&oacute;n se presenta una lista de las opciones m&aacute;s importantes 
  que podemos poner en el fichero named.boot:</P>
</FONT> 
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>directory</b></font><FONT FACE="Verdana" SIZE=2> Especifica un directorio donde est&eacute;n los ficheros de zona. Pueden ponerse varios directorios repitiendo el comando directory. De acuerdo con el est&aacute;ndar de sistema de ficheros para Linux, el directorio deber&iacute;a ser /var/named.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>primary</b></font><FONT FACE="Verdana" SIZE=2> Los argumentos que lleva son un nombre de dominio y un nombre de fichero , declarando el servidor local primario para el dominio de named. Como servidor primario, named carga la informaci&oacute;n de zona del fichero dado.<BR>
Normalmente, siempre habr&aacute; por lo menos un comando primary en cada fichero named.boot, para traducci&oacute;n inversa del IP 127.0.0.1, que es el interface de bucle o "loopback", como ya sabemos.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>secondary</b></font><FONT FACE="Verdana" SIZE=2> Esta sentencia tiene como par&aacute;metros un nombre de dominio, una lista de direcciones y un nombre de fichero. Declara el servidor local como servidor maestro secundario para el dominio indicado. Un servidor secundario mantiene tambi&eacute;n informaci&oacute;n "autorizada" como el primario, pero en lugar de obtenerla de un fichero, la intenta obtener de un servidor primario. Debe proporcionarse al menos una direcci&oacute;n IP de servidor primario en la lista de direcciones. El servidor local ir&aacute; contactando con cada uno de ellos hasta que transfiera con &eacute;xito la base datos de zona, que ser&aacute; almacenada en el fichero de respaldo (copia de seguridad o backup) dado en el tercer argumento del comando. Si ninguno de los servidores primarios responde, se obtendr&aacute; la informaci&oacute;n de zona del fichero de respaldo.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>named</b></font><FONT FACE="Verdana" SIZE=2> intentar&aacute; entonces refrescar los datos almacenados regularmente. Esto se explica despu&eacute;s cuando se vean las entradas "SOA" de los ficheros.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>cache</b></font><FONT FACE="Verdana" SIZE=2> Tiene como argumentos un dominio y un nombre de fichero. Contiene la lista de servidores de nombres ra&iacute;z. Solo se reconocer&aacute;n registros NS y A. El argumento domain es normalmente el nombre del dominio ra&iacute;z ("."). Esta informaci&oacute;n es fundamental: si el comando cache no existiera, named no har&iacute;a una cache local. Esto degradar&iacute;a de forma importante el rendimiento e incrementar&iacute;a la carga de la red si los nombres que se buscan no est&aacute;n en la red local. Adem&aacute;s, named tampoco ser&aacute; capaz de contactar con cualquier servidor de nombres ra&iacute;z, y por ello, no podr&aacute; resolver ninguna direcci&oacute;n excepto aquellas para las que est&eacute; autorizado. Una excepci&oacute;n a esta regla, ocurre cuando se usan servidores redirigidos (con la opci&oacute;n forwarders explicada a continuaci&oacute;n).</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>forwarders</b></font><FONT FACE="Verdana" SIZE=2> Esta opci&oacute;n lleva una lista de direcciones como argumento. Las direcciones IP en la lista especifican servidores de nombres a los que named puede preguntar si falla una traducci&oacute;n de un nombre mediante su cache local. Se intenta preguntar a todos en orden hasta que uno de ellos responda.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>slave</b></font><FONT FACE="Verdana" SIZE=2> Esta opci&oacute;n hace que el servidor sea esclavo. Esto significa que nunca realizara consultas recursivas, sino que las redirigir&aacute; a los servidores especificados con forwarders.</font></P>
<FONT FACE="Verdana" SIZE=2> 
<P>Hay dos opciones adicionales que no vamos a describir: sortlist y domain. Adem&aacute;s, 
  hay dos directivas que pueden aparecer en los ficheros de zona. Son $INCLUDE 
  y $ORIGIN, que tampoco vamos a describir, ya que raramente se utilizan.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="6.2.2"></a>6.2.2 Ficheros de base de datos DNS</P>
</u></I>
<P>Los ficheros incluidos con named, como named.hosts, siempre tienen un dominio 
  asociado a ellos llamado origen. Este es el nombre de dominio especificado con 
  los comandos cache y primary. En un fichero maestro, se pueden especificar nombres 
  de m&aacute;quinas y dominios relativos a este dominio. Un nombre dado en un 
  fichero de configuraci&oacute;n se considera absoluto si termina con un punto. 
  En caso contrario se considera relativo al origen. Al origen en s&iacute; mismo 
  nos podemos referir con "@".</P>
<P>Todos los datos en un fichero principal se dividen en registros de recursos 
  o RRs. Son la unidad de informaci&oacute;n del DNS. Cada RR tiene un tipo. Los 
  registros de tipo A, por ejemplo, asocian un nombre a una direcci&oacute;n IP. 
  Los registros de tipo CNAME asocian un alias de una m&aacute;quina con su nombre 
  oficial. Como ejemplo, obs&eacute;rvese la figura 6.3 de la p&aacute;gina 96, 
  que muestra el fichero named.hosts para nuestro sistema.</P>
<P>La representaci&oacute;n de los RRs en los ficheros utiliza el siguiente formato:</P>
<DIR> 
  <DIR> 
    <P>[domain] [ttl] [class] type rdata</P>
  </DIR>
</DIR>
<P>Los campos se separan por espacios o tabulaciones. Una entrada puede continuarse 
  en varias l&iacute;neas si se abre un par&eacute;ntesis antes del primer fin 
  de l&iacute;nea y el &uacute;ltimo campo es seguido de un cierre de par&eacute;ntesis. 
  Cualquier cosa entre un punto y coma y el siguiente salto de l&iacute;nea ser&aacute; 
  un comentario.</P>
</FONT> 
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>domain</b></font><FONT FACE="Verdana" SIZE=2> Aqu&iacute; va el nombre del dominio que se aplica al RR actual. Si no se da nombre de dominio, se asume el mismo que se puso para el RR anterior.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>ttl</b></font><FONT FACE="Verdana" SIZE=2> Con el fin de forzar al sistema DNS a descartar informaci&oacute;n despu&eacute;s de cierto tiempo, cada RR lleva asociado un "tiempo de vida" o ttl 5. El campo ttl especifica, en segundos, el tiempo de validez de la informaci&oacute;n desde que se obtiene del servidor. Es un n&uacute;mero decimal de hasta ocho d&iacute;gitos. Si no se especifica ning&uacute;n valor, tomar&aacute; uno por defecto del campo minimum del registro SOA precedente.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>class</b></font><FONT FACE="Verdana" SIZE=2> Aqu&iacute; se indica la clase de direcci&oacute;n: IN para direcciones IP, HS para objetos de la clase Hesiod. Trabajando con redes TCP/IP debe usarse siempre la clase IN. Si no se especifica ning&uacute;n valor, se toma el valor del RR anterior.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>type</b></font><FONT FACE="Verdana" SIZE=2> Describe el tipo de RR. Los tipos habituales son A, SOA, PTR y NS. En las siguientes secciones comentaremos estos tipos de RRs.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>rdata</b></font><FONT FACE="Verdana" SIZE=2> Contiene los datos asociados al RR. El formato depende del tipo, y se describir&aacute;n mas adelante.</font></P><FONT FACE="Verdana" SIZE=2>
<P>_____________________________________________<BR>
5 N. del T.: Time to Live</P>
<P>&nbsp;</P>
<P>A continuaci&oacute;n se presenta una lista incompleta de RRs que se utilizan en los ficheros de DNS. Hay algunos mas que no vamos a comentar. Son experimentales, y de escaso uso.</P>
<P><b><font color="#009900">SOA</font></b> Describe una zona de autoridad (SOA 
  significa "Start of Authority", es decir, "Comienzo de Autoridad"). Se&ntilde;ala 
  que los registros siguientes contienen informaci&oacute;n "autorizada" para 
  el dominio. Cada fichero incluido en la opci&oacute;n primary debe tener un 
  registro SOA para esta zona. Los datos asociados contienen los siguientes campos:</P>
</FONT>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>origin</b></font><FONT FACE="Verdana" SIZE=2> Nombre can&oacute;nico del servidor de nombres primario para este dominio. Se suele dar como nombre absoluto.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>contact</b></font><FONT FACE="Verdana" SIZE=2> Direcci&oacute;n de correo electr&oacute;nico de la persona responsable de mantener el dominio, reemplazando el car&aacute;cter '@' por un punto. Por ejemplo, si el responsable de nuestra red fuese janet, este campo contendr&aacute;: janet.vbrew.com.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>serial</b></font><FONT FACE="Verdana" SIZE=2> Este es el n&uacute;mero de versi&oacute;n del fichero de zona, expresado con un n&uacute;mero decimal. Cuando se cambien datos del fichero, deber&aacute; incrementarse este n&uacute;mero. El n&uacute;mero de versi&oacute;n es utilizado por los servidores secundarios para saber cuando la informaci&oacute;n de una zona ha cambiado. Para mantenerse actualizados, los servidores secundarios piden cada cierto tiempo el registro SOA del primario, y comparan el n&uacute;mero de versi&oacute;n con el que tienen en la cache. Si ha cambiado, el servidor secundario pedir&aacute; de nuevo la informaci&oacute;n de zona al primario.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>refresh</b></font><FONT FACE="Verdana" SIZE=2> Especifica el intervalo, en segundos, que esperan los servidores secundarios entre peticiones de registros SOA a los primarios. De nuevo, se trata de un n&uacute;mero decimal de hasta ocho d&iacute;gitos. Normalmente, la topolog&iacute;a de la red no cambia mucho, con lo que este n&uacute;mero ser&aacute; como poco de un d&iacute;a para grandes redes, y de mucho m&aacute;s tiempo para redes peque&ntilde;as.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>retry</b></font><FONT FACE="Verdana" SIZE=2> Este n&uacute;mero determina los intervalos de tiempo entre reintentos de comunicaci&oacute;n con servidores primarios cuando una petici&oacute;n de una zona falla. No debe ser peque&ntilde;o ya que un fallo temporal del servidor primario har&aacute; que el secundario cargue in&uacute;tilmente la red. Buenas elecciones son una hora o como poco media hora.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>expire</b></font><FONT FACE="Verdana" SIZE=2> Especifica el tiempo, en segundos, que tardar&aacute; el servidor en descartar los datos de zona si no ha podido contactar con el servidor primario. Normalmente ser&aacute; grande. As&iacute;, Craig Hunt ([Hunt92]) recomienda 42 d&iacute;as.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>minimum</b></font><FONT FACE="Verdana" SIZE=2> Valor por defecto para el valor del ttl en los registros de recursos que no lo especifiquen. Sirve para indicar a otros servidores de nombres que descarten el RR tras cierto tiempo. No tiene efecto, sin embargo, sobre el tiempo en el que un servidor secundario intenta actualizar la informaci&oacute;n de zona. El valor de minimum debe ser grande, en especial para redes locales con tipolog&iacute;as poco cambiantes. Una buena elecci&oacute;n puede ser de una semana o un mes. En el caso de que haya registros RR que cambien con frecuencia, siempre podr&aacute; asignarle valores particulares de ttl.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>A</b></font><FONT FACE="Verdana" SIZE=2> Asocia direcciones IP con nombres. El campo de datos contiene la direcci&oacute;n separando los octetos por puntos, como es habitual. Para cada m&aacute;quina solo puede haber un registro A, que se considera nombre oficial o can&oacute;nico. Cualquier otro nombre ser&aacute; un alias y debe ser incluido con registros CNAME.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>NS</b></font><FONT FACE="Verdana" SIZE=2> Apunta a un servidor de nombres maestro de una zona subordinada. Vea la secci&oacute;n 2.6 para obtener informaci&oacute;n de por qu&eacute; es necesario. El campo de datos contiene el nombre del servidor. Para traducir ese nombre debe proporcionarse un registro A adicional, que se conoce como glue record, al proporcionar la direcci&oacute;n IP del servidor.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>CNAME</b></font><FONT FACE="Verdana" SIZE=2> Asocia un alias con su nombre can&oacute;nico. El nombre can&oacute;nico se determina con un registro A. Los alias son indicados mediante registros CNAME.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>PTR</b></font><FONT FACE="Verdana" SIZE=2> Se usa para asociar nombres del dominio in-addr.arpa con sus nombres normales. Se usa para obtener nombres a partir de direcciones IP (traducci&oacute;n inversa). El nombre de la m&aacute;quina debe ser el can&oacute;nico.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>MX</b></font><FONT FACE="Verdana" SIZE=2> Especifica el servidor de correo para un dominio. En la secci&oacute;n "Encaminado de correo en la Internet" del cap&iacute;tulo 13 se explica por que son necesarios estos servidores. La sintaxis del registro MX es:</font></P><FONT FACE="Verdana" SIZE=2><DIR>
<DIR>

<P>[domain] [ttl] [class] MX preference host</P></DIR>
</DIR>

</FONT>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>host</b></font><FONT FACE="Verdana" SIZE=2> es el nombre del servidor de correo para el dominio domain . Cada servidor tiene un valor entero de preferencia (preference) asociado. Un agente de transporte de correo que desee entregar mensajes al dominio indicado en domain lo intentar&aacute; con los servidores de estos registros hasta que uno responda. Se empieza probando con los de menor preferencia.</font></P>
<P><FONT FACE="Verdana" SIZE=2 COLOR="#008000"><B>HINFO</b></font><FONT FACE="Verdana" SIZE=2> Este registro da informaci&oacute;n sobre el hardware y el software de la m&aacute;quina.<BR>
Su sintaxis es:</font></P>
<FONT FACE="Verdana" SIZE=2> 
<DIR> 
  <DIR> 
    <P>[domain] [ttl] [class] HINFO hardware software</P>
  </DIR>
</DIR>
<P>El campo hardware identifica el hardware utilizado. Existe un conjunto de convenciones 
  sobre esto, el cual puede verse en el RFC 1340. Si el campo contiene blancos, 
  debe encerrarse entre comillas dobles. El campo software especifica el software 
  utilizado, para el que tambi&eacute;n existen convenciones en el mismo documento 
  RFC.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="6.2.3"></a>6.2.3 Escribiendo los ficheros</P>
</u></I> 
<P>Las figuras 6.2, 6.3, 6.4, y 6.5 son ejemplos de ficheros para un servidor 
  de nombres en nuestra red ejemplo, localizado en la m&aacute;quina vlager. El 
  ejemplo es sencillo dada la simplicidad de nuestra red. Si tiene requisitos 
  mas complejos, l&eacute;ase el libro "DNS and BIND" de Cricket Liu y Paul Albitz 
  ([AlbitzLiu92]).</P>
<P>El fichero named.ca mostrado en la figura 6.2 da ejemplos de registros de servidores 
  ra&iacute;z.</P>
<P>Un fichero de cache t&iacute;pico suele tener informaci&oacute;n sobre una 
  docena de servidores. Puede obtener la lista de servidores del dominio ra&iacute;z 
  mediante el programa nslookup descrito mas adelante.6</P>
<DIR> 
  <DIR> 
    <P>;<BR>
      ; /var/named/named.ca Fichero de cache.<BR>
      ; No estamos en Internet, luego no necesitamos<BR>
      ; servidores raiz. Elimine los puntos y coma<BR>
      ; si desea activarlos.<BR>
      ;</P>
    <P>; . 99999999 IN NS NS.NIC.DDN.MIL<BR>
      ; NS.NIC.DDN.MIL 99999999 IN A 26.3.0.103<BR>
      ; . 99999999 IN NS NS.NASA.GOV<BR>
      ; NS.NASA.GOV 99999999 IN A 128.102.16.10</P>
  </DIR>
</DIR>
<P>Figura 6.2: Fichero named.ca.</P>
<P>_____________________________________________<BR>
  6 Esto no podr&aacute; hacerlo si no ha especificado alg&uacute;n servidor ra&iacute;z. 
  Puede en cambio ejecutar nslookup con un servidor diferente del suyo, o usar 
  el fichero de ejemplo de la figura 6.2 y entonces obtener una lista de servidores 
  validos.</P>
<P>&nbsp;</P>
<DIR> 
  <DIR> 
    <P>;<BR>
      ; /var/named/named.hosts Maquinas locales en nuestra red<BR>
      ; El origen es vbrew.com<BR>
      ;<BR>
      @ IN SOA vlager.vbrew.com. (<BR>
      janet.vbrew.com.<BR>
      16 ; serial<BR>
      86400 ; refresco: una vez al dia<BR>
      3600 ; reintentos: una hora<BR>
      3600000 ; expiracion: 42 d&iacute;as<BR>
      604800 ; minimo: 1 semana )<BR>
      IN NS vlager.vbrew.com.<BR>
      ;<BR>
      ; el correo local se distribuye en vlager<BR>
      IN MX 10 vlager<BR>
      ;<BR>
      ; direcci&oacute;n de loopback<BR>
      localhost. IN A 127.0.0.1<BR>
      ; Nuestra ethernet<BR>
      vlager IN A 191.72.1.1<BR>
      vlager-if1 IN CNAME vlager<BR>
      ; vlager es tambien un servidor de USENET news<BR>
      news IN CNAME vlager<BR>
      vstout IN A 191.72.1.2<BR>
      vale IN A 191.72.1.3<BR>
      ; Otra Ethernet<BR>
      vlager-if2 IN A 191.72.2.1<BR>
      vbardolino IN A 191.72.2.2<BR>
      vchianti IN A 191.72.2.3<BR>
      vbeaujolais IN A 191.72.2.4</P>
  </DIR>
</DIR>
<P>Figura 6.3: Fichero named.hosts.</P>
<P>&nbsp;</P>
<DIR> 
  <DIR> 
    <P>;<BR>
      ; /var/named/named.local Traduccion inversa para 127.0.0<BR>
      ; El origen es 0.0.127.in-addr.arpa.<BR>
      ;<BR>
      @ IN SOA vlager.vbrew.com. (<BR>
      joe.vbrew.com.<BR>
      1 ; serial<BR>
      360000 ; refresco: 100 horas<BR>
      3600 ; reintento: 1 hora<BR>
      3600000 ; expiracion: 42 d&iacute;as<BR>
      360000 ; minimo: 100 horas )<BR>
      IN NS vlager.vbrew.com.<BR>
      1 IN PTR localhost.</P>
  </DIR>
</DIR>
<P>Figura 6.4: Fichero named.local.</P>
<P>&nbsp;</P>
<DIR> 
  <DIR> 
    <P>;<BR>
      ; /var/named/named.rev Traducci&oacute;n inversa de nuestros numeros IP<BR>
      ; El origen es 72.191.in-addr.arpa.<BR>
      ;<BR>
      @ IN SOA vlager.vbrew.com. (<BR>
      joe.vbrew.com.<BR>
      16 ; serial<BR>
      86400 ; refresco: una vez al dia<BR>
      3600 ; reintento: una hora<BR>
      3600000 ; expiracion: 42 d&iacute;as<BR>
      604800 ; minimo: 1 semana )<BR>
      IN NS vlager.vbrew.com.<BR>
      ; nuestra red<BR>
      1.1 IN PTR vlager.vbrew.com.<BR>
      2.1 IN PTR vstout.vbrew.com.<BR>
      3.1 IN PTR vale.vbrew.com.<BR>
      ; la otra red<BR>
      1.2 IN PTR vlager-if1.vbrew.com.<BR>
      2.2 IN PTR vbardolino.vbrew.com.<BR>
      3.2 IN PTR vchianti.vbrew.com.<BR>
      4.2 IN PTR vbeaujolais.vbrew.com.</P>
  </DIR>
</DIR>
<P>Figura 6.5: Fichero named.rev.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="6.2.4"></a>6.2.4 Comprobaci&oacute;n del funcionamiento del servidor 
  de nombres</P>
</u></I> 
<P>Existe una utilidad que resulta interesante para comprobar el funcionamiento 
  del servidor de nombres reci&eacute;n configurado. Se llama nslookup, y puede 
  usarse tanto interactivamente como desde la l&iacute;nea de comandos. En el 
  &uacute;ltimo caso, se invoca simplemente como:</P>
<DIR> 
  <DIR> 
    <P>nslookup nombre</P>
  </DIR>
</DIR>
<P>y pedir&aacute; el nombre indicado al servidor de nombres que aparezca en resolv.conf 
  (si aparece mas de uno, nslookup coger&aacute; uno al azar).</P>
<P>El modo interactivo, sin embargo, es mucho m&aacute;s interesante. Adem&aacute;s 
  de buscar m&aacute;quinas por su nombre, se puede tambi&eacute;n preguntar por 
  cualquier registro DNS, y transferir la informaci&oacute;n de zona completa 
  de un dominio.</P>
<P>Cuando se invoca sin argumentos, nslookup mostrar&aacute; el servidor de nombres 
  en uso y entrar&aacute; en modo interactivo. En el prompt '&gt;' que se mostrar&aacute;, 
  puede teclear cualquier nombre de dominio por el que quiera preguntar. Por defecto, 
  preguntar&aacute; por registros de tipo A, es decir, aquellos que dan una direcci&oacute;n 
  IP correspondiente al dominio introducido.</P>
<P>Esto se puede cambiar tecleando "set type=tipo", donde tipo es un nombre de 
  registro de recurso (RR) como los descritos antes (en la secci&oacute;n 6.2) 
  o bien la palabra ANY.</P>
<P>Por ejemplo, &eacute;sta puede ser una sesi&oacute;n con nslookup:</P>
<DIR> 
  <DIR> 
    <P>$ nslookup<BR>
      Default Name Server: rs10.hrz.th-darmstadt.de<BR>
      Address: 130.83.56.60<BR>
      <BR>
      &gt; sunsite.unc.edu<BR>
      Name Server: rs10.hrz.th-darmstadt.de<BR>
      Address: 130.83.56.60<BR>
      <BR>
      Non-authoritative answer:<BR>
      Name: sunsite.unc.edu<BR>
      Address: 152.2.22.81</P>
  </DIR>
</DIR>
<P>Si intenta preguntar por un nombre que no tiene direcci&oacute;n IP asociada, 
  pero se encuentran otros registros relacionados en el DNS, el programa responder&aacute; 
  con un error "No type A records found" (no se encontraron registros de tipo 
  A). Sin embargo, puede hacer preguntas para otro tipo de registros sin mas que 
  usar el comando "set type". Por ejemplo, para obtener el registro SOA de unc.edu, 
  podr&iacute;a escribir lo siguiente:</P>
<DIR> 
  <DIR> 
    <P>&gt; unc.edu<BR>
      *** No address (A) records available for unc.edu<BR>
      Name Server: rs10.hrz.th-darmstadt.de<BR>
      Address: 130.83.56.60<BR>
      <BR>
      &gt; set type=SOA<BR>
      &gt; unc.edu<BR>
      Name Server: rs10.hrz.th-darmstadt.de<BR>
      Address: 130.83.56.60<BR>
      <BR>
      Non-authoritative answer:<BR>
      unc.edu<BR>
      origin = ns.unc.edu<BR>
      mail addr = shava.ns.unc.edu<BR>
      serial = 930408<BR>
      refresh = 28800 (8 hours)<BR>
      retry = 3600 (1 hour)<BR>
      expire = 1209600 (14 days)<BR>
      minimum ttl = 86400 (1 day)<BR>
      <BR>
      Authoritative answers can be found from:<BR>
      UNC.EDU nameserver = SAMBA.ACS.UNC.EDU<BR>
      SAMBA.ACS.UNC.EDU internet address = 128.109.157.30</P>
  </DIR>
</DIR>
<P>De manera similar, se pueden pedir registros MX, etc. Y mediante la palabra 
  ANY se obtendr&aacute;n todos los RR asociados al nombre escrito.</P>
<DIR> 
  <DIR> 
    <P>&gt; set type=MX<BR>
      &gt; unc.edu<BR>
      Non-authoritative answer:<BR>
      unc.edu preference = 10, mail exchanger = lambada.oit.unc.edu<BR>
      lambada.oit.unc.edu internet address = 152.2.22.80<BR>
      <BR>
      Authoritative answers can be found from:<BR>
      UNC.EDU nameserver = SAMBA.ACS.UNC.EDU<BR>
      SAMBA.ACS.UNC.EDU internet address = 128.109.157.30</P>
  </DIR>
</DIR>
<P>&nbsp;</P>
<P>Una aplicaci&oacute;n pr&aacute;ctica de nslookup para la depuraci&oacute;n 
  es obtener la lista de servidores ra&iacute;z para el fichero named.ca. Esto 
  puede hacerse pidiendo todos los registros NS asociados al dominio ra&iacute;z:</P>
<DIR> 
  <DIR> 
    <P>&gt; set type=NS<BR>
      &gt; .<BR>
      Name Server: fb0430.mathematik.th-darmstadt.de<BR>
      Address: 130.83.2.30<BR>
      <BR>
      Non-authoritative answer:<BR>
      (root) nameserver = NS.INTERNIC.NET<BR>
      (root) nameserver = AOS.ARL.ARMY.MIL<BR>
      (root) nameserver = C.NYSER.NET<BR>
      (root) nameserver = TERP.UMD.EDU<BR>
      (root) nameserver = NS.NASA.GOV<BR>
      (root) nameserver = NIC.NORDU.NET<BR>
      (root) nameserver = NS.NIC.DDN.MIL<BR>
      <BR>
      Authoritative answers can be found from:<BR>
      (root) nameserver = NS.INTERNIC.NET<BR>
      (root) nameserver = AOS.ARL.ARMY.MIL<BR>
      (root) nameserver = C.NYSER.NET<BR>
      (root) nameserver = TERP.UMD.EDU<BR>
      (root) nameserver = NS.NASA.GOV<BR>
      (root) nameserver = NIC.NORDU.NET<BR>
      (root) nameserver = NS.NIC.DDN.MIL<BR>
      NS.INTERNIC.NET internet address = 198.41.0.4<BR>
      AOS.ARL.ARMY.MIL internet address = 128.63.4.82<BR>
      AOS.ARL.ARMY.MIL internet address = 192.5.25.82<BR>
      AOS.ARL.ARMY.MIL internet address = 26.3.0.29<BR>
      C.NYSER.NET internet address = 192.33.4.12<BR>
      TERP.UMD.EDU internet address = 128.8.10.90<BR>
      NS.NASA.GOV internet address = 128.102.16.10<BR>
      NS.NASA.GOV internet address = 192.52.195.10<BR>
      NS.NASA.GOV internet address = 45.13.10.121<BR>
      NIC.NORDU.NET internet address = 192.36.148.17<BR>
      NS.NIC.DDN.MIL internet address = 192.112.36.4</P>
  </DIR>
</DIR>
<P>El conjunto completo de comandos disponibles en nslookup puede obtenerse con 
  la orden interna help.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="6.2.5"></a>6.2.5 Otras utilidades interesantes </P>
</u></I> 
<P>Hay algunas utilidades que pueden ayudarle en sus tareas de administrador de 
  BIND. Describiremos dos de ellas. Por favor, eche un vistazo a la documentaci&oacute;n 
  que traen para saber como utilizarlas.</P>
<P>La utilidad hostcvt sirve para obtener una configuraci&oacute;n inicial de 
  BIND a partir del fichero /etc/hosts. Genera tanto los ficheros de traducci&oacute;n 
  directa (registros A) como los de traducci&oacute;n inversa (registros PTR) 
  teniendo cuidado con los nombres de alias y otros. Por supuesto, no har&aacute; 
  todo el trabajo, pues aun puede que necesite ajustar los registros SOA o a&ntilde;adir 
  registros MX. Suponemos que tambi&eacute;n le ayudar&aacute; tener cerca algunas 
  aspirinas. El programa hostcvt forma parte de las fuentes de BIND, pero puede 
  obtenerse por separado en algunos servidores FTP dedicados a Linux.</P>
<P>Despu&eacute;s de configurar el servidor de nombres, puede que desee comprobar 
  el resultado. La aplicaci&oacute;n ideal para &eacute;sto (al menos para m&iacute;) 
  es el programa dnswalk, un paquete basado en perl que navega por la base de 
  datos DNS, buscando errores habituales y verificando que la informaci&oacute;n 
  es consistente. El programa dnswalk ha sido enviado recientemente al grupo comp.sources.misc 
  de News, y deber&iacute;a estar en los servidores FTP que archiven este grupo 
  (un servidor que seguro que lo tiene es ftp.uu.net).</P>
</FONT> 
</BODY>
</HTML>
