<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl8</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl07.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl09.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 8</P>
</font></B><P ALIGN="CENTER"><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>El Protocolo Punto-a-Punto (PPP)</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>&nbsp;</P>
</FONT>
<dir>
    <p><font face="Verdana" size="2"><a href="garl08.htm#8.1">8.1 Desenredando 
      las Pes</a><br>
      <a href="garl08.htm#8.2">8.2 PPP en Linux</a><br>
      <a href="garl08.htm#8.3">8.3 Conexiones con pppd</a><br>
      <a href="garl08.htm#8.4">8.4 Los Ficheros de Opciones</a><br>
      <a href="garl08.htm#8.5">8.5 Realizaci&oacute;n de la Llamada con chat</a><br>
      <a href="garl08.htm#8.6">8.6 Depuraci&oacute;n de la Configuraci&oacute;n 
      PPP</a><br>
      <a href="garl08.htm#8.7">8.7 Opciones de Configuraci&oacute;n IP</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl08.htm#8.7.1">8.7.1 Elecci&oacute;n 
          de las Direcciones IP</a><br>
          <a href="garl08.htm#8.7.2">8.7.2 Encaminamiento a trav&eacute;s de una 
          Conexi&oacute;n PPP</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl08.htm#8.8">8.8 Opciones de 
      Control de Enlace</a><br>
      <a href="garl08.htm#8.9">8.9 Consideraciones Generales sobre Seguridad</a><br>
      <a href="garl08.htm#8.10">8.10 Autentificaci&oacute;n con PPP</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl08.htm#8.10.1">8.10.1 CHAP 
          frente a PAP</a><br>
          <a href="garl08.htm#8.10.2">8.10.2 El fichero de claves CHAP</a><br>
          <a href="garl08.htm#8.10.3">8.10.3 El Fichero de Claves PAP</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl08.htm#8.11">8.11 Configuraci&oacute;n 
      de un Servidor PPP</a></font></p>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="8.1"></a>8.1 Desenredando las Pes</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Al igual que el SLIP, el PPP es un protocolo utilizado para enviar datagramas a trav&eacute;s de una conexi&oacute;n serie, pero mejora algunas de las carencias del anterior. El PPP permite a las partes comunicantes negociar al principio de la conexi&oacute;n opciones como las direcciones IP y el tama&ntilde;o m&aacute;ximo de los datagramas, y proporciona mecanismos de autentificaci&oacute;n de los clientes. Para cada una de estas capacidades, el PPP tiene un protocolo concreto.</P>
<P>A continuaci&oacute;n, describiremos brevemente estos bloques b&aacute;sicos que constituyen el PPP. Esta descripci&oacute;n esta muy lejos de ser completa; si quiere saber mas sobre el PPP, lea sus especificaciones en el RFC 1548, as&iacute; como en la docena de RFCs que le acompa&ntilde;an.1</P>
<P>En la parte m&aacute;s baja del PPP esta el protocolo de Control de Conexi&oacute;n de Datos de Alto-Nivel, abreviadamente HDLC2 3, que define los limites de las tramas PPP individuales, y proporciona un control de errores de 16 bit. Al contrario de lo que ocurr&iacute;a con SLIP, una trama PPP es capaz de llevar paquetes de otros protocolos distintos al IP, como el IPX de Novell o el Appletalk. El PPP consigue esto a&ntilde;adiendo a la trama b&aacute;sica HDLC un campo de control que identifica el tipo de paquete contenido en la misma.</P>
<P>El LCP, Protocolo de Control de Enlace4, es utilizado en la parte mas alta del HDLC para negociar las opciones concernientes a la conexi&oacute;n de datos, tales como la Unidad M&aacute;xima de Recepci&oacute;n (MRU) que establece el tama&ntilde;o m&aacute;ximo del datagrama que cada extremo de comunicaci&oacute;n acepta recibir.</P>
<P>_____________________________________________<BR>
1 Los RFCs mas relevantes est&aacute;n listados en la Bibliograf&iacute;a al final de este libro.<BR>
2 N. del T.: Del ingl&eacute;s High-Level Data Link Control<BR>
3 En realidad, el HDLC es un protocolo mucho mas general publicado por la Organizaci&oacute;n Internacional de Est&aacute;ndares (ISO).<BR>
4 N. del T.: Del ingl&eacute;s Link Control Protocol</P>
<P>&nbsp;</P>
<P>Un paso importante en la configuraci&oacute;n del enlace PPP corresponde a la autentificaci&oacute;n de los clientes. Aunque no es obligatorio, es casi un deber para las l&iacute;neas telef&oacute;nicas.</P>
<P>Normalmente el servidor pide al cliente que se identifique probando que se sabe alguna clave secreta. Si el llamante se equivoca, la conexi&oacute;n se termina. Con el PPP, las autorizaciones se producen en los dos sentidos; es decir, el que llama tambi&eacute;n puede pedir al servidor que se autentifique. Estos procedimientos de autentificaci&oacute;n son totalmente independientes entre si. Hay dos protocolos distintos, seg&uacute;n el tipo de autentificaci&oacute;n, los cuales discutiremos mas adelante. Se llaman el Protocolo de Autentificaci&oacute;n por Contrase&ntilde;a, o PAP, y el Protocolo de Autentificaci&oacute;n por Reto, o CHAP5.</P>
<P>Cada protocolo de red que es encaminado a trav&eacute;s de la conexi&oacute;n de datos, como el IP, el Appletalk, etc; es configurado din&aacute;micamente usando el correspondiente Protocolo de Control de Red (NCP). Por ejemplo, para enviar datagramas IP a trav&eacute;s del enlace, los dos nodos tienen que negociar en primer lugar que direcciones IP van a utilizar. El protocolo de control utilizado para esto es el IPCP6, el Protocolo de Control del IP.</P>
<P>Aparte de enviar datagramas IP est&aacute;ndar a trav&eacute;s del enlace, el PPP tambi&eacute;n permite la compresi&oacute;n Van Jacobson de las cabeceras en los datagramas IP. Es una t&eacute;cnica para meter las cabeceras de los paquetes TCP en un espacio de tan solo tres bytes. Tambi&eacute;n se utiliza en el CSLIP, y es conocida coloquialmente como compresi&oacute;n de cabeceras VJ. La utilizaci&oacute;n de la compresi&oacute;n puede negociarse tambi&eacute;n al comienzo de la conexi&oacute;n gracias al IPCP.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="8.2"></a>8.2 PPP en Linux</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>En el Linux, la funcionalidad del PPP esta dividida en dos partes, un controlador de HDLC de bajo nivel situado en el kernel, y el demonio pppd del espacio del usuario que controla los diferentes protocolos de control. La versi&oacute;n actual del PPP para Linux es la linux-ppp-1.0.0, y contiene el modulo PPP para el kernel, el pppd, y un programa llamado chat utilizado para llamar al sistema remoto.</P>
<P>El controlador del PPP para el kernel fue escrito por Michael Callahan. El pppd fue escrito a partir de una implementaci&oacute;n gratuita del PPP para m&aacute;quinas Sun y 386BSD que a su vez fue escrita por Drew Perkins y otros programadores, y mantenida por Paul Mackerras. Fue transportada a Linux por Al Longyear.7 El chat fue escrito por Karl Fox.8</P>
<P>_____________________________________________<BR>
5 N. del T.: Del ingl&eacute;s Challenge Handshake Authentication Protocol<BR>
6 N. del T.: Del ingl&eacute;s IP Control Protocol<BR>
7 Los dos autores han dicho que van a estar muy ocupados por bastante tiempo. As&iacute; que si tiene alguna pregunta sobre el PPP en general, mejor pregunte a la gente en el canal de la lista de correo de los "Linux activists" en la RED.<BR>
8 karl@morningstar.com.</P>
<P>&nbsp;</P>
<P>Al igual que el SLIP, el PPP esta implementado a trav&eacute;s de una disciplina especial para la utilizaci&oacute;n de las l&iacute;neas. Para utilizar una l&iacute;nea de serie como enlace PPP, en primer lugar tendr&aacute; que establecer la conexi&oacute;n con su m&oacute;dem, como es usual; y posteriormente pasar la l&iacute;nea al modo PPP. En este modo, todos los datos que nos llegan son pasados al controlador del PPP, que comprueba la validez de las tramas que llegan (cada trama HDLC trae un c&oacute;digo de control de errores de 16 bit), las descompone y las despacha. Actualmente, es capaz de controlar datagramas IP, utilizando opcionalmente la compresi&oacute;n de cabeceras Van Jacobson. Tan pronto como Linux acepte IPX, el controlador PPP ser&aacute; ampliado para poder controlar tambi&eacute;n los paquetes IPX.</P>
<P>El controlador del kernel es ayudado por el pppd, el demonio del PPP, que realiza toda la fase de inicializaci&oacute;n y autentificaci&oacute;n necesaria antes de que el verdadero tr&aacute;fico de red pueda ser enviado a trav&eacute;s del enlace. El comportamiento del pppd puede ser ajustado utilizando varias opciones. Como el PPP es bastante complejo, es imposible explicar todas ellas en un solo cap&iacute;tulo. Por eso, este libro no puede cubrir todos los aspectos del pppd, sino solamente darle una introducci&oacute;n. Para mas informaci&oacute;n, lea las p&aacute;ginas de manual y los ficheros README de la distribuci&oacute;n con las fuentes del pppd, que deber&iacute;an ayudarle a comprender la mayor parte de las cuestiones que este cap&iacute;tulo no trata. Si su problema persiste incluso despu&eacute;s de leer toda la documentaci&oacute;n, deber&iacute;a pasarse por el grupo de noticias comp.protocols.ppp para solicitar ayuda, que es el lugar donde encontrar&aacute; a la mayor parte de la gente envuelta en el desarrollo del pppd.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="8.3"></a>8.3 Conexiones con pppd</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Cuando quiere conectarse a Internet a trav&eacute;s de un enlace PPP, tiene que configurar las capacidades b&aacute;sicas de red como el dispositivo de loopback y el sistema de resoluci&oacute;n de direcciones. Las dos han sido explicadas en los cap&iacute;tulos previos. Hay algunas cosas que es necesario decir sobre la utilizaci&oacute;n del DNS en un enlace serie; por favor, lea el cap&iacute;tulo del SLIP para mas informaci&oacute;n.</P>
<P>Como ejemplo introductorio de como establecer una conexi&oacute;n PPP con el pppd, suponga que esta de nuevo en vlager. Ya ha llamado al servidor PPP, c3po, y entrado en la cuenta del usuario ppp. c3po ya ha lanzado su controlador PPP. Despu&eacute;s de salir del programa de comunicaciones que utilizo para llamar, se ejecuta el siguiente comando:</P><DIR>
<DIR>

<P># pppd /dev/cua3 38400 crtscts defaultroute</P></DIR>
</DIR>

<P>Esto cambiar&aacute; a la l&iacute;nea de serie cua3 al modo PPP y establecer&aacute; un enlace IP con c3po. La velocidad de transferencia utilizada en el puerto de serie ser&aacute; de 38400bps. La opci&oacute;n crtscts activa el control de flujo por hardware en el puerto, que es una obligaci&oacute;n para velocidades superiores a los 9600 bps.</P>
<P>Lo primero que hace el pppd tras ejecutarse es negociar varias caracter&iacute;sticas para el enlace con el extremo remoto utilizando el LCP. Normalmente, el conjunto de opciones que intenta negociar el pppd funcionar&aacute;, as&iacute; que no nos meteremos mas con este asunto. Volveremos a tratar el LCP con mas detalle en alguna secci&oacute;n posterior.</P>
<P>Hasta ahora, tambi&eacute;n hemos asumido que c3po no necesita ninguna autentificaci&oacute;n de nosotros, as&iacute; que la fase configuraci&oacute;n habr&aacute; sido completada con &eacute;xito.</P>
<P>El pppd negociar&aacute; entonces los par&aacute;metros IP con su compa&ntilde;ero usando IPCP, el protocolo de control IP. Al no especificar direcci&oacute;n IP alguna, el pppd intentar&aacute; usar la direcci&oacute;n que se obtiene al resolver el nombre del ordenador local. Decididas las direcciones, cada pppd se lo comunicar&aacute; al otro extremo.</P>
<P>Normalmente no habr&aacute; ning&uacute;n problema con esta configuraci&oacute;n por defecto. Incluso si su m&aacute;quina esta en una Ethernet, puede utilizar la misma direcci&oacute;n IP tanto para la Ethernet como para el interface PPP. No obstante, el pppd le permite utilizar direcciones diferentes, o incluso pedir a su compa&ntilde;ero que utilice alguna direcci&oacute;n espec&iacute;fica. Estas opciones ser&aacute;n discutidas mas adelante.</P>
<P>Tras pasar por la fase de configuraci&oacute;n IPCP, el pppd configurar&aacute; la red de su ordenador para utilizar el enlace PPP. En primer lugar, configurar&aacute; el interface de red PPP como un enlace punto-a-punto, utilizando el ppp0 para el primer enlace PPP que este activo, ppp1 para el segundo, y as&iacute; sucesivamente. A continuaci&oacute;n preparar&aacute; una entrada de la tabla de encaminamiento que apunte al ordenador del otro extremo del enlace. En el ejemplo anterior, el pppd har&aacute; que el encaminamiento de red por defecto apunte a c3po, debido a que lo especificamos con la opci&oacute;n defaultroute.9 Esto provoca que todos los datagramas dirigidos a ordenadores que no est&eacute;n en su red sean enviados a c3po. Hay un variado n&uacute;mero de formas de encaminamiento que acepta el pppd, y las cubriremos en mayor detalle mas adelante.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="8.4"></a>8.4 Los Ficheros de Opciones</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Antes de que el pppd procese los argumentos de su l&iacute;nea de comandos, echa un vistazo a varios ficheros para establecer sus opciones por defecto. Estos ficheros pueden contener cualquier argumento de l&iacute;nea de comando valido, distribuido a trav&eacute;s de un cierto n&uacute;mero de l&iacute;neas. Los comentarios se escriben tras el s&iacute;mbolo de almohadillado (#).</P>
<P>El primer fichero de opciones es el /etc/ppp/options, que es le&iacute;do cada vez que el pppd arranca. El utilizarlo para establecer algunas opciones globales por defecto es una buena idea, pues le permite evitar que sus usuarios hagan ciertas cosas que podr&iacute;an comprometer la seguridad del sistema. Por ejemplo, para hacer que el PPP necesite alg&uacute;n tipo de autentificaci&oacute;n del otro sistema, a&ntilde;adir&iacute;a la opci&oacute;n auth a este fichero. Esta opci&oacute;n no puede ser evitada por el usuario, de forma que se hace totalmente imposible el establecer una conexi&oacute;n PPP con cualquier sistema que no este en nuestras bases de datos para la autentificaci&oacute;n.</P>
<P>_____________________________________________<BR>
9 El encaminamiento por defecto es instalado solamente si no hay ninguno establecido de antes.</P>
<P>&nbsp;</P>
<P>El otro fichero de opciones, que es le&iacute;do despu&eacute;s del /etc/ppp/options, es el .ppprc situado en el directorio home del usuario. Permite que cada usuario especifique su propio conjunto de opciones por defecto.</P>
<P>Un fichero /etc/ppp/options de ejemplo puede parecerse a &eacute;ste:</P>
<P># Opciones globales para el pppd de vlager.vbrew.com<BR>
auth # obligar a autentificaci&oacute;n<BR>
usehostname # usar el nombre del ordenador local para el CHAP<BR>
lock # usar el bloqueo de dispositivo tipo UUCP<BR>
domain vbrew.com # nombre de nuestro dominio</P>
<P>Las dos primeras opciones se utilizan para la autentificaci&oacute;n y ser&aacute;n explicadas a continuaci&oacute;n. La expresi&oacute;n lock hace que el pppd utilice el m&eacute;todo de bloqueo de dispositivos de UUCP. De esta manera, cada proceso que accede a un dispositivo serie, por ejemplo el /dev/cua3, crea un fichero de bloqueo llamado LCK..cua3 en el directorio de spool del UUCP para se&ntilde;alizar que ese dispositivo esta siendo usado. Esto es necesario para evitar que otros programas, como pueden ser el minicom o el uucico, abran el dispositivo de serie mientras &eacute;ste es usado por el PPP.</P>
<P>La raz&oacute;n de poner estas opciones en el fichero de configuraci&oacute;n global es que &eacute;stas no pueden ser pasadas por alto, de forma que proporcionan un razonable nivel de seguridad.</P>
<P>Pero tenga en cuenta que, a pesar de todo, algunas opciones podr&aacute;n ser pasadas por alto mas tarde; un ejemplo de esto es la cadena connect.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="8.5"></a>8.5 Realizaci&oacute;n de la Llamada con chat</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Uno de los problemas que puede haberle dado el ejemplo anterior es que tenia que establecer la conexi&oacute;n manualmente antes de poder ejecutar el pppd. Al contrario que el dip, el pppd no tiene su propio lenguaje de scripts para llamar al sistema remoto y entrar en &eacute;l, sino que conf&iacute;a en otro programa externo para que haga esto. El comando que tiene que ser ejecutado puede d&aacute;rsele al pppd con la opci&oacute;n connect en la l&iacute;nea de comando. El pppd redirigir&aacute; la entrada y salida est&aacute;ndar de comandos a la l&iacute;nea de serie. Un programa &uacute;til para esto es el expect, escrito por Don Libes. Tiene un lenguaje muy potente basado en el Tcl, y fue dise&ntilde;ado exactamente para este tipo de aplicaci&oacute;n.</P>
<P>El paquete pppd incluye un programa similar llamado chat que le permite especificar un script del estilo de los de UUCP. B&aacute;sicamente, un script del chat consiste en una secuencia alterna de cadenas que esperamos recibir del sistema remoto y las respuestas que hemos de enviar. Las llamaremos respectivamente, cadenas esperadas y cadenas enviadas. Este es un extracto de un t&iacute;pico script del chat:</P><DIR>
<DIR>

<P>ogin: b1ff ssword: s3kr3t</P></DIR>
</DIR>

<P>Esto le indica al chat que espere a que el sistema remoto le env&iacute;e el mensaje de petici&oacute;n de usuario y entonces le devuelve el nombre del usuario b1ff. Solo esperamos por ogin: para que no importe si el mensaje de login empiece por l may&uacute;scula o min&uacute;scula, o si llega con basura. La siguiente cadena es una cadena esperada que hace que el chat espere al mensaje de petici&oacute;n de contrase&ntilde;a y la env&iacute;e nuestra contrase&ntilde;a como respuesta.</P>
<P>Esto es b&aacute;sicamente lo que tienen los scripts del chat. Un script completo para llamar a un servidor PPP deber&iacute;a, adem&aacute;s, incluir los comandos apropiados para el m&oacute;dem. Suponga que su m&oacute;dem entiende los comandos Hayes, y que el n&uacute;mero de tel&eacute;fono del servidor es el 318714. En ese caso, la l&iacute;nea completa del chat para que pudi&eacute;semos establecer una conexi&oacute;n con c3po seria</P><DIR>
<DIR>

<P>$ chat -v '' ATZ OK ATDT318714 CONNECT '' ogin: ppp word: GaGariN</P></DIR>
</DIR>

<P>Por definici&oacute;n, la primera cadena que damos al chat tiene que ser una cadena esperada, pero como el m&oacute;dem no dir&aacute; nada hasta que hablemos conel, hacemos que el chat la ignore especificando una cadena vac&iacute;a. Continuamos enviando ATZ, el comando de inicializaci&oacute;n para los m&oacute;dems compatibles Hayes, y esperamos a que nos responda con OK. La siguiente cadena env&iacute;a al chat el comando de marcado junto con el n&uacute;mero de tel&eacute;fono, y espera a que aparezca el mensaje CONNECT como respuesta. Esto esta seguido de otra cadena vac&iacute;a otra vez, porque ahora no queremos enviar nada, sino esperar a que aparezca el mensaje de petici&oacute;n de login. El resto del script del chat funciona exactamente como antes.</P>
<P>La opci&oacute;n -v hace que el chat capture todas las actividades hacia la facilidad local2 del demonio syslog.10</P>
<P>El escribir el script de chat directamente en la l&iacute;nea de comando implica un cierto riesgo, pues los usuarios pueden ver la l&iacute;nea de comando de un proceso con el comando ps. Puede evitar esto colocando el script del chat en un fichero, por ejemplo llamado dial-c3po. Entonces, podr&aacute; hacer al chat leer el script del fichero en vez de la l&iacute;nea de comando utilizando la opci&oacute;n -f, seguida por el nombre del fichero. Por lo tanto la invocaci&oacute;n completa al pppd tendr&aacute; ahora un aspecto como &eacute;ste:</P><DIR>
<DIR>

<P># pppd connect "chat -f dial-c3po" /dev/cua3 38400 -detach \<BR>
crtscts m&oacute;dem defaultroute</P></DIR>
</DIR>

<P>_____________________________________________<BR>
10 Si edita el syslog.conf para redirigir estos mensajes a un fichero, aseg&uacute;rese de que este fichero no pueda ser le&iacute;do por cualquiera, pues el chat tambi&eacute;n captura todo el script de entrada por defecto - incluyendo las contrase&ntilde;as.</P>
<P>&nbsp;</P>
<P>Adem&aacute;s de la opci&oacute;n connect que se refiere al script de llamada, hemos a&ntilde;adido dos opciones mas a la l&iacute;nea de comando: -detach, que le indica al pppd que no se separe de la consola ni se vuelva proceso de segundo plano. La palabra m&oacute;dem activa algunas acciones especificas para m&oacute;dem sobre el dispositivo de serie, como colgar la l&iacute;nea antes y despu&eacute;s de la llamada. Si no utiliza esta opci&oacute;n, el pppd no se preocupara de la l&iacute;nea DCD del puerto, y por lo tanto no podr&aacute; detectar si el extremo remoto cuelga de forma imprevista.</P>
<P>Los ejemplos anteriores eran bastante simples; el chat permite el uso de scripts mucho mas complejos. Una caracter&iacute;stica muy &uacute;til es la capacidad de especificar cadenas frente a las cuales parar el chat con un error. Unas cadenas t&iacute;picas para parar pueden ser mensajes como BUSY o NO CARRIER, que son los que su m&oacute;dem produce cuando el n&uacute;mero al que llama comunica o no descuelga. Para hacer que el chat las reconozca inmediatamente en vez de esperar, puede introducirlas al principio del script utilizando la opci&oacute;n ABORT:</P><DIR>
<DIR>

<P>$ chat -v ABORT BUSY ABORT 'NO CARRIER' '' ATZ OK ...</P></DIR>
</DIR>

<P>De una forma parecida, puede variar el valor del tiempo de espera para algunas partes de los scripts de chat insertando opciones TIMEOUT. Para mas detalles, vea la p&aacute;gina de manual del chat(8).</P>
<P>Algunas veces, tambi&eacute;n querr&aacute; disponer de alg&uacute;n tipo de ejecuci&oacute;n condicional de algunas partes del script de chat. Por ejemplo, cuando reciba el mensaje de petici&oacute;n de login desde el extremo remoto, puede que quiera enviar un BREAK, o un retorno de carro.</P>
<P>Puede conseguir esto a&ntilde;adiendo un sub-script a la parte esperada del script. Consiste en una secuencia de cadenas de env&iacute;o y esperadas, de la misma forma que el script en su totalidad, pero separadas por guiones. El sub-script es ejecutado desde el momento en que la cadena esperada a la que est&aacute;n ligados no es recibida a tiempo. Para este ejemplo, modificar&iacute;amos el script del chat de la siguiente manera:</P><DIR>
<DIR>

<P>ogin:-BREAK-ogin: ppp ssword: GaGariN</P></DIR>
</DIR>

<P>Ahora, cuando el chat no recibe el mensaje de login del sistema remoto, se ejecuta el sub-script enviando un BREAK y esperando de nuevo por el mensaje de login. Si ahora ya aparece, el script continua como usualmente y si no, termina con un error.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="8.6"></a>8.6 Depuraci&oacute;n de la Configuraci&oacute;n PPP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Por defecto, el pppd registrar&aacute; todos los avisos y mensajes de error gracias a las facilidades daemon del syslog. Tiene que a&ntilde;adir una entrada al syslog.conf que redirija esto a un fichero, o incluso a la consola, pues de otra forma el syslog simplemente desechara estos mensajes. La siguiente entrada env&iacute;a todos los mensajes a /var/log/ppp-log:</P><DIR>
<DIR>

<P>daemon.* /var/log/ppp-log</P></DIR>
</DIR>

<P>Si la configuraci&oacute;n de su PPP no funciona, echar un vistazo a este fichero le deber&iacute;a dar una primera pista de que es lo que va mal. Si esto no le ayuda, tambi&eacute;n puede activar la salida extra de depuraci&oacute;n utilizando la opci&oacute;n debug. Esto hace que el pppd registre los contenidos de todos los paquetes de control enviados o recibidos a syslog. Todos los mensajes ir&aacute;n a la facilidad daemon.</P>
<P>Finalmente, la opci&oacute;n mas dr&aacute;stica es el activar la depuraci&oacute;n a nivel de kernel llamando al pppd con la opci&oacute;n kdebug. Esto es seguido por un argumento num&eacute;rico que es el O exclusivo (xor) de los siguientes valores: 1 para mensajes de depuraci&oacute;n generales, 2 para imprimir los contenidos de todas las tramas HDLC que nos llegan, y 4 para hacer al controlador imprimir todas las tramas HDLC salientes. Para capturar los mensajes de depuraci&oacute;n a nivel de kernel, tiene que, o bien ejecutar un demonio syslogd que lea el fichero /proc/kmsg, o si no el demonio klogd. Cualquiera de los dos dirige la depuraci&oacute;n del kernel a la facilidad kernel del syslogd.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="8.7"></a>8.7 Opciones de Configuraci&oacute;n IP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>El IPCP se utiliza para negociar un par de par&aacute;metros IP a la hora de 
  configurar la conexi&oacute;n. Normalmente, cada extremo de comunicaci&oacute;n 
  puede enviar un Paquete de Petici&oacute;n de Configuraci&oacute;n IPCP, indicando 
  que valores quiere cambiar de los que vienen por defecto, y a que valor. Tras 
  la recepci&oacute;n, el extremo remoto inspecciona cada opci&oacute;n sucesivamente, 
  y, o responde que la acepta, o la rechaza.</P>
<P>El pppd le da gran control sobre que opciones intentara negociar el IPCP. Puede 
  ajustar esto a trav&eacute;s de varias opciones en la l&iacute;nea de comandos 
  de las que hablamos a continuaci&oacute;n.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="8.7.1"></a>8.7.1 Elecci&oacute;n de las Direcciones IP</P>
</u></I> 
<P>En el ejemplo anterior, hac&iacute;amos que el pppd llamase a c3po y estableciera 
  una conexi&oacute;n IP. No nos preocup&aacute;bamos de elegir una direcci&oacute;n 
  IP particular en ninguno de los extremos de la conexi&oacute;n. En vez de ello, 
  tom&aacute;bamos la direcci&oacute;n de vlager como la direcci&oacute;n IP local, 
  y dej&aacute;bamos a c3po darse su propia direcci&oacute;n. Algunas veces, sin 
  embargo, es &uacute;til el tener control sobre la direcci&oacute;n utilizada 
  por alguno de los extremos de la conexi&oacute;n. El pppd soporta diferentes 
  posibilidades sobre este aspecto.</P>
<P>Para pedir direcciones particulares, normalmente de al pppd la siguiente opci&oacute;n:</P>
<DIR> 
  <DIR> 
    <P>dir_local :dir_remota</P>
  </DIR>
</DIR>
<P>donde dir_local y dir_remota pueden ser especificadas en notaci&oacute;n de 
  cu&aacute;druplas num&eacute;ricas o como nombres de ordenador. 11 Esto hace 
  al pppd intentar usar la primera direcci&oacute;n como su propia direcci&oacute;n 
  IP, y la segunda como la de su compa&ntilde;ero. Si el compa&ntilde;ero rechaza 
  alguna de ellas durante la negociaci&oacute;n IPCP, no se establecer&aacute; 
  ninguna conexi&oacute;n IP.12</P>
<P>Si solo quiere establecer la direcci&oacute;n local, y aceptar cualquier direcci&oacute;n 
  que utilice el compa&ntilde;ero, simplemente deseche la parte de la dir_remota. 
  Por ejemplo, para hacer a vlager usar la direcci&oacute;n IP 130.83.4.27 en 
  vez de la suya propia, le escribir&iacute;a 130.83.4.27: en la l&iacute;nea 
  de comando. De forma similar, para establecer la direcci&oacute;n remota &uacute;nicamente, 
  dejar&iacute;a el campo de la dir_local en blanco. Por defecto, el pppd utilizara 
  entonces la direcci&oacute;n asociada al nombre de su ordenador.</P>
<P>Algunos servidores PPP que sirven a muchos clientes asignan direcciones din&aacute;micamente: 
  las direcciones son asignadas a los sistemas solo cuando llaman, y son reclamadas 
  de nuevo una vez que se desconecta. Cuando llame a uno de &eacute;stos servidores, 
  debe asegurarse de que el pppd no solicita una direcci&oacute;n IP particular, 
  sino que acepta la direcci&oacute;n que el servidor le pide que utilice. Esto 
  quiere decir que no tiene que poner el argumento dir_local.</P>
<P>Adem&aacute;s, tendr&aacute; que utilizar la opci&oacute;n noipdefault, que 
  hace que el pppd espere a que el compa&ntilde;ero le proporcione la direcci&oacute;n 
  IP en vez de utilizar la direcci&oacute;n IP del ordenador local.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="8.7.2"></a>8.7.2 Encaminamiento a trav&eacute;s de una Conexi&oacute;n 
  PPP</P>
</u></I> 
<P>Tras configurar el interface de red, el pppd preparar&aacute; un encaminamiento 
  que solamente le sirve para comunicarse con el otro extremo. Si el ordenador 
  remoto esta en una red de &aacute;rea local, seguramente usted deseara conectar 
  tambi&eacute;n con los ordenadores que est&aacute;n "detr&aacute;s" de &eacute;l; 
  para eso, se ha de configurar un encaminamiento de red adecuado.</P>
<P>_____________________________________________<BR>
  11 El utilizar nombres de ordenador en esta opci&oacute;n tiene algunas consecuencias 
  a la hora de la autentificaci&oacute;n utilizando CHAP. Puede echar un vistazo 
  a la secci&oacute;n sobre CHAP m&aacute;s adelante.12 Puede permitir al otro 
  PPP sobrescribir sus ideas de direcciones IP dando al pppd las opciones <BR>
  ipcp-accept-local e ipcp-accept-remote. Eche un vistazo a la p&aacute;gina del 
  manual para m&aacute;s detalles.</P>
<P>&nbsp;</P>
<P>Ya hemos visto antes que se puede pedir al pppd que configure el encaminamiento 
  por defecto utilizando la opci&oacute;n defaultroute. Esta opci&oacute;n es 
  muy &uacute;til si el servidor PPP al que llama va a actuar como su pasarela 
  a Internet.</P>
<P>El caso contrario, cuando su sistema act&uacute;a como un gateway para un solo 
  ordenador, es tambi&eacute;n relativamente f&aacute;cil de llevar a cabo. Por 
  ejemplo, imagine a alg&uacute;n empleado de la Cervecera Virtual cuyo ordenador 
  de casa se llama loner. Cuando este conectando a vlager a trav&eacute;s de PPP, 
  &eacute;l utiliza una direcci&oacute;n de la subred de la Cervecera. Podremos 
  dar al pppd del ordenador vlager la opci&oacute;n proxyarp, que instalara una 
  entrada proxy-ARP para el ordenador loner. Esto har&aacute; que loner sea autom&aacute;ticamente 
  accesible desde todos los ordenadores de la Cervecera y la Vinatera.</P>
<P>De cualquier manera, las cosas no son siempre tan f&aacute;ciles como esto, 
  por ejemplo cuando intentamos unir dos redes de &aacute;rea local. Esto requiere 
  normalmente el a&ntilde;adir una ruta de red especifica, porque estas redes 
  tendr&aacute;n ya sus propios encaminamientos por defecto. Por otra parte, el 
  tener a los dos extremos de comunicaci&oacute;n utilizando la conexi&oacute;n 
  PPP como encaminamiento por defecto generar&iacute;a un ciclo sin fin, donde 
  los paquetes con destinos desconocidos rebotar&iacute;an entre los dos ordenadores 
  hasta que su tiempo de vida (TTL) expirase.</P>
<P>Pongamos un ejemplo: suponga que la Cervecera Virtual abre una sucursal en 
  alguna otra ciudad. La sucursal utiliza su propia red Ethernet utilizando el 
  n&uacute;mero de red IP 191.72.3.0, que es la subred 3 de la red de clase B 
  de la Cervecera. Quieren conectarse a la red Ethernet principal de la Cervecera 
  a trav&eacute;s de PPP para actualizar las bases de datos de clientes, etc. 
  De nuevo, vlager actuara como pasarela; la otra m&aacute;quina se llama sub-etha 
  y tiene una direcci&oacute;n IP de 191.72.3.1.</P>
<P>Cuando sub-etha conecta a vlager, har&aacute; que el punto de encaminamiento 
  por defecto sea vlager, como es habitual. En vlager, de todas formas, tendremos 
  que instalar un encaminamiento de red para la subred 3 que vaya a trav&eacute;s 
  de sub-etha. Para esto, utilizamos una caracter&iacute;stica del pppd de la 
  que no hemos hablado hasta ahora - el comando ip-up. Es un script de shell situado 
  en /etc/ppp que se ejecuta despu&eacute;s de que el interface PPP ha sido configurado. 
  Cuando esta presente, se le llama con los siguientes par&aacute;metros:</P>
<DIR> 
  <DIR> 
    <P>ip-up interface dispositivo velocidad dir_local dir_remota</P>
  </DIR>
</DIR>
<P>donde interface se refiere al interface de red usado, dispositivo es la ruta 
  al dispositivo serie utilizado, (/dev/tty si se utiliza la salida y entrada 
  est&aacute;ndar), y velocidad es la velocidad del dispositivo. dir_local y dir_remota 
  nos dan las direcciones IP usadas en dos extremos de la conexi&oacute;n en notaci&oacute;n 
  de cuarteto num&eacute;rico. En nuestro caso, el script ip-up puede contener 
  el siguiente fragmento de c&oacute;digo:</P>
<DIR> 
  <DIR> 
    <P>#!/bin/sh<BR>
      case $5 in<BR>
      191.72.3.1) # este es sub-etha<BR>
      route add -net 191.72.3.0 gw 191.72.3.1;;<BR>
      ...<BR>
      esac<BR>
      exit 0</P>
  </DIR>
</DIR>
<P>De una forma an&aacute;loga, /etc/ppp/ip-down se utiliza para deshacer todas 
  las acciones de ip-up despu&eacute;s de que la conexi&oacute;n PPP ha sido cortada.</P>
<P>A pesar de todo, la tabla de encaminamiento aun no esta completa. Hemos configurado 
  las entradas de la tabla de encaminamiento para las dos ordenadores con PPP, 
  pero hasta ahora, todos los dem&aacute;s ordenadores de las dos redes no saben 
  nada sobre la conexi&oacute;n PPP.</P>
<P>Esto no es un gran problema si todos los ordenadores de la sucursal tienen 
  su encaminamiento por defecto encaminado a sub-etha, y todos los ordenadores 
  de la Cervecera encaminan hacia vlager por defecto. Si &eacute;ste no fuera 
  el caso, su &uacute;nica posibilidad normalmente ser&aacute; usar un demonio 
  de encaminamiento como el gated. Tras crear el encaminamiento de la red en vlager, 
  el demonio de encaminamiento pasara el nuevo encaminamiento a todos los ordenadores 
  de las redes dependientes de &eacute;sta.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="8.8"></a>8.8 Opciones de Control de Enlace</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Anteriormente, ya hemos tratado sobre el LCP, el protocolo de control de enlace (Link Control Protocol), que se utiliza para negociar las caracter&iacute;sticas de la conexi&oacute;n y comprobarla.&nbsp;</P>
<P>Las dos opciones mas importantes que pueden ser negociadas por el LCP son la unidad m&aacute;xima de recepci&oacute;n (MRU) y el mapa de caracteres de control as&iacute;ncronos. Tambi&eacute;n hay varias opciones de configuraci&oacute;n LCP mas, pero son demasiado especificas como para comentarlas aqu&iacute;. Eche un vistazo a la RFC 1548 para ver una descripci&oacute;n de &eacute;stas.</P>
<P>El mapa de caracteres de control as&iacute;ncronos, tambi&eacute;n conocido como el mapa as&iacute;ncrono, es usado en enlaces as&iacute;ncronos, como las l&iacute;neas telef&oacute;nicas, para identificar los caracteres de control que deben de ser reemplazados por una secuencia especifica de dos caracteres13. Por ejemplo, puede que quiera evitar los caracteres XON y XOFF utilizados con el control de flujo hardware activado, pues alg&uacute;n m&oacute;dem mal configurado puede parar hasta que reciba un XOFF. Otro candidato puede ser Ctrl-] (el car&aacute;cter de escape del telnet). El PPP le permite rehuir de cualquiera de los caracteres con c&oacute;digos ASCII comprendidos entre 0 y 31 especific&aacute;ndolos en el mapa as&iacute;ncrono.</P>
<P>_____________________________________________<BR>
13 N. del T.: Estos caracteres se conocen como rehuidos</P>
<P>&nbsp;</P>
<P>El mapa as&iacute;ncrono (async map) es un mapa de bits de 32 bits de ancho, y cuyo bit menos significativo corresponde al car&aacute;cter ASCII NUL, y cuyo bit mas significativo corresponde al ASCII 31. Si un bit se pone a 1, indica que el car&aacute;cter correspondiente debe de ser rehuido antes de ser enviado a trav&eacute;s de la conexi&oacute;n. Inicialmente, el mapa as&iacute;ncrono se establece como 0xffffffff, lo que significa que todos los caracteres de control ser&aacute;n rehuidos.</P>
<P>Para decir al otro ordenador que no tiene que rehuir de todos los caracteres de control sino solo de algunos, puede establecer un nuevo mapa as&iacute;ncrono al pppd utilizando la opci&oacute;n asyncmap. Por ejemplo, si solo ^S y ^Q (los c&oacute;digos ASCII 17 y 19, normalmente utilizados para XON y XOFF) deben de ser rehuidos, utilice la siguiente opci&oacute;n:</P><DIR>
<DIR>

<P>asyncmap 0x000A0000</P></DIR>
</DIR>

<P>La unidad m&aacute;xima de recepci&oacute;n, o MRU, se&ntilde;aliza al otro extremo el tama&ntilde;o m&aacute;ximo de las tramas HDLC que queremos recibir. Aunque esto puede que le recuerde al valor de la MTU (unidad m&aacute;xima de transferencia), tienen poco en com&uacute;n. El MTU es un par&aacute;metro del dispositivo de red del kernel, y describe el tama&ntilde;o m&aacute;ximo de la trama que el interface es capaz de soportar. El MRU es mas bien un consejo al ordenador remoto para que no genere ninguna trama mas grande que la MRU; no obstante, el interface ha de ser capaz de recibir tramas de hasta 1500 bytes.</P>
<P>Por lo tanto, elegir un MRU no es tanto una cuesti&oacute;n de que es capaz de transmitir la conexi&oacute;n, sino de como conseguir el mejor rendimiento. Si va a usar la conexi&oacute;n para aplicaciones interactivas, el poner en el MRU valores tan bajos como 296 es una buena idea, de forma que un paquete ocasional mayor (digamos, de una sesi&oacute;n de FTP) no haga a su cursor "saltar". Para decir al pppd que pida un MRU de 296, pondr&iacute;a la opci&oacute;n mru 296.</P>
<P>Las MRUs peque&ntilde;as, de todas maneras, solo tienen sentido si no tiene la compresi&oacute;n de cabecera VJ desactivada (esta activada por defecto).</P>
<P>El pppd tambi&eacute;n entiende un par de opciones LCP que configuran el comportamiento general del proceso de negociaci&oacute;n, como es el m&aacute;ximo n&uacute;mero de peticiones de configuraci&oacute;n que pueden ser intercambiadas antes de que se corte la conexi&oacute;n. A menos que sepa exactamente lo que esta haciendo, deber&aacute; dejar este valor fijo.</P>
<P>Finalmente, hay dos opciones que se aplican a los mensajes de eco del LCP. El PPP define dos mensajes, "Petici&oacute;n de Eco" y "Respuesta de Eco". El pppd usa esta caracter&iacute;stica para comprobar si la conexi&oacute;n esta aun operativa. Puede habilitar esto utilizando la opci&oacute;n lcp-echo-interval junto con el tiempo en segundos. Si no se reciben tramas del ordenador remoto en este intervalo, el pppd genera una Petici&oacute;n de Eco, y espera a que el compa&ntilde;ero devuelva una Respuesta de Eco. Si el compa&ntilde;ero no produce una respuesta, la conexi&oacute;n es cortada despu&eacute;s de que se hayan enviado un cierto n&uacute;mero de peticiones. Este n&uacute;mero puede ser establecido utilizando la opci&oacute;n lcp-echo-failure. Por defecto, esta caracter&iacute;stica tambi&eacute;n esta desactivada.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="8.9"></a>8.9 Consideraciones Generales sobre Seguridad</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Un demonio de PPP mal configurado puede ser un peligroso agujero en la seguridad. Es equivalente a dejar a cualquiera enganchar su m&aacute;quina a su red Ethernet (y eso es muy malo). En esta secci&oacute;n, discutiremos algunas medidas que deber&iacute;an hacer su configuraci&oacute;n del PPP segura.</P>
<P>Uno de los problemas del pppd es que el configurar el dispositivo de red y la tabla de encaminamiento requiere los privilegios de root. Normalmente resolver&aacute; esto ejecut&aacute;ndolo como setuid de root. A pesar de ello, el pppd permite a los usuarios establecer varias opciones de relevancia para la seguridad. Para protegerse contra cualquier ataque que pueda lanzar alg&uacute;n usuario manipulando estas opciones, se sugiere que establezca un par de valores por defecto en el fichero global /etc/ppp/options, tal como los mostrados en el fichero de ejemplo en la secci&oacute;n "Utilizaci&oacute;n de los Ficheros de Opciones". Algunos de ellos, como los de las opciones de autentificaci&oacute;n, no pueden ser despu&eacute;s modificados por el usuario, as&iacute; que proporcionan una razonable protecci&oacute;n contra las manipulaciones.</P>
<P>Por supuesto, tambi&eacute;n tiene que protegerse de los sistemas con los que habla con PPP. Para evitar que otros ordenadores puedan hacerse pasar por quien no son, debe utilizar siempre alg&uacute;n tipo de autentificaci&oacute;n con el otro extremo de la comunicaci&oacute;n. Adem&aacute;s, no deber&iacute;a permitir a ordenadores desconocidos usar cualquier direcci&oacute;n IP que elijan, sino restringirlas a unas pocas. La siguiente secci&oacute;n tratar&aacute; sobre estos asuntos.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="8.10"></a>8.10 Autentificaci&oacute;n con PPP</P>
</font></u></B><U><I><FONT FACE="Verdana" SIZE=2> 
<P><a name="8.10.1"></a>8.10.1 CHAP frente a PAP</P>
</font></I></U><FONT FACE="Verdana" SIZE=2> 
<P>Con el PPP, cada sistema puede obligar al otro ordenador a identificarse usando 
  uno de los dos protocolos de autentificaci&oacute;n disponibles. Estos son el 
  Protocolo de Autentificaci&oacute;n por Contrase&ntilde;a (PAP), y el Protocolo 
  de Autentificaci&oacute;n por Reto (CHAP). Cuando se establece una conexi&oacute;n, 
  cada extremo puede pedir al otro que se autentifique, independientemente de 
  que sea el llamante o el llamado. Mas adelante, utilizare relajadamente 'cliente' 
  y 'servidor' cuando quiera distinguir entre el sistema autentificado y el autentificador. 
  Un demonio PPP puede pedir a la otra m&aacute;quina autentificaci&oacute;n enviando 
  otra petici&oacute;n mas de configuraci&oacute;n de LCP indicando el protocolo 
  de autentificaci&oacute;n deseado.</P>
<P>El PAP trabaja b&aacute;sicamente de la misma forma que el procedimiento normal 
  de login. El cliente se autentifica a si mismo enviando un nombre de usuario 
  y una contrase&ntilde;a (opcionalmente encriptada) al servidor, la cual es comparada 
  por el servidor con su base de datos de claves. Esta t&eacute;cnica es vulnerable 
  a los intrusos que pueden intentar obtener la contrase&ntilde;a escuchando en 
  una l&iacute;nea de serie y a otros que hagan sucesivos intentos de ataque por 
  el m&eacute;todo de prueba y error.</P>
<P>El CHAP no tiene estos defectos. Con el CHAP, el autentificador (i.e. el servidor) 
  env&iacute;a una cadena de "reto" generada aleatoriamente al cliente, junto 
  a su nombre de ordenador.</P>
<P>El cliente utiliza el nombre del ordenador para buscar la clave apropiada, 
  la combina con el reto, y encripta la cadena utilizando una funci&oacute;n de 
  codificaci&oacute;n de un solo sentido. El resultado es devuelto al servidor 
  junto con el nombre del ordenador cliente. El servidor realiza ahora la misma 
  computaci&oacute;n, y advierte al cliente si llega al mismo resultado.</P>
<P>Otra caracter&iacute;stica del CHAP es que no solicita autentificaci&oacute;n 
  al cliente solamente al comienzo de la sesi&oacute;n, sino que env&iacute;a 
  retos a intervalos regulares para asegurarse de que el cliente no ha sido reemplazado 
  por un intruso, por ejemplo cambiando la l&iacute;nea telef&oacute;nica.</P>
<P>El pppd mantiene las claves secretas para el CHAP y el PAP en dos ficheros 
  separados, llamados /etc/ppp/chap-secrets y pap-secrets respectivamente. Si 
  introduce un ordenador remoto en alguno de los dos ficheros, tiene un buen control 
  de cual de los protocolos CHAP o PAP se utilizara para autentificarnos conel 
  y viceversa.</P>
<P>Por defecto, el pppd no pide autentificaci&oacute;n al ordenador remoto, pero 
  aceptara el autentificarse a si mismo cuando se lo pida el ordenador remoto. 
  Como el CHAP es mucho mas fuerte que el PAP, el pppd intenta usar el anterior 
  siempre que es posible. Si el otro ordenador no lo acepta, o el pppd no encuentra 
  una clave CHAP para el sistema remoto es su fichero chap-secrets, cambia al 
  PAP. Si tampoco tiene clave PAP para su compa&ntilde;ero, renunciar&aacute; 
  a autentificarse. Como consecuencia de esto, se cerrar&aacute; la conexi&oacute;n.</P>
<P>Este comportamiento puede ser modificado de varias formas. Por ejemplo, cuando 
  se a&ntilde;ade la palabra auth, el pppd solicitara al otro ordenador que se 
  autentifique. El pppd aceptara el uso del CHAP o el PAP para ello, siempre y 
  cuando tenga una clave para su compa&ntilde;ero en su base de datos CHAP o PAP 
  respectivamente. Hay otras opciones para activar o no un determinado protocolo 
  de autentificaci&oacute;n, pero no las describir&eacute; aqu&iacute;. Puede 
  leer la p&aacute;gina de manual del pppd(8) para mas detalles.</P>
<P>Si todos los sistemas con los que conversa en PPP est&aacute;n de acuerdo en 
  autentificarse con usted, deber&iacute;a poner la opci&oacute;n auth en el fichero 
  global /etc/ppp/options y definir contrase&ntilde;as para cada sistema en el 
  fichero chap-secrets. Si un sistema no acepta el CHAP, a&ntilde;ada una entrada 
  para &eacute;l al fichero pap-secrets. De esta forma, puede asegurarse de que 
  ning&uacute;n sistema sin autentificar se conecta a su ordenador.</P>
<P>Las dos secciones siguientes hablan sobre los dos ficheros de claves del PPP, 
  pap-secrets y chap-secrets. Est&aacute;n situados en /etc/ppp y contienen tripletas 
  de clientes, servidores y contrase&ntilde;as, seguidas opcionalmente por una 
  lista de direcciones IP. La interpretaci&oacute;n de los campos de servidor 
  y cliente es distinta en el CHAP y el PAP, y tambi&eacute;n depende de si nos 
  autentificamos nosotros con el otro ordenador, o si solicitamos al servidor 
  que se autentifique con nosotros.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="8.10.2"></a>8.10.2 El fichero de claves CHAP</P>
</u></I> 
<P>Cuando tiene que autentificarse con alg&uacute;n servidor utilizando el CHAP, 
  el pppd busca en el fichero chap-secrets una entrada cuyo campo de cliente sea 
  igual al nombre del ordenador local, y cuyo campo de servidor sea igual al nombre 
  del ordenador remoto enviado en el reto del CHAP. Cuando solicita a la otra 
  m&aacute;quina que se autentifique, los roles son simplemente al rev&eacute;s: 
  el pppd entonces buscara una entrada que tenga el campo de cliente igual al 
  nombre del ordenador remoto (enviado en la respuesta del CHAP del cliente), 
  y el campo de servidor igual al nombre del ordenador local.</P>
<P>El siguiente es un fichero de ejemplo del chap-secrets para vlager:14</P>
<DIR> 
  <DIR> 
    <P># claves CHAP para vlager.vbrew.com<BR>
      #<BR>
      # cliente servidor clave direcci&oacute;n<BR>
      #----------------------------------------------------------------------<BR>
      vlager.vbrew.com c3po.lucas.com "Use The Source Luke" vlager.vbrew.com<BR>
      c3po.lucas.com vlager.vbrew.com "riverrun, pasteve" c3po.lucas.com<BR>
      * vlager.vbrew.com "VeryStupidPassword" pub.vbrew.com</P>
  </DIR>
</DIR>
<P>Cuando se intenta establecer una conexi&oacute;n PPP con c3po, c3po pide a 
  vlager que se autentifique usando el CHAP mediante el env&iacute;o de un reto 
  del CHAP. El pppd entonces examina chap-secrets buscando una entrada cuyo campo 
  de cliente sea igual a vlager.vbrew.com y el campo de servidor sea c3po.lucas.com,15 
  y encuentra la primera l&iacute;nea mostrada anteriormente. Entonces produce 
  la respuesta del CHAP a partir de la cadena del reto y la clave (Use The Source 
  Luke), y la env&iacute;a de vuelta a c3po.</P>
<P>Al mismo tiempo, el pppd produce un reto del CHAP para c3po, conteniendo una 
  &uacute;nica cadena de reto y su nombre de ordenador completo vlager.vbrew.com. 
  c3po construye una respuesta del CHAP de la manera que acabamos de decir, y 
  se la devuelve a vlager.</P>
<P>El pppd extrae ahora el nombre del cliente (c3po.vbrew.com) de la respuesta, 
  y busca en el fichero chap-secrets una l&iacute;nea que tenga c3po como cliente 
  y vlager como servidor. La segunda l&iacute;nea se corresponde con esto, as&iacute; 
  que el pppd combina el reto del CHAP y la clave riverrun, pasteve, las encripta, 
  y compara el resultado con la respuesta del CHAP de c3po.</P>
<P>_____________________________________________<BR>
  14 Las comillas no son parte de la contrase&ntilde;a, simplemente sirven para 
  proteger el espacio en blanco del interior de la contrase&ntilde;a.<BR>
  15 Este nombre de ordenador se toma del reto del CHAP.</P>
<P>&nbsp;</P>
<P>El cuarto campo opcional lista las direcciones IP que son aceptables por los 
  clientes nombrados en el primer campo. Las direcciones pueden ser dadas en notaci&oacute;n 
  de cuarteto num&eacute;rico o como nombres de ordenador que son resueltos posteriormente. 
  Por ejemplo, si c3po solicita usar una direcci&oacute;n IP que no esta en esta 
  lista durante la negociaci&oacute;n IPCP, la petici&oacute;n ser&aacute; rechazada, 
  y IPCP se desconectara. En el fichero de ejemplo anterior, c3po esta limitado 
  a poder usar solo su propia direcci&oacute;n. Si el campo de direcci&oacute;n 
  est&aacute; vac&iacute;o, se permitir&aacute; cualquier direcci&oacute;n; un 
  valor de "-" evita el uso de una cierta direcci&oacute;n IP con un cliente.</P>
<P>La tercera l&iacute;nea del fichero chap-secrets de prueba, permite a cualquier 
  ordenador establecer un enlace PPP con vlager, pues si aparece la expresi&oacute;n 
  "*" en los campos de cliente o servidor, ser&aacute; valido cualquier nombre. 
  El &uacute;nico requisito es que sepa la clave, y utiliza la direcci&oacute;n 
  de pub.vbrew.com. Pueden aparecer perfectamente entradas con comodines en los 
  nombres en cualquier lugar del fichero de claves, pues el pppd siempre utilizar&aacute; 
  la entrada mas especifica que pueda ser aplicada a un par cliente/servidor.</P>
<P>Hay algunas cosas que decir sobre la manera en que el pppd encuentra los nombres 
  de ordenadores que busca en el fichero de claves. Como se explic&oacute; anteriormente, 
  el nombre del ordenador remoto es siempre proporcionado por el otro ordenador 
  en el paquete de reto o respuesta del CHAP. El nombre del ordenador local ser&aacute; 
  obtenido por defecto llamando a la funci&oacute;n gethostname(2). Si ha configurado 
  el nombre del sistema como el nombre del ordenador sin calificar, entonces tendr&aacute; 
  que dar al pppd el nombre del dominio a a&ntilde;adir usando la opci&oacute;n 
  domain:</P>
<DIR> 
  <DIR> 
    <P># pppd ...domain vbrew.com</P>
  </DIR>
</DIR>
<P>Esto a&ntilde;adir&aacute; el nombre del dominio de la Cervecera a vlager para 
  todas las actividades relacionadas con la autentificaci&oacute;n. Otras opciones 
  que modifican la idea que tiene el pppd del nombre del ordenador local son usehostname 
  y name. Cuando da la direcci&oacute;n IP local en la l&iacute;nea de comando 
  usando "local :remoto ", y local es un nombre en vez de un cuarteto num&eacute;rico, 
  el pppd utilizar&aacute; &eacute;ste como el nombre local. Para mas detalles, 
  lea la p&aacute;gina del manual del pppd(8).</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="8.10.3"></a>8.10.3 El Fichero de Claves PAP</P>
</u></I> 
<P>El fichero de claves PAP es muy similar al utilizado por el CHAP. Los dos primeros 
  campos siempre contienen un nombre de usuario y un nombre de servidor; el tercero 
  alberga la clave PAP. Cuando el sistema remoto env&iacute;a una petici&oacute;n 
  de autentificaci&oacute;n, el pppd usa la entrada en la que el campo de servidor 
  es igual al nombre del ordenador local, y el campo de usuario igual al nombre 
  de usuario enviado en la petici&oacute;n. Cuando se autentifica a si mismo al 
  otro ordenador, el pppd toma la clave a enviar de la l&iacute;nea con el nombre 
  de usuario igual al nombre del usuario local, y con el campo de servidor igual 
  al nombre del ordenador remoto.</P>
<P>Un fichero de claves PAP sencillo puede parecerse a &eacute;ste:</P>
<P># /etc/ppp/pap-secrets<BR>
  #<BR>
  # usuario servidor clave direcci&oacute;n<BR>
  vlager-pap c3po cresspahl vlager.vbrew.com<BR>
  c3po vlager DonaldGNUth c3po.lucas.com</P>
<P>La primera l&iacute;nea se usa para autentificarnos a nosotros mismos cuando 
  hablemos con c3po. La segunda l&iacute;nea describe como un usuario llamado 
  c3po tiene que autentificarse con nosotros.</P>
<P>El nombre vlager-pap de la primera columna es el nombre de usuario que nosotros 
  mandamos a c3po. Por defecto, el pppd tomara el nombre del ordenador local como 
  el nombre de usuario, pero tambi&eacute;n se puede especificar un nombre diferente 
  dando la opci&oacute;n user, seguida por el nombre deseado.</P>
<P>Para escoger una de las entradas del fichero pap-secrets para la autentificaci&oacute;n 
  con el compa&ntilde;ero, el pppd tiene que saber el nombre del ordenador remoto. 
  Como no tiene manera de averiguarlo, tiene que especificarlo en la l&iacute;nea 
  de comando usando la palabra remotename, seguida por el nombre del ordenador 
  remoto. Por ejemplo, para usar la entrada comentada anteriormente para la autentificaci&oacute;n 
  con c3po, tenemos que a&ntilde;adir la siguiente opci&oacute;n a la l&iacute;nea 
  de comando del pppd:</P>
<DIR> 
  <DIR> 
    <P># pppd ... remotename c3po user vlager-pap</P>
  </DIR>
</DIR>
<P>En el cuarto campo (y todos los siguientes), puede especificar que direcciones 
  IP est&aacute;n permitidas para ese ordenador particular, de la misma forma 
  que en el fichero de claves del CHAP. El otro ordenador solo podr&aacute; pedir 
  direcciones de esa lista. En el fichero de ejemplo, obligamos a c3po a usar 
  su direcci&oacute;n IP autentica.</P>
<P>D&eacute;se cuenta de que el PAP es un m&eacute;todo de autentificaci&oacute;n 
  bastante d&eacute;bil, y se recomienda utilizar el CHAP siempre que sea posible. 
  Por eso, no explicaremos el PAP en gran profundidad aqu&iacute;; si esta interesado 
  en utilizar el PAP, encontrar&aacute; algunas caracter&iacute;sticas mas de 
  &eacute;ste comentadas en la p&aacute;gina del manual del pppd(8).</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="8.11"></a>8.11 Configuraci&oacute;n de un Servidor PPP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Hacer funcionar el pppd como servidor es solo cuesti&oacute;n de a&ntilde;adir las opciones adecuadas en la l&iacute;nea de comando. Idealmente, crear&iacute;a una cuenta especial, digamos ppp, y le adjudicar&iacute;a un script o programa como shell de entrada que llame al pppd con estas opciones. Por ejemplo, podr&iacute;a a&ntilde;adir la siguiente l&iacute;nea a /etc/passwd:</P><DIR>
<DIR>

<P>ppp:*:500:200:Cuenta PPP Publica:/tmp:/etc/ppp/ppplogin</P></DIR>
</DIR>

<P>Por supuesto, puede usar uids y gids diferentes a los mostrados arriba. Tambi&eacute;n tendr&aacute; que establecer la contrase&ntilde;a para la cuenta de arriba usando el comando passwd.</P>
<P>El script ppplogin tendr&aacute; entonces este aspecto:</P><DIR>
<DIR>

<P>#!/bin/sh<BR>
# ppplogin - script para lanzar el pppd al entrar<BR>
mesg n<BR>
stty -echo<BR>
exec pppd -detach silent m&oacute;dem crtscts</P></DIR>
</DIR>

<P>El comando mesg deshabilita la opci&oacute;n de que otros usuarios puedan escribir a la terminal (tty) usada utilizando, por ejemplo, el comando write. El comando stty desactiva el eco de caracteres. Esto es necesario, pues de otra forma todo lo que el otro ordenador env&iacute;e le ser&aacute; devuelto a modo de eco. La opci&oacute;n del pppd m&aacute;s importante de las incluidas en el script es -detach, porque evita que el pppd se separe de la terminal controlada. Si no especific&aacute;semos esta opci&oacute;n, se ir&iacute;a a segundo plano, haciendo que el script del shell terminase. Esto provocar&iacute;a que la l&iacute;nea serie colgase y se perdiera la conexi&oacute;n. La opci&oacute;n silent hace que el pppd espere hasta recibir un paquete del sistema llamante antes de comenzar a enviar. Esto evita la aparici&oacute;n de timeouts al transmitir cuando el sistema que nos llama es lento en lanzar su cliente PPP. La opci&oacute;n m&oacute;dem hace al pppd vigilar la l&iacute;nea DTR para ver si el otro sistema ha colgado, y crtscts activa el control de flujo por hardware.</P>
<P>Adem&aacute;s de estas opciones, se puede forzar alguna clase de autentificaci&oacute;n, por ejemplo especificando auth en la l&iacute;nea de comando del pppd, o en el fichero de opciones globales. La p&aacute;gina del manual tambi&eacute;n habla sobre opciones m&aacute;s especificas para activar o desactivar los protocolos de autentificaci&oacute;n individuales.</P></FONT></BODY>
</HTML>
