<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<TITLE>garl14</TITLE>
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff">

<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=737>
<TR><TD WIDTH="46%" VALIGN="TOP">
      <P><a href="garl13.htm"><IMG SRC="left.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
<TD WIDTH="11%" VALIGN="TOP">
      <P ALIGN="CENTER"><a href="garl.htm"><IMG SRC="up.gif" WIDTH=34 HEIGHT=36 border="0"></a>
    </TD>
<TD WIDTH="43%" VALIGN="TOP">
      <P ALIGN="RIGHT"><a href="garl15.htm"><IMG SRC="right.gif" WIDTH=36 HEIGHT=34 border="0"></a>
    </TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=2><P>&nbsp;</P>
</FONT><B><FONT FACE="Arial" SIZE=4 COLOR="#000080"><P ALIGN="CENTER">Cap&iacute;tulo 14</P>
</font></B><P ALIGN="CENTER"><HR><p></P>
<B><U><FONT FACE="Verdana" SIZE=2><P>Como configurar y poner en marcha smail</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Este cap&iacute;tulo es una breve introducci&oacute;n a la forma de configurar 
  smail y, adem&aacute;s, dar&aacute; una idea general de la funcionalidad que 
  este programa provee. Aunque smail es muy similar en comportamiento a sendmail, 
  sus archivos de configuraci&oacute;n son totalmente diferentes.</P>
<P>El archivo de configuraci&oacute;n principal es /usr/lib/smail/config. Este 
  archivo es el que se debe editar para ajustar los valores espec&iacute;ficos 
  al sistema que se est&aacute; configurando. Si &uacute;nicamente es un ordenador 
  terminal de UUCP, ser&aacute;n relativamente pocas las opciones a cambiar. Hay 
  adem&aacute;s otros archivos que configuran las opciones de encaminamiento y 
  transporte que se pueden modificar; se hablar&aacute; brevemente sobre la forma 
  de hacerlo.</P>
<P>La forma de operaci&oacute;n normal de smail hace que procese y entregue todo 
  el correo de entrada inmediatamente. Si se tiene un tr&aacute;fico relativamente 
  alto, se puede preferir que smail guarde todos los mensajes en una cola, y los 
  procese a intervalos regulares.</P>
<P>Cuando se trabaja con correo dentro de una red TCP/IP, es frecuente que smail 
  funcione como demonio: en el momento de arrancar la m&aacute;quina, se invoca 
  desde el archivo rc.inet2, y se coloca en segundo plano, desde donde espera 
  que haya una conexi&oacute;n TCP que entre por el puerto SMTP (el puerto 25 
  es lo normal). Este esquema es muy bueno cuando se espera una gran cantidad 
  de tr&aacute;fico, pues smail no se lanza por separado para cada conexi&oacute;n 
  que ingresa. La alternativa es usar a inetd como el administrador del puerto 
  SMTP, y lanzar una copia de smail cada vez que haya una conexi&oacute;n en este 
  puerto.</P>
<P>El programa smail tiene muchas opciones que se usan para controlar su comportamiento; 
  describirlas una por una en detalle no es de gran utilidad. Afortunadamente 
  smail tiene varios modos est&aacute;ndar de operaci&oacute;n que se habilitan 
  cuando es invocado con un nombre especifico tal como rmail o smtpd. Es com&uacute;n 
  que estos nombres espec&iacute;ficos sean enlaces simb&oacute;licos al binario 
  de smail. Se ver&aacute;n mas de &eacute;stos cuando se discutan algunas otras 
  caracter&iacute;sticas de smail.</P>
<P>Hay dos enlaces a smail que deben existir siempre: /usr/bin/rmail y /usr/sbin/sendmail.1</P>
<P>Cuando se crea y se env&iacute;a un mensaje de correo con un agente de usuario 
  tal como elm, el mensaje se pasara a rmail para su entrega, con la lista de 
  destinatarios dada en la l&iacute;nea de comandos. Lo mismo sucede con el correo 
  que entra v&iacute;a UUCP. Algunas versiones de rmail, sin embargo, invocan 
  a /usr/sbin/sendmail en vez de a rmail, por lo que son necesarios ambos enlaces. 
  Por ejemplo, si smail esta en /usr/local/bin, se debe escribir lo siguiente 
  en la l&iacute;nea de comandos:</P>
<DIR> 
  <DIR> 
    <P># ln -s /usr/local/bin/smail /usr/bin/rmail<BR>
      # ln -s /usr/local/bin/smail /usr/sbin/sendmail</P>
  </DIR>
</DIR>
<P>Si se quiere investigar mas sobre los detalles de configuraci&oacute;n de smail, 
  se debe buscar en las p&aacute;ginas del manual smail(1) y smail(5). Si no estuviesen 
  incluidas en su distribuci&oacute;n preferida del Linux, se pueden obtener junto 
  con el c&oacute;digo fuente de smail.</P>
</FONT>
<dir> 
    <p><font face="Verdana" size="2"><a href="garl14.htm#14.1">14.1 Configuraci&oacute;n 
      de UUCP</a><br>
      <a href="garl14.htm#14.2">14.2 Configuraci&oacute;n para una red local</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl14.htm#14.2.1">14.2.1 Como 
          escribir los archivos de configuraci&oacute;n</a><br>
          <a href="garl14.htm#14.2.2">14.2.2 Como ejecutar smail</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl14.htm#14.3">14.3 Si no logra 
      pasar</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl14.htm#14.3.1">14.3.1 Como 
          compilar smail</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl14.htm#14.4">14.4 Modos de entrega 
      de correo</a><br>
      <a href="garl14.htm#14.5">14.5 Otras opciones del fichero config</a><br>
      <a href="garl14.htm#14.6">14.6 Encaminamiento de mensajes y entrega</a><br>
      <a href="garl14.htm#14.7">14.7 Mensajes de encaminamiento</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl14.htm#14.7.1">14.7.1 La 
          base de datos de trayectorias paths</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl14.htm#14.8">14.8 Como entregar 
      mensajes a las direcciones locales</a></font></p>
    <dir> 
      <dir> 
        <p><font face="Verdana" size="2"><a href="garl14.htm#14.8.1">14.8.1 Usuarios 
          locales</a><br>
          <a href="garl14.htm#14.8.2">14.8.2 Reenv&iacute;o</a><br>
          <a href="garl14.htm#14.8.3">14.8.3 Archivos de alias</a><br>
          <a href="garl14.htm#14.8.4">14.8.4 Listas de correo</a></font></p>
      </dir>
    </dir>
    <p><font face="Verdana" size="2"><a href="garl14.htm#14.9">14.9 Transportes 
      basados en UUCP</a><br>
      <a href="garl14.htm#14.10">14.10 Transportes basados en SMTP</a><br>
      <a href="garl14.htm#14.11">14.11 Calificaci&oacute;n de nombre de anfitri&oacute;n</a></font></p>
</dir>
<B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="14.1"></a>14.1 Configuraci&oacute;n de UUCP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Para usar smail en un entorno que solo tiene UUCP, la instalaci&oacute;n b&aacute;sica es muy sencilla. Primero se debe asegurar de que est&eacute;n los dos enlaces simb&oacute;licos a rmail y sendmail mencionados anteriormente. Si se espera recibir conexiones de SMTP de otros sitios, tambi&eacute;n se debe hacer un enlace de rsmtp a smail.</P>
<P>En la distribuci&oacute;n de smail de Vince Skahan, se encuentra un archivo muestra de configuraci&oacute;n. Su nombre es config.sample y esta en /usr/lib/smail. Se debe copiar a config y editarlo para ajustar los valores espec&iacute;ficos de su sistema.</P>
<P>Suponiendo que su m&aacute;quina se llama swim.twobirds.com, y esta registrado en los mapas UUCP como swim y su relevo UUCP es ulysses, entonces el archivo config podr&iacute;a ser como el siguiente:</P><DIR>
<DIR>

<P>#<BR>
# Los nombres de nuestros dominios<BR>
visible_domain=two.birds:uucp<BR>
#<BR>
# Nuestro nombre en los mensajes que viajan al exterior<BR>
visible_name=swim.twobirds.com<BR>
#<BR>
# Tambi&eacute;n se usa este nombre uucp<BR>
uucp_name=swim.twobirds.com<BR>
#<BR>
# Nuestro relevo UUCP<BR>
smart_host=ulysses </P></DIR>
</DIR>

<P>_____________________________________________<BR>
1 Esta es la nueva ubicaci&oacute;n est&aacute;ndar de sendmail de acuerdo con el Est&aacute;ndar del Sistema de Archivos de Linux. Otra ubicaci&oacute;n com&uacute;n es /usr/lib.</P>
<P>&nbsp;</P>
<P>La primera instrucci&oacute;n le indica a smail los dominios a los que su sistema pertenece. Se deben insertar sus nombres aqu&iacute;, separados con signos de punto y coma. Si el nombre de su sistema esta registrado en los mapas de UUCP, ser&aacute; necesario agregar adem&aacute;s la palabra uucp. Cuando se manipula un mensaje de correo, smail determina el nombre de su nodo usando una llamada de sistema hostname(2) y revisa la direcci&oacute;n del destinatario con respecto al nombre del nodo, revisando cada uno de los nombres de la lista. Si la direcci&oacute;n coincide con cualquiera de estos nombres, o el nombre del sistema no esta calificado, el receptor se considera local y smail intenta entregar el mensaje a un usuario o alias dentro del sistema local. En cualquier otro caso, el receptor se considera remoto y se intenta entregar al nodo adecuado.</P>
<P>La palabra clave visible_name debe contener un solo nombre de dominio totalmente calificado de la m&aacute;quina que se desea utilizar para los mensajes que se env&iacute;an hacia fuera. Este nombre se usa cuando se genera la direcci&oacute;n de quien env&iacute;a el correo en todos los mensajes de salida. Es importante asegurarse de que el nombre que se use sea reconocido por smail como una referencia al sistema local (i.e. el nombre del ordenador con uno de los dominios listados en el atributo visible_domain). Si no se hiciese de esta forma, las respuestas a los mensajes enviados rebotaran hacia fuera del nodo local.</P>
<P>La &uacute;ltima instrucci&oacute;n pone la ruta utilizada para el encaminamiento del relevo UUCP (descrito en la secci&oacute;n 13.4). Con este cambio mostrado, smail enviara cualquier correo dirigido hacia direcciones remotas al relevo. Como los mensajes ser&aacute;n entregados a trav&eacute;s de UUCP, el atributo debe especificar un sistema conocido para los programas UUCP que corran en su sistema. Consulte el cap&iacute;tulo 12 sobre el tema de como hacer que su nodo sea conocido por UUCP.</P>
<P>Hay una opci&oacute;n que se utiliza en el archivo anterior que aun no ha sido explicada; &eacute;sta es uucp_name. La raz&oacute;n para utilizar esta opci&oacute;n es la siguiente: normalmente smail utiliza el valor que devuelve hostname(2) para cosas que hace el UUCP tales como poner en el encabezado From_ el camino de regreso del correo. Si el nombre del nodo no esta registrado en el mapa de UUCP, es necesario indicar a smail que en vez de &eacute;ste utilice el nombre de dominio completamente calificado.2 Esto se puede hacer agregando la opci&oacute;n uucp_name al archivo de configuraci&oacute;n config.</P>
<P>_____________________________________________<BR>
2 La raz&oacute;n de esto es: Suponga que el nombre de su sistema es monad y que no esta registrado en los mapas y adem&aacute;s hay un lugar registrado en los mapas que se llama monad. Cada correo que se dirija a monad!root, aun cuando haya sido enviado desde un vecino directo UUCP, viajara hasta el otro monad. Esto es una molestia para todos.</P>
<P>&nbsp;</P>
<P>Hay otro archivo en /usr/lib/smail, que se llama paths.sample. Este es un ejemplo de la forma que tiene un archivo de caminos, paths. Sin embargo, este archivo no es necesario a menos que se tengan enlaces de correo a mas de un lugar. Si fuese necesario hacerlo, se debe escribir uno nuevo o generar uno partiendo de los mapas de Usenet. El archivo paths se describir&aacute; mas adelante, en este mismo cap&iacute;tulo.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="14.2"></a>14.2 Configuraci&oacute;n para una red local</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Si esta funcionando una instalaci&oacute;n con dos o m&aacute;s nodos conectados 
  por medio de una red local, es necesario designar a uno de ellos para que maneje 
  la conexi&oacute;n UUCP con el mundo exterior. Entre las m&aacute;quinas de 
  la red local, es muy probable que se quiera intercambiar correo con SMTP sobre 
  TCP/IP. Suponga que se tiene nuevamente el ejemplo de la Cervecera Virtual, 
  y vstout se configura como una pasarela UUCP.</P>
<P>En un entorno de red, es preferible mantener todos los archivos con el correo 
  de los usuarios en un solo sistema de archivos, que puede ser montado con NFS 
  desde todas las dem&aacute;s m&aacute;quinas. Esto permite a los usuarios desplazarse 
  de m&aacute;quina en m&aacute;quina sin tener que mover su correo por todos 
  lados (o peor, revisar tres o cuatro ordenadores para ver su correo reci&eacute;n 
  recibido cada ma&ntilde;ana). As&iacute; mismo, es deseable hacer que las direcciones 
  de los usuarios sean independientes del ordenador en la cual el correo se almacena. 
  Es una pr&aacute;ctica com&uacute;n utilizar el nombre del dominio como la direcci&oacute;n 
  de quien env&iacute;a el correo en vez de utilizar el nombre de la m&aacute;quina 
  servidora del correo. El usuario Janet, por ejemplo, podr&iacute;a especificar 
  su direcci&oacute;n como janet@vbrew.com en vez de janet@vale.vbrew.com. A continuaci&oacute;n 
  se explicara como hacer que el servidor reconozca el nombre del dominio como 
  un nombre v&aacute;lido para su instalaci&oacute;n.</P>
<P>Otra forma de mantener todos los apartados postales en un anfitri&oacute;n 
  central es utilizar POP o IMAP. POP quiere decir, por sus siglas en ingles Post 
  Office Protocol, es decir, Protocolo de Oficina Postal y permite a los usuarios 
  tener acceso a sus archivos de correo a trav&eacute;s de una conexi&oacute;n 
  TCP/IP. IMAP, o Protocolo de Acceso Interactivo al Correo por sus siglas en 
  ingles de Interactive Mail Access Protocol, es similar a POP, excepto que es 
  mas general. Ambos clientes y servidores para IMAP y POP han sido portados a 
  Linux, y est&aacute;n disponibles en sunsite.unc.edu bajo el directorio /pub/Linux/system/Network.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="14.2.1"></a>14.2.1 Como escribir los archivos de configuraci&oacute;n</P>
</u></I> 
<P>La configuraci&oacute;n para la Cervecera funciona de la siguiente forma: todos 
  los nodos, con excepci&oacute;n del servidor de correo vstout, encaminan todo 
  el correo que va hacia el exterior hacia este servidor, utilizando la t&eacute;cnica 
  de encaminamiento al relevo de correo. vstout encamina todo el correo que va 
  hacia el exterior al verdadero nodo de relevo que, a su vez, env&iacute;a todo 
  el correo de la Cervecera; este &uacute;ltimo nodo se llama moria.</P>
<P>El archivo est&aacute;ndar config para todas las m&aacute;quinas con la excepci&oacute;n 
  de vstout es como sigue:</P>
<DIR> 
  <DIR> 
    <P>#<BR>
      # Nuestro dominio:<BR>
      visible_domain=vbrew.com<BR>
      #<BR>
      # El nombre que usamos:<BR>
      visible_name=vbrew.com<BR>
      #<BR>
      # Encaminamiento al relevo: via SMTP hacia vstout<BR>
      smart_path=vstout<BR>
      smart_transport=smtp&nbsp;</P>
  </DIR>
</DIR>
<P>Esto es muy parecido a lo que se ha hecho para configurar un sistema que solo 
  funciona con UUCP. La diferencia principal es que el medio de transporte utilizado 
  para enviar el correo al nodo de relevo es SMTP. El atributo visible_domain 
  hace que smail utilice el nombre del dominio en vez de utilizar el nombre del 
  sistema local en todo el correo de salida.</P>
<P>En la pasarela de correo UUCP vstout el archivo config es ligeramente distinto:</P>
<DIR> 
  <DIR> 
    <P>#<BR>
      # Los nombres de nuestros sistemas:<BR>
      hostnames=vbrew.com:vstout.vbrew.com:vstout<BR>
      #<BR>
      # La forma en que nos llamamos a nosotros mismos:<BR>
      visible_name=vbrew.com<BR>
      #<BR>
      # En el mundo uucp, somos conocidos como vbrew.com<BR>
      uucp_name=vbrew.com<BR>
      #<BR>
      # Transporte inteligente: via uucp hacia moria<BR>
      smart_path=moria<BR>
      smart_transport=uux<BR>
      #<BR>
      # somos la autoridad para nuestro dominio<BR>
      auth_domains=vbrew.com</P>
  </DIR>
</DIR>
<P>Este archivo de configuraci&oacute;n, config, utiliza un esquema diferente 
  para indicar a smail como se llama el sistema local. En vez de dar una lista 
  de dominios y permitir que busque el nombre del nodo con una llamada al sistema, 
  se especifica una lista expl&iacute;citamente. La lista de arriba contiene tanto 
  el dominio completamente calificado como el del sistema no calificado, y el 
  nombre del dominio completo en s&iacute; mismo. Esto hace que smail reconozca 
  a janet@vbrew.com como una direcci&oacute;n local, y entregue el mensaje a janet.</P>
<P>La variable auth_domains indica el nombre de los dominios para los cuales vstout 
  es considerado como autoridad. Esto es, si smail recibe cualquier correo con 
  una direcci&oacute;n hacia host .vbrew.com en donde host no corresponde a ninguna 
  m&aacute;quina existente, se rechaza el mensaje y se devuelve al remitente del 
  mismo. Si esta l&iacute;nea no esta, cualquier mensaje rechazado ser&aacute; 
  enviado nuevamente al relevo de correo, quien lo mandara a vstout, y as&iacute; 
  sucesivamente hasta que se descarte por exceder la cuenta m&aacute;xima de saltos.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="14.2.2"></a>14.2.2 Como ejecutar smail</P>
</u></I> 
<P>La primera cosa que se debe hacer es decidir si se ejecutara smail como un 
  demonio independiente, o si se permitir&aacute; que inetd administre el puerto 
  SMTP e invoque a smail cuando un cliente solicite una conexi&oacute;n SMTP. 
  Normalmente es preferible la operaci&oacute;n como un demonio independiente 
  en el servidor de correo, debido a que esto carga la computadora menos que lanzar 
  una copia nueva de smail cada vez que se solicite una conexi&oacute;n individual. 
  Cuando un servidor de correo entrega casi todo el correo que recibe directamente 
  a los usuarios, es preferible optar por la operaci&oacute;n con inetd.</P>
<P>Independientemente del modo de operaci&oacute;n que se haya elegido para cada 
  anfitri&oacute;n individual, es importante asegurarse que se tiene la siguiente 
  l&iacute;nea en el archivo /etc/services:</P>
<DIR> 
  <DIR> 
    <P>smtp 25/tcp # Simple Mail Transfer Protocol</P>
  </DIR>
</DIR>
<P>Esto define el n&uacute;mero del puerto TCP que smail utilizar&aacute; para 
  las conexiones SMTP. 25 es el puerto est&aacute;ndar definido por el RFC de 
  N&uacute;meros de Puerto Asignados.</P>
<P>Cuando se ejecuta como demonio, smail se coloca a s&iacute; mismo en segundo 
  plano, y esperar&aacute; a que ocurra una conexi&oacute;n en el puerto SMTP. 
  Cuando haya una conexi&oacute;n, lanza un proceso y conduce una conversaci&oacute;n 
  SMTP en dicho puerto. El demonio smail se lanza normalmente invoc&aacute;ndolo 
  desde el script rc.inet2 con la siguiente instrucci&oacute;n:</P>
<DIR> 
  <DIR> 
    <P>/usr/local/bin/smail -bd -q15m</P>
  </DIR>
</DIR>
<P>El modificador -bd indica que se funcionara como demonio, y -q15m hace que 
  se procesen los mensajes acumulados en la cola cada 15 minutos.</P>
<P>Si en cambio, se quiere utilizar inetd, el archivo /etc/inetd.conf deber&aacute; 
  contener una l&iacute;nea como la siguiente:</P>
<DIR> 
  <DIR> 
    <P>smtp stream tcp nowait root /usr/sbin/smtpd smtpd</P>
  </DIR>
</DIR>
<P>smtpd debe ser un enlace simb&oacute;lico al binario de smail. Recuerde que 
  tiene que forzar a que inetd relea inetd.conf envi&aacute;ndole una se&ntilde;al 
  HUP despu&eacute;s de hacer estos cambios.</P>
<P>El modo demonio y el modo inetd son mutuamente excluyentes. Si se ejecuta smail 
  como demonio, aseg&uacute;rese de que este comentada cualquier l&iacute;nea 
  en inetd.conf para el servicio smtp. De manera similar, cuando se tenga a inetd 
  como administrador de smail, aseg&uacute;rese de que rc.inet2 no lanza al demonio 
  smail.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="14.3"></a>14.3 Si no logra pasar. . .</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Si algo va mal con la instalaci&oacute;n, hay algunas herramientas que pueden 
  ayudar a encontrar cual es la ra&iacute;z del problema. El primer lugar que 
  se debe revisar es el conjunto de archivos de registro de smail. Est&aacute;n 
  en /var/spool/smail /log, y se llaman logfile y paniclog, respectivamente. El 
  primero lista todas las transacciones, mientras que el &uacute;ltimo solo se 
  usa cuando haya mensajes de error relacionados con errores en la configuraci&oacute;n 
  y similares.</P>
<P>Un ejemplo t&iacute;pico de una l&iacute;nea en el logfile es el siguiente:</P>
<DIR> 
  <DIR> 
    <P>04/24/94 07:12:04: [m0puwU8-00023UB] received<BR>
      | from: root<BR>
      | program: sendmail<BR>
      | size: 1468 bytes<BR>
      04/24/94 07:12:04: [m0puwU8-00023UB] delivered<BR>
      | via: vstout.vbrew.com<BR>
      | to: root@vstout.vbrew.com<BR>
      | orig-to: root@vstout.vbrew.com<BR>
      | router: smart_host<BR>
      | transport: smtp</P>
  </DIR>
</DIR>
<P>Esto muestra que un mensaje de root a root@vstout.vbrew.com ha sido correctamente 
  entregado al sistema vstout a trav&eacute;s de SMTP.</P>
<P>Los mensajes que smail no pudo entregar generan una l&iacute;nea similar en 
  el archivo de registro, pero con el mensaje de error en vez de la parte que 
  dice entregado (delivered):</P>
<DIR> 
  <DIR> 
    <P>04/24/94 07:12:04: [m0puwU8-00023UB] received<BR>
      | from: root<BR>
      | program: sendmail<BR>
      | size: 1468 bytes<BR>
      04/24/94 07:12:04: [m0puwU8-00023UB] root@vstout.vbrew.com ... deferred<BR>
      (ERR_148) transport smtp: connect: Connection refused</P>
  </DIR>
</DIR>
<P>El error de arriba es t&iacute;pico para una situaci&oacute;n en la cual smail 
  reconoce correctamente que el mensaje deber&iacute;a ser entregado a vstout 
  pero que no fue posible establecer la conexi&oacute;n al servicio SMTP en vstout. 
  Si esto sucede, es posible que tenga un problema de configuraci&oacute;n o bien 
  que el soporte TCP este ausente de los binarios del smail.</P>
<P>Este problema no es tan raro de encontrar. Hay varios binarios de smail que 
  vienen con distribuciones de Linux y que no tienen soporte de red TCP/IP. Si 
  este es su caso, debe recompilar el programa smail. Una vez instalado smail, 
  se debe revisar si se tiene soporte de red TCP haciendo un telnet al puerto 
  SMTP de su m&aacute;quina. Una conexi&oacute;n exitosa al servidor SMTP se muestra 
  a continuaci&oacute;n (la entrada por teclado se marca con este tipo de letra):</P>
<DIR> 
  <DIR> 
    <P>$ telnet localhost smtp<BR>
      Trying 127.0.0.1...<BR>
      Connected to localhost.<BR>
      Escape character is '^]'.<BR>
      220 monad.swb.de Smail3.1.28.1 #6 ready at Sun, 23 Jan 94 19:26 MET<BR>
      QUIT<BR>
      221 monad.swb.de closing connection</P>
  </DIR>
</DIR>
<P>Si esta prueba no produce el mensaje de SMTP (la l&iacute;nea que comienza 
  con el c&oacute;digo 220), debe asegurarse de que su configuraci&oacute;n es 
  verdaderamente correcta antes de recompilar smail, como se describir&aacute; 
  a continuaci&oacute;n.</P>
<P>Si hay alg&uacute;n problema con smail que no se pueda localizar con el mensaje 
  de error que smail genera, se pueden activar los mensajes de depuraci&oacute;n. 
  Para hacer esto, se debe utilizar el modificador -d, seguido de un numero opcional 
  que especifique el nivel de detalle de la informaci&oacute;n (no se debe dejar 
  ning&uacute;n espacio entre el modificador y el argumento num&eacute;rico).</P>
<P>Entonces, smail mostrar&aacute; un informe de su operaci&oacute;n en la pantalla 
  que dar&aacute; mas pistas acerca de lo que puede estar mal.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="14.3.1"></a>14.3.1 Como compilar smail</P>
</u></I>
<P>Si esta seguro de que su smail carece de soporte de red TCP, es necesario obtener 
  el c&oacute;digo fuente. Es posible que ya este incluido en su distribuci&oacute;n 
  si la obtuvo en CD-ROM, si no fuese as&iacute;, se puede conseguir en la red 
  via FTP.3</P>
<P>La mejor forma de compilar smail, es comenzar con el conjunto de archivos de 
  configuraci&oacute;n de la distribuci&oacute;n de Vince Skahan. Para incluir 
  el controlador de TCP dentro de la compilaci&oacute;n, se debe poner la macro 
  DRIVER_CONFIGURATION en el archivo conf/EDITME con el par&aacute;metro bsd-network 
  o arpa-network. El primero se utiliza para las instalaciones de red local, pero 
  cuando se est&aacute; en Internet es necesario usar arpa-network.</P>
<P>La diferencia entre estas dos es que la segunda tiene un manejador especial 
  para el servicio BIND que permite reconocer registros MX, lo cual la primera 
  no puede hacer.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="14.4"></a>14.4 Modos de entrega de correo</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Como se menciono anteriormente, smail es capaz de entregar los mensajes inmediatamente o encolarlos para un proceso posterior. Si se decide encolar los mensajes, smail guardara todo el correo en el directorio messages debajo de /var/spool/smail. No se procesaran hasta que se le indique expl&iacute;citamente que lo haga (a este proceso se le conoce como "ejecutar la cola").</P>
<P>Se puede seleccionar uno de tres modos de entrega definiendo el atributo delivery_mode en el archivo config para que este como foreground, background, o queued. Es decir, proceso normal, proceso en segundo plano, o proceso en cola. Estas opciones seleccionan la entrega normal (procesamiento inmediato de los mensajes de entrada), en segundo plano (los mensajes son entregados por medio de un hijo del proceso receptor: el proceso padre muere inmediatamente despu&eacute;s de la creaci&oacute;n del hijo), y el encolado. El correo de entrada siempre ser&aacute; encolado independientemente de esta opci&oacute;n si la variable booleana queue_only esta puesta en el archivo config.</P>
<P>Si se activa el modo de cola, se debe asegurar de que las colas se revisen regularmente; probablemente cada 10 o 15 minutos. Si se ejecuta smail como demonio, se debe agregar la opci&oacute;n -q10m en la l&iacute;nea de comandos para procesar la cola cada 10 minutos. De forma alternativa, se puede invocar runq desde el cron en esos intervalos de tiempo. runq deber&aacute; ser un enlace a smail.</P>
<P>Se puede revisar la cola del correo al invocar smail con la opci&oacute;n -bp. De manera equivalente, se puede hacer que mailq sea un enlace a smail, e invocar mailq:</P><DIR>
<DIR>

<P>$ mailq -v<BR>
m0pvB1r-00023UB From: root (in /var/spool/smail/input)<BR>
Date: Sun, 24 Apr 94 07:12 MET DST<BR>
Args: -oem -oMP sendmail root@vstout.vbrew.com<BR>
Log of transactions:<BR>
Xdefer: &lt;root@vstout.vbrew.com&gt; reason: (ERR_148) transport smtp:<BR>
connect: Connection refused</P></DIR>
</DIR>

<P>_____________________________________________<BR>
3 Si compro una distribuci&oacute;n Linux a un proveedor comercial, se puede solicitar el c&oacute;digo fuente con "un cargo de env&iacute;o nominal" (que solo cubra los gastos), de acuerdo con las condiciones de copia de smail.</P>
<P>&nbsp;</P>
<P>Esto muestra un solo mensaje que esta esperando en la cola de mensajes. El registro de transacciones (que solo se mostrar&aacute; si se da a mailq la opci&oacute;n -v) puede dar una explicaci&oacute;n adicional de por que el mensaje esta esperando para su entrega. Si aun no se ha intentado entregar el mensaje, no se mostrar&aacute; la informaci&oacute;n del registro.</P>
<P>Aun cuando no se utilice el modo de cola, smail pondr&aacute; de forma ocasional los mensajes en la cola cuando falle la entrega inmediata por una raz&oacute;n transitoria. Para las conexiones SMTP, esto puede ser debido a que el nodo siguiente sea un inalcanzable; pero los mensajes pueden tambi&eacute;n ser pospuestos cuando el sistema de archivos del receptor este lleno. En cualquier caso, debe poner una cola que se revise, por ejemplo, cada hora (utilizando runq), porque si no, cualquier mensaje pospuesto se quedara encolado indefinidamente.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="14.5"></a>14.5 Otras opciones del fichero config</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Hay otras muchas opciones en el archivo config, algunas poco usadas en sistemas sencillos. Sin embargo, mencionaremos algunas que s&iacute; que ser&aacute;n &uacute;tiles con frecuencia:</P>
<P><b>error_copy_postmaster</b><BR>
Si esta variable booleana se pone, cualquier error generar&aacute; un mensaje al administrador de correo. Normalmente esto solo se hace para los errores que se deben a una configuraci&oacute;n incorrecta. La variable puede activarse poni&eacute;ndola en el archivo config, precedida por un signo de suma (+).</P>
<P><b>max_hop_count</b><BR>
Si la cuenta de saltos para un mensaje (i.e. el n&uacute;mero de nodos que se han atravesado) es igual o excede a este numero, los intentos de entrega producir&aacute;n un mensaje de error que ser&aacute; enviado a quien genero el mensaje. Esto se utiliza para prevenir que los mensajes entren en un ciclo infinito. La cuenta de saltos se calcula generalmente a partir del numero de campos <BR>
Received: que se encuentran en el encabezado del correo. Adem&aacute;s, esta cuenta tambi&eacute;n puede ser ajustada de forma manual utilizando la opci&oacute;n -h en la l&iacute;nea de comandos. Esta variable tiene como valor por defecto 20.</P>
<P><b>postmaster</b><BR>
La direcci&oacute;n del administrador de correo. Si la direcci&oacute;n Postmaster no puede ser resuelta como direcci&oacute;n local valida, entonces &eacute;sta se utiliza como &uacute;ltimo recurso. El valor por defecto es root.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="14.6"></a>14.6 Encaminamiento de mensajes y entrega</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>smail divide la entrega del correo en tres partes, la ruta, el m&oacute;dulo de entrega local y el m&oacute;dulo de transporte.</P>
<P>El m&oacute;dulo de encaminamiento resuelve todas las direcciones remotas, determinando el nodo al que el mensaje ser&aacute; enviado y el transporte que ser&aacute; utilizado. Dependiendo de la naturaleza del enlace, se utilizar&aacute;n transportes diferentes tales como UUCP o SMTP.</P>
<P>Las direcciones locales se dan al m&oacute;dulo de entrega local que resuelve cualquier reenv&iacute;o o alias. Por ejemplo, la direcci&oacute;n podr&iacute;a ser un alias o una lista de correo, o el usuario podr&iacute;a querer reenviar su correo a otra direcci&oacute;n. Si la direcci&oacute;n resultante es remota, se maneja de nuevo en el m&oacute;dulo de encaminamiento, de otra forma se asigna a un transporte para su entrega local. Normalmente, la acci&oacute;n a realizar ser&aacute; entregar a un archivo de correo, pero los mensajes tambi&eacute;n pueden ser pasados a la entrada de un comando (por ejemplo, un filtro de correo que el usuario quiera establecer) o agregados a un archivo arbitrario cualquiera.</P>
<P>El m&oacute;dulo de transporte, finalmente, es el responsable de la entrega, independientemente del m&eacute;todo que se haya escogido. Intenta entregar el mensaje y en caso de problemas, puede devolver un mensaje al remitente o posponer la entrega para intentarlo de nuevo m&aacute;s tarde.</P>
<P>Con smail se tiene mucha flexibilidad para configurar estas tareas. Para cada una de ellas, hay varios controladores4 disponibles, de los cuales se puede elegir el m&aacute;s adecuado. </P>
<P>Se debe indicar a smail la elecci&oacute;n a trav&eacute;s de los siguientes archivos: routers, directors y transports, que se encuentran en /usr/lib/smail. Si estos archivos no existiesen, se toman valores por defecto razonables que funcionan en la mayor parte de los sistemas que utilizan SMTP o UUCP como transporte. Si se quiere cambiar la pol&iacute;tica de encaminamiento de smail, o modificar un transporte, es conveniente obtener los archivos ejemplo que vienen con la distribuci&oacute;n de los programas fuente de smail 5, copiar los archivos ejemplo a /usr/lib/smail, y modificarlos de acuerdo con sus necesidades. Los archivos de ejemplos de configuraci&oacute;n est&aacute;n tambi&eacute;n en el Ap&eacute;ndice B.</P>
<P>_____________________________________________<BR>
4 Aqu&iacute;, conocemos por controladores a los distintos m&oacute;dulos internos de smail capaces de utilizar un m&eacute;todo de entrega de mensajes u otro. As&iacute;, tenemos controladores para UUCP o para SMTP 5 Los archivos de configuraci&oacute;n por defecto se encuentran en samples/generic bajo el subdirectorio de los programas fuente.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="14.7"></a>14.7 Mensajes de encaminamiento</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Cuando se le da un mensaje, smail revisa primero si el destino est&aacute; en el sistema local o en un nodo remoto. Si la direcci&oacute;n del ordenador destino corresponde a uno de los nodos locales configurados en el archivo config, el mensaje es tratado por el m&oacute;dulo de entrega local. Si no fuese as&iacute;, smail transmite la direcci&oacute;n del destino a varios controladores de encaminado para encontrar a que m&aacute;quina se debe transmitir el mensaje. Los controladores se pueden indicar en el archivo routers; si este archivo no existe, se utiliza un conjunto de encaminadores por defecto.</P>
<P>El nodo destino se pasa a todos los encaminadores por turno, y aquel que encuentra la ruta mas especifica es seleccionado. Por ejemplo, suponga que hay un mensaje dirigido a joe@foo.bar.com y que un encaminador conoce una ruta para todos los nodos que pertenecen al dominio bar.com, mientras que otro tiene la informaci&oacute;n sobre el camino directo al sistema foo.bar.com. Como el segundo es m&aacute;s especifico, es elegido sobre el primero. Si hubiese dos encaminadores que proveen una soluci&oacute;n correcta e igual de especifica, se elige al primero que este en el archivo routers.</P>
<P>A continuaci&oacute;n, el encaminador elegido especifica que transporte utilizar&aacute;, por ejemplo UUCP, y genera as&iacute; una nueva direcci&oacute;n destino. La nueva direcci&oacute;n se pasa al transporte junto con el nombre del sistema a quien se le debe pasar el mensaje. En el ejemplo anterior, smail podr&iacute;a encontrar que foo.bar.com se puede encontrar via UUCP utilizando la trayectoria ernie!bert. As&iacute; generar&aacute; un nuevo destino bert!foo.bar.com!user, y utilizar&aacute; esta direcci&oacute;n, a trav&eacute;s del transporte UUCP, como la que ser&aacute; transmitida a ernie.</P>
<P>Cuando se utilice la configuraci&oacute;n por defecto, los siguientes encaminadores estar&aacute;n disponibles:</P>
<P><b><font color="#990000">o</font></b> Si la direcci&oacute;n del nodo destino 
  se puede resolver utilizando las llamadas de biblioteca gethostbyname(3) o gethostbyaddr(3), 
  el mensaje ser&aacute; entregado via SMTP. La &uacute;nica excepci&oacute;n 
  es si la direcci&oacute;n que se encuentra se refiere al sistema local, en cuyo 
  caso ser&aacute; enviado al m&oacute;dulo de entrega local.</P>
<P>smail tambi&eacute;n reconoce las direcciones IP escritas como cuarteto de puntos como nombre legal de m&aacute;quina, siempre y cuando pueda ser resuelto a trav&eacute;s de una llamada a gethostbyaddr(3). Por ejemplo scrooge@[149.76.12.4] podr&iacute;a ser v&aacute;lida aunque muy rara como direcci&oacute;n para scrooge en quark.physics.groucho.edu.</P>
<P>Si su m&aacute;quina esta en Internet, estos encaminadores no son lo que usted necesita, debido a que no soportan registros MX. Vea mas adelante lo que se debe hacer en este caso.</P>
</FONT><B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#800000"><B>o</b></font><FONT FACE="Verdana" SIZE=2> Si la base de datos de alias de trayectorias, /usr/lib/smail /paths existe, smail tratar&aacute; de buscar en el archivo al nodo destino (rest&aacute;ndole la extensi&oacute;n .uucp si la hubiera). El correo a una direcci&oacute;n que coincida con este encaminador ser&aacute; entregado utilizando UUCP, a trav&eacute;s de la trayectoria que se haya encontrado en la base de datos.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#800000"><B>o</b></font><FONT FACE="Verdana" SIZE=2> La direcci&oacute;n del nodo (rest&aacute;ndole la extensi&oacute;n .uucp si la hubiera) se compara con la salida de la instrucci&oacute;n uuname para revisar si el sistema destino es un vecino UUCP. Si &eacute;ste es el caso, el mensaje ser&aacute; entregado utilizando el transporte UUCP.</font></P>
<B></B><P><FONT FACE="Verdana" SIZE=2 COLOR="#800000"><B>o</b></font><FONT FACE="Verdana" SIZE=2> Si la direcci&oacute;n no coincide en ninguno de los encaminadores citados anteriormente, ser&aacute; entregado utilizando un relevo de correo. La trayectoria al nodo de relevo as&iacute; como el medio de transporte que ser&aacute; utilizado se ponen en el archivo config.</font></P>
<FONT FACE="Verdana" SIZE=2> 
<P>Los valores por defecto funcionan para la mayor parte de las instalaciones 
  sencillas, pero no son &uacute;tiles si las necesidades de encaminamiento son 
  algo m&aacute;s complejas. Si se enfrenta con uno de los problemas que se discutir&aacute;n 
  a continuaci&oacute;n, es necesario instalar su propio archivo routers para 
  cambiar los valores por defecto. Un archivo ejemplo routers con el que se puede 
  empezar esta en el ap&eacute;ndice B. Algunas distribuciones de Linux traen 
  adem&aacute;s, un conjunto de archivos de configuraci&oacute;n hechos a la medida 
  para solventar esas dificultades.</P>
<P>Es probable que el peor de los problemas surja cuando su m&aacute;quina viva 
  en un universo dual con enlaces de marcado telef&oacute;nico via IP y UUCP. 
  Entonces se tendr&aacute;n nombres de nodos en el archivo hosts con los cuales 
  solo se comunica ocasionalmente a trav&eacute;s de un enlace SLIP, y smail intentara 
  entregar cualquier correo por medio de estos sistemas usando SMTP. Este comportamiento 
  no es deseable normalmente debido a que, si el enlace SLIP se activa de forma 
  regular, SMTP es mucho m&aacute;s lento que mandar el correo con UUCP.</P>
<P>Con los valores por defecto, no se puede evitar que smail se porte mal.</P>
<P>Este problema se puede evitar revisando con smail el archivo paths antes de 
  preguntar por el sistema de resoluci&oacute;n, y poner a todos los nodos a los 
  que se quiera forzar la entrega via UUCP en el archivo paths. Si nunca se quiere 
  enviar ning&uacute;n mensaje sobre SMTP, se pueden eliminar poniendo como comentarios 
  todos los encaminadores que est&aacute;n basados en el sistema de resoluci&oacute;n.</P>
<P>Otro problema es que las opciones por defecto no proporcionan encaminado de 
  correo Internet verdadero, debido a que un encaminador basado en un DNS no eval&uacute;a 
  los registros MX. Para habilitar el soporte completo para el encaminamiento 
  de correo Internet, es necesario eliminar al encaminador poni&eacute;ndolo como 
  comentario, y quitar el comentario de aquel que utiliza BIND. Sin embargo, algunas 
  distribuciones de Linux incluyen binarios de smail que no tienen el soporte 
  para BIND incluido y, si se habilita BIND, se obtendr&aacute; un mensaje en 
  el archivo paniclog que dice "router inet_hosts: driver bind not found", es 
  decir, "no se encuentra el controlador de bind", por lo que ser&aacute; necesario 
  obtener el c&oacute;digo fuente y recompilar smail (vea la secci&oacute;n 14.2 
  mas arriba).</P>
<P>Para concluir, generalmente no es buena idea utilizar el controlador uuname. 
  Por una parte, generar&aacute; un error de configuraci&oacute;n cuando no se 
  tenga UUCP instalado, debido a que no encontrar&aacute; al programa uuname. 
  Por la otra, es que se tienen mas sistemas listados en su archivo Systems de 
  UUCP que aquellos con los que se mantiene correo. Estos pueden ser nodos con 
  los cuales &uacute;nicamente se intercambian noticias, o sistemas de los cuales 
  se bajan archivos ocasionalmente via UUCP an&oacute;nimo, pero no se tiene mas 
  tr&aacute;fico que &eacute;ste.</P>
<P>Para resolver el primer problema, se puede sustituir el programa uuname con 
  un script que haga un simple exit 0. La soluci&oacute;n mas general es, sin 
  embargo, editar el archivo routers y borrar todo el driver.</P>
<P>&nbsp;</P>
<I><U>
<P><a name="14.7.1"></a>14.7.1 La base de datos de trayectorias paths</P>
</u></I>
<P>El programa smail espera encontrar una base de datos de alias de trayectorias 
  en el archivo paths en el subdirectorio /usr/lib/smail. Este archivo es opcional, 
  por lo que si no se quiere hacer ning&uacute;n encaminamiento por medio de alias 
  de trayectorias, simplemente se borra el archivo paths.</P>
<P>El archivo paths debe ser un archivo ASCII ordenado que contiene l&iacute;neas 
  que mapeen los nombres de los nodos destino a trayectorias UUCP con signos de 
  admiraci&oacute;n. El archivo tiene que estar ordenado debido a que smail utiliza 
  b&uacute;squeda binaria para encontrar un sitio.</P>
<P>No se permiten comentarios en este archivo, y el nombre del sitio debe estar 
  separado de la trayectoria utilizando un car&aacute;cter de tabulaci&oacute;n. 
  Las bases de datos de alias de trayectorias se discuten con mas detalle en el 
  cap&iacute;tulo 13.</P>
<P>Si se genera este archivo a mano, es importante asegurarse de incluir todos 
  los nombres validos para un sistema. Por ejemplo, si a una m&aacute;quina se 
  le conoce por un nombre simple UUCP y un nombre de dominio totalmente calificado, 
  se debe a&ntilde;adir una l&iacute;nea para cada uno de ellos. El archivo debe 
  estar ordenado (para ello, enviarlo al comando sort(1)).</P>
<P>Si su nodo es simplemente terminal, no ser&aacute; necesario tener un archivo 
  paths: basta con ajustar los atributos de nodo de relevo en su archivo config, 
  y dejarle todo el trabajo de encaminamiento que su correo genere.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="14.8"></a>14.8 Como entregar mensajes a las direcciones locales</P>
</font></u></B><FONT FACE="Verdana" SIZE=2> 
<P>Es com&uacute;n que una direcci&oacute;n local de correo sea solo el nombre 
  del usuario, en cuyo caso el mensaje se entrega en su archivo de correo, /var/spool/mail 
  /usuario. En otros casos se incluyen alias y nombres de la lista de correo, 
  y correo redirigido por el usuario. En estos casos, la direcci&oacute;n local 
  se expande a una nueva lista de direcciones que pueden ser locales o remotas.</P>
<P>Independientemente de estas direcciones "normales", smail puede manejar otros 
  tipos de destino para los mensajes locales tales como nombres de archivos o 
  comandos (que reciben el mensaje por su entrada est&aacute;ndar). Estas no son 
  propiamente direcciones, de tal forma que no se puede mandar correo, por ejemplo 
  a /etc/passwd@vbrew.com; solo son v&aacute;lidas si se han tomado de un archivo 
  alias o de redireccionamiento.</P>
<P>Un nombre de archivo es cualquier cosa que comience con una diagonal (/) o 
  una tilde (~). El segundo se refiere al directorio inicial del usuario, y es 
  posible solo si el nombre del archivo ha sido tomado de .forward o una l&iacute;nea 
  de redirecci&oacute;n del archivo de correo (ver mas abajo). Cuando smail manda 
  el mensaje a un archivo, lo a&ntilde;ade al final del archivo y, de ser necesario, 
  lo puede tambi&eacute;n crear.</P>
<P>Una instrucci&oacute;n por tuber&iacute;a puede ser cualquier comando UNIX 
  precedido por el simbolo (|). Esto hace que smail env&iacute;e el comando al 
  shell junto con sus argumentos, pero sin el '|' que lo encabeza; pasando el 
  mensaje a la entrada est&aacute;ndar del comando.</P>
<P>Por ejemplo, para meter una lista de correo en un grupo de noticias local, 
  se podr&iacute;a utilizar un script llamado gateit y configurar un alias local 
  que entregue todos los mensajes de esta lista de correo al script, utilizando 
  "_gateit".</P>
<P>Si la invocaci&oacute;n contiene un espacio en blanco, se debe encerrar entre 
  comillas dobles.</P>
<P>Debido a los problemas de seguridad que pueden ser ocasionados aqu&iacute;, 
  es importante cuidar que no se ejecute el comando si la direcci&oacute;n ha 
  sido obtenida de alguna forma dudosa (por ejemplo, si el archivo de alias del 
  cual la direcci&oacute;n se ha obtenido puede ser escrito por cualquiera).</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="14.8.1"></a>14.8.1 Usuarios locales</P>
</u></I> 
<P>El caso mas com&uacute;n para una direcci&oacute;n local es mostrar el archivo 
  de correo del usuario. Este apartado postal esta en /var/spool/mail y tiene 
  el nombre del usuario. Tambi&eacute;n es propiedad de &eacute;ste, con grupo 
  mail y tiene el modo 660. Si no existe, smail lo crea.</P>
<P>Observe que aunque /var/spool/mail es el lugar est&aacute;ndar para poner los 
  archivos de correo, algunas aplicaciones tienen diferentes trayectorias compiladas 
  en ellos, por ejemplo /usr/spool/mail. Si la entrega a los usuarios en su sistema 
  falla constantemente, se puede intentar hacer un enlace simb&oacute;lico a /var/spool/mail 
  para ver si esta situaci&oacute;n mejora.</P>
<P>Hay dos direcciones que smail necesita para funcionar: MAILER-DAEMON y Postmaster. 
  Cuando se devuelve un mensaje de informe debido a un correo que no pudo ser 
  entregado, se env&iacute;a una copia a la cuenta del administrador postal (el 
  postmaster) para su revisi&oacute;n (en el caso de que este mensaje pudiera 
  ser debido a un problema de configuraci&oacute;n).</P>
<P>El usuario MAILER-DAEMON se utiliza como la direcci&oacute;n del remitente 
  del mensaje devuelto.</P>
<P>Si estas direcciones no tienen nombres de cuentas validas en su sistema, smail 
  mapea impl&iacute;citamente MAILER-DAEMON a postmaster, y postmaster a root. 
  Es conveniente cambiar esto d&aacute;ndole un alias postmaster al responsable 
  del mantenimiento de los programas de correo.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="14.8.2"></a>14.8.2 Reenv&iacute;o</P>
</u></I> 
<P>Un usuario puede redirigir su correo a una direcci&oacute;n alternativa utilizando 
  uno de los dos m&eacute;todos que soporta smail. Una opci&oacute;n es poner</P>
<DIR> 
  <DIR> 
    <P>Forward to receptor ,...</P>
  </DIR>
</DIR>
<P>en la primera l&iacute;nea de su archivo de correo. Esto enviar&aacute; todo 
  el correo que se reciba a la lista de receptores especificada all&iacute;. La 
  otra es crear un archivo .forward en el directorio principal del usuario, que 
  contenga una lista de los receptores separados por comas. Con este sistema de 
  redireccionamiento, todas las l&iacute;neas del archivo son le&iacute;das e 
  interpretadas.</P>
<P>Observe que cualquier tipo de direcci&oacute;n puede ser utilizada. As&iacute;, 
  un ejemplo pr&aacute;ctico del archivo .forward para cuando se tome unas vacaciones 
  puede ser &nbsp;</P>
<DIR> 
  <DIR> 
    <P>janet, "|vacation"</P>
  </DIR>
</DIR>
<P>La primera direcci&oacute;n entrega el mensaje que llega al archivo de correo 
  de janet, mientras que la instrucci&oacute;n vacation provoca la devoluci&oacute;n 
  de un mensaje que informa al remitente que janet esta de vacaciones.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="14.8.3"></a>14.8.3 Archivos de alias</P>
</u></I> 
<P>El programa smail entiende los archivos de alias compatibles con los del sendmail 
  de Berkeley. Las l&iacute;neas en el archivo de alias pueden ser de la forma 
  alias: receptores</P>
<P>receptores es una lista de direcciones separadas por comas que ser&aacute; 
  sustituida por el alias. La lista de receptores puede continuar a trav&eacute;s 
  de varias l&iacute;neas si la siguiente l&iacute;nea comienza con un car&aacute;cter 
  de tabulaci&oacute;n.</P>
<P>Hay una caracter&iacute;stica especial que permite que smail maneje listas 
  de correo desde un archivo de alias: si se especifica ":include:nombrearchivo 
  " como receptor, smail leer&aacute; el archivo especificado, y sustituir&aacute; 
  su contenido con una lista de receptores.</P>
<P>El archivo de alias principal es /usr/lib/aliases. Si se decide hacerlo escribible 
  por todo el mundo, smail no entregara ning&uacute;n mensaje a los comandos de 
  shell que pudiese contener el archivo. Un archivo de ejemplo se muestra a continuaci&oacute;n:</P>
<DIR> 
  <DIR> 
    <P># vbrew.com archivo /usr/lib/aliases<BR>
      hostmaster: janet<BR>
      postmaster: janet<BR>
      usenet: phil<BR>
      # La lista de correo de desarrollo de programas.<BR>
      development: joe, sue, mark, biff<BR>
      /var/mail/log/development<BR>
      owner-development: joe<BR>
      # Los anuncios de interes general ser&aacute;n enviados<BR>
      # a todo el personal (lista staff)<BR>
      announce: :include: /usr/lib/smail/staff,<BR>
      /var/mail/log/announce<BR>
      owner-announce: root<BR>
      # pasarela a la lista de correos foobar a un grupo de noticias local<BR>
      ppp-list: "|/usr/local/lib/gateit local.lists.ppp"</P>
  </DIR>
</DIR>
<P>Si hay un error cuando se entrega a una direcci&oacute;n generada por el archivo 
  aliases, smail intentara enviar una copia del mensaje de error al "due&ntilde;o 
  del alias". Por ejemplo, si la entrega a biff no se logra cuando se env&iacute;o 
  un mensaje a la lista de correo development, se enviara una copia del mensaje 
  de error al remitente, as&iacute; como tambi&eacute;n al postmaster y a owner-development. 
  Si la direcci&oacute;n del due&ntilde;o no existe, no se generar&aacute; el 
  mensaje de error adicional.</P>
<P>Cuando se entrega a un archivo o cuando se invocan programas en el archivo 
  aliases, smail se convierte en el usuario nobody para evitar problemas de seguridad6. 
  En especial cuando se entrega a un archivo esto constituye una verdadera molestia. 
  En el archivo de ejemplo que se dio anteriormente, los archivos de registro 
  .log deben ser propiedad y ser escribibles por el usuario nobody, o la entrega 
  hacia ellos fallara.</P>
<P>_____________________________________________<BR>
  6 N. del T.: nobody significa nadie, y es un usuario que se utiliza cuando no 
  se identifica al due&ntilde;o de un proceso, y si bien se desea su ejecuci&oacute;n, 
  tambi&eacute;n es cierto que no deseamos crear un agujero en nuestros mecanismos 
  de seguridad, por lo cual nobody es un usuario con los privilegios reducidos 
  al m&iacute;nimo.</P>
<P>&nbsp;</P>
<I><U> 
<P><a name="14.8.4"></a>14.8.4 Listas de correo</P>
</u></I> 
<P>En vez de utilizar el archivo aliases, las listas de correo tambi&eacute;n 
  pueden ser administradas por medio de archivos en el directorio /usr/lib/smail 
  /lists. Una lista de correo llamada nagbugs se debe describir en el archivo 
  lists/nag-bugs, el cual deber&aacute; contener las direcciones de los miembros 
  separadas por comas. La lista puede estar en varias l&iacute;neas, con l&iacute;neas 
  de comentarios que comienzan con el s&iacute;mbolo #.</P>
<P>Para cada lista de correo, un usuario (o alias) llamado owner-nombredelista 
  debe existir; cualquier error que ocurra cuando se resuelva una direcci&oacute;n 
  ser&aacute; enviado a este usuario. Esta direcci&oacute;n se usa tambi&eacute;n 
  como la direcci&oacute;n del remitente en todos los mensajes de salida en el 
  campo de encabezado Sender:.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080"> 
<P><a name="14.9"></a>14.9 Transportes basados en UUCP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Hay varios transportes compilados en smail que utilizan el conjunto de programas UUCP.</P>
<P>En un entorno UUCP, los mensajes se pasan normalmente al invocar rmail en el siguiente nodo, d&aacute;ndole el mensaje en la entrada est&aacute;ndar y la direcci&oacute;n a quien va dirigido en la l&iacute;nea de argumentos. En el sistema, rmail deber&aacute; ser un enlace al programa smail.</P>
<P>Cuando se maneja un mensaje con el transporte UUCP, smail convierte la direcci&oacute;n destino a una trayectoria UUCP con s&iacute;mbolos de admiraci&oacute;n. Por ejemplo, user@host se transformara en host!user. Cualquier ocurrencia del operador de direcciones '%' ser&aacute; conservada, de tal forma que user%host@gateway se convertir&aacute; en gateway!user%host.</P>
<P>Sin embargo, mail nunca generar&aacute; esa direcci&oacute;n por si mismo.</P>
<P>De manera alternativa, smail puede enviar y recibir lotes de BSMPT via UUCP. Con BSMTP, uno o mas mensajes son empaquetados en un solo lote que contiene las instrucciones para que el controlador del correo local funcione como si se hubiera establecido una conexi&oacute;n SMTP real. BSMTP se utiliza frecuentemente en redes de guardar-y-enviar (por ejemplo las basadas en UUCP) para ahorrar espacio en disco. El archivo de ejemplo transports del ap&eacute;ndice B contiene un transporte doblado bsmtp que genera lotes parciales BSMTP en un directorio de colas. Luego, deben ser combinados en los lotes finales utilizando un script de shell que agrega las instrucciones apropiadas HELO y QUIT.</P>
<P>Para habilitar el transporte bsmtp para enlaces UUCP espec&iacute;ficos se deben utilizar los archivos llamados m&eacute;todo (revise la p&aacute;gina del manual smail(5) para mas detalles). Si se tiene &uacute;nicamente un enlace UUCP, y se utiliza un encaminado a relevo, se puede habilitar el env&iacute;o de lotes SMTP poniendo la variable de configuraci&oacute;n smart_transport a bsmtp en vez de uux.</P>
<P>Para recibir lotes SMTP sobre UUCP, se debe asegurar que se tiene el mismo programa de decodificaci&oacute;n de lotes que el sistema remoto que env&iacute;a los lotes. Si el nodo remoto utiliza smail tambi&eacute;n, es necesario hacer un enlace llamado rsmtp a smail. Si el sistema remoto corre sendmail, se debe adem&aacute;s instalar un script llamado /usr/bin/bsmtp que haga un simple "exec rsmtp" (una enlace simb&oacute;lico no funcionara).</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="14.10"></a>14.10 Transportes basados en SMTP</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>El smail soporta actualmente un controlador de SMTP para entregar el correo sobre conexiones TCP.7 Es capaz de entregar un mensaje a cualquier numero de direcciones de una m&aacute;quina, con el nombre de la misma especificado como nombre de dominio totalmente calificado que puede ser resuelto por el software de red, o con la notaci&oacute;n de cuarteto de puntos encerrados entre corchetes. En general, las direcciones se resuelven con los controladores de encaminamiento del BIND, gethostbyname(3), o gethostbyaddr(3) que lo entregaran al transporte SMTP.</P>
<P>El manejador de SMTP intentara conectarse al sistema remoto inmediatamente a trav&eacute;s del puerto smtp como esta listado en /etc/services. Si no puede ser alcanzado, o expira el tiempo m&aacute;ximo de espera, la entrega del correo se reintentara posteriormente.</P>
<P>La entrega en Internet requiere que las rutas al nodo destino est&eacute;n especificadas en el formato route-addr descrito en el cap&iacute;tulo 13, en vez de utilizar una trayectoria de signos de admiracion.8 smail transformara user%host@gateway, en donde gateway se alcanza via host1!host2!host3, en la direcci&oacute;n de la ruta-fuente &lt;@host2,@host3:user%host@gateway&gt; la cual ser&aacute; enviada como la direcci&oacute;n del remitente a host1. Para habilitar dicha transformaci&oacute;n (utilizando el controlador incluido de BIND), se debe editar la l&iacute;nea del controlador smtp en el archivo transports. Un archivo de muestra transports se da en el Ap&eacute;ndice B.</P>
<P>&nbsp;</P>
</FONT><B><U><FONT FACE="Verdana" SIZE=2 COLOR="#008080">
<P><a name="14.11"></a>14.11 Calificaci&oacute;n de nombre de anfitri&oacute;n</P>
</font></u></B><FONT FACE="Verdana" SIZE=2>
<P>Algunas veces se desean capturar los nombres de sistema no calificados (i.e. aquellos que no tienen un nombre de dominio) escritos en la direcci&oacute;n del remitente o del receptor, por ejemplo cuando se pasa a trav&eacute;s de dos redes, en donde una requiere de nombres de dominio totalmente calificados. En un relevo Internet-UUCP, los nombres de nodo no calificados deben ser mapeados al dominio uucp por defecto. Cualquier otro cambio de direcci&oacute;n distinto a los anteriores son cuestionables.</P>
<P>_____________________________________________<BR>
7 Los autores llaman a este soporte "simple". Para una versi&oacute;n futura de smail, han anunciado un mecanismo completo que manejar&aacute; &eacute;sto de manera m&aacute;s eficiente.<BR>
8 Sin embargo, el uso de rutas en Internet se desaconseja totalmente. En cambio, se deben utilizar nombres de dominio totalmente calificados.</P>
<P>&nbsp;</P>
<P>El archivo /usr/lib/smail /qualify indica a smail que nombres de dominios debe cambiar a que nombres de nodo. Las l&iacute;neas del archivo qualify consisten en el nombre del sistema comenzando en la columna uno, seguidos del nombre del dominio. Las l&iacute;neas conteniendo un s&iacute;mbolo # como su primer car&aacute;cter no blanco se consideran comentarios. Las l&iacute;neas se buscan en el orden en el que aparecen.</P>
<P>Si no existe el archivo qualify, no se hace ninguna calificaci&oacute;n de nombres de nodos.</P>
<P>Un nombre de anfitri&oacute;n especial (*) indica que todos son nombres de nodos. As&iacute;, se puede habilitar un mapeo a todos los sistemas no mencionados antes en un dominio por defecto. Debe ser utilizado solo en la &uacute;ltima l&iacute;nea.</P>
<P>En la Cervecera Virtual, todos los sistemas han sido configurados para utilizar nombres de dominio totalmente calificados en las direcciones de los remitentes. Las direcciones de los receptores no calificadas se considera que est&aacute;n en el dominio uucp, de tal forma que solo una l&iacute;nea en el archivo qualify es necesaria.</P><DIR>
  <DIR> 
    <P># /usr/lib/smail/qualify, cambiado por janet el 12 Feb 1994<BR>
      #<BR>
      * uucp</P>
  </DIR>
</DIR>
<P>&nbsp;</P>
</FONT>
</BODY>
</HTML>
