<!doctype linuxdoc system>

<article>

<title>Win95 + WinNT + Linux multi-amor&ccedil;age en utilisant le LILO mini-HOWTO
<author>Renzo Zanelli, <tt/rzanelli@southeast.net/ -- Traduit par Maxime
Baudin <tt><htmlurl url="mailto:mbaudin@club-internet.fr" name="mbaudin@club-internet.fr"></tt>
<date>v1.0, 26 Mars 1998

<abstract>
Ce document d&eacute;crit la fa&ccedil;on de faire du multi-amor&ccedil;age (multi-boot)
entre Windows 95, Windows NT et Linux.
</abstract>

<!-- Table of contents -->
<toc>

<!-- Begin the document -->

<sect>Introduction

<p>
Il existe  de nombreux documents qui d&eacute;crivent en d&eacute;tail 
comment faire du multi-armor&ccedil;age avec un nombre quelconque de syst&egrave;mes d'exploitation
et le chargeur (OS Loader) de Windows NT.    
Lorsque que j'ai finalement
achet&eacute; Windows NT, j'avais d&eacute;j&agrave; Windows 95 et Linux
d'install&eacute;s sur mon syst&egrave;me, et j'utilisais alors LILO pour
s&eacute;lectionner l'amor&ccedil;age sur l'un ou l'autre.
J'ai d&eacute;cid&eacute; d'ajouter Windows NT au menu de LILO plut&ocirc;t
que d'utiliser le chargeur de NT.


&Agrave; l'origine j'avais Windows 95 sur mon premier disque IDE et
Linux sur le second. Le disque contenant Linux est devenu le
troisi&egrave;me et j'ai install&eacute; Windows NT sur un nouveau disque
plac&eacute; en deuxi&egrave;me. Jusqu'ici je n'ai pas essay&eacute; ce
proc&eacute;d&eacute; dans d'autres configurations, je suis convaincu que
l'ordre dans lequel les syst&egrave;mes d'exploitation sont
install&eacute;s ou l'ordre des disques n'a pas d'importance.


Pensez simplement &agrave; cr&eacute;er les disquettes d'amor&ccedil;age
de secours lorsque chaque syst&egrave;me d'exploitation vous propose de
le faire !

Dans la mesure o&ugrave; j'utilise l'utilitaire Bootpart (&eacute;crit par
Gilles Vollant) et qu'il ne g&egrave;re pas les disques durs dont la taille
&eacute;xc&egrave;de 4 Go, ces explications pourraient ne pas
&ecirc;tre utilisables sur des disques de plus grande capacit&eacute;. Si
vous devez travailler avec des disques durs de plus de 4 Go, veuillez
contacter Gilles directement (son  adresse &eacute;lectronique se trouve
dans la documentation de Bootpart).

<sect>Installer les syst&egrave;mes d'exploitation

<p>
Lors de l'installation des S.E. (syst&egrave;mes d'exploitation), assurez vous de le faire sur des
partitions amor&ccedil;ables (bootables). J'ai install&eacute; Windows 95
et Windows NT sur des partitions en FAT16, par cons&eacute;quent cette
m&eacute;thode fonctionne sur ce type de partition. Si vous d&eacute;cidez
d'utiliser la FAT32 pour Windows 95 et NTFS pour Windows NT,
v&eacute;rifiez au pr&eacute;alable que votre version de Linux les
g&egrave;re et si tel est le cas, jusqu'&agrave; quel point. 

<!-- (NDT:
l'utilisation de la FAT32 et NTFS impliquent des modifications non
d&eacute;crites dans la version originale, vous trouverez des explications
sous forme de NDT, jusqu'&agrave; la prochaine mise &agrave; jour de la
version originale). -->

<sect1>Installer Windows 95

<p>
Installez Windows 95 sur votre premier disque dur. Ce sera votre disque C: .
Rappelez vous de cr&eacute;er la disquette d'amor&ccedil;age lorsque cela
vous est propos&eacute;.

J'ai trouv&eacute; plus simple de retirer le disque contenant Linux lors de
l'installation de Windows 95, de sorte qu'il ne soit jamais
d&eacute;tect&eacute; et que Windows 95 ignore son existence.

&Agrave; ce stade, si vous avez tout fait correctement, vous devriez
pouvoir d&eacute;marrer Windows 95.

<sect1>Installer Windows NT

<p>
Installez Windows NT sur votre deuxi&egrave;me disque. Lors de la
cr&eacute;ation de la partition sur ce disque, rendez la partition
amor&ccedil;able. Toutes les versions de Linux ne supportent pas NTFS,
par cons&eacute;quent, j'ai cr&eacute;&eacute; la partition en FAT 16 ; d'une part
par pr&eacute;caution et d'autre part parce que je veux pouvoir &eacute;changer
des informations entre les deux variantes Windows.
<!-- (NDT: NT ne lit pas les partitions FAT 32, et 95/98 ne lit pas les
partitions NTFS). -->

Lors de l'installation de Windows NT, ce dernier d&eacute;tectera la
pr&eacute;sence de Windows 95 (NDT : seulement s'il est sur une FAT 16) et
lui cr&eacute;era une entr&eacute;e dans le menu du chargeur NT, vous
devriez alors voir trois entrées dans le menu, comme suit :
<tscreen><verb>
Windows NT Workstation Version 4.00
Windows NT Workstation Version 4.00 [VGA mode]
Microsoft Windows
</verb></tscreen>
<!-- (NDT : sur Win95 FAT 32/Win98, vous ne verrez pas le chargeur NT... pas de
panique, il est ailleurs). -->

&Agrave; ce stade, si vous avez tout fait correctement, vous devriez
&ecirc;tre en mesure de faire du "multi-amor&ccedil;age" entre Windows NT
et Windows 95.

<!-- (NDT : pas dans le cas Win95-FAT32/Win98, mais &ccedil;a viendra ;-) ) -->


<sect1>Installer Linux

<p>
Installez Linux sur votre troisi&egrave;me disque. Lorsque j'ai
install&eacute; Linux, je n'avais que Windows 95 d'install&eacute;, je n'ai
eu qu'&agrave; ajouter l'acc&egrave;s &agrave; la partition Windows 95
dans LILO. Vous pouvez installer des acc&egrave;s pour tous
vos S.E. &agrave; l'installation de LILO, ou &eacute;diter le fichier de
configuration de LILO plus tard. N&eacute;anmoins si vous d&eacute;cidez de
le faire, je vous expliquerais &agrave; quoi est cens&eacute; ressembler le
fichier /etc/lilo.conf dans le chapitre suivant. Une fois Linux
install&eacute;, vous devriez &ecirc;tre en mesure de d&eacute;marrer sous
Linux.

<sect>La partie Linux

<p>
Ceci implique l'&eacute;dition du fichier /etc/lilo.conf et la
r&eacute;-installation de LILO.
Les lignes suivantes doivent d&eacute;j&agrave; &ecirc;tre pr&eacute;sentes
dans le fichier /etc/lilo.conf
<tscreen><verb>
boot=/dev/hda
</verb></tscreen>

La strophe relative à Linux doit d&eacute;j&agrave; &ecirc;tre pr&eacute;sent:
<tscreen><verb>
# Bloc Linux
image=/vmlinuz
root=/dev/hdc1
label=Linux
# Fin du bloc
</verb></tscreen>

Ajoutons une strophe pour Windows 95
<tscreen><verb>
# Couplet Win95
other=/dev/hda1
table=/dev/hda
label=Windows95
# Fin du bloc
</verb></tscreen>

Puis on ajoute une strophe pour Windows NT
<tscreen><verb>
# Bloc WinNT
other=/dev/hdb1
table=/dev/hda
loader=/boot/any_d.b
label=WindowsNT
# Fin du bloc NT
</verb></tscreen>

<!-- (NDT : Si le chargeur NT est sur le deuxi&egrave;me disque, changer alors :
table=/dev/hda
en
table=/dev/hdb ) -->

Relancez LILO. &Agrave; ce stade, si tout s'est bien pass&eacute;, vous
devriez avoir comme choix : Windows 95, Windows NT et Linux depuis le menu
de LILO. Vous pouvez d&eacute;marrer sous Linux et Windows 95 (ce dernier
vous donnant acc&egrave;s au menu du chargeur NT). Pour rendre
l'acc&egrave;s &agrave; NT op&eacute;rationnel, vous devrez encore oeuvrer un
peu du c&ocirc;t&eacute; NT.

<sect>La partie Windows NT

<p>
Avant d'aller plus avant, vous devrez faire deux choses de plus.

La premi&egrave;re est de t&eacute;l&eacute;charger et d&eacute;compresser
l'utilitaire Bootpart (de Gilles Vollant). Vous le trouverez &agrave; : <url
url="http://www.winimage.com/bootpart.htm"> avec quelques informations sur
son utilisation.

La seconde est de copier (ne les effacez pas encore !) &agrave; la racine
du disque contenant Windows NT les fichiers suivants :
 <tscreen><verb>
Boot.ini
Bootsect.dos
Ntdetect.com
Ntldr
</verb></tscreen>
Ces fichiers constituent le chargeur NT. Ils sont localis&eacute;s &agrave;
la racine du disque contenant Windows 95 et y ont &eacute;t&eacute;
plac&eacute;s par Windows NT &agrave; l'installation de ce dernier.

<!-- (NDT : ces fichiers se trouvent d&eacute;j&agrave ; sur le disque contenant
Windows NT, si votre Win95/98 est en FAT 32. Si vous avez une FAT32,
l'installation se termine ici.). -->

Une fois cela fait, d&eacute;marrez sous Windows 95 en mode DOS (en pressant
Majuscule+F5 au chargement de Windows 95) et entrez alors les commandes
suivantes :
<tscreen><verb>
BOOTPART WINNT BOOT:D:
</verb></tscreen>
Vous devez maintenant &eacute;diter le fichier Boot.ini situ&eacute;
&agrave; la racine de la partition de Windows NT. Vous devez &eacute;diter
trois lignes, une dans la section [boot loader] et deux dans la section
[operating systems].

Voici le Boot.ini original :
<tscreen><verb>
[boot loader]
timeout=30
default=multi(0)disk(0)rdisk(1)partition(1)\WINNT
[operating systems]
multi(0)disk(0)rdisk(1)partition(1)\WINNT="Windows NT Workstation Version
4.00"
multi(0)disk(0)rdisk(1)partition(1)\WINNT="Windows NT Workstation Version
4.00 [VGA mode]" /basevideo /sos
C:\ = "Microsoft Windows"
</verb></tscreen>

Voici le fichier Boot.ini modifi&eacute; :
<tscreen><verb>
[boot loader]
timeout=30
default=multi(0)disk(0)rdisk(0)partition(1)\WINNT
[operating systems]
multi(0)disk(0)rdisk(0)partition(1)\WINNT="Windows NT Workstation Version
4.00"
multi(0)disk(0)rdisk(0)partition(1)\WINNT="Windows NT Workstation Version
4.00 [VGA mode]" /basevideo /sos
</verb></tscreen>
Notez que toutes les occurrences du type rdisk(1) ont &eacute;t&eacute;
modifi&eacute;es en rdisk(0) et les lignes r&eacute;f&eacute;ren&ccedil;ant
Windows 95 ont &eacute;t&eacute; retir&eacute;es.
<!-- (NDT : avec la FAT 32 aucune modification n'est &agrave; effectuer). -->

Apr&egrave;s avoir sauv&eacute; le fichier, si vous avez tout fait
correctement, vous devriez maintenant &ecirc;tre capable de d&eacute;marrer
sous Windows NT &agrave; partir de LILO.

<sect>La partie Windows 95

<p>
Cr&eacute;ez une disquette de d&eacute;marrage DOS &agrave; partir de
l'invite de commande de DOS (en pressant Majuscule+F5 au chargement de
Windows 95). Il est fondamental de cr&eacute;er cette disquette &agrave;
partir de DOS, et pas d'une fen&ecirc;tre DOS sous Windows 95. ne
d&eacute;marrez pas sous Windows 95 tant que cette &eacute;tape n'est pas
r&eacute;alis&eacute;e. Copiez le fichier C:\WINDOWS95\COMMAND\SYS.COM sur
la disquette (en substituant le chemin d'acc&egrave;s &agrave; Windows 95
s'il est diff&eacute;rent). D&eacute;marrez alors &agrave; partir de cette
disquette, puis entrez la commande :
<tscreen><verb>
SYS C:
</verb></tscreen>
Cela devrait retirer le chargeur NT, et vous devriez d&eacute;sormais
pouvoir d&eacute;marrer directement sur Windows 95 &agrave;
partir de LILO.
<!-- (NDT : ceci n'est pas &agrave; faire sous Windows 98 ou 95 sur FAT 32.) -->

Vous pouvez alors effacer les fichiers du chargeur NT :
<tscreen><verb>
Boot.ini
Bootsect.dos
Ntdetect.com
Ntldr
</verb></tscreen>

<sect>R&eacute;f&eacute;rences

<p>
Merci aux personnes suivantes (sans ordre particulier) :

James C. Bevier et D. Michael McFarland.  Leurs &eacute;changes sur la
liste de diffusion RedHat m'ont apport&eacute; plusieurs informations sur
la fa&ccedil;on de d&eacute;marrer sur Windows NT &agrave; partir de Linux.

Gilles Vollant. Bootpart est un utilitaire tr&egrave;s pratique et Gilles
le met &agrave; disposition gratuitement avec une bonne documentation.
Merci Gilles.

Mike Harlan.  En lisant son 'Linux-DOS-Win95-OS2' mini-HOWTO, cela m'a
permis de faire certaines hypoth&egrave;ses sur le comportement de LILO.

</article>

