<!doctype linuxdoc system>

<article>

<!-- traduction de la mini-howto -->

<title>Mini-Howto sur la r&eacute;cup&eacute;ration d'une partition  

<author> AUTEUR Rolf Klausen, <tt/rolfk@romsdal.vgs.no/

<date> v1.1, 22 Octobre 1997

<abstract>



Ce document d&eacute;crit comment r&eacute;cup&eacute;rer une partition d&eacute;truite par MS-DOG
</abstract>


<!-- Table of contents -->
<toc>


<!-- Begin the document -->

<sect>INTRODUCTION

<p>
<bf/Introduction/ 
J'ai install&eacute; Linux sur mon ordinateur et je l'utilise depuis un an 
maintenant, et je pense que c'est le meilleur OS jamais cr&eacute;&eacute;. J'ai aussi
MS-DOG ET Windows NT 4.0 install&eacute; sur mon ordinateur. La raison pour
laquelle j'utilise MS-DOG est tr&egrave;s simple, car comme l'a &eacute;crit Lars Wirzenius
une fois :" MS-DOS - you can't live with it, you can't live without it
" (MS-dos - vous ne pouvez ni vivre avec, ni vivre sans).  
Je l'utilise pour les jeux, les d&eacute;mos, et aussi pour le travail. Mais cela
suffit. J'ai deux partitions DOS, une partition primaire et un disque
logique (je suppose que vous savez ce que c'est, sinon lisez le mini-HOWTO
sur la Partition. On peut le trouver &agrave; sunsite.unc.edu et sans doute dans
d'autres endroits). Mes partitions ont &agrave; peu pr&egrave;s 500 MB chacun (j'ai un disque dur de
3.2 GB et un autre de 1.2 GB). Ma partition Linux est de 1200 MB. J'ai un
espace libre d'environ 800 MB dont je ne sais pas quoi faire pour l'instant,
et je me demandais comment je m'y prendrais si j'avais besoin de plus d'espace pour DOS
(un jeu important ou autre chose), parceque je ne savais pas combien de disques logiques DOS pouvait g&eacute;rer en tout. Je ne sais pas pourquoi mais je
pensais que DOS ne pouvait en avoir qu'un (en plus de sa partition primaire).
Aussi je voulais v&eacute;rifier que DOS pouvait acc&egrave;der &agrave;  plusieurs disques
logiques. Je d&eacute;marrais fdisk (DOS) et utilisais le menu pour cr&eacute;er un disque
logique DOS. J'en cr&eacute;ais un de 100 MB. Puis je le formattais et tout marchait
parfaitement.Pens&eacute;e tr&egrave;s agr&eacute;able ! Et alors je connus &ccedil;a! En realit&eacute; je n'avais pas
besoin de ce disque et je d&eacute;cidais donc de le d&eacute;truire. J'utilisais de
nouveau fdisk, choisissais dans le menu "delete DOS primary partition or
logical drive"(d&eacute;truire une partition primaire ou un disque logique ou
quelque chose de ce genre), s&eacute;lectionnais le disque E: pour le d&eacute;truire,
tapais le label du volume (en r&eacute;alit&eacute; il n'y en avait pas donc je tapais
enter), et fdisk m'avertit que le disque avait &eacute;t&eacute;
d&eacute;truit avec succ&egrave;s.
Puis je red&eacute;marrais. Sur mon ordinateur j'utilise un programme appel&eacute; System
Commander. C'est un bon programme qui propose un menu sympa (comme le Boot
Manager d'OS/2) avec ic&ocirc;nes et quelques outils int&eacute;ressants. Il d&eacute;tecte
automatiquement les OS.

Mais quand je red&eacute;marrais, Linux avait disparu du menu. Je d&eacute;marrais DOS,
tapais e: suivi d'ENTER, et tout restait calme. Je red&eacute;marrais fdisk,
choisissais d'afficher la table des partitions, mon disque E: y &eacute;tait
pr&eacute;sent et l&agrave; o&ugrave; se trouvait ma partition Linux il n'y avait plus qu'un
espace libre!
CHOC! HORREUR! je commen&ccedil;ais &agrave; suer et trembler. Que pouvais-je faire! Je ne
pouvais pas simplement tout r&eacute;installer. Il devait y avoir un moyen pour
tout r&eacute;cuperer.Et, oui, il y en avait un! Merci mon Dieu (m&ecirc;me si je ne crois
pas en lui) il y en avait un. J'avais un tas d'informations utiles et de 
programmes sur cette partition! Avant je me demandais comment r&eacute;cuperer ma
partition, je souhaitais que Bill Gates ne fut jamais n&eacute;!
Avez-vous d&eacute;j&agrave; v&eacute;cu la m&ecirc;me chose r&eacute;cemment ? Ne soyez pas effray&eacute;! La
solution est l&agrave;! lisez juste encore un peu plus loin...! Oh, en raison du
fait que je vis en Norv&egrave;ge, mon anglais n'est probablement pas tr&egrave;s bon,
mais j'esp&egrave;re que vous comprendrez quand m&ecirc;me.

<sect1> D&eacute;claration

<p>
<bf/D&eacute;claration/ Ce mini-howto est Copyright (C) 1997 Rolf Klausen. Tous droits
r&eacute;serv&eacute;s. Vous pouvez faire tout ce que vous voulez avec (enfin presque).
Cela m'est &eacute;gal. Seulement gardez mon nom intact. Je souhaite simplement que
cela soit utile aux utilisateurs de la communaut&eacute; Linux.
Mais, s'il-vous-pla&icirc;t, lisez la section suivante.

<bf>IMPORTANT!!!</bf>



Je ne suis pas responsable des dommages caus&eacute;s &agrave; un ordinateur resultant de
la lecture de ce HOWTO. Si vous causez des dommages, cela sera votre faute, pas
la mienne! Soyez prudent quand vous partitionnez des disques, ne faites pas
d'erreur, car cela peut &ecirc;tre fatal. Sauvegardez vos donn&eacute;es importantes et
v&eacute;rifiez que tout ce que vous faites est correct. Ce qui est d&eacute;crit ici
marche avec mon ordinateur, mais il peut ne pas marcher avec le v&ocirc;tre.
Normalement, il devrait marcher pour tout le monde mais je ne peux rien
garantir. C'est le dernier avertissement que vous lirez :<bf/ SAUVEGARDER VOS
DONNEES IMPORTANTES!/ ou pour r&eacute;sumer, faite l'usage de ce HOWTO &agrave; vos propres
risques.


<sect1>Copyright

<p>

<bf/Copyright/ Sauf indication contraire, les droits d'auteur des HOWTO
Linux sont d&eacute;tenus par leurs auteurs respectifs. Les HOWTO Linux peuvent
&ecirc;tre reproduits et distribu&eacute;s, en totalit&eacute; ou en partie, sur tout media
physique ou &eacute;lectronique dans la mesure o&ugrave; ce copyright est preserv&eacute; dans
chaque copie. La distribution commerciale en est autoris&eacute;e et encourag&eacute;e.
L'auteur appr&eacute;cierait toutefois qu'on lui notifie individuellement ce genre
de distribution.

Le pr&eacute;sent copyright doit couvrir toute traduction, compilation et autre
travail d&eacute;riv&eacute; des HOWTO Linux. C'est-&agrave;-dire qu'il est interdit d'imposer
des restrictions de diffusion allant au del&agrave; du pr&eacute;sent copyright &agrave; des
ouvrages inspir&eacute;s, ou incorporant des passages, de HOWTO Linux. Sous
certaines conditions, des exceptions &agrave; ces r&egrave;gles seront tol&eacute;r&eacute;es : contactez
le coordinateur des HOWTO &agrave; l'adresse donn&eacute;e ci-dessous ou le coordinateur
des traductions francaises, &agrave; l'adresse mailto:dumas@Linux.EU.ORG.

Pour r&eacute;sumer, nous souhaitons une diffusion aussi large que possible de ces
informations. N&eacute;anmoins, nous entendons garder la propri&eacute;t&eacute; intellectuelle
(copyright) des HOWTO, et appr&eacute;cierions d'&ecirc;tre inform&eacute;s de leur
redistribution.

Si vous avez des questions, contactez Greg Hankins le coordinateur des
documents HOWTO   de Linux, par e-mail  gregh@sunsite.unc.edu
par t&eacute;l&eacute;phone +1 404 853 9989  ou Tim Bynum &agrave; l'adresse &eacute;lectronique suivante tjbynum@sunsite.unc.edu 


<sect>PREPARATIONS ET BESOINS

<p>


<sect1>Ce dont vous avez besoin

<p>
<bf/VOS BESOINS/  Donc, MS-dog a d&eacute;truit votre partition Linux?  Voil&agrave; ce dont vous avez besoin
pour le ramener d'entre les morts :
<itemize>
<item>une installation  MS-DOS en &eacute;tat de marche, de pr&eacute;f&eacute;rence sur un disque
dur( peut-&ecirc;tre que cela marche aussi avec une disquette, je ne sais pas) 
<item>un programme sous Dos appel&eacute; Magique Partition (magic partition). 
</itemize>

<sect1>Je suppose que ...
<p>
<bf/Si vous &ecirc;tes dans se cas/, alors votre chance de r&eacute;cup&eacute;rer votre partition est &eacute;lev&eacute;e!

<sect>JE VEUX RETROUVER MA PARTITION!

<p>
<bf/Le sauvetage  / OK! Soyez pr&ecirc;t &agrave; sauver...attrapez une tasse de caf&eacute;, relaxez-vous. Tout va
bien aller  -  Pouvez-vous imaginer ce que j'ai ressenti quand MaSsy-DOS a
d&eacute;truit ma partition? Je n'ai jamais &eacute;t&eacute; aussi en col&egrave;re de toute ma vie
(enfin presque). Mais j'ai trouv&eacute; un moyen de r&eacute;cup&eacute;rer la partition, soit ...

<sect1>Le programme <bf>Partition Magique</bf>
<p>
R&eacute;cuperer le programme<bf> magique partition</bf> (partition magic program) sur
internet. Le d&eacute;marrer et vous aurez une jolie interface utilisateur
ressemblant &agrave; win95.
C'est tr&egrave;s facile &agrave; utiliser et si vous utilisez windoze95, vous n'aurez pas
de probl&egrave;me. Cliquez sur le bouton OK, une repr&eacute;sentation graphique de votre
disque appara&icirc;tra sur votre &eacute;cran. Les diff&eacute;rentes partitions et systemes de
fichiers sont represent&eacute;s par des couleurs diff&eacute;rentes. J'ai une partition
primaire DOS, et vous aussi, je suppose. Ma partition Linux se trouve sur un
de mes disques logiques. O&ugrave; l&agrave;  il &eacute;tait avant, maintenant il y a seulement
une barre grise d'espace libre. A gauche ou &agrave; 
droite de cette barre vous devez
avoir un petit disque logique qui est votre partition Linux Swap. Maintenant
cliquez avec le bouton droit sur l'espace libre et s&eacute;lectionner
cr&eacute;er ou choisissez &agrave; partir du menu. Vous devriez &ecirc;tre  capable de
comprendre comment &ccedil;a marche. Comme dit pr&eacute;cedemment, c'est  tr&egrave;s facile
d'utiliser l'interface. Quand la bo&icirc;te de  dialogue <bf>creation</bf>
apparait, vous pouvez choisir entre <bf> FAT HPFS</bf> et <bf> Unformatted </bf>,
s&eacute;lectionner <bf/unformatted/. Si vous choisissez FAT ou HPFS, un syst&egrave;me de fichiers FAT ou HPFS sera cree
sur la partition et votre syst&egrave;me de fichiers Linux sera d&egrave;truit, aussi
soyez certain de faire le bon choix.
Ensuite s&eacute;lectionnez OK et votre partition sera cr&eacute;&eacute;e. Mais votre
partition est marqu&eacute;e comme une partition DOS FAT16 (dans la table de
partition, chaque partition a une marque (un nombre h&eacute;xadecimal) qui montre
&agrave; quel OS la partition appartient). Que faites-vous maintenant ? Continuez sur
la section suivante.


<sect1>Changer la partition en partition Linux native
<p>
<bf/Vous avez besoin/ maintenant des deux disquettes boot et root, aussi j'esp&egrave;re
que vous les avez. Il est aussi possible d'utiliser loadlin. Soyez
simplement s&ucirc;r de pouvoir d&eacute;marrer Linux et de lancer fdisk &agrave; partir de lui.
Premiere chose &agrave; faire est de login(ouvrir un session), d&eacute;marrer fdisk en tapant fdisk au
prompt du shell. Si vous avez plus d'une partition, v&eacute;rifiez que fdisk
choisit bien la bonne. Tapez "p" (simplement la lettre p) et ENTER. Vous
devriez avoir maintenant l'affichage de la table de partition. Il y a
normalement plus d'un "DOS 16-BIT >=32M". Cherchez celle qui correspond &agrave;
votre partition Linux (regardez la taille... etc) et notez son nombre (exemple
le mien est /dev/hda6, ainsi je dois me rappeler le nombre 6 ). Maintenant
tapez "t" et ENTER pour changer le type de la partition, ou ID comme c'est
nomm&egrave; dans fdisk de Linux (je ne suis pas s&ucirc;ur de celui qui est correct, type
ou ID mais j'utilise le mot type). Maintenant tapez le nombre que vous avez
m&eacute;moris&eacute; et ENTER. Maintenant il vous faut taper le code hexad&eacute;cimal
correspondant &agrave; l'OS auquel appartient votre partition. Quand vous avez fait
tout cela et sans erreur, votre partition devrait &ecirc;tre OK! OUI! C'EST VRAI!
Cela a march&eacute; pour moi, et devrait marcher pour vous aussi! Il ne reste plus
qu'une chose &agrave; faire.  


<sect1>La touche finale

<p>
<bf/Il reste encore quelques d&eacute;tails/. Avant tout red&eacute;marrez Linux
comme vous le faites habituellement (LILO, etc) et regardez si tout marche.
Si cela ne marche pas, soit vous vous &ecirc;tes tromp&eacute;, soit ma m&eacute;thode de
r&eacute;cup&eacute;ration ne marche pas pour vous (mais si cela d&eacute;marre correctement,
f&eacute;licitations! Vous avez fait tout correctement! Maintenant fsck va v&eacute;rifier
votre systh&egrave;me de fichier une fois (il v&eacute;rifiait le mien deux fois, je  ne
sais pas pourquoi). Et tout marchera bien de nouveau! Si ce n'est pas le
cas, ne me blamez pas. Comme je l'ai dit, cela a march&eacute; pour moi, pas
forc&egrave;ment pour vous. Si j'ai sauv&eacute; votre partition, m'envoyez un e-mail
serait tr&egrave;s sympa.



<sect>CONTRIBUTIONS
<p>
<bf/Contributions et remerciements/

<sect1>Auteurs

<p>
<bf/AUTEURS / il n'y en a qu'un et c'est moi : Rolf Klausen. 
<quote>
 <bf/E-mail/ : rolkf@romsdal.vgs.no
 <bf/WWW /: http://www2.romsdal.vgs/no/~rolfk/       
 <bf/courrier/ : Rolf Klausen Neptunvn 
            10 6400 Molde NORWAY
</quote>

<sect1>Remerciements 
<p>
<bf/Mes remerciements vont &agrave; / :
<itemize>
<item>Eivind Stormyr (eivind@ardata.no) pour m'avoir fait conna&icirc;tre Linux,
le meilleur OS jamais cr&eacute;&eacute; et m'avoir appris un  tas de choses sur les
ordinateurs
<item>Bjorn Olav Stormyr (bjorn@ardata.no)pour m'avoir fourni de grands
morceaux de  mon ordinateur. Sans lui je n'aurais pas pu
avoir d'ordinateur personnel
<item>chaque autre membre de la communaute de Linux et chaque personne qui
soutient Linux, &eacute;crit de la documentation et des programmes pour Linux et
tous les auteurs de LDP et virtuellement toute personne ayant quelque chose
&agrave; voir avec Linux.
<item>particuli&egrave;rement Linux B. Thorvalds -c'est le ROI 
<item>et bien s&ucirc;r, Tone B. Skjoelsvik qui est la plus belle fille du monde.
</itemize>


<sect1> Mes remerciements ne vont pas &agrave; ...
<p>
<bf/Je ne remercie pas .../
Bill Gates (htt://Bill.gates@microsoft.com (?)) pour avoir cr&eacute;&eacute; le syst&egrave;me
d'exploitation le plus affreux qui soit sur terre et pour avoir d&eacute;truit ma
partition Linux (Oui, je le bl&acirc;me. S'il n'&eacute;tait pas n&eacute;, alors ma partition
n'aurait pas &eacute;t&eacute; d&eacute;truite, je n'aurai pas eu &agrave; la sauver et je n'aurai jamais
&eacute;crit ce mini HOWTO).


</article>
