<!doctype linuxdoc system>

<!--    R&eacute;sum&eacute; de l'enqu&ecirc;te "Linux sur machine &agrave; bus PCI" - ver 0.5h - Novembre 1995
        -----------------------------------------------------
        (c) Michael Will - Document r&eacute;serv&eacute; aux utilisations non commerciales
        michaelw@student.uni-tuebigen.de
        Adaptation fran&ccedil;aise : Nat Makar&eacute;vitch (LIVIA)
        Mise &agrave; jour traduction fran&ccedil;aise : Olivier Chr&eacute;tien
        Version de l'adaptation : 0.5h_fr1
        La reproduction de la pr&eacute;sente traduction n'implique
        pas l'autorisation de ses traducteurs : Nat (nat@nataa.frmug.fr.net)
        et olivier.chretien@atd.fdn.fr
        -----------------------------------------------------
 -->

<article>

<!-- Title information -->

<title>Linux PCI-HOWTO
<author>par Michael Will, <tt/Michael.Will@student.uni-tuebingen.de/
<date>version 0.5h, 15 Novembre 1995
<abstract>

Linux et les cartes-m&egrave;res PCI
</abstract>

<!-- Table of contents -->
<toc>

<!-- Begin the document -->

<sect>Introduction

<p>
De nombreux utilisateurs de Linux --- y compris votre serviteur ! ---
aimeraient employer Linux sur une machine &agrave; bus PCI.
Ce document propose une &eacute;tude de la compatibilit&eacute; des cartes
PCI (m&egrave;res et d'extension) avec Linux, r&eacute;alis&eacute;e gr&acirc;ce &agrave; une enqu&ecirc;te
men&eacute;e aupr&egrave;s d'utilisateurs.

Si vous disposez d'informations &agrave; ce propos (et dignes d'int&eacute;r&ecirc;t !),
n'h&eacute;sitez &agrave; contacter l'auteur de ce document ou, si l'anglais &eacute;crit
g&eacute;n&egrave;re une terrible angoisse, celui de cette adaptation fran&ccedil;aise
(adresse email&nbsp;: cf. derni&egrave;re page).

Dans ce document le terme <sq>embarqu&eacute;</sq> d&eacute;signe un circuit install&eacute; sur
la carte-m&egrave;re, par opposition &agrave; un composant de carte d'extension.
J'ai traduit <sq>driver</sq> par <sq>pilote</sq>.

<sect> PCI ... pourquoi ?

<p>

<sect1>Aper&ccedil;u g&eacute;n&eacute;ral

<p>
Le bus d'un PC peut mettre en oeuvre une ou plusieurs des normes
dont la liste suit (certaines d'entre elles sont mutuellement exclusives).
<descrip>
<tag/ISA/ Peu on&eacute;reux, lent (le plus souvent 8Mhz), standard, nombre
de cartes d'extension disponibles tr&egrave;s &eacute;lev&eacute;
<tag/EISA/ On&eacute;reux, rapide, relativement peu de cartes sp&eacute;cifiques
(seules capables d'exploiter au mieux ses possibilit&eacute;s)
<tag/MCA/ Con&ccedil;u et cautionn&eacute; par IBM. Rapide mais peu r&eacute;pandu
<tag/VESA-Bus local/ Bas&eacute; sur l'ISA (qu'il &eacute;paule), peu on&eacute;reux,
rapide, relativement peu de cartes sp&eacute;cifiques.
<tag/PCI-Bus local/ On&eacute;reux, rapide, peu de cartes sp&eacute;cifiques mais
ce standard l'emportera probablement, ce qui diminuera le co&ucirc;t
et la raret&eacute; des mat&eacute;riels compatibles.
</descrip>

ISA/VESA-Local-Bus et EISA/VLB :
cette combinaison, sur bus &agrave; fr&eacute;quences d'horloges &eacute;lev&eacute;es, pose divers
probl&egrave;mes et s'av&egrave;re assez peu fiable mais son faible co&ucirc;t et ses tr&egrave;s
honorables performances lui assur&egrave;rent un bon succ&egrave;s commercial.
La plupart des cartes r&eacute;centes paraissent fiables.

EISA : fiable et ouvert (standard n'appartenant pas &agrave; un constructeur) mais
assez cher, surtout pr&eacute;vu pour les machines des
utilisateurs avertis et les serveurs de r&eacute;seaux. Peu de cartes disponibles.

PCI : ouvert, au moins aussi rapide que l'EISA et c&acirc;bl&eacute; sur 64 bits
(consid&eacute;ration capitale pour les machines Pentium), gagne du terrain.

PCI n'est pas, comme le fut la combinaison (E)ISA/Local-Bus, d&eacute;pendant du
processeur employ&eacute;. Un composant PCI est commun &agrave; toutes les lignes de
processeurs (DEC Alpha, Intel et compatibles, Power ...) et son installation
sur une carte m&egrave;re PCI n'implique aucun circuit d'interfa&ccedil;age : seul le BIOS
varie, ce qui garantit des co&ucirc;ts de production moins &eacute;lev&eacute;s que ceux de
l'(E)ISA/Local Bus).

<sect1>Performances
<p>
Extrait (adapt&eacute;) du document de <sq>propagande pro-PCI</sq> de Craig Sutphin :
<quote>
Contrairement &agrave; certains autres bus locaux, le PCI est con&ccedil;u pour servir
toutes les cartes d'extension : vid&eacute;o, mais aussi r&eacute;seau, interfaces disques
(<sq>contr&ocirc;leurs</sq>) ...
A 33 MHz le bus PCI transf&egrave;re (sur 32 bits) jusqu'&agrave; 132 Moctets par seconde.
Une extension (passage &agrave; 64 bits) des logiques d'adressage et de transfert
des donn&eacute;es peut doubler ce d&eacute;bit sans remettre en cause l'existant.
Le PCI reste ind&eacute;pendant du processeur et administre au mieux les transferts
en permettant au bus local de v&eacute;hiculer les donn&eacute;es sans employer le
bus principal (processeur/m&eacute;moire).
Cela constitue, pour les utilisateurs de PC rapides, une importante
augmentation de la fiabilit&eacute;, de la performance et de la facilit&eacute;
d'exploitation (caract&eacute;ristiques non triviales avec des bus travaillant
&agrave; 33MHz).
Divers modes &eacute;volu&eacute;s d'exploitation du bus am&eacute;liorent les performances des
cartes d'extension sans grever le syst&egrave;me central.
L'interfa&ccedil;age des composants PCI ne n&eacute;cessite aucune circuiterie sp&eacute;cifique.
</quote>

On se reportera au chapitre sur les Benchmarks pour obtenir des r&eacute;sultats de
tests, bruts (et parfois incoh&eacute;rents) sur les cartes ASUS PCI pour 486 et 586.

<sect1>Le circuit <sq>contr&ocirc;leur</sq> SCSI-2 embarqu&eacute; (int&eacute;gr&eacute; sur carte-m&egrave;re) NCR53c810

<p>
Le circuit embarqu&eacute; NCR de gestion de la cha&icirc;ne SCSI-II constitue l'une des
plus all&eacute;chantes caract&eacute;ristiques de certaines cartes-m&egrave;res PCI.
Il est th&eacute;oriquement au moins aussi rapide que celui des cartes
Adaptec 174x (EISA) mais reste beaucoup moins on&eacute;reux.
Des pilotes (drivers) pour DOS et OS/2 sont disponibles.
Drew Eckard a publi&eacute; la version 3 de son pilote pour circuit NCR53c810.
J'utilise actuellement le noyau 1.1.78 (9 janvier 1994).
Cela fonctionne si bien que j'ai revendu mon adaptec-1542B-ISA. :-)
<footnote>NCR est une marque de semiconducteurs :-) NdT</footnote>

Certaines cartes m&egrave;res PCI int&egrave;grent le circuit NCR53c810.
On peut aussi l'acheter sur carte d'extension pour &agrave; peu pr&egrave;s 70 dollars.

Les patchs pour NCR et fichiers images de disques de boot sont
disponibles sur tsx-11.mit.edu, probablement dans /pub/linux/ALPHA/scsi/ncr.
Ils doivent aussi se trouver sur les sites-miroirs.

Les plus r&eacute;centes distributions Slackware (post&eacute;rieures &agrave; 2.0)
doivent aussi pouvoir g&eacute;rer ce circuit.
Les plus r&eacute;centes versions non stabilis&eacute;es du noyau (1.1.41, par exemple)
ne n&eacute;cessitent plus aucun patch. Depuis la version 1.2 le pilote NCR est
dans le noyau standard.

J'ai remarqu&eacute; une seule chose qui ne fonctionne pas encore dans le pilote
NCR actuel. La D&eacute;connection/Reconnection n'est pas g&eacute;r&eacute;e, ce qui rends 
p&eacute;nible l'utilisation d'un streamer SCSI. En effet une commande comme "mt erase"
bloque tout le bus SCSI jusqu'&agrave; sa fin. Cela est bien emb&ecirc;tant.

Drew y travaille, voir plus bas.

Le syst&egrave;me FreeBSD g&egrave;re le NCR53c810 depuis un bon moment d&eacute;j&agrave;, y compris
les "Tagged Command Queues", le "FAST" et le "WIDE" SCSI ansi que la
d&eacute;connection pour les 53c810, 815 et 825. Drew dit qu'il serait possible
d'adapter le pilote FreeBSD pour Linux. Y a-t-il des volontaires ?

J'ai l'impression que l'&eacute;volution s&eacute;par&eacute;e de FreeBSD et Linux oblige &agrave;
r&eacute;inventer la roue un peu trop souvent. Un peu plus de coop&eacute;ration ne nuirait
pas &agrave; aucun des deux syst&egrave;mes...

Apr&egrave;s une trop longue attente, j'ai abandonn&eacute; la carte NCR pour une des cartes,
performantes mais ch&egrave;res, contr&ocirc;leur SCSI PCI de marque DPT qui sont mentionn&eacute;es
dans cet article. Evidemment, juste apr&egrave;s j'ai appris que Drew fournissait en
test une nouvelle version de son pilote. :-)

<sect1> Drew Eckhardt &agrave; propos de PCI-SCSI&nbsp;:

<p>

Drew a d&eacute;clar&eacute; &agrave; la fin de Mars &agrave; propos de contr&ocirc;leurs SCSI sur bus PCI&nbsp;:
(l&eacute;g&egrave;rement modifi&eacute; pour clarification dans le contexte)

Les cartes Adaptec 2940, Buslogic BT946, BT946W, DPT PCI, Future Domain 3260,
NCR53c810, NCR53c815, NCR53c820, et NCR53c825 fonctionnent toutes plus ou moins.

<itemize> 
<item> L'Adaptec 2940 souffre du m&ecirc;me probl&egrave;me de sensibilit&eacute; de cablage
        que toutes les cartes r&eacute;centes mais, &agrave; par &ccedil;a, fonctionne bien.
<item>  Les cartes Futur Domain n'exploitent pas le busmaster et le pilote
        ne g&egrave;re pas les commandes multiples simultan&eacute;es. Si vous n'avez pas 
        besoin de commandes simultan&eacute;e choisissez la carte NCR qui est moins
        ch&egrave;re et exploite le busmaster. Si la gestion des commandes simultan&eacute;es
        vous est indispensable, prenez une Buslogic.
<item>  The Buslogic BT956W will do WIDE SCSI with the Linux drivers (although
        you can't use targets 8-15), the Adaptec 2940W (with one line patch
        to the 2940 driver) won't, nor will the NCR53c820 and NCR53c825.
<item>  La Buslogic BT956W fait du WIDE SCSI avec le pilote Linux (bien que
        l'on ne puisse pas utiliser les cibles 8 &agrave; 15). L'Adaptec 2940W (avec
        le pilote 2940 patch&eacute; d'une ligne) la NCR53c820 et la NCR53c825 n'en
        font pas.
<item>  Les cartes NCR sont vraiement peu ch&egrave;res (70 US &dollar), sont 
        g&eacute;n&eacute;ralement rapides mais le pilote ne g&egrave;re pas actuellement les
        commandes simultan&eacute;es. Une version Alpha du pilote qui g&egrave;re la
        deconnection/reconnection et le transfert synchrone est maintenant
        disponible publiquement. (voire plus bas)
<item>  Les cartes SCSI Emulux, Forex, et celles non mentionn&eacute;es ne fonctionnent
        pas.
</itemize>

<sect1> Nouvelle version Alpha du pilote NCR

<p>

Des versions Alpha du pilote NCR font des choses sympas commme la connection/reconnection
et les transferts synchrones. Elles sont maintenant disponibles publiquement.
Toute personne interess&eacute;e voulant jouer avec devrait
<itemize>
<item> S'abonner &agrave; la liste de diffusion NCR en envoyant un courrier &eacute;lectronique
       &agrave; majordomo@colorado.edu avec "subscribe ncr53c810" dans le texte.
<item> T&eacute;l&eacute;charger tous les readmes et les derniers fichiers de diffs &agrave;
       l'adresse ftp://tsx-11.mit.edu/pub/ALPHA/linux/SCSI/ncr53c810
</itemize>

<sect1> Le pilote EATA-DMA et les contr&ocirc;leurs PCI SCSI de DPT

<p>

Le pilote scsi EATA-DMA a subi de gros changements et prend en charge maintenant
aussi les contr&ocirc;leurs PCI SCSI, les contr&ocirc;leurs multiples et tous les canaux SCSI
sur les cartes SmartCache/Raid multicanaux.

Le pilote prend en charge tous les contr&ocirc;leurs SCSI au protocole EATA-DMA (document
CAM/89-004 rev. 2.0c) et a &eacute;t&eacute; test&eacute; avec beaucoup de ces contr&ocirc;leurs dans
des configurations diverses.

<verb>
Il s'agit des&nbsp;:    (ISA)   (EISA) (PCI)
      DPT Smartcache: PM2011  PM2012A 
                              PM2012B 
      Smartcache III: PM2021  PM2022  PM2024 
                              PM2122  PM2124
                              PM2322 
      SmartRAID     : PM3021  PM3122  PM3224 
                              PM3222
      et d'autres contr&ocirc;leurs NEC ou ATT.
</verb>

Sur une carte DPT de base (sans cache ni module RAID), un MC680x0 g&egrave;re
le (ou les) circuits DMA busmaster ansi que le circuit contr&ocirc;leur SCSI.
La carte SCSI DPT se comporte presque comme un coprocesseur SCSI.

La carte DPT peut aussi &eacute;muler un contr&ocirc;leur IDE (interface ST506), ce qui
vous permet de l'utiliser avec tous les syst&egrave;mes d'exploitation m&ecirc;me s'ils
n'ont pas de pilote EATA.

Sur une carte avec cache, c'est le 680x0 qui assure la gestion  de ce cache.
La carte DPT admet jusqu'&agrave; 64 Mo de RAM en tant que cache disque.

Sur une carte avec module RAID, c'est aussi le 680x0 qui g&egrave;re le RAID,
assurant le "mirroring" en RAID-1, le "striping" et la g&eacute;n&eacute;ration des codes
ECC en RAID-5, etc.

Les cartes d'entr&eacute;e de gamme utilisent un Motorola 68000 tandis que les hauts
de gamme, plus tourn&eacute;es vers le RAID, utilisent un processeur 68020, 68030 
ou 68040/40MHz.

Les prix officiels vont de 245 &dollar &agrave; 1995 &dollar (1er d&eacute;cembre 1994).

Comme on m'a demand&eacute; de nombreuses fois o&ugrave; acheter ces cartes en Europe,
j'ai demand&eacute; &agrave; DPT de m'envoyer la liste de leurs distributeurs europ&eacute;ens
officiels. En voici un court extrait&nbsp:

<verb> 
Autriche : Macrotron GmbH             Tel:+43 1 408 15430   Fax:+43 1 408 1545 
Danemark : Tallgrass Technologies A/S Tel:+45 86 14 7000    Fax:+45 86 14 7333
Finlande : Computer 2000 Finnland OY  Tel:+35 80 887 331    Fax:+35 80 887 333 43
France   : Chip Technologies          Tel:+33 1 49 60 1011  Fax:+33 1 49 599350
Allemagne: Akro Datensysteme GmbH     Tel:+49 (0)89 3178701 Fax:+49 (0)89 31787299
Russie   : Soft-tronik                Tel:+7 812 315 92 76  Fax:+7 812 311 01 08
GB   .   : Ambar Systems Ltd.         Tel:+44 296 435 511   Fax:+44 296 479 461 
</verb>

 "A mon avis, les cartes DPT sont les cartes SCSI les mieux con&ccedil;ues disponibles
 pour PC. Et j'ai &eacute;cris du code pour presque tous les types de cartes SCSI
 pour PC. (Bien que r&eacute;troactivement, je me demande bien pourquoi !) ;-)"
           Jon R. Taylor (jtaylor@magicnet.net) President, Visionix, Inc.

La derni&egrave;re version du pilote EATA-DMA et une image de disquette de boot
Slackware sont disponibles &agrave; l'adresse&nbsp;:
  ftp.uni-mainz.de:/pub/Linux/Drivers/SCSI/EATA

Le pilote est inclus dans le noyau standard depuis la version 1.1.81.

L'auteur peut &ecirc;tre joint aux adresses suivantes&nbsp;:
  neuffer@goofy.zdv.uni-mainz.de or linux@uni-koblenz.de 

<sect1> Future Domain TMC-3260 PCI SCSI

<p>

Rik Faith (faith@cs.unc.edu) m'a indiqu&eacute; le 1er F&eacute;vrier 1995 que la carte
Future Domain TMC-3260 PCI SCSI &eacute;tait prise en charge par le pilote Future
Domain 16x0 SCSI driver.  Le SCSI-HOWTO peut contenir des informations plus
r&eacute;centes.

<itemize>
<item> La d&eacute;tection n'est pas bien faite car elle n'utilise pas la m&eacute;thode
       standard du BIOS PCI (J'ai besoin que quelqu'un qui poss&egrave;de cette carte
       m'envoie les patches qui corrigent ce probl&egrave;me). Vous aurez peut-&ecirc;tre
       &agrave; bidouiller la routine de d&eacute;tection  dans le noyau pour que votre
       carte soit reconnue.
<item> Le pilote ne g&egrave;re pas encore les commandes multiples en attente ce qui
       fait que votre syst&egrave;me sera bloqu&eacute; pendant le rembobinage de votre
       streamer.
<item> Le pilote ne g&egrave;re pas le mode de transfert am&eacute;lior&eacute; pseudo-32bit 
       apport&eacute; par les composants r&eacute;cents Future Domain. Vous n'aurez donc pas
       de taux de transfert aussi &eacute;lev&eacute;s que sous DOS.
<item> Comme le pilote g&egrave;re seulement le protocole SCSI-I, vos disques rapides
       ne fourniront pas leur d&eacute;bit maximum possible. (La aussi, les bonnes
       volont&eacute;s sont les bienvenues -- personne ne travaille dessus 
       actuellement.)
</itemize>


<sect1> R&eacute;flexions diverses sur le SCSI

<p>



James Soutter (J.K.Soutter1@lut.ac.uk) m'a demand&eacute; de pr&eacute;ciser les points
suivants :

<quote>
Le SCSI-2 <sq>Fast Wide</sq> est parfois, &agrave; tort, d&eacute;sign&eacute; par <sq>SCSI-3</sq>.
Il diff&egrave;re du SCSI-2 standard dans la mesure o&ugrave; il met en oeuvre un
bus de donn&eacute;es SCSI sur 16 bits (et non 8).
Cela porte le taux de transfert maximum &agrave; 20Moctets/seconde (au lieu de 10)
mais n&eacute;cessite l'emploi de disques adapt&eacute;s (Fast Wide).
<p>
Ce th&eacute;orique gain en performances n'acc&eacute;l&egrave;rera peut-&ecirc;tre pas certains
syst&egrave;mes car les taux de transfert <sq>internes</sq> (des plateaux au
m&eacute;tacontr&ocirc;leur)
de la plupart des disques restent inf&eacute;rieurs &agrave; 10Moctets/seconde. Un seul
disque de ce type ne peut donc se trouver limit&eacute; par la bande passante
offerte par une carte SCSI-2 standard.
<p>
Dans le catalogue Seagate d'octobre 1993, seul un disque Fast Wide SCSI-2
a un taux de tranfert interne sup&eacute;rieur &agrave; 10 Mo/s ( le ST12450W).
La pluspart des disques ont un taux de transfert interne de 6 Mo/s au plus,
bien que le ST12450W ne soit pas la seule exception &agrave; cette r&egrave;gle.
En conclusion, la norme Fast Wide SCSI est con&ccedil;ue pour le march&eacute; des serveurs
et n'apporte pas forc&eacute;ment d'avantages &agrave; une station de travail.
<p>
Plut&ocirc;t que d'acheter une carte m&egrave;re &agrave; interface SCSI int&eacute;gr&eacute;e ou bien d'attendre
le pilote NCR, vous pourriez acheter une carte contr&ocirc;leur SCSI s&eacute;par&eacute;e.
D'apr&egrave;s Drew, la seule option PCI SCSI qui a une chance de marcher est la 
Buslogic 946. Elle est cens&eacute;e &ecirc;tre compatible &agrave; l'Adaptec 1540 comme les 
cartes EISA/VESA/ISA de la s&eacute;rie.
<p>
Drew a indiqu&eacute; que les autres cartes PCI SCSI ont peu de chances d'&ecirc;tre
prises en charge par Linux ou les syst&egrave;mes BSD car les contr&ocirc;leurs &agrave; base de 
circuit NCR sont moins chers et plus courants.
</quote>

Selon broom@ocean.fit.qut.edu.au (Bradley Broom) :
<quote>
La Buslogic BT-946C PCI SCSI fonctionne si l'on d&eacute;braye, gr&acirc;ce au
programme MS/DOS <tt>AUTOSCSI</tt> livr&eacute; par son constructeur, l'option
<sq>enable Disconnection</sq>.
</quote>


Ernst Kloecker (ernst@cs.tu-berlin.de) &eacute;crit (citation adapt&eacute;e) :
<quote>
Talus Corporation dispose d'un pilote NS/FIP pour cartes PCI
&agrave; circuit SCSI <sq>NCR</sq>. Il sera diffus&eacute; sous peu, peut-&ecirc;tre m&ecirc;me &agrave; titre
gracieux.
</quote>

Toutes les cartes m&egrave;res PCI ne disposent pas du circuit. Les cartes ASUS
anciennes l'ont ainsi qu'une des cartes J-Bond.( La pluspart des cartes
m&egrave;res actuelles (06/95) consid&egrave;rent que c'est &agrave; vous d'acheter le NCR53c810
s&eacute;par&eacute;ment.) Certaines marques fournissent une alternative comme vous pouvez
le lire dans le texte de Drew...

Le circuit NCR est assez &eacute;volu&eacute; pour prendre en charge des disques format&eacute;s
par d'autres circuits.
<footnote>
Ce qui semble assez naturel si aucun des circuits impliqu&eacute;s n'effectue de
translation ! NdT.</footnote>

<sect> Carte-m&egrave;re de marque ASUS

<sect1> ASUS et NMI (Parit&eacute;) -- impact sur la  Gravis-Ultrasound
<p>
        Les derni&egrave;res cartes m&egrave;res PCI ne g&egrave;rent plus les barettes SIMMS
&agrave; parit&eacute;. Comme j'achetais habituellement des barettes SIMMS sans parit&eacute;
&agrave; cause de leur co&ucirc;t, je ne pensais pas que ce soit un probl&egrave;me avant de
rajouter une carte Gravis-Ultrasound dans ma machine. Sous DOS le pilote
SBOS et l'utilitaire de test se plaignent de la sorte "nmi procedure
disabled on this pc". La documentation conseille de changer de carte m&egrave;re
dans ce cas, ce qui n'aide pas beaucoup.

La Gravis-Ultrasound fonctionne bien dans les cartes ASUS-SP3 et ASUS-SP4,
malgr&eacute; cela, mais ma Gravis-Ultrasound-Max g&eacute;n&egrave;re avec gmod un "kernel panic"
sur les deux cartes. De plus, de temps en temps, le fait de jouer des fichiers
.au sur /dev/audio provoque des choses bizarres, comme jouer le reste d'un
son pr&eacute;c&eacute;dent apr&egrave;s le nouveau. Le gestionaire de son recommende un buffer de
65536 octets avec la GUS Max contrairement au petit buffer de la GUS - 
je ne sais pas pourquoi.
Les deux cartes poss&egrave;dent chacunes 1Mo de DRAM. Ces probl&egrave;mes ne sont peut-&ecirc;tre
pas li&eacute;s au probl&egrave;me NMI mais pl&ucirc;tot au gestionaire de son&nbsp?

J'ai entendu dire que ce n'est pas seulement ASUS mais la pluspart des cartes
r&eacute;centes qui ne g&egrave;rent pas la parit&eacute; et le NMI.

De plus en plus bizarre, la carte ASUS-TP4 &agrave; chipset Triton fonctionne bien
avec la GUS Max - il charge bien le pilote SBOS. Je dois admettre que je ne
comprends pas tout.
 
<sect1> Diff&eacute;rents types de cartes m&egrave;res ASUS
<p> 

<sect2> ASUS SP3 &agrave; chipset Saturn I (rev. 2) pour 486
<p>
<itemize>
<item>  2 x rs232 with 16550
<item>  NCR53c810 onboard, 
<item>  chipset Saturn I (rev. 2) l&eacute;g&egrave;rement bugg&eacute;.
</itemize>

<sect2> ASUS SP3G &agrave; chipset Saturn II (rev. 4) pour 486
<p>
        comme la SP3, mais le chipset Saturn est moins bugg&eacute;.

<sect2> ASUS SP3 &agrave; chipset SiS pour 486
<p>
        comme la AP4 mais plus r&eacute;cente, chipset SiS, fonctions
        d'&eacute;conomie d'&eacute;nergie, EIDE, rs232 avec 2 16550 et 
        port centronics.
        Seulement 2 connecteurs pour barettes SIMM, a l'air de
        fonctionner avec l'AMD486DX4/120 mais pas tr&egrave;s fiable avec
        le NCR53c810 et sous diff&eacute;rents syst&egrave;mes d'exploitation
        (Windows-NT, Windows 95, OS2). Apr&egrave;s mise &agrave; jour vers une
        carte Pentium ASUS SP4, tous les probl&egrave;mes ont disparus ce qui
        confirme que cela venait de la carte. A l'air de bien fonctionner
        quand m&ecirc;me sous Linux.
        
        
<sect2> ASUS AP4, pour 486, &agrave; bus PCI/ISA/VesaLocalbus
<p>
        fonctions d'&eacute;conomie d'&eacute;nergie, 1 slot VLB, 3 slots ISA,
        4 slots PCI, seul le contr&ocirc;leur EIDE est int&eacute;gr&eacute;, il n'y a
        ni contr&ocirc;leur de disquettes, ni rs232/centronics.
        Tr&egrave;s petite taille.

        Prend l'AMD486DX2/66 pour un DX4/100. On peut corriger &ccedil;a en
        soudant une broche (laquelle ?) &agrave; la masse, mais de toute fa&ccedil;on
        je ne recommenderais pas cette carte.

        Celle que j'ai test&eacute; ne fonctionnait ni sous OS2 ni sous Linux
        bien que certaines personnes l'utilisent avec ses deux syst&egrave;mes.

        Le slot VLB est cens&eacute; &ecirc;tre plus lent qu'un slot VLB normal &agrave;
        cause du pont PCI vers VLB, mais sans nuire &agrave; la rapidit&eacute; du
        cot&eacute; PCI.

<sect2> ASUS SP4-SiS, pour Pentium90, PCI/ISA
<p>
        Identique &agrave; la SP3-SiS, mais pour Pentium90/100.

<sect2> ASUS TP4XE &agrave; chipset Triton et prise en charge de la SRAM ou EDORAM
<p>
        Peut utiliser la nouvelle ram EDO et la future SRAM. La m&eacute;moire
        SRAM devrait augmenter les performances de fa&ccedil;on consid&eacute;rable.
        Cette carte n'a pas accept&eacute; les barrettes PS2-SIMMS de 8Mo qui
        marchaient sans probl&egrave;me sur une ASUS SP4. Apr&egrave;s &eacute;change contre
        d'autres barettes plus volumineuses (16 puces au lieu de 8 si
        je me souviens bien) cela s'est mis &agrave; fonctionner.
        Test&eacute;e avec un P90 et un P100.
        

<sect1> Tests de rapidit&eacute; sur des cartes m&egrave;res ASUS
<p>
J'ai essay&eacute; de comparer la vitesse CPU sur deux cartes ASUS&nbsp;: pour le
486 j'ai test&eacute; la SP3 SiS (celle qui a un slot VLB) et pour le 586, la
TP4/XE. Les deux cartes avait 16 Mo de RAM, le syst&egrave;me &eacute;tait inutilis&eacute;.
Les tests whestone et dhrystone ont &eacute;t&eacute; employ&eacute;s en changeant le CPU.

Je dois reconnaitre que je n'ai pas encore lu la faq sur les benchmarks et
que je serais donc amen&eacute; &agrave; beaucoup modifier cette partie bient&ocirc;t. Si vous
avez des commentaires, n'h&eacute;sitez pas &agrave; me les envoyer par courrier &eacute;lectronique.

Je suis sp&eacute;cialement &eacute;tonn&eacute; par le fait que l'AMD486DX4/100 est plus rapide
au test dhrystones que le DX4/120 ! Je ne retrouve pas cette incoh&eacute;rence en
comparant les P90 et P100.

Le probl&egrave;me vient peut-&ecirc;tre du fait que lorsque j'ai branch&eacute; l'amdDX4-100, la
carte &eacute;tait configur&eacute;e pour un DX2-66. Bien que le BIOS voyait bien qu'il 
s'agissait d'un DX4-100, la carte a peut-&ecirc;tre utilis&eacute; les mauvaises fr&eacute;quences
d'horloge... mais puisque le DX2-66 fonctionne &agrave; 33Mhz * 2 et le DX4 &agrave; 33Mhz * 
3, cela aurait du &ecirc;tre correct ?

La carte avec le DX4-120 est configur&eacute;e en 40Mhz * 3 = 120 Mhz.

Je me demande aussi si le test whetstone fournit des chiffres aussi &eacute;gaux
sur d'autres machines ? 

<sect2> ASUS SP3 avec l'amd486DX4-100
<p>
<itemize>
<item> Temps pour 500000 passes Dhrystone = 7 soit 63559 dhrystones/second
<item> Temps pour 1000 passes Whetstone = 5 soit 200.000 Whetstones/second
</itemize>

<sect2> ASUS SP3 avec l'amd486DX4-120
<p>
<itemize>
<item> Temps pour 500000 passes Dhrystone = 8 soit 58074 dhrystones/second
<item> Temps pour 1000 passes Whetstone = 4 soit 250.000 Whetstones/second
</itemize>

<sect2> ASUS SP3 avec l'intel486DX2-66
<p>
<itemize>
<item> Temps pour 500000 passes Dhrystone = 9 soit 50761 dhrystones/second
<item> Temps pour 1000 passes Whetstone = 7 soit 142.8571 Whetstones/second
</itemize>

<sect2> ASUS TP4/XE avec l'intel586-90
<p>
<itemize>
<item> Temps pour 500000 passes Dhrystone = 4 soit 101010 dhrystones/second
<item> Temps pour 1000 passes Whetstone = 3 soit 333.3333 Whetstones/second
</itemize>

<sect2> ASUS TP4/XE avec l'intel586-100
<p>
<itemize>
<item> Temps pour 500000 passes Dhrystone = 4 soit 102040 dhrystones/second
<item> Temps pour 1000 passes Whetstone = 2  soit 500.0000 Whetstones/second
</itemize>

<sect1> Carte-m&egrave;re ASUS PCI-I-SP3 : heinrich@zsv.gmd.de fournit des informations
d&eacute;taill&eacute;es :
<p>

<itemize>
<item> Slots : 3 PCI, 4 ISA (3x16 bits, 1x8 bits)
<item> 4 bancs de SIMM 72 broches (max. 128Mo)
<item> Processeur mont&eacute; sur support ZIF
<item> place pour 4 SIMM 72 broches (max. 128Mo)
<item> BIOS AWARD en EPROM-flash
<item> Embarqu&eacute;s : SCSI <sq>NCR</sq>, 1 //, 2 s&eacute;ries (avec FIFO), AT-Bus, contr&ocirc;leur de disquettes
</itemize>

Comme la plupart des cartes de cette cat&eacute;gorie elle n'offre qu'un cache
m&eacute;moire en lecture (perte de performances estim&eacute;e par rapport aux cartes
avec cache en &eacute;criture : environ 3% (?)).

Le BIOS prend en charge les disques SCSI sous DOS/Windows sans pilote
additionnel (ASPI livr&eacute;)
Autres pilotes fournis : OS2, Windows-NT, SCO-Unix, Netware
(3.11 et 4, d'apr&egrave;s ce que j'ai compris).

Gert Doering (gert@greenie.muc.de) affirme que le pilote fourni pour SCO
ne fonctionne pas correctement.
Plusieurs commandes <sq>time dd if=/dev/rhd20 of=/dev/null bs=100k
count=500</sq> m&egrave;nent &agrave; un <sq>kernel panic</sq>.

Il semble pr&eacute;f&eacute;rable, lorsque l'on emploie le circuit embarqu&eacute; d'origine
Adaptec, de ne pas employer l'option de <sq>sync negotiation</sq> (configuration
accessible gr&acirc;ce au setup en BIOS de la carte Adaptec).
<footnote>Attention : de graves accidents d'exploitation (<sq>kernel
panic</sq>)
surviennent parfois lors du red&eacute;marrage du syst&egrave;me apr&egrave;s un changement de
configuration. Cela ne semble pas pr&ecirc;ter &agrave; cons&eacute;quence (le red&eacute;marrage
suivant se d&eacute;roule correctement) mais ...  Test&eacute; par votre serviteur !
  NdT.</footnote>

Une version plus r&eacute;cente de cette carte-m&egrave;re existe (ASUS-PCI-I/SP3G,
le `G' est important) et ces probl&egrave;mes ont probablement &eacute;t&eacute; corrig&eacute;s.
Elle emploie le nouvel ensemble de circuits Intel (version 4)
<sq>Saturn-ZX</sq>
et supporte donc les options PCI les plus &eacute;volu&eacute;es (level triggered
shareable and BIOS-configurable).
En sus : port souris PS/2 (aux), dispositif d'&eacute;conomie d'&eacute;nergie EPA
et support pour DX-4.

Les derni&egrave;res informations disponibles indiquent que certains
utilisateurs de cette carte (ASUS-SP3-G) constatent qu'elle ne supporte pas
(crashes sous Linux) l'option "PCI-to-Memory-Posting".
Tout fonctionne parfaitement lorsque cette option est d&eacute;bray&eacute;e.
jw@peanuts.informatik.uni-tuebingen.de pense que cela peut relever d'un
probl&egrave;me avec le noyau Linux car certaines parties du syst&egrave;me semblent continuer
de fonctionner lors des crashes, ce qui peut r&eacute;v&eacute;ler un bogue dans le code du
swapper. MS-DOS, OS/2 et Windows ne pr&eacute;sentent pas ce sympt&ocirc;me.

<sect1> Pat Dowler (dowler@pt1B1106.FSH.UVic.CA) nous parle de l'ASUS SP3G
<p>

<itemize>
<item> carte ASUS SP3G (rev.4 == saturn II)
<item> CPU AMD DX4-100 CPU (il faut positionner le cavalier 36 &agrave; 1&amp;2 plut&ocirc;t que 2&amp;3,
        et les autres de la m&ecirc;me fa&ccedil;on que pour les processeurs 486DXn)
<item> m&eacute;moire cache 256K cache (15ns :-)
<item> 16meg RAM (2x8meg)
<item> carte vid&eacute;o ET4000 ISA 
<item> disque dur quantum IDE 
<item> carte ethernet SMC Elitel16 combo 
</itemize>

Contrairement &agrave; d'autres compte-rendus, j'ai trouv&eacute; que le curseur souris
de d&eacute;place de fa&ccedil;on tr&egrave;s souple sous X (comme sur le bon vieux 386) - par
contre il sautille avec certains jeux DOS...

Les performances sont tr&egrave;s bonnes ! J'ai fais tourner des gros tests de calcul
en virgule flottante ( 500x500 doubles - &agrave; peu pr&egrave;s 4megs) et j'ai constat&eacute; 
que les performances en mode 3x33 (100Mhz) &eacute;tait &agrave; peu pr&egrave;s 1.5x sup&eacute;rieures
&agrave; celles en mode 2x (66Mhz)... J'&eacute;tais un peu sceptique &agrave; propos du triplement
de fr&eacute;quence mais il me semble que &ccedil;a tient ses promesses :-)

Le syst&egrave;me hautement configurable de gestion de la consommation "energy star"
ne fonctionne pas avec les processeurs AMD DX4 actuels - il faut un processeur
SL.

J'ai vraiement besoin d'un disque SCSI et d'une carte vid&eacute;o PCI :-)

(J'ai re&ccedil;u le coup de t&eacute;l&eacute;phone d'une personne qui a eu le probl&egrave;me du composant
d&eacute;fectueux SMC FIFO. Ils se plantent apr&egrave;s l'utilisation de X-window.)

<sect> Confusion &agrave; propos des chipsets Saturn

<p>

Pat Duffy (duffy@theory.chem.ubc.ca) nous dit&nbsp;:

<verb>
Saturn I:  Ce sont les versions 1 et 2 des chipsets Saturn.
Saturn II:  Aussi appel&eacute; version 4 du chipset Saturn.
 
Autant que je le sache , la version 3 n'a jamais &eacute;t&eacute;e livr&eacute;e, et (d'apr&egrave;s un 
petit nombre de gens qui la poss&egrave;dent) la SP3G int&egrave;gre maintenant la version 4
(Saturn II). 
 
Vous &ecirc;tes perdus ? He bien, la seule vraie r&eacute;ponse est de disposer de la carte
et d'y lancer le script de d&eacute;boggage du chipset PCI. A ma connaissance,
pourtant, la carte SP3G est livr&eacute;e avec la version 4 (Saturn II).
</verb>


<sect> Cartes vid&eacute;os

<p>
Divers utilisateurs emploient des cartes <sq>Number Nine</sq> (nom abr&eacute;g&eacute; : &num;9)
Level 12 et ELSA Winner 1000 (mod&egrave;le 2000 aussi, vraisemblablement) et
autres bas&eacute;es sur le circuit S3 928. La nouvelle version d'XFree (3.1) prend
en charge les cartes Tseng ET4000/W32 en mode acc&eacute;l&eacute;r&eacute;, les chipsets S3
Vision 864 et 964 y compris sur les cartes telles que l'ELSA Winner 1000Pro
et 2000Pro, Number Nine GXE64 et GXE64Pro, Miro Crystal 20SV). Les modes
vid&eacute;os comptant 16 ou 32 bits par pixel (16 bpp) sont &agrave; pr&eacute;sent disponibles.
Le circuit d'horloge Chrontel8391 est maintenant reconnu par le serveur S3.

Les cartes S3 Trio32 et Trio64 comme la SPEA V7 Mirage P64 PCI et MIRO Crystal
40SV, sont maintenant g&eacute;r&eacute;es. La Mach32 et la Mach64 sont g&eacute;r&eacute;es maintenant en
mode acc&eacute;l&eacute;r&eacute;.

Le pilote SVGA

La gestion du mode 16bpp (65K couleurs au lieu des 256 habituelles) pour les
Mach32 ainsi que le mode 32bpp de certaines cartes S3 et P9000 a &eacute;t&eacute; rajout&eacute;e.


tldraben@eos.ncsu.edu d&eacute;clare :

<itemize>
<item> Diamond Stealth W32 -- le mode texte fonctionne.
<item> ET4000/W32 -- insupportable.
<item> &num 9GXEL13 -- Fonctionne, mais affichage des consoles virtuelles
perdu lors de basculements de sessions. Ai d&ucirc; acheter une carte Dell.
</itemize>
<p>
Par ailleurs :
<itemize>
<item> Genoa Phantom 8900PCI fonctionne.
<item> Genoa Phantom/W32 2Mo ne fonctionne pas avec la carte-m&egrave;re ASUS.
<item> Tseng 3000/W32i semble fonctionner correctement.
<item> Spea-v7 mecury-lite fonctionne parfaitement (sous XFree 2.1 et ult&eacute;rieur).
</itemize>

La Spea V7 Mirage P64 PCI 2M &agrave; base de Trio64 fonctionne bien depuis
XFree86(tm)-3.1.1.

L'ATI Graphics Ultra Pro pour PCI avec 2Mo VRAM et le DAC ATI68875C
fonctionne bien (1280x1024 256 74Hz non-entrelac&eacute;) selon
dem@skyline.dayton.oh.us.

jbauer@badlands.NoDak.edu (John Edward Bauer) indique que la Paradise
WD90C33 PCI bloque la machine lorsque la sauvegarde d'&eacute;cran de X
Window entre en action. Les nouveaux noyaux corrigent ce probl&egrave;me.

miroChrystal 8S/PCI (1Mo) S3 - aucun probl&egrave;me.

Stephen Tweedie indique que sa carte Cirrus Logics 5434 PCI fonctionne bien.
Elle fonctionne en 64 bits avec 2M et marche parfaitement avec le pilote
SVGA en 8, 16 et 32 bits par pixel.

<sect> Cartes Ethernet
<p>
Les cartes ISA fonctionnent, bien entendu, mais d'aucuns aimeraient utiliser
les versions PCI. L'auteur de la plupart (sinon tous) des programmes
pilotes pour cartes Ethernet (Donald Becker (becker@cesdis.gsfc.nasa.gov))
d&eacute;clare :
<quote>
<p>
Le code LANCE a &eacute;t&eacute; &eacute;tendu pour g&eacute;rer la version PCI.
J'esp&egrave;re fournir le code de d&eacute;tection PCI (&agrave; peu pr&egrave;s une douzaine de lignes
suppl&eacute;mentaires dans le pilote LANCE) dans la prochaine version du noyau.
Je suis en train de travailler sur le mode 32 bit.
Je n'ai pas encore commenc&eacute; le code 21040.
<p>
Je vais &eacute;crire des versions adapt&eacute;es au mode PCnet32 et &agrave; la carte DEC 21040. 
Cela couvrira la majorit&eacute; du march&eacute; des cartes Ethernet PCI.
<p>
Voir l'URL :
file://cesdis.gsfc.nasa.gov/pub/people/becker/whoiam.html
</quote>

Les noyaux 1.1.50 et ult&eacute;rieurs g&egrave;rent les cartes bas&eacute;es sur le circuit AMD.
Une carte-m&egrave;re Pentium permet alors d'obtenir environ 900Ko/seconde sous ftp
avec environ 20% de charge CPU (circuit AMD Lance).

Tous les mat&eacute;riels Ethernet bas&eacute;s sur le chip AMD PCnet/PCI doivent
fonctionner. Les cartes Boca co&ucirc;tent, aux US, moins de 70&dollar;.

Geoffry Coram a indiqu&eacute; dans les news qu'il a r&eacute;ussi &agrave; faire fonctionner sa
carte 3com 590 TPO. Il a du t&eacute;l&eacute;charger le pilote alpha &agrave; l'adresse&nbsp;:
http://cesdis.gsfc.nasa.gov/linux/drivers. On peut y trouver aussi d'autres 
pilotes.
Voir aussi http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html

Donald Holmgren dit qu'il a r&eacute;ussi &agrave; connecter sa carte DEC DE435 (PCI) au
r&eacute;seau local sur coax fin (BNC). Le pilote DE435 v&eacute;rifie d'abord la prise pour 
paire torsad&eacute;e, puis commute vers le port alternatif (s&eacute;lectionable par 
cavalier en AUI ou BNC) si le port 10BaseT ne fonctionne pas.

Jim Cusick utilise la carte Boca 1PI sur coax fin.
Elle fonctionne tr&egrave;s bien. On ira voir &agrave; l'URL&nbsp:
http://cesdis.gsfc.nasa.gov/linux/misc/boca-failure.html
pour des d&eacute;tails sur les disfonctionements du d&eacute;but avec cette carte. Ma 
deuxi&egrave;me carte, apr&egrave;s retour pour &eacute;change de la premi&egrave;re, &eacute;tait &eacute;tiquet&eacute;e
"PN 4186". La pr&eacute;c&eacute;dente qui ne marchait pas &eacute;tait une "PN4185". Pr&eacute;cisez
&agrave; la commande que vous voulez le mod&egrave;le le plus r&eacute;cent. A 70 &dollar, cette
carte est une bonne affaire.

Dave Platt recommande d'&eacute;viter &agrave; tout prix la carte Boca BEN1PI. Elle ne serait
pas fiable &agrave; cause de d&eacute;fauts de conception et Boca ne semble pas en mesure de
corriger le probl&egrave;me. La carte 3Com 3c590 PCI "Vortex" est disponible en version
combo (10BaseT, thin coax at AUI). Le pilote Linux de cette carte ne fait pas
encore partie du noyau standard, mais est disponible &agrave; l'URL
http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html et peut &ecirc;tre patch&eacute; dans
les derniers noyaux 1.2.x (ainsi que les 1.3.x) sans beaucoup de difficult&eacute;.
Le pilote Linux ne peut pas utiliser la possibilit&eacute; d'autod&eacute;tection d'interface
de cette carte - le programme DOS fourni permet de configurer la carte afin 
qu'elle utilise l'interface choisie ( coax fin dans notre cas). Une fois cela
fait, le pilote Linux utilise l'interface correcte.

Il a utilis&eacute; avec succes une 3c590 pendant plusieurs semaines.

Dave Kennedy nous fait part qu'il a eu deux des cartes Boca cit&eacute;es plus haut
et qu'elles fonctionnent bien sous charge l&eacute;g&egrave;re. Craig ne les recommende pas
car Boca ne semble pas suivre les sp&eacute;cifications d'AMD mais il a pu les 
utiliser pendant deux semaines sans probl&egrave;mes. Il a test&eacute; les performances NFS
en transf&eacute;rant de gros fichiers depuis et vers son serveur (16M, 8M). Il a 
aussi essay&eacute; de travailler localement avec tous ses fichiers de donn&eacute;es mont&eacute;s
par NFS et cela sans probl&egrave;mes. Les performances paraissent am&eacute;lior&eacute;es de 
100 pour cent par rapport &agrave; sa carte ISA NE2000. (note de l'&eacute;diteur&nbsp;: 
cela aurait sans doute &eacute;t&eacute; la m&ecirc;me chose avec la SMC ISA Elite Ultra&nbsp;?)

<sect1> 3Com-3c590-tpo

<p>

Quelqu'un a mentionn&eacute; sur usenet avoir utilis&eacute; la 3Com-3c590-TPO (EtherLink
 III - PCI). Pour que cela fonctionne avec son noyau Linux 1.2.8, il lui a
fallu le pilote "3c59x.c" avec le "vortex.patch".

<sect1> DEC435 PCI NIC

<p>

Il parait que la carte DEC435 PCI marche bien avec les pilotes fournis dans
la distribution Slackware - Je pense donc qu'ils sont dans le noyau standard&nbsp;?

<sect> Cartes m&egrave;res

<p>
Liste des utilisateurs qui ont r&eacute;pondu &agrave; mon questionnaire, sur le type de
cartes m&egrave;res qu'ils emploient ... et r&eacute;sultats obtenus lors de
l'installation et l'utilisation de Linux :

<sect1> ASUS

<p>
<itemize>
<item>  Ruediger.Funck@Physik.TU-Muenchen.DE - fonctionne mais ...
<item>  strauss@dagoba.escape.de - demi-succ&egrave;s, fonctionne mais ...
<item>  krypton@netzservice.de (Ulrich Teichert), - fonctionne
<item>  heinrich@zsv.gmd.de - fonctionne
<item>  CARSTEN@AWORLD.aworld.de - fonctionne
<item>  egooch@mc.com - fonctionne (sauf le port s&eacute;rie)
<item>  archie@CS.Berkeley.EDU - fonctionne, apr&egrave;s avoir compris comment
configurer l'IDE.
<item>    Lars Heinemann (lars@uni-paderborn.de) fonctionne
<item>  Michael Will (michaelw@desaster.student.uni-tuebingen.de) - fonctionne
</itemize>

<sect1> Micronics P54i-90
<p>
<itemize>
<item>  root@intellibase.gte.com - fonctionne.
<item>  bill.foster@mccaw.com - fonctionne.
<item>  karpens@ncssm-server.ncssm.edu - fonctionne.
</itemize>

<sect1>  SA486P AIO-II
<p>
ah@doc.ic.ac.uk fonctionne.

<sect1> Sirius SPACE

<p>

hi86@rz.uni-karlsruhe.de - fonctionne.

<sect1> Gateway-2000
<p>
<itemize>
<item>  kenf@clark.net - fonctionne (pb. avec carte son)
<item>  dmarples@comms.eee.strathclyde.ac.uk - fonctionne mais ...
<item>  robert logan (rl@de-montfort.ac.uk)  - sans aucun probl&egrave;me.
<item>  James D. Levine (jdl@netcom.com) - sans aucun probl&egrave;me.
</itemize>

<sect1> Intel-Premier
<p>
grif@cs.ucr.edu  - fonctionne.
jeromem@amiserv.xnet.com - fonctionne
demarest@rerf.or.jp - fonctionne (Premier-II) 

<sect1> DELL Poweredge SP4100
<p>
gbelow@pmail.sams.ch - fonctionne

<sect1> Comtrade Best Buy PCI / PCI48X Mo Rev 1.0
<p>
tldraben@eos.ncsu.edu - Fonctionne. Probablement &eacute;quip&eacute;e de l'ensemble de
circuits (<sq>chipset</sq>) d&eacute;ficient Intel <sq>Saturn</sq>.

<sect1> IDeal PCI / PCI48X Mo Rev 1.0
<p>
tldraben@eos.ncsu.edu - Ne fonctionne pas.

<sect1> CMD Tech. PCI IDE / CSA-6400C
<p>
tldraben@eos.ncsu.edu - Fonctionne.

<sect1> GA-486iS (Gigabyte)
<p>
Stefan.Dalibor@informatik.uni-erlangen.de - Fonctionne.

<sect1> GA-586-ID (Gigabyte) 90 Mhz Pentium PCI/EISA
<p>
kkeyte@esoc.bitnet - fonctionne

<sect1> ESCOM 486dx2/66 - Type de carte non pr&eacute;cis&eacute;
<p>
Seul le streamer (floppy tape de marque Archive) ne fonctionne pas.

<sect1> J-Bond avec i486dx2/66
<p>
Drew Eckhardt (drew@kinglear.cs.Colorado.EDU) utilise la Diamond Stealth 64 VRAM
avec 4M de M&eacute;moire (&agrave; base de 964). Elle fonctionne tr&egrave;s bien en 1024x768 72Hz
et 32bpp de m&ecirc;me qu'en 16bpp et 8bpp. Il lui a fallu le serveur X311u2S3 de
ftp.xfree86.org. Les possesseurs de cartes Diamond &agrave; base de 968 devront faire
de m&ecirc;me.


<sect1> Super micro 011895 03:50 SUPER P54CI-PCI rev 1.3 (Opti)
<p> 
Manuel de Vega Barreiro
<itemize>
<item> carte m&egrave;re super micro 011895 03:50 SUPER P54CI-PCI rev 1.3
<item> Chipset Opti: 82c557,82c556,82c558,82c621.
<item> 4 slots PCI, 4 ISA (4x16 Bit)
<item> Support ZIF pour CPU (120,100,90,75 mHz)
<item> 4 SIMMs 72 broches (max 128Mb)
<item> cache 256,512,1024 Kb L2-cache
<item> Ami WinBIOS en Flash-Eprom (101094-VIPER-P)
<item> contr&ocirc;leur int&eacute;gr&eacute; EIDE pour 4 disques.
<item> Pentium 90Mhz, 8Mo (now 16Mo) RAM et 256K L2-cache.
<item> 1 maxtor 540 Mo, 1 st3122A 1Go
<item> Number Nine 9GXE64pro with 2Mo
<item> Sound blaster 16 + cdrom Matsushita 
<item> Ecran 17" microscan 5ep ADI
</itemize>
J'utilise Linux 1.1.57 (maintenant 1.2.1) sans probl&egrave;mes.
       dosemu0.53 fonctionne bien (logiciels de comm comme kermit et xtalk)
       XFree86 3.1 &agrave; la r&eacute;solution de 1024x768
       



<sect> Rapports d&eacute;taill&eacute;s
<p>

<sect1> Micronics P54i-90 (root@intellibase.gte.com)
<p>
Pentium &agrave; 90MHz, 32Mo de RAM et 512Ko de cache &agrave; 2 niveaux. Fonctionne
parfaitement (une compilation de noyau n'exige que 10
minutes).
<p>
La carte-m&egrave;re offre :
<itemize>
<item> UART - 2 16550A
<item> ECP - un port parall&egrave;le am&eacute;lior&eacute;
<item> IDE
<item> Contr&ocirc;leur de lecteurs de disquettes
</itemize>
<p>
Avantages : j'emploie pour le moment une Adaptec 1542CF et un disque Seagate
d'un giga. Aucun probl&egrave;me. Carte vid&eacute;o ATI Graphics Pro Turbo (PCI), tr&egrave;s
v&eacute;loce. Les ports s&eacute;rie g&egrave;rent un modem TeleBit T3000 (38400) sans pertes de
caract&egrave;res. Les adresses m&eacute;moires situ&eacute;es au-del&agrave; de 16Mo sont aussi servies
par le cache. Trois bancs de circuits SIMM (2 barettes par banc) pouvant
chacun supporter 64 Mo (32 Mo par barette). Chaque banc doit bien entendu
&ecirc;tre complet (2 barettes). Support CPU ZIF. BIOS flash PHOENIX.
<p>
Inconv&eacute;nients : RAM maxi 192Mo mais cache limit&eacute; &agrave; 512Ko. La carte vid&eacute;o est
tr&egrave;s v&eacute;loce mais il n'existe pas pour le moment de serveur X pour circuit
Mach64 (le serveur SVGA existant n'exploite du moins pas ses possibilit&eacute;s).
Je ne sais pas si le <sq>contr&ocirc;leur</sq> IDE int&eacute;gr&eacute; fonctionne car je n'appr&eacute;cie
gu&egrave;re les standards sp&eacute;cifiques &agrave; une plateforme et n'ai donc pas achet&eacute; de
disque IDE mais emploie un Seagate 31200N et un NEC 3Xi.

Mitch.

<sect1> Angelo Haritsis (ah@doc.ic.ac.uk) &agrave; propos de la SA486P
AIO-II&nbsp;:
<p>
J'ai achet&eacute; une carte <sq>SA486P AIO-II</sq> supportant les 486 SX/DX/DX2/DX4.
Elle offre&nbsp;:
<p>
<itemize>
<item> Chipset Intel Saturn v2
<item> BIOS Phoenix (flash EPROM)
<item> NCR scsi BIOS v 3.04.00
<item> 256K 15ns cache (max 512K) (write back et write through)
<item> 4 connecteurs pour RAM (SIMM 72 points) en 2 bancs
<item> 3 slots PCI, 4 ISA
<item> NCR 53c810 embarqu&eacute;
<item> IDE / floppy / 2 x 16550A uarts / parall&egrave;le &eacute;tendu embarqu&eacute;s
</itemize>

J'utilise un 486/DX2-66, un disque dur Seagate "Barracuda" 2.1Go (ST12550N),
un streamer Wangtek 5525ES et une vieille carte S3 (ISA).
Tout fonctionna parfaitement d&egrave;s le premier boot (noyau 1.1.50).
Et cela perdure depuis un mois.
Note : j'employais une Buslogic BT-445S et ai pu placer le disque sous le
contr&ocirc;le du circuit NCR sans reformater ... tout a surv&eacute;cu.
Les p&eacute;riph&eacute;riques SCSI paraissent nettement plus rapides.
Seules r&eacute;serves :

1/ lilo ne peut booter le syst&egrave;me sans une &eacute;dition manuelle de /etc/disktab,
effectu&eacute;e une fois pour toutes.

2/ Afin que l'ensemble fonctionne :
disconnect/reconnect est d&eacute;bray&eacute;.
Cela autorise donc le verrouillage du bus SCSI m&ecirc;me durant de longues
op&eacute;rations (<sq>rewind</sq> du streamer) ...
La n&eacute;gociation du mode synchrone est elle aussi d&eacute;bray&eacute;e. Cela entra&icirc;ne une
certaine perte de performances.

Je crois que Drew (auteur du pilote pour circuit SCSI NCR) r&eacute;sout en ce
moment ces limitations.

Quelques probl&egrave;mes avec Windows.

<sect1> bill.foster@mccaw.com parle de sa Micronics M5Pi
<p>
<itemize>
<item> Micronics M5Pi avec Pentium 60 MHz &agrave; bus PCI et :
<item> 16Mo RAM/512Ko cache
<item> IDE, parall&egrave;le, 16550A UARTS
<item> 2 X 340MB IDE Maxtor
<item> Soundblaster 16 SCSI-II
<item> Toshiba 3401B CD-ROM SCSI
<item> D&eacute;rouleur de bandes Archive Viper 525MB SCSI
<item> Moniteur Viewsonic 17 pouces
<item> Carte vid&eacute;o Cardex Challenger PCI (ET4000/W32P)
<item> Souris s&eacute;rie A4-Tech
</itemize>

Tout fonctionne bien. L'installation de la distribution Slackware s'av&eacute;ra
tr&egrave;s ais&eacute;e et je peux employer Quicken 7 pour DOS gr&acirc;ce &agrave; DOSEMU.
J'emploie X Window en 1152x900 &agrave; 67Hz.

<sect1> Simon Karpen (karpens@ncssm-server.ncssm.edu) &agrave; propos de la Micronics M54pi
<p>
Je n'ai pas eu de probl&egrave;mes avec cette carte, le contr&ocirc;leur PCI IDE int&eacute;gr&eacute;
(j'esp&egrave;re passer au SCSI bient&ocirc;t) et une ATI Mach32 (GUP) avec 2Mo de VRAM.

<sect1> Goerg von Below (gbelow@pmail.sams.ch) &agrave; propos du DELL Poweredge
<p>

<itemize>
<item> Intel 486DX4/100
<item> 16 Mo RAM
<item> DELL SCSI Array (DSA) avec Firmware A07, DSA-Manager 1.7
<item> disque dur 1 Go SCSI DIGITAL
<item> CD-ROM NEC SCSI
<item> streamer SCSI 2 Go interne
<item> Ethernet : 3-Com C579 EISA
<item> Carte vid&eacute;o : ATI 6800AX PCI VGA, 1 MB RAM
</itemize>

Attention :
Le DSA ne fonctionne qu'avec le firmware (<sq>BIOS</sq>) A07&nbsp;!!
A06, trop bogu&eacute;, interdit le reboot&nbsp;!!
Pour r&eacute;cup&eacute;rer ce code : ftp dell.com, fichier /dellbbs/dsa/dsaman17.zip

A part cela aucun probl&egrave;me sous Linux. Machine faisant office de serveur de noms, de
serveur de news et de serveur WWW sur l'Internet depuis deux mois ...

<sect1> zenon@resonex.com &agrave; propos du Gateway2000 P-66
<p>
Gateway 2000, Pentium &agrave; 66 MHz, carte-m&egrave;re Intel offrant
5 slots ISA et 3 PCI.
Je n'utilise qu'une carte PCI &num;9 GXe level 12 (2 Mo VRAM et
1 Mo DRAM) achet&eacute;e chez Dell. Je n'emploie le mode graphique, sous
Linux, qu'&agrave; partir des consoles et attends quelques adaptations
d'XFree86 avant de l'essayer en 1280x1024. J'ai pu utiliser cette
carte sous DOS/Windows en 1280x1024x256 sans probl&egrave;me.
Install&eacute;es par ailleurs : carte Ethernet <sq>Etherlink 3C509</sq> (Etherlink III),
la carte Mitsumi<footnote>Interfa&ccedil;ant probablement un lecteur de CD-ROM.</footnote>,
l'Adaptec 1542C et une carte s&eacute;rie/parall&egrave;le (la machine comprend donc 3
ports s&eacute;rie).

32 Mo de m&eacute;moire install&eacute;s et reconnus par DOS et Linux.
Une souris bus (Microsoft en mode PS/2).

Aucun probl&egrave;me jusqu'&agrave; pr&eacute;sent.

<sect1> James D. Levine (jdl@netcom.com) utilise un Gateway 2000

<p>
Gateway 2000 P5-60 &agrave; carte-m&egrave;re Intel <sq>Mercury</sq>, BIOS sur EPROM Flash
d'origine AMI (1.00.03.AF1, (c)'92) 16Mo RAM, interface IDE embarqu&eacute;e
et carte vid&eacute;o PCI : ATI AX0 (Mach32 Ultra XLR).

Aucun probl&egrave;me avec ce mat&eacute;riel jusqu'&agrave; pr&eacute;sent, mais n'a rien essay&eacute; de
tr&egrave;s sp&eacute;cial (pilotes SCSI ou acc&eacute;l&eacute;rateurs d'IDE).

<sect1> hi86@rz.uni-karlsruhe.de : carte SPACE

<p>
8Mo RAM, S3 805 1Mo DRAM PCI
Disque dur 260Mo Seagate IDE (je ne peux exploiter le circuit NCR53c810
faute de pilote), Linux 0.99pl15d fonctionne bien.

<sect1> grif@cs.ucr.edu : carte INTEL

<p>
17 machines 60MHz Pentium (carte Intel <sq>Premier</sq>).


<sect1> Jerome Meyers (jeromem@xnet.com) et Intel Premier
<p>
Intel Premier Plato-babyAT 90mhz avec Buslogic bt946c w/4.86 mcode w/4.22
autoSCSI, ATI Xpression (Mach64) (j'emploie les pilotes disponibles sur sunsite et
un moniteur AcerView 56L).
<p>
4 disques durs IDE. Linux (Slackware 2.0) per&ccedil;oit les deux premiers et ce que
contr&ocirc;le la BusLogic (qui &eacute;mule une Adaptec 1542). DOS per&ccedil;oit tout.
BusLogic (aux US du moins ! NdT) exp&eacute;die sans probl&egrave;mes les circuits
permettant de proc&eacute;der &agrave; une mise-&agrave;-jour mat&eacute;rielle (bo&icirc;tiers PLCC).
Une Sound Blaster SCSI-2 contr&ocirc;le aussi un lecteur de CD. Config compl&egrave;te,
donc : 4 disques IDE (2 pour Linux) et 2 contr&ocirc;leurs SCSI.

<sect1> Timothy Demarest (demarest@rerf.or.jp) et l'Intel Plato Premiere II

<p>
La configuration de mon syst&egrave;me est la suivante&nbsp;: 16 Mo de RAM 60ns,
carte ethernet 3Com Etherlink-III (10base2), ATI Mach 64 2 Mo de VRAM,
CDROM SCSI double vitesse Toshiba, NCR 53c810 PCI SCSI, lecteur de cartouches
270 Mo Syquest 3270, &eacute;cran Viewsonic 17 pouces, Pentium 90 (non bugg&eacute;).
Je tourne sous Slackware 2.1.0 avec un noyau 1.2.0 et d'autres mises &agrave; jour
diverses.

Tout fonctionne sans probl&egrave;me. Je ne recommende pas les lecteurs Syquest.
J'ai utilis&eacute; les mod&egrave;les 3105 et 3270 qui sont tous les deux tr&egrave;s, tr&egrave;s
fragiles. De plus les cartouches sont facilement endommag&eacute;es ce qui m'a
caus&eacute; de fr&eacute;quents probl&egrave;mes. Je suis en train de m'int&eacute;resser &agrave; d'autres
syst&egrave;mes de stockage amovible (MO, Zip, Minidisc, etc).

Quelques informations qui peuvent &ecirc;tre utiles&nbsp;:

<sect2> Mises &agrave; jour du Flash Bios

<p>
On peut t&eacute;l&eacute;charger par ftp les mises &agrave; jour de Flash Bios &agrave; partir de
wuarchive.wustl.edu:/pub/MSDOS_UPLOADS/plato. Le num&eacute;ro de version actuelle est
1.00.12.AX1. Les mises &agrave; jour de BIOS doivent &ecirc;tre effectu&eacute;es dans l'ordre.
De 1.00.03.AZ1 vers 1.00.06.AX1 vers 1.00.08.AX1 vers 1.00.10.AX1 vers 1.00.12.AX1.
On peut aussi t&eacute;l&eacute;charger ces mises &agrave; jour sur le BBS Intel.

<sect2> Carte PCI SCSI NCR 53c810 sans BIOS

<p>
Si vous utilisez la carte PCI SCSI NCR 53c810 sans BIOS avec la Plato,
il se peut que vous ayez du mal &agrave; la faire reconnaitre. J'ai du modifier
un des cavaliers de la carte NCR&nbsp;: Celui qui contr&ocirc;le si il y a 1 ou
2 cartes SCSI NCR dans votre machine doit &ecirc;tre sur "2". Je ne sais pas 
pourquoi, mais c'est comme &ccedil;a que j'ai r&eacute;ussi &agrave; la faire marcher.
L'autre cavalier contr&ocirc;le le choix de l'interruption (A, B, C, D). Je l'ai
laiss&eacute; sur A (position par d&eacute;faut).

<sect2> A part &ccedil;a, c'est du "plug and play"&nbsp;!

<p>
Il n'y a rien &agrave; faire dans le BIOS pour configurer la carte NCR 53c810.
Ne vous en faites pas - une fois les cavaliers de la carte bien positionn&eacute;s,
elle sera bien d&eacute;tect&eacute;e&nbsp;! Le PCI c'est bien du "plug and play"&nbsp;!


<sect1> heinrich@zsv.gmd.de : carte ASUS
<p>
ASUS-PCI-Board (SP3) &eacute;quip&eacute; de :

<itemize>
<item>   Carte-m&egrave;re PCI Asus, CPU AMD 486/dx2-66 et 16Mo RAM
<item>   Disque dur Fujitsu 2196ESA 1G SCSI-II
<item>   Interface disque dur Future Domain 850MEX (peu ch&egrave;res, copie
quasi conforme des Seagates ST01. J'attends le pilote pour le NCR53c810
embarqu&eacute;)
<item>   ATI Graphics Ultra (premi&egrave;re vague : circuit Mach-8, carte ISA 8
bits)
<item>   Slackware 1.1.1
</itemize>

L'utilisateur s'est content&eacute; d'installer la nouvelle carte m&egrave;re, de
r&eacute;installer les
cartes et de connecter les c&acirc;bles ... et tout a fonctionn&eacute; du premier coup.
Mais il n'emploie aucune carte d'extension PCI.

<sect1> CARSTEN@AWORLD.aworld.de : carte ASUS
<p>
Carte ASUS-PCI avec 486DX66/2, miro-crystal 8s PCI avec serveur pour S3 de
XFree86-2.0, n'utilisant pas le circuit SCSI NCR embarqu&eacute; pour cause de
manque de pilotes sous Linux mais test&eacute; sous DOS et reconnu tr&egrave;s v&eacute;loce.
Aucun probl&egrave;me de compatibilit&eacute;.

<sect1> Lars Heinemann (lars@uni-paderborn.de) : ASUS

<p>
Carte ASUS PCI/I-486SP3 &agrave; 486DX2/66, 16Mo RAM (2x8),
miroChrystal 8S/PCI (1Mo) S3, Soundblaster PRO, Adaptec 1542b (3.20
ROM) carte SCSI et deux disques (Fujitsu M2694ESA et Quantum LPS52)
plus QIC-150 Streamer.
Aucun probl&egrave;me !

<sect1> Ruediger.Funck@Physik.TU-Muenchen.DE : carte ASUS

<p>
<itemize>
<item> ASUS PCI/I-486SP3 /  i486DX2-66  /  8 Mo PS/2 70 ns
<item> BIOS: Award v 4.50
<item> Miro Crystal 8s PCI - S3 P86C805 - 1Mo DRAM
<item> Disque dur Quantum LPS 540S SCSI contr&ocirc;l&eacute; par NCR 53c810
<item> CPU vers DRAM <sq>write buffer</sq> : en fonction (enabled)
<item> CPU vers PCI <sq>write buffer</sq> :  en fonction
<item> PCI vers DRAM <sq>write buffer</sq> : non employ&eacute;
<item> CPU vers PCI <sq>burst write</sq> :   en fonction
</itemize>

<sect1> robert logan (rl@de-montfort.ac.uk) : GW/2000
<p>
<itemize>
<item> Gateway 2000 4DX2-66P
<item> 16 Mo RAM,
<item> PCI ATI AX0 2Mo DRAM (ATI GUP).
<item> Disque dur WD 2540 (528 Mo)
<item> Slackware 1.1.2 (0.99pl15f)
</itemize>

Aucun probl&egrave;me. SLIP et la carte Orchid-Soundwave-32 fonctionnent.
J'attends moi aussi le pilote pour NCR.
Seul probl&egrave;me rencontr&eacute; : les performances du disque IDE laissent &agrave;
d&eacute;sirer sous Linux alors que ce tr&egrave;s r&eacute;cent disque WD vole sous DOS/WfW.
<footnote>L'interface IDE fonctionne en mode ISA sous Linux et un pilote
commute le mode PCI sous DOS. Cela explique la perte de charge constat&eacute;e.
Cf. aussi le cas de dmarples@comms.eee.strathclyde.ac.uk  NdT.</footnote>

<sect1> archie@CS.Berkeley.EDU : ASUS (deux machines)
<p>
<itemize>
<item> ASUS PCI-SP3 (4 ISA, 3 PCI)
<item> Intel 486DX2/66
<item> Genoa Phantom 8900PCI (autre machine&nbsp;: Tseng 3000/W32i)
<item> Maxtor 345 Mo IDE
<item> Carte modem Supra 14.4
<item> Moniteurs : ViewSonic 6e et NEC Multisync 4fge
<item> Slackware 1.2.0
</itemize>

Le circuit SCSI embarqu&eacute; est mis hors-fonction. Probl&egrave;mes de prime abord
avec la cha&icirc;ne IDE (interface embarqu&eacute;e) : <sq>un jumper, sur la carte, permet de
sp&eacute;cifier si la ligne d'IRQ 14 provient du bus ISA ou PCI.
Un exemple fourni par le manuel montre une connexion &agrave; l'INT A du PCI.
Ne pas le respecter. La configuration du Supra exige l'emploi de setserial
(pour pr&eacute;ciser que le port est un 16550A).
Slackware : utiliser /etc/rc.d/rc.serial.</sq>

<sect1> Michael Will : ASUS-SP3 486 (premi&egrave;re g&eacute;n&eacute;ration)

<p>

J'utilise la configuration suivante :

<itemize>
<item> ASUS PCI-SP3-Board : 486dx2/66 et 16Mo RAM
<item> NCR53c810-SCSI-II embarqu&eacute; pour 1Go Seagate et streamer Wangtek
<item> ATI-GUP PCI Mach32 / 2Mo VRAM fonctionnant parfaitement
avec XFree86(tm)-3.1 (8 et 16 bits/pixel)
<item> Linux kernel 1.1.54
</itemize>

Tout fonctionne. Vitesse satisfaisante. Les performances de la carte
ATI-GUP-PCI (Mach32) restent en de&ccedil;a des indices de benchmarks. Si j'avais de
l'argent j'ach&egrave;terais un P90 Plato et une carte &num;9GXE64Pro !


<sect1> Mike Frisch (mfrisch@saturn.tlug.org) : Giga-Byte 486IM
<p>

<itemize>
<item> Giga-Byte 486IM
<item> 4 slots ISA (2 double VLB) et 4 PCI 
<item> CPU: Intel 486DX/33
<item> BIOS: Award 4.50G
<item> Contr&ocirc;leur disque PCI EIDE : Giga-Byte GA-107 (CMD 640x PCI
        Multi-I/O)
<item> carte vid&eacute;o PCI : ATI Graphics eXpression PCI 2MB DRAM
<item> Linux Kernel: 1.2.9
<item> Distribution Linux : Slackware 2.2.0 tr&egrave;s modifi&eacute;e
</itemize>

J'ai fait tourner cette carte 24h sur 24 ces 6 derniers mois. Elle a 
fonctionn&eacute; sans probl&egrave;me sous DOS/Windows, OS/2 Warp et Linux (24h/24).


<sect1> Karl Keyte (kkeyte@esoc.bitnet) Gigabyte GA586 Pentium

<p>
<itemize>
<item> PCI/EISA Board Gigabyte GA586-ID 90MHz Pentium (biprocesseur, un seul
CPU mont&eacute;)
<item> 32 Mo RAM
<item> SCSI - pas de circuit NCR, j'emploie donc une Adaptec 1542C,
<item> PCI ATI GUP 2M VRAM
<item> Adaptec 1742 EISA SCSI
<item> Soundblaster 16
</itemize>

<p>
DOS et Linux fonctionnent parfaitement. Machine extr&ecirc;mement v&eacute;loce. Les
benchmarks de BYTE pour machines Unix lui accordent une puissance &agrave; peu pr&egrave;s
&eacute;gale &agrave; celle d'une Sun SPARC 20 sous Solaris 2.3.
Le PC effectue plus vite le test de vitesse de calcul en arithm&eacute;tique enti&egrave;re
et celui portant sur la manipulation des processus (changement de contexte y
compris). La station Sun l'emporte lors des traitements en virgule flottante
et sur l'un des tests de vitesse du syst&egrave;me de disques.

<sect1> kenf@clark.net : G/W 2000

<p>
Emploie un Gateway 2000 sans probl&egrave;me. La carte son livr&eacute;e (mod&egrave;le non
pr&eacute;cis&eacute;) ne fonctionne pas. Il esp&egrave;re obtenir satisfaction apr&egrave;s un
&eacute;change contre une v&eacute;ritable Sound Blaster.

<sect1> Joerg Wedeck (jw@peanuts.informatik.uni-tuebingen.de) / ESCOM

<p>
486 DX2/66 vendue par ESCOM (type de carte m&egrave;re non pr&eacute;cis&eacute;)
avec IDE embarqu&eacute; et sans circuit SCSI <sq>NCR</sq>. Adaptec 1542cf
et carte vid&eacute;o SPEA v7 mercury lite (s3, PCI, 1Mo),
ISA-Soundblaster-16, mitsumi-cdrom (simple vitesse).
Seul le streamer Archive ne fonctionne pas.
Le spea-v7 s'entend parfaitement avec XFree86-2.1 !

Il abandonna tout cela pour adopter une carte ASUS-SP3-G et constata qu'elle
ne supporte pas les transferts en mode rafale du bus PCI vers la m&eacute;moire
(<sq>PCI-to-Memory posting</sq>). Seul Linux crashe, Windows et OS/2 fonctionnent.
D&eacute;brayer cette option rend le tout parfaitement stable.
Lire &agrave; ce propos <sq>http://wsiserv.informatik.uni-tuebingen.de/~jw</sq>.
        
<sect1> ut@informatik.uni-kiel.d400.de / ASUS
<p>
ASUS-PCI et AMD486dx40 (cadenc&eacute; &agrave; 33MHz ?!).
La carte ISA-ET3000 Optima 1024A ISA fonctionne bien. Pas de probl&egrave;me avec le
disque SCSI Quantum540S connect&eacute; au NCR53c810 int&eacute;gr&eacute;.

        
<sect> Probl&egrave;mes rencontr&eacute;s
<p>
<sect1> hschmal@informatik.uni-rostock.de : SCSI-PCI-SC200
<p>
Linux refuse de d&eacute;marrer lorsque la carte SCSI-PCI-SC200 se trouve dans le syst&egrave;me.

<sect1> dmarples@comms.eee.strathclyde.ac.uk G/W 2000

<p>

Gateway 2000
G/W 2000 4DX2/66 PCI
ATI-Graphics-Ultra-Pro
IDE

Fonctionne bien, seule la carte IDE fonctionne en mode ISA sous Linux,
beaucoup plus lentement que sous DOS apr&egrave;s basculement en mode PCI par un
programme MS-DOS sp&eacute;cifique.
Plus lent sous Linux, donc : un patch serait le bienvenu.

<sect1> cip574@wpax01.physik.uni-wuerzburg.de (Frank Hofmann) / ASUS
<p>

La carte ASUS / 16Mo-RAM, carte ISA S3/928, interface IDE embarqu&eacute;e,
disque Seagate ST4550A.
Aucun probl&egrave;me avec les noyaux Linux plus r&eacute;cents.

Probl&egrave;me rencontr&eacute; :
<tscreen>
Ma souris, sous X, ne r&eacute;agit plus comme d'habitude. Le pointeur semble
bondir lorsque je la d&eacute;place vite. Ce probl&egrave;me a je crois &eacute;t&eacute; trait&eacute;
dans un newsgroup Linux. L'utilisation du 16550 expliquerait ce
ph&eacute;nom&egrave;ne. Apr&egrave;s deux semaines d'utilisation je m'y suis habitu&eacute; :-)
</tscreen>

R&eacute;duire le seuil du tampon fourni par le 16550 devrait am&eacute;liorer la
situation. Un patch pour setserial le permettrait mais je ne sais o&ugrave; le
trouver.


<sect1> axel@avalanche.cs.tu-berlin.de (Axel Mahler) / ASUS

<p>
Carte-m&egrave;re ASUS PCI/I-486SP3 (Award BIOS 4.50), 16 Mo RAM
Circuit SCSI <sq>NCR</sq> mis hors-fonction,
Carte PCI Genoa Phantom/W32 2Mo

Adaptec AHA-1542CF (BIOS v2.01) pour :
<itemize>
<item> disque IBM 1.05 Go
<item> CD-ROM Toshiba (XM4101-B)
<item> DAT HP (2Go)
</itemize>

mke2fs (0.4, v. 1.11.93) fige le syst&egrave;me et interdit l'installation.
<footnote>(Version ancienne, indique l'utilisation d'un noyau obsol&egrave;te NdT).</footnote>

Le remplacement de la carte vid&eacute;o Genoa Phantom/W32
2Mo PCI par une ELSA Winner 1000 2Mo PCI corrigea le probl&egrave;me.
Le syst&egrave;me fonctionne aussi avec une vieille carte VGA ISA de marque
EIZO. Cela met en cause la carte Genoa.

<sect1> Frank Strauss (strauss@dagoba.escape.de) / ASUS

<p>
Carte ASUS SP3   i486DX2/66
NCR53c810 hors-fonction
Adaptec 1542B dans un slot ISA : 2 disques (200Mo Maxtor,
420Mo Fujitsu), SyQuest 88Mo et streamer Tandberg
carte vid&eacute;o ELSA Winner 1000 PCI, 1Mo-VRAM
Soundblaster Pro dans slot ISA (IRQ 5)
Interface IDE embarqu&eacute;e mise hors-fonction
Circuits embarqu&eacute;s pour s&eacute;rie, parall&egrave;le et contr&ocirc;leur de disquettes
en fonction.

La machine se fige parfois apr&egrave;s un reset (logiciel ou mat&eacute;riel).
Ce n'est probablement pas d&ucirc; &agrave; l'Adaptec ou &agrave; la carte son
car le syst&egrave;me ne red&eacute;marre pas, parfois, m&ecirc;me lorsqu'elles sont
d&eacute;pos&eacute;es.
Mais sit&ocirc;t lanc&eacute; (lorsque le message du BIOS de l'ELSA appara&icirc;t)
tout fonctionne &agrave; merveille.
<footnote>M&ecirc;mes sympt&ocirc;mes ici depuis l'installation d'une carte clone &agrave; base de
Cirrus 5428 / VLB dans une machine EISA/VLB   NdT.</footnote>

Les deux ports s&eacute;rie sont bien d&eacute;tect&eacute;s en mode 16550 mais lors de
certains transferts perdent de nombreux caract&egrave;res en mode V42bis.
Cela semble relever d'un probl&egrave;me mat&eacute;riel.

Le mode rafale CPU-&gt;PCI fonctionne bien sous DOS/Windows

Le mode rafale CPU-&gt;PCI ne fonctionne pas correctement avec linux0.99p15 :
pertes de pages &eacute;crans lors de basculements de consoles virtuelles
et blocages du syst&egrave;me laissant le voyant SCSI allum&eacute; lors de
l'invocation d'applications massives telles que ghostview ou xdvi.

(Je pense que ces applications exigent beaucoup de transferts en mode
CPU-&gt;PCI-burst &agrave; cause des importants volumes de donn&eacute;es transf&eacute;r&eacute;s
vers la carte ELSA lors de leur invocation).

Tout fonctionne bien apr&egrave;s mise hors-fonction du mode CPU-&gt;PCI-Burst.
La carte vid&eacute;o d&eacute;livre 93k xstones en 1152x846
(peu de cache pour les fontes avec 1Mo). Le mode Opaquemove sous twm est
un poil mieux que <sq>supportable</sq> :-)

Un programme DOS nomm&eacute; <tt>SATURN.EXE</tt>, lanc&eacute; avant de d&eacute;marrer Linux,
aide ce dernier &agrave; exploiter le mode burst sans accroc.

Quelqu'un a affirm&eacute; que certains de ces probl&egrave;mes dispara&icirc;traient si je
pouvais d&eacute;brayer le mode <sq>sync negotiation</sq> de l'Adaptec mais j'ignore si
la 1542B permet cela.

Avec le mode CPU-&gt;PCI-Burst la carte vid&eacute;o atteint 95k xstones, ce gain
ne justifie pas l'effort. L'utilisateur aimerait exploiter la carte vid&eacute;o
en mode 1152x900 mais cela ne semble pas possible car elle interpr&egrave;te toute
r&eacute;solution horizontale sup&eacute;rieure &agrave; 1024 comme &eacute;gale &agrave; 1280, entamant la
bande passante au point de devoir r&eacute;duire la dimension verticale &agrave; 816
pixels.

<sect1> egooch@mc.com / ASUS

<p>
<itemize>
<item> Carte    ASUS PCI/I-486 SP3      RAM&nbsp;: 16Mo (4x4M-SIMM)
<item> Processeur       486DX33
<item> BIOS     Ver. 4.50 (12/30/93)
<item> 2 lecteurs de disquettes (1.2 et 1.44), utilisant le circuit embarqu&eacute;
<item> SCSI    WD7000 SCSI et Adaptec 1542CF fonctionnent
<item>          2 disques SCSI 320Mo
<item>          CD-ROM SCSI NEC84
<item>          Streamer Archive QIC150 SCSI
<item> Vid&eacute;o    Tseng ET4000 ISA
<item> Son      PAS16
<item>  Imprimante sur le port parall&egrave;le int&eacute;gr&eacute; &agrave; la carte m&egrave;re
</itemize>

Aucune carte d'extension PCI pour le moment, mais d&eacute;sire acheter une carte
vid&eacute;o PCI. Utilise une carte d'interface SCSI WD7000 en attendant le
pilote pour circuit NCR embarqu&eacute;.
<p>
Tout fonctionne parfaitement. Le premier port s&eacute;rie (sert un modem 14.4)
se bloque parfois lors des tentatives de reconnexions apr&egrave;s utilisation du
modem. Ce probl&egrave;me serait caus&eacute; par un circuit (SMC-LSI) du 16550
d&eacute;ficient.
La souris Logitech s&eacute;rie connect&eacute;e au second port fonctionne bien, mais je
cherche comment diminuer le seuil du tampon fourni par le 16550.
                
<sect1> Stefan.Dalibor@informatik.uni-erlangen.de / GigaByte

<p>
<itemize>
<item> Carte  GA-486iS Gigabyte 256Kb cache 2L, i486-DX2
<item> Bios     AMI, 93/8
<item> SCSI     Pas de circuit SCSI embarqu&eacute;, j'emploie une Adaptec 1542C,
<item> Vid&eacute;o     ELSA Winner 1000
<item> Linux  0.99pl14 + SCSI-Clustering-Patches / Slackware 1.1.1
</itemize>

<p>
Tout semble fonctionner correctement mais l'utilisateur n'a pas
encore essay&eacute; d'installer une carte Ethernet, d'imprimer ou
d'exploiter un streamer.
Des probl&egrave;mes de blocages du syst&egrave;me lorsqu'il utilisait <tt>find</tt> furent
r&eacute;solus par l'application des patches de clustering SCSI mais ils
relevaient plut&ocirc;t de dysfonctionnements des anciennes version du noyau.
        
La carte vid&eacute;o ELSA-Winner-1000 se fige parfois. L'affichage devient pour
le moins &eacute;trange et il faut relancer le syst&egrave;me. Le revendeur a parl&eacute; d'un
bug de la carte ELSA mais le constructeur a affirm&eacute; avoir r&eacute;solu cela. le
probl&egrave;me n'est pas syst&eacute;matique, l'utilisateur t&acirc;che donc de l'ignorer.
        
Tout bien consid&eacute;r&eacute; la machine fonctionne bien en utilisation de
bureautique orient&eacute; traitement de textes (emacs, LaTeX, xfig, ghostview)
et semble tr&egrave;s v&eacute;loce, &agrave; peine au-dessous des stations Sun co&ucirc;tant au
moins 3 fois plus cher qu'il emploie par ailleurs.
        
Le mode CPU-&gt;PCI-Burst est d&eacute;bray&eacute; car le BIOS ne supporte pas
correctement cela.


<sect1> Tom Drabenstott (tldraben@eos.ncsu.edu) : Comtrade / PCI48IX

<p>
PCI48IX Rev. 1.0.  Constructeur inconnu, documentation
par <sq>TMC</sq>. Le BIOS ne permet gu&egrave;re de param&eacute;trer le bus PCI.

La carte ISA multifonctions d'interface IDE de type UMC (863+865)
fonctionne bien sous DOS et OS/2 mais pas sous Linux.

<sect> Choix d'une carte-m&egrave;re PCI : conseils et observations diverses
<p>
Angelo Haritsis (ah@doc.ic.ac.uk) a rassembl&eacute; les &eacute;l&eacute;ments de cette section.

<sect1> ATTENTION
<p>
Ne pas acheter de carte-m&egrave;re PCI/VLB, elles paraissent toutes mal con&ccedil;ues.
Opter pour une carte PCI/ISA.
Eviter les jeu de composants (chipsets) de marque OPTi mod&egrave;les
82C596, 82C597 et 82C822 comme sur la carte m&egrave;re TMC PCI54PV.
<p>
(Je connais au moins une personne qui n'a pas de probl&egrave;me avec sa TMC PCI54PV.
Il lui a fallu seulement mettre sa carte NCR53c810 dans le slot A qui semble le 
seul capable de faire du busmaster.)
<p>
Diverses rumeurs laissent entendre que les cartes m&egrave;res Intel ne peuvent
supporter plus d'une carte d'extension bus master. On dit aussi que le
chipset Saturn II pose divers probl&egrave;mes ... mais je l'emploie avec
satisfaction&nbsp;!

<sect1> Connecteur de composants de RAM
<p>
Opter pour une carte &agrave; connecteurs 72 points (v&eacute;locit&eacute; maximale).
Toutes les cartes Intel offrent cela.

<sect1> Carte-m&egrave;re PCI pl&eacute;biscit&eacute;e
<p>
La carte-m&egrave;re Intel pour Pentium 90 &agrave; chipset Premiere II (connue aussi sous
le nom de <sq>Plato</sq>) para&icirc;t satisfaisante.
Opter pour un BIOS int&eacute;grant le code du contr&ocirc;leur SCSI
NCR embarqu&eacute; afin que m&ecirc;me le 53c810 permette &agrave; MS-DOS de fonctionner.
La version 1.00.08 (ou peut-&ecirc;tre 1.00.06) offre un BIOS pour le circuit NCR
int&eacute;gr&eacute; au BIOS principal (AMI). Une disquette permet de mettre &agrave; jour ce
dernier (inscrit sur EPROM FLASH). La plus r&eacute;cente version rep&eacute;r&eacute;e porte le
num&eacute;ro 1.00.10 et corrige tous les probl&egrave;mes de jeunesse de ce produit.

<sect1> Lignes d'IRQ (Interrupt ReQuest)
<p>
La plupart des cartes-m&egrave;res exigent une configuration explicite (via le
SETUP) des param&egrave;tres PCI bas-niveau ... pour chaque connecteur (slot PCI) !
Cela m&eacute;nage la compatibilit&eacute; de ce bus avec les cartes ISA.
Sur les plus anciennes cartes PCI des cavaliers (jumpers) doivent
configurer le mode d'exploitation des lignes d'interruptions fournies par
chaque slot PCI (INTA et parfois INTB, INTC et INTD) et de leur interfa&ccedil;age
avec les lignes du classique 8259. Si une carte-m&egrave;re donn&eacute;e int&egrave;gre ces
cavaliers leurs positions doivent imp&eacute;rativement correspondre au param&egrave;trage
(SETUP) du bus PCI.
Les documents fournis avec un certain nombre de cartes (Viglens, par exemple)
sont partiellement erron&eacute;s. L'installation exige en ce cas quelques
t&acirc;tonnements.


<sect1> La famille des circuits contr&ocirc;leurs SCSI de NCR <sq>8xx</sq>
<p>
Tous les circuits NCR 8XX emploient le bus mastering (peuvent prendre le
contr&ocirc;le du bus) et se connectent directement au bus PCI. Ils correspondent
aux sp&eacute;cifications PCI version 2.0 et sont donc capables de transferts en
mode rafale sur 32 bits &agrave; 33MHz (133 Mo/s).

<sect2>  53C810
<p>
8 bits Fast SCSI-2 (10 Mo/s).
N&eacute;cessite un BIOS sp&eacute;cifique sur la carte m&egrave;re.
100 broches Quad Flat Pack (PQFP).
Premier circuit SCSI pour PCI. Le moins on&eacute;reux car le plus produit.

<sect2>  53C815
<p>
8 bits Fast SCSI-2 (10 Mo/s).
Terminaisons passives (<sq>single ended</sq>) uniquement.
Interface pour BIOS externe (circuit id&eacute;al pour conception de carte).
128 broches QFP.

<sect2>  53C825
<p>
16 bits Fast SCSI-2 (20 Mo/s).
Terminaisons passives ou diff&eacute;rentielles.
Interface pour BIOS externe.
160 broches QFP.


<sect1> Le futur des 53c8xx
<p>
NCR annoncera dans les 6 prochains mois 4 nouveaux circuits.
Brochages compatibles avec les 810 et 825 et quelques nouvelles fonctions.

Tous ces circuits n&eacute;cessitent un BIOS sous MS-DOS. Le 810 seul exige son
implantation sur la carte-m&egrave;re. La plus r&eacute;cente version du BIOS NCR porte le
num&eacute;ro 3.04.00 et permet &agrave; MS-DOS d'employer les disques de plus d'un Go.

<sect1> Performances des circuits SCSI NCR
<p>
Les tests de v&eacute;locit&eacute; du magazine allemand <sq>C't</sq> indiquent que ces circuits
fonctionnent nettement plus vite que la BusLogic BT-946. Un utilisateur a
constat&eacute; un niveau de performances d'environ 10 &agrave; 15% sup&eacute;rieur &agrave; celui d'une
Adaptec 2940 et qu'avec un tr&egrave;s rapide disque dur le tout semble environ deux
fois et demi plus rapide qu'une Adaptec 1540.

<sect1> Des nouvelles du support NCR53c825
<p>
Ca fonctionne. point.

<sect1> Frederic POTTER (Frederic.Potter@masi.ibp.fr) &agrave; propos de Pentium+NCR+Strap_bug 
<p>
Sur certaines cartes Intel Plato, le bios NCR ne reconnait pas la carte car il
doit la voir en tant que "contr&ocirc;leur SCSI secondaire", et que sur la pluspart
des cartes SCSI le cavalier de s&eacute;lection primaire/secondaire a &eacute;t&eacute; soud&eacute; en
position primaire (pour &eacute;conomiser un centime, sans doute).

Solution: 
<verb>
Pr&egrave;s du circuit NCR, il y a 3 connections (sorte de trous) avec un strap,
qui ressemblent &agrave;

                O--O  O

        Cela indique que le primaire est configur&eacute; par d&eacute;faut. Pour la carte
        Intel Plato il devrait &ecirc;tre comme ceci

                O  O--O

        La meilleure solution est d'enlever le strap et de mettre &agrave; la place
        un cavalier &agrave; deux positions.
</verb>

<sect1> La d&eacute;tection des p&eacute;riph&eacute;riques PCI dans les noyaux Linux r&eacute;cents par Frederic Potter
<p>

Frederic Potter a rajout&eacute; une d&eacute;tection des p&eacute;riph&eacute;riques PCI dans les noyaux r&eacute;cents.
Si vous faites "cat /proc/pci" vous devriez obtenir la liste de vos cartes.
Si certaines de vos cartes ne sont pas bien reconnues, envoyez un courrier
&eacute;lectronique &agrave; "Frederic.Potter@masi.ibp.fr". 
<p>
Voir arch/i386/kernel/bios32.c et include/linux/pci.h dans les sources du noyau
pour en savoir plus sur le fonctionnement de la d&eacute;tection PCI.

<sect1> Autres p&eacute;riph&eacute;riques PCI
<p>
Quelles autres cartes PCI peut-on utiliser ? A part les nombreuses cartes
graphiques, j'aimerais entendre parler d'autres cartes comme les cartes
ethernet, de capture d'&eacute;cran ou de TEST.
Cyclades a en beta test en ce moment&nbsp;:

<sect2> Cyclades: carte multiport PCI RISC &agrave; 16 ports
<p> 

Ce produit appel&eacute; Cyclom-Ye poss&egrave;de les caract&eacute;ristiques suivantes&nbsp;:
 
<itemize>
<item> Carte PCI h&ocirc;te bas&eacute; sur le jeu de circuits PLX. Cette carte g&egrave;re de 8
        &agrave; 32 ports s&eacute;rie, avec des boitiers externes 8 ou 16 ports.
<item> cable SCSI II.
<item> boitiers externes 8 or 16 ports avec connecteurs RJ45 ou DB25 au choix.
        On peut d&eacute;buter avec 8 ports et augmenter &agrave; 32 en rajoutant seulement
        des boitiers. Chaque boitier externe contient 2 ou 4 contr&ocirc;leurs s&eacute;rie
        RISC CD-1400 (chaque CD-1400 contr&ocirc;le 4 ports s&eacute;rie).
<item> Il est possible d'installer 4 cartes h&ocirc;te dans un PC ce qui permet un
       maximum de 128 ports s&eacute;rie par syst&egrave;me.
</itemize> 
Ce produit est en cours de beta test au 26 juillet 1995 et devrait &ecirc;tre disponible
vers octobre. Vous pouvez les contacter &agrave; sales@cyclades.com.

<sect> Conclusion

<p>
Si vous avez l'argent n&eacute;cessaire optez pour une ASUS-SP4, P90, c'est ce que
je poss&egrave;de en ce moment. Si vous pouvez vous le permettre 32 Mo de RAM est
tr&egrave;s sup&eacute;rieur &agrave; 16 Mo.

Dans un avenir proche, le futur standard sera le chipset Triton qui permettra
l'utilisation des barettes m&eacute;moires EDO et SRAM. Les deux seront plus ch&egrave;res
que de la RAM PS2, et en ce moment (28 juin 1995) la SRAM n'est pas encore
disponible. Si la RAM EDO est plus ch&egrave;re ce n'est pas &agrave; cause des co&ucirc;ts de
production, il parait qu'ils sont identiques.

Pour un syst&egrave;me &agrave; hautes performances, je choisirais quand m&ecirc;me une ASUS-TP4/XE
avec de la RAM EDO mais si vous n'en avez pas un besoin urgent il vaut mieux
attendre encore un peu.

Pour le choix d'une carte graphique, je dirais que la meilleure des cartes
bon march&eacute; qui s'accorde parfaitement avec un &eacute;cran Samsung Syncmaster 15Gli,
est la SPEA V7 Mirage P64 &agrave; circuit Trio64 en version 2 Mo de DRAM. Pour
des affichages plus sophistiqu&eacute;s tel l'Iiyama-IDEK 8617-T, je pense que la 
PCI Mach64 ATI-GUP-Turbo (pas le mod&egrave;le moins cher GUP-Turbo-Windows) serait
un bon choix : avec 4 Mo de RAM on peut avoir 16 millions de couleurs dans les
r&eacute;solutions sup&eacute;rieures. Elle est bien g&eacute;r&eacute;e par XFree86(tm)-3.1.1, et il y a 
aussi des serveurs X commerciaux, parmi lesquels je recommenderais Accelerated/X,
qui la font fonctionner tr&egrave;s efficacement.

Pour du SCSI je conseille un contr&ocirc;leur DPT plust&ocirc;t que le (moins cher et
tr&egrave;s rapide) NCR53c810 si l'on compte utiliser beaucoup de streamer SCSI.
Le pilote Linux pour NCR53c810 ne g&egrave;re pas, en effet, les connection/d&eacute;connection
ce qui bloque le bus SCSI &agrave; chaque op&eacute;ration du type "mt rewind", "mt fsf", etc.
Cela implique de p&eacute;naliser les performances pendant l'utilisation de Tar. Mais
allez voir les nouveaux pilotes alpha de Drew avant de prendre un d&eacute;cision, 
peut-&ecirc;tre r&eacute;solvent-ils ces probl&egrave;mes.

Pour des serveurs, le DPT reste de toute fa&ccedil;on le contr&ocirc;leur de choix &agrave; cause
de la bonne gestion du cache mat&eacute;riel ( avec tri des acc&egrave;s, ce qui rend le
cache embarqu&eacute; int&eacute;ressant m&ecirc;me sur un environnement Linux ou l'OS g&egrave;re son
propre cache) et du support raid jusqu'au niveau 5.

Si vous ne voulez d&eacute;penser autant d'argent en &eacute;quipement informatique (vous
avez aussi une vie) vous pourriez prendre une ASUS-SP3-SiS avec un AMD-DX2/66
ou un DX4/100. La SPEA V7 Mirage P64 PCI avec 2 Mo de DRAM est un bon choix
car elle utilise le circuit S3 Trio64 qui est bien support&eacute; par XFree86(tm)-3.1.1
et de plus n'est pas ch&egrave;re et rapide.

Depuis XFree86(tm)-3.1, l'ET4000/w32-PCI rapide et peu ch&egrave;re est aussi un 
bon choix.

<sect> Remerciements

<p>
Les personnes suivantes ont directement contribu&eacute; &agrave; la r&eacute;daction de ce
document :

<itemize>
<item> David Lesher (wb8foz@netcom.com) (correction de la version anglaise)
<item> Nathanael MAKAREVITCH (nat@nataa.frmug.fr.net) (adaptation en fran&ccedil;ais)
<item> Jun Morimoto (morimoto@lab.imagica.co.jp) (adaptation en japonais)
<item> Marco Melgazzi (marco@vcldec1.polito.it) (adaptation en italien)
<item> Donald Becker (becker@cesdis.gsfc.nasa.gov) (infos ethernet)
<item> Drew Eckhardt (drew@kinglear.cs.Colorado.EDU) (infos SCSI)
</itemize>

<p>
J'ai collect&eacute; la plupart des informations pr&eacute;sent&eacute;es ici par email et
articles de news post&eacute;s par les personnes dont les noms suivent :
<tscreen><tt>
CARSTEN@AWORLD.aworld.de,
dmarples@comms.eee.strathclyde.ac.uk,
drew@kinglear.cs.Colorado.EDU (oeuvrant sur le pilote du NCR53c810),
duncan@spd.eee.strathclyde.ac.uk,
fm3@irz.inf.tu-dresden.de,
grif@ucrengr.ucr.edu,
heinrich@zsv.gmd.de,
hm@ix.de (iX-Magazine),
hm@seneca.ix.de, 
kebsch.pad@sni.de,
kenf@clark.net,
matthias@penthouse.boerde.de,
ortloff@omega.informatik.uni-dortmund.de,
preberle@cip.informatik.uni-erlangen.de,
rob@me62.lbl.gov,
rsi@netcom.com,
sk001sp@unidui.uni-duisburg.de,
strauss@dagoba.escape.de,
strauss@dagoba.priconet.de, 
hi86@rz.uni-karlsruhe.de, 
Ulrich Teichert, krypton@netzservice.de,
Stefan.Dalibor@informatik.uni-erlangen.de,
tldraben@teleport.com
mundkur@eagle.ece.uci.edu,
ooch@jericho.mc.com,
Gert Doering (gert@greenie.muc.de),
James D. Levine (jdl@netcom.com),
Georg von Below (gbelow@pmail.sams.ch),
Jerome Meyers (jeromem@quake.xnet.com),
Angelo Haritsis (ah@doc.ic.ac.uk),
archie@CS.Berkeley.EDU et son copain kenf@clark.net.
</tt></tscreen>
<p>
Nat aimerait remercier les courageux relecteurs/correcteurs de ce
document :<newline>
<tscreen><tt>
Xavier Cazin,
Ren&eacute; Cougnenc
</tt></tscreen>

<sect> Informations diverses (section ajout&eacute;e par Nat)
<p>
---------------------------------------
<p>
Truc pour v&eacute;rifier la release du chipset PCI (merci &agrave; Jean-Louis Matrat).

<verb>
Sous debug:

-o cf8 f0
-i c000
86
-i c001
80
-i c002
A3
-i c003
04
-i c008
11
-o cf8 00
-q
</verb>

Les valeurs retourn&eacute;es indiquent&nbsp;:
<itemize>
<item> en 00 et 01 : Vendor ID, Intel si 8086
<item> en 02 et 03 : Device ID, 0483 si Saturn (PCI en 486), 04A3 si PCI en
Pentium (Mercury et la suite)
<item> en 04 : R&eacute;vision ID, 01 pour Mercury 1 (60 MHz), 03 pour Mercury 2 (66
MHz), Neptune (90 MHz) si 10 et plus.
</itemize>
<p>
---------------------------------------
<p>
Pour r&eacute;cup&eacute;rer les fichiers permettant de reprogrammer un BIOS de carte
Plato :<p>
ftp.ibp.fr:/pub/linux/packages/GCC/plato.tar.gz

<p>
Un newsgroup nomm&eacute; alt.comp.periphs.mainboard.asus traite du cas des cartes
m&egrave;res ASUS.
<p>
<sect> Note du traducteur
<p>
Note destin&eacute;e aux utilisateurs de Linux r&eacute;sidant en France :
Une conf&eacute;rence r&eacute;partie sur de nombreux BBS fran&ccedil;ais traite de Linux.
Elle est reli&eacute;e au newsgroup Usenet <sq>fr.comp.os.linux</sq>.

Divers sites publics proposent fichiers et informations utiles.
Connexion par modem/r&eacute;seau t&eacute;l&eacute;phonique commut&eacute;, sans parit&eacute;, 8 bits de
donn&eacute;es et 1 bit de stop&nbsp;:

<verb>
brasil       (1)  44 67 08 44       Bulletin Board System
bbs-fdn      (1)  48 89 58 59       Site Linux et uucp anonyme de
                                    l'association FDN. Login guest,
                                    ou nuucp sans mot de passe.
remcomp      (1)  40 22 90 93       Site uucp anonyme.
             (1)  42 47 06 11       Login: nuucp, pas de mot de
                                    passe. Liste des fichiers dans
                                    ~/catalogue.gz
renux        (1)  42 37 78 92       Site Linux ou uucp anonyme.
                                    Liste des fichiers dans:
                                    /mirror/catalogue.zip
shagshag     (1)  40 30 04 68       Site Linux
fasterix    (1)  47 07 32 34        fichiers /gnu et /vrac
magix        (1)  45 21 02 52
paoux        (1)  60 82 29 34       Site Linux ou uucp anonyme
spia         (16) 47 42 56 25       Site Linux
stdin BBS    (16) 72 34 54 37       Bulletin Board System
Le Lien      (16) 72 08 98 79       Bulletin Board System
Suptel Nancy (16) 83 53 16 17       Bulletin Board System
             (16) 83 53 20 21
cafard naum  (16) 51 70 16 32      Bulletin Board System
             (16) 51 70 16 34      Site Linux  ou uucp anonyme.

Serveurs ftp :
ftp.ibp.fr         132.227.60.2     /pub/linux : miroir de tsx-11.mit.edu.
ftp.fdn.org        193.55.4.75      /pub/Linux
ftp.loria.fr       152.81.10.10     /pub/linux
ftp.univ-angers.fr 193.49.144.1     /pub/Linux

Voir aussi :
fgb1.fgb.mw.tu-muenchen.de     129.187.200.1    /pub/linux
ftp.denet.dk                   129.142.6.74     /pub/OS/linux
ftp.dfv.rwth-aachen.de         137.226.4.105    /pub/linux
ftp.ibr.cs.tu-bs.de            134.169.34.15    /pub/os/linux
ftp.informatik.rwth-aachen.de  137.226.112.172  /pub/Linux
ftp.informatik.tu-muenchen.de  131.159.0.110    /pub/Linux
ftp.mcc.ac.uk                  130.88.203.12    /pub/linux
ftp.stack.urc.tue.nl           131.155.2.71     /pub/linux
ftp.win.tue.nl                 131.155.70.100   /pub/linux
nic.funet.fi                   128.214.6.100    /pub/OS/Linux
src.doc.ic.ac.uk               146.169.2.1      /packages/linux
</verb>

<sect> Copyright/avertissement l&eacute;gal
<p>
&copy; Copyright 1993, 94 by Michael Will (michaelw@student.uni-tuebingen.de) - r&eacute;serv&eacute; aux usages non commerciaux.
La licence GPL (Gnu Public License) s'applique. Si vous ne pouvez pas obtenir
une copie de la GPL, je serais heureux de vous en envoyer une.

Si vous vendez ce HOWTO sur un CD ou dans un livre je serais heureux d'en
obtenir un exemplaire pour r&eacute;f&eacute;rence.

(Michael.Will@student.uni-tuebingen.de)

Vous pouvez me contacter par courrier &eacute;lectronique ou bien au +49-7071-969063.

La reproduction de la pr&eacute;sente traduction ne n&eacute;cessite
pas l'autorisation de ses traducteurs : Nat (nat@nataa.frmug.fr.net) et
Olivier (olivier.chretien@atd.fdn.fr).

Les marques cit&eacute;es restent la propri&eacute;t&eacute; de leurs possesseurs.
Les informations fournies ne sont assorties d'aucune garantie.
</article>
