<!doctype linuxdoc system>

<article>

<title>Le Linux Printing Usage HOWTO
<author>Mark Komarinski, <tt/markk@auratek.com/
<date>v1.2.1, 24 Mars 1997
<abstract>
Ce document est une aide &agrave; l'impression sous Linux et fournissant des informations pratiques sur des sujets de base.
Toute remarque ou commentaire concernant ce HOWTO ou sa traduction peuvent &ecirc;tre envoy&eacute;es &agrave; la personne concern&eacute;e.
</abstract>
 
<toc>

<sect>Introduction
<p>
Ce document d&eacute;crit comment utiliser le syst&egrave;me de gestion d'impression  fourni avec le syst&egrave;me d'exploitation Linux. Ce HOWTO vient en compl&eacute;ment du HOWTO
Comment imprimer sous Linux (Linux Printing Setup HOWTO) qui traite de l'installation et de la configuration du syst&egrave;me d'impression sous Linux. Le contenu de ce HOWTO devrait &ecirc;tre d'une &eacute;gale utilit&eacute; pour toutes les d&eacute;clinaisons du syst&egrave;me d'exploitation BSD en plus du syst&egrave;me d'exploitation Linux.
<p>

<sect1>Historique du Printing HOWTO
<p>
Note de Mark Komarinski <tt/markk@auratek.com/ :
<p>
Je voudrais remercier Matt Foster pour son imposant travail de r&eacute;&eacute;criture de ce HOWTO. Je conserve son style et je proc&egrave;de &agrave; des ajouts pour garder le tout &agrave; jour.
<p>
Note de Matt Foster <tt/mwf@engr.uark.edu/ :
<p>
Cette version du Linux Printing HOWTO est une compl&egrave;te r&eacute;&eacute;criture de l'original &eacute;crit par Grant Taylor <tt/grant@god.tufts.edu/ et Brian McCauley <tt/B.A.McCauley@bham.ac.uk/. J'ai essay&eacute; de conserver le contenu pr&eacute;sent dans le HOWTO de Grant et de Brian mais j'ai fortement modifi&eacute; le style de pr&eacute;sentation et la profondeur des notions abord&eacute;es. Je trouve que cela rend le HOWTO plus complet et plus facile &agrave; lire. J'esp&egrave;re seulement que vous en serez d'accord.
<p>

<sect1>Historique des versions
<p>
<itemize>
<item>v1.2.1
<itemize>
<item>mise &agrave; jour, quelques changements pour la publication Dr. Linux
</itemize>
<item>v1.2
<itemize>
<item>Imprimantes Windows
<item>Changement de la taille maximale des fichiers d'impression
</itemize>
<item>v1.11
<itemize>
<item>Nouveau responsable
<item>Ajout d'information sur lpc
<item>Ajout d'information sur le d&eacute;pannage
<item>Des notions sur l'impression de fichiers graphiques
</itemize>
<item>v1.1
<itemize>
<item>R&eacute;vision du vocabulaire utilis&eacute;
<item>Etoffement de la section sur l'impression PostScript
<item>Tentative de clarification des exemples
<item>Compl&eacute;ments sur les utilitaires basiques d'impression sous Linux
</itemize>
<item>v1.0
<itemize>
<item>Publication initiale du Printing Usage HOWTO
</itemize>
</itemize>
<p>

<sect1>Copyrights et Marques d&eacute;pos&eacute;es
<p>
Certains des noms mentionn&eacute;s dans ce HOWTO font l'objet de copyrights et/ou de marques d&eacute;pos&eacute;es par certaines personnes et/ou compagnies. Ces noms apparaissent enti&egrave;rement en majuscules ou d&eacute;butent par une majuscule dans ce HOWTO.

<p>
(c) 1995 Matt Foster (<tt/mwf@engr.uark.edu/)
<p>
(c) 1996-1997 Mark F. Komarinski (<tt/markk@auratek.com/)

<p>
Toutes les traductions, les travaux d&eacute;riv&eacute;s ou de compilation incorporant n'importe lequel des documents HOWTO Linux
doivent se trouver sous le coup de ce copyright.

<p>Ainsi, vous ne pouvez pas produire un travail d&eacute;riv&eacute; d'un HOWTO et imposer des restrictions additionnelles quant &agrave; sa diffusion. Des exceptions &agrave; ces r&egrave;gles peuvent &ecirc;tre accord&eacute;es sous certaines conditions ; veuillez contacter le coordinateur des HOWTO Linux &agrave; l'adresse donn&eacute;e plus bas.

<p>En r&eacute;sum&eacute;, nous voulons promouvoir la diss&eacute;mination de ces informations &agrave; travers autant de canaux que possible. Cependant, nous souhaitons tout de m&ecirc;me conserver le copyright sur les documents HOWTO et souhaiterions &ecirc;tre mis au courant de tous les projets de redistribution des HOWTO.

<p>Si vous avez des questions, veuillez contacter Greg Hankins, le coordinateur des HOWTO Linux, &agrave; <tt/gregh@sunsite.unc.edu/. Vous pouvez utiliser finger sur cette adresse pour obtenir un num&eacute;ro de t&eacute;l&eacute;phone et d'autres informations pour la prise de contact.

<sect1>T&eacute;l&eacute;charger les HOWTOs Linux sur l'impression
<p>
Dans le cas o&ugrave; vous voudriez imprimer une version de ce HOWTO, je vous recommande de t&eacute;l&eacute;charger la version PostScript. Elle est format&eacute;e d'une mani&egrave;re qui la rend esth&eacute;tiquement plus attrayante et plus facile &agrave; lire. Vous pouvez obtenir la version PostScript depuis l'un des nombreux sites de distribution Linux tel que SunSITE (ou ftp.ibp.fr en France NdT).

<sect1>Comment nous contacter
<p>
Les questions, commentaires ou corrections concernant ce HOWTO peuvent &ecirc;tre envoy&eacute;s &agrave; <tt/ markk@auratek.com/.

<sect1>Remerciements
<p>
Un grand merci &agrave; tous ceux qui ont pris le temps de lire la version alpha de ce HOWTO et de me r&eacute;pondre avec de nombreux commentaires et suggestions dont certains pourront &ecirc;tre reconnus dans cette version.
<p>
Je voudrais aussi remercier Matt Foster qui a effectu&eacute; la r&eacute;&eacute;criture originale.

<sect>Imprimer sous Linux
<p>
Cette section d&eacute;crit comment imprimer des fichiers, examiner la file d'impression, supprimer des travaux de la file d'impression, formater des fichiers avant de les imprimer ainsi que comment configurer votre environnement d'impression.

<sect1>Historique de l'impression sous Linux
<p>
Le syst&egrave;me d'impression de Linux, le gestionnaire lp, est un portage du code source &eacute;crit par the Regents of the University of California pour la version BSD du syst&egrave;me d'exploitation UNIX.

<sect1>Imprimer un fichier en utilisant lpr
<p>
La mani&egrave;re la plus simple, et de loin, d'imprimer un fichier sous le syst&egrave;me d'exploitation Linux est de l'envoyer directement sur le p&eacute;riph&eacute;rique d'impression. Une fa&ccedil;on de le faire est d'utiliser la commande cat. En tant qu'utilisateur root, on peut faire quelque chose du genre :
<tscreen><code>
# cat thesis.txt > /dev/lp
</code></tscreen>

<p>
Dans le cas pr&eacute;sent, /dev/lp est un lien symbolique vers le p&eacute;riph&eacute;rique d'impression r&eacute;el, que ce soit une imprimante matricielle ou laser, un
logiciel de mise en page ou un traceur. (Cf ln(1) pour plus d'information sur les liens symboliques.)

<p>
Pour des raisons de s&eacute;curit&eacute;, seulement l'utilisateur root et les utilisateurs dans le m&ecirc;me groupe que le d&eacute;mon d'impression sont autoris&eacute;s &agrave; &eacute;crire directement sur l'imprimante. C'est pourquoi des commandes telles que lpr, lprm et lpq doivent &ecirc;tre utilis&eacute;es pour acc&eacute;der &agrave; l'imprimante.

<p>
De ce fait, les utilisateurs doivent utiliser lpr pour imprimer un fichier. La commande lpr prend en charge tout le travail initial n&eacute;cessaire &agrave; l'impression du fichier puis passe le contr&ocirc;le &agrave; un autre programme, lpd, le d&eacute;mon d'impression. Celui-ci dit alors &agrave; l'imprimante comment imprimer le fichier.

<p>
Quand lpr est ex&eacute;cut&eacute;, il commence par copier le fichier sp&eacute;cifi&eacute; vers un r&eacute;pertoire particulier (le r&eacute;pertoire spool) où le fichier demeure jusqu'&agrave; ce que lpd l'ait imprim&eacute;. Une fois que lpd est pr&eacute;venu de l'existence d'un fichier &agrave; imprimer, il va produire une copie de lui-m&ecirc;me (ce que nous programmeurs appelons forking). Cette copie imprimera alors notre fichier alors que l'original attend d'autres requ&ecirc;tes d'impression. Cela permet &agrave; de multiples travaux d'&ecirc;tre int&eacute;gr&eacute;s &agrave; la queue au m&ecirc;me instant.

<p>
La syntaxe de lpr(1) est tr&egrave;s famili&egrave;re :
<tscreen><code>
$ lpr [ options ] [ nom_du_fichier ... ]
</code></tscreen>

<p>
Si un nom de fichier n'est pas sp&eacute;cifi&eacute;, lpr attend une entr&eacute;e en provenance de l'entr&eacute;e standard (g&eacute;n&eacute;ralement le clavier ou le r&eacute;sultat d'un autre programme). Cela permet &agrave; l'utilisateur de rediriger la sortie d'une commande vers le gestionnaire d'impression.
Ainsi :
<tscreen><code>
$ cat thesis.txt | lpr
</code></tscreen>
ou
<tscreen><code>
$ pr -l60 thesis.txt | lpr
</code></tscreen>

<p>
La commande lpr accepte de nombreux arguments sur la ligne de commande qui permettent &agrave; l'utilisateur de contr&ocirc;ler son fonctionnement. Certains de ces arguments les plus utilis&eacute;s sont :
<itemize>
<item>-Pprinter pour sp&eacute;cifier l'imprimante &agrave; utiliser
<item>-s pour cr&eacute;er un lien symbolique plut&ocirc;t que de copier le fichier dans le r&eacute;pertoire d'impression (utile pour de gros fichiers)
<item>-&num;num pour sp&eacute;cifier le nombre de copies &agrave; imprimer
</itemize>
Un exemple d'utilisation de lpr pourrait &ecirc;tre du genre :
<tscreen><code>
$ lpr -#2 -sP dj thesis.txt
</code></tscreen>
Cette commande cr&eacute;era un lien symbolique vers le fichier thesis.txt dans le r&eacute;pertoire spool pour l'imprimante appel&eacute;e dj, où il sera trait&eacute; par lpd. Il imprimera alors une seconde copie de thesis.txt.

<p>
Pour une liste de toutes les options que lpr reconna&icirc;tra, voyez lpr(1).


<sect1>Voir la file d'impression avec lpq
<p>
Pour voir le contenu de la file d'impression, utilisez la commande lpq. Employ&eacute;e sans arguments, elle renvoie le contenu de la file d'impression de l'imprimante par d&eacute;faut.

<p>La sortie retourn&eacute;e par lpq peut &ecirc;tre utile &agrave; plus d'un titre.
<tscreen><code>
$ lpq
lp is ready and printing
Rank   Owner      Job  Files                            Total Size
active mwf        31   thesis.txt                       682048 bytes
</code></tscreen>

<sect1>Annuler un travail d'impression en utilisant lprm
<p>
Une autre fonctionnalit&eacute; utile de tout syst&egrave;me d'impression est la possibilit&eacute; d'annuler un travail qui a &eacute;t&eacute; pr&eacute;alablement envoy&eacute; dans la file. Pour ce faire, utilisez lprm.
<tscreen><code>
$ lprm -
</code></tscreen>
<p>
La commande ci-dessus annule tous les travaux d'impression qui appartiennent &agrave; l'utilisateur qui a employ&eacute; la commande. Un travail d'impression en particulier peut &ecirc;tre annul&eacute; en se munissant en premier lieu du num&eacute;ro de travail tel que mentionn&eacute; par lpq puis en donnant ce num&eacute;ro &agrave; lprm. Par exemple :
<tscreen><code>
$ lprm 31
</code></tscreen>
annulerait le travail 31 (thesis.txt) de l'imprimante par d&eacute;faut.

<sect1>Contr&ocirc;ler le programme lpd avec lpc.
<p>
Le programme lpc(8) est utilis&eacute; pour contr&ocirc;ler les imprimantes que lpd dessert. Vous pouvez activer ou d&eacute;sactiver une imprimante ou ses files d'impression, r&eacute;organiser les travaux &agrave; l'int&eacute;rieur d'une file, et obtenir un rapport d'&eacute;tat sur les imprimantes ou leurs files. Lpc est le plus
souvent utilis&eacute; dans une configuration o&ugrave; de multiples imprimantes sont raccord&eacute;es &agrave; la m&ecirc;me machine.
<tscreen><code>
$ lpc
</code></tscreen>

<p>
La commande ci-dessus lancera le programme lpc. Par d&eacute;faut, vous entrez alors en mode interactif et vous pouvez commencer &agrave; envoyer des commandes. L'autre option est d'employer une commande lpc sur la ligne de commande.
<tscreen><code>
$ lpc status all
</code></tscreen>

<p>
Une liste de toutes les commandes disponibles se trouve dans les pages man de lpd mais voici quelques unes des
commandes majeures dont vous allez avoir besoin. Toutes les commandes
o&ugrave; figure option acceptent soit un nom d'imprimante particulier (lp, print, etc) ou le mot-cl&eacute; all qui d&eacute;signe toutes les imprimantes.
<itemize>
<item> disable option - emp&ecirc;che l'entr&eacute;e de tout nouveau travail d'impression
<item> down option - d&eacute;sactive toute impression sur l'imprimante
<item> enable option - autorise de nouveaux travaux &agrave; int&eacute;grer la file d'impression
<item> quit (ou exit) - quitte lpc
<item> restart option - relance lpd pour cette imprimante
<item> status option - imprime l'&eacute;tat de l'imprimante
<item> up option - autorise tout et lance un nouveau lpd
</itemize>

<sect1>Le programme printtool sous RedHat.
<p>
Juste quelques mots sur l'&eacute;tonnant programme printtool de RedHat. Il semble &ecirc;tre en mesure de faire tout ce qu'un filtre magique ferait. RedHat installe d&eacute;j&agrave; la plupart des programmes n&eacute;cessaires au filtrage. Voici comment j'ai configur&eacute; mon imprimante  sous RH 4.0 avec une HP LJ 4L connect&eacute;e &agrave; mon port parall&egrave;le.
<itemize>
<item>Devenez root et lancez printtool (si vous avez utilis&eacute; su, vous vous &ecirc;tes rappel&eacute; de faire SETENV DISPLAY :0.0 et xhost +, n'est-ce pas ?)
<item>Cliquez sur Add et appuyez sur OK pour une imprimante locale
<item>Remplissez l'information sur le p&eacute;riph&eacute;rique d'impression (/dev/lp1 pour moi)
<item>Compl&eacute;tez le filtre d'entr&eacute;e : s&eacute;lectionnez un type d'imprimante, une r&eacute;solution, et la taille du papier (ljet4, 300x300 et letter)
<item>Appuyez sur OK jusqu'&agrave; revenir au point de d&eacute;part et relancez lpd.
</itemize>
<p>
Comme si vous remplissiez un fichier /etc/printcap &agrave; la main, vous pouvez avoir de multiples d&eacute;finitions d'imprimante pour chacune de vos imprimantes r&eacute;elles. Une pour chaque taille de papier, pour les diff&eacute;rentes r&eacute;solutions, etc.

<sect>Imprimer des fichiers
<p>
Cette section de l'impression des types de fichiers que vous allez rencontrer dans une configuration Linux.

<sect1>Impression des fichiers graphiques
<p>
L'impression de fichiers graphiques sur une imprimante d&eacute;pend g&eacute;n&eacute;ralement du type de graphiques que vous utilisez et du type d'imprimante sur lequel vous voulez imprimer. Les imprimantes matricielles sont hors de question du fait de
leurs diff&eacute;rences de traitement des graphismes. La meilleure chose &agrave; faire dans cette situation est de voir si votre imprimante est compatible avec une Epson ou une IBM ProPrinter et d'alors convertir le fichier graphique en PostScript avant d'utiliser Ghostscript (voir la section suivante) pour l'impression du
graphisme.

<p>
Si vous avez une imprimante laser, les choses sont plus simples car nombre d'entre elles sont compatibles avec PCL. Cela vous donne alors plusieurs alternatives. Certains programmes peuvent fournir une sortie directement en PCL. Si ce n'est pas le cas, des programmes tels que NetPBM peuvent convertir vers PCL. La derni&egrave;re possibilit&eacute; est d'utiliser ghostscript (voir section suivante).

<p>
Votre meilleure possibilit&eacute; consiste &agrave; installer des packages tels que NetPBM et Ghostscript puis d'installer un filtre magique qui traitera les fichiers graphiques automagiquement.

<sect1>Impression des fichiers PostScript
<p>
Imprimer des fichiers PostScript sur uen imprimante qui dispose d'un interpr&eacute;teur PostScript est simple : il suffit d'utiliser lpr et l'imprimante s'occupera des d&eacute;tails pour vous. Pour ceux parmi nous qui ne disposent pas d'imprimantes poss&eacute;dant des fonctionnalit&eacute;s PostScript, nous devons faire appel &agrave; d'autres moyens. Heureusement, il y a des programmes disponibles &agrave; m&ecirc;me de comprendre PostScript et de le traduire en un langage que la plupart des imprimantes comprendront. Ghostscript est probablement le plus connu des programmes de ce type.

<p>
La responsabilit&eacute; de Ghostscript est de convertir toutes les descriptions d'un fichier PostScript en des commandes que l'imprimante comprendra. Pour imprimer un fichier PostScript en utilisant Ghostscript, vous pourriez faire quelque chose du genre :
<tscreen><code>
$ gs -dSAFER -dNOPAUSE -sDEVICE=deskjet -sOutputFile=\|lpr thesis.ps
</code></tscreen>

<p>
Remarquez que dans l'exemple ci-dessus, on envoie par le tube la sortie de Ghostscript vers la commande lpr en utilisant l'option -sOutputFile.

<p>
Ghsostview est une interface de Ghostscript pour le syst&egrave;me X Window. Il vous permet de pr&eacute;visualiser un fichier PostScript avant de l'imprimer. Ghostview et Ghostscript peuvent tous deux &ecirc;tre t&eacute;l&eacute;charg&eacute;s de SunSITE par exemple.

<sect1>Impression des fichiers PDF
<p>
Adobe a diffus&eacute; un lecteur Acrobat pour Linux et il est disponible sur la home page d'Adobe. Son pr&eacute;d&eacute;cesseur, xpdf, est aussi disponible. Tous deux devraient imprimer sur un p&eacute;riph&eacute;rique PostScript.

<sect1>Impression des fichiers TeX
<p>
Une des mani&egrave;res les plus faciles d'imprimer des fichiers TeX est de les convertir en PostScript puis de les imprimer par l'interm&eacute;diaire de Ghostscript. Pour ce faire, vous devez d'abord les covertir en DVI (pour DeVice Independent). Vous pouvez le faire avec la commande tex(1). Ensuite vous convertissez le fichier DVI en PostScript avec dvips. Tout ceci ressemblera &agrave; ce qui suit une fois tap&eacute; :
<tscreen><code>
$ tex thesis.tex
$ dvips thesis.dvi
</code></tscreen>
<p>
Maintenant, vous &ecirc;tes pr&ecirc;t &agrave; imprimer le fichier PostScript r&eacute;sultant en suivant les indications &eacute;crites plus haut.

<sect1>Impression des fichiers format&eacute;s apr&egrave;s troff
<p>
<tscreen><code>
$ groff -Tascii thesis.tr | lpr
</code></tscreen>
ou, si vous pr&eacute;f&eacute;rez :
<tscreen><code>
$ groff thesis.tr > thesis.ps
</code></tscreen>
suivi de l'impression du fichier PostScript comme indiqu&eacute; ci-dessus.

<sect1>Impression des pages man
<p>
<tscreen><code>
$ man man | col -b | lpr
</code></tscreen>

<p>
Les pages man contiennent des donn&eacute;es pr&eacute;dormat&eacute;es par troff, c'est pourquoi nous devons enlever toute surbrillance ou soulignement, etc. Le programme col fait cela tr&egrave;s bien et comme nous envoyons les donn&eacute;es par le tube, le programme man n'utilisera pas more.

<sect>Divers
<p>
Cette section couvre les sujets qui n'avaient pas leur place ailleurs.

<sect1>Formatage avant impression
<p>
Comme la plupart des fichiers ASCII ne sont pas format&eacute;s pour l'impression, il est utile de les formater pr&eacute;alablement d'une fa&ccedil;on ou d'une autre avant de les imprimer pour de bon. On peut, par exemple, mettre un titre et des num&eacute;ros de page, r&eacute;gler les marges, les espacements, l'indentation ou l'imprimer dans plusieurs colonnes. Une mani&egrave;re courante de faire cela est d'utiliser un pr&eacute;processeur d'impression tel que pr.
<tscreen><code>
$ pr +4 -d -h&quot;Ph.D. Thesis, 2nd Draft&quot; -l60 thesis.txt | lpr
</code></tscreen>
<p>
Dans l'exemple ci-dessus, pr prendrait le fichier thesis.txt, en sauterait les trois premi&egrave;res pages (+4), r&eacute;glerait la longueur des pages &agrave; soixante lignes (-l60), introduirait un double espacement (-d) et ajouterait la phrase &quot;Ph.D. Thesis, 2nd Draft&quot; en haut de chaque page (-h). Lpr enverrait alors dans la file d'impression la sortie de pr. Pour plus d'informations sur pr, voir sa page man.

<sect1>Les variables d'environnement PRINTER
<p>
Toutes ces commandes du syst&egrave;me d'impression de Linux acceptent l'option -P. cette option permet &agrave; l'utilisateur de sp&eacute;cifier quelle imprimante utiliser pour la sortie. Si l'utilisateur ne sp&eacute;cifie l'imprimante &agrave; utiliser, l'imprimante par d&eacute;faut sera alors utilis&eacute;e comme p&eacute;riph&eacute;rique de sortie.

<p>
Plut&ocirc;t que d'avoir &agrave; sp&eacute;cifier l'imprimante &agrave; utiliser &agrave; chaque fois que vous imprimez, vous pouvez affecter &agrave; la variable d'environnement PRINTER le nom de l'imprimante que vous voulez utiliser. Cela se fait de diff&eacute;rentes mani&egrave;res selon le shell utilis&eacute;. Ainsi pour bash :
<tscreen><code>
$ PRINTER=&quot;printer_name&quot;; export PRINTER
</code></tscreen>
et pour csh, cela donne :
<tscreen><code>
% setenv PRINTER &quot;printer_name&quot;
</code></tscreen>

<p>
Ces commandes peuvent &ecirc;tre plac&eacute;es dans vos scripts de connexion (.profile pour bash, .cshrc pour csh) ou tap&eacute;es sur la ligne de commande. Cf bash(1) et csh(1) pour plus d'informations sur les variables d'environnement.


<sect>Foire Aux Questions
<p>
Q1. Comment &eacute;viter l'effet marche d'escalier ?
<p>
R1. L'effet marche d'escalier est d&ucirc; &agrave; la fa&ccedil;on dont certaines imprimantes attendent les fins de ligne. Certaines imprimantes veulent des lignes termin&eacute;es par une s&eacute;quence retour chariot/fin de ligne (comme sous DOS) plut&ocirc;t que la s&eacute;quence fin de ligne utilis&eacute;e par les syst&egrave;mes type UNIX. La mani&egrave;re la plus simple de r&eacute;gler ce probl&egrave;me est de voir si votre imprimante est en mesure de basculer d'un mode &agrave; l'autre, que ce soit par la manipulation d'un interrupteur DIP ou en envoyant une s&eacute;quence d'&eacute;chappement au d&eacute;but de chaque travail d'impression. Dans le dernier cas, vous pouvez utiliser un filtre magique voir Q2).
<p>
Une solution rapide est d'utiliser un filtre sur la ligne de commande comme dans :
<tscreen><code>
$ cat thesis.txt | todos | lpr
</code></tscreen>

<p>
Q2. Qu'est-ce qu'un filtre ?
<p>
R2. Un filtre est un programme qui lit l'entr&eacute;e standard (stdin), traite d'une certaine mani&egrave;re cette entr&eacute;e et &eacute;crit sur la sortie standard (stdout). Les filtres sont utilis&eacute;s dans de nombreux cas tels que le traitement de textes.

<p>
Q3. Qu'est-ce qu'un filtre magique ?
<p>
R3. Un filtre magique est un filtre qui r&eacute;alise un traitement en fonction du type de fichier. Par exemple, si le fichier est un fichier texte simple, il l'imprimera en utilisant les m&eacute;thodes traditionnelles. Si c'est un fichier PostScript, ou d'un autre format, il l'imprimera en utilisant une autre m&eacute;thode (ghostscript). Deux exemples en sont magicfilter et APSfilter. Une limitation de ce style de programme est que les programmes appropri&eacute;s doivent &ecirc;tre install&eacute;s avant l'installation du filtre.
<p>
La raison en est que quand magicfilter s'installe, il recherche dans votre syst&egrave;me des programmes sp&eacute;cifiques (comme ghostscript qui, s'il le trouve, lui permettra de traiter les fichier PostScript) et se construit alors sur la base du r&eacute;sultat de ses recherches. Pour pouvoir traiter tous les fichiers &agrave; imprimer, vous devrez probablement avoir install&eacute; l'un de ces programmes :
<itemize>
<item> GhostScript
<item> TeX
<item> NetPBM
<item> jpeg utilities
<item> gzip
</itemize>

<p>
Q4. Qu'en est-il du Windows Printing System ? Marchera-t-il sous Linux ?
<p>
R4. Peut-&ecirc;tre. Les imprimantes qui n'acceptent que les commandes WPS ne marcheront pas sous Linux. Les imprimantes qui acceptent les commandes WPS et d'autres commandes (comme la Canon BJC 610) fonctionneront du moment qu'elles auront &eacute;t&eacute; configur&eacute;es en un mode autre que WPS. D'autres imprimantes, telles que certaines HP DeskJet 820Cxi/Cse, ne fonctionneront pas sous Linux. Cela dit, on peut utiliser Linux comme serveur d'impression pour des machines sous Win95 (cf Samba) puisque Win95 dispose de pilotes pour ces imprimantes.

<p>
Q5. Qu'est-ce donc que ce syst&egrave;me de pacotille ? Je ne peux pas imprimer plus de 6 pages sans obtenir un message d'erreur &quot;fichier trop gros&quot; (&quot;file too large&quot;).
<p>
R5. Une des options du fichier /etc/printcap a rapport avec la taille maximale d'un fichier d'impression. Par d&eacute;faut, elle est de 1000 blocs disque (environ 500k?). Pour les fichiers PostScript ou assimil&eacute;s, cela vous autorise 6 &agrave; 8 pages avec des graphismes. Assurez vous d'avoir ajout&eacute; la ligne suivante dans la d&eacute;finition de l'imprimante:
		mx=0
<p>
La principale raison de cet &eacute;tat de fait est d'essayer d'emp&ecirc;cher le remplissage du r&eacute;pertoire spool. Il y a une autre mani&egrave;re d'y rem&eacute;dier, en for&ccedil;ant lpr &agrave; cr&eacute;er un lien symbolique du r&eacute;pertoire spool vers le fichier &agrave; imprimer. Mais vous devez vous rappeler d'ajouter l'option -s &agrave; lpr &agrave; chaque fois.
 

<sect>D&eacute;pannage
<p>
Cette section d&eacute;taille quelques uns des probl&egrave;mes les plus communs en mati&egrave;re d'impression.
<p>
Si votre imprimante ne fonctionne pas:
<itemize>
<item>les autres travaux d'impression fonctionnent-ils? (probl&egrave;me avec l'application?)
<item>lpd est-il lanc&eacute;? (le v&eacute;rifier en utilisant lpc) (gestionnaire d'impression?)
<item>L'utilisateur root peut-il &eacute;crire directement sur l'imprimante? (services d'impression?)
<item>Pouvez-vous imprimer sous DOS? (probl&egrave;me de connexion ou d'imprimante?)
</itemize>
<p>
R&eacute;pondre &agrave; ces questions pourrait vous fournir une solution.
<p>
Envoyez vos suggestions pour cette rubrique &agrave; <tt/markk@auratek.com/.

<sect>R&eacute;f&eacute;rences
<p>
Ici prennent placent les r&eacute;f&eacute;rences aux documents sur le syst&egrave;me d'impression sous Linux. J'ai essay&eacute; de garder cette rubrique aussi pointue que possible. Si vous trouvez que j'ai oubli&eacute; un document d'importance, n'h&eacute;sitez pas &agrave; me contacter.

<p>
Avant de poster votre question sur un newsgroup d'USENET, assurez vous des choses suivantes:
<itemize>
<item>L'imprimante accepte-t-elle des travaux d'impression? (Lancez lpc(8) pour en avoir le coeur net)
<item>La r&eacute;ponse &agrave; votre question figure-t-elle dans le HOWTO sur l'impression de Grant Taylor?
</itemize>

<p>
Si la r&eacute;ponse &agrave; l'une des questions ci-dessus est oui, r&eacute;f&eacute;lchissez &agrave; deux fois avant de poster votre question. Et si finalement vous la postez, assayez d'y inclure des informations pertinentes. N'&eacute;crivez pas quelque chose du genre &quot;J'ai des probl&egrave;mes avec lpr, aidez-moi.&quot; Ce type de message sera tout simplement ignor&eacute; par la majorit&eacute; des personnes. Pensez &eacute;galement &agrave; inclure la version du noyau que vous utilisez, comment l'erreur est apparue ainsi que les &eacute;ventuels messages d'erreur fournis par le syst&egrave;me.

<p>
Pages de manuel
<itemize>
<item>cat(1) concat&eacute;nation et impression de fichiers
<item>dvips(1) convertisseur de fichiers DVI TeX en PostScript
<item>ghostview(1) visualisation de documents PostScript &agrave; l'aide de Ghostscript
<item>groff(1) interface pour le syst&egrave;me de formatage de document groff
<item>gs(1) interpr&eacute;teur/visualisateur Ghostscript
<item>lpc(8) programme de contr&ocirc;le d'impression
<item>lpd(8) d&eacute;mon d'impression
<item>lpq(1) programme de visualisation de la file d'impression
<item>lpr(1) imprimante hors-ligne
<item>lprm(1) effacement de travaux d'impression de la file 
<item>pr(1) formatage des fichiers textes pour l'impression
<item>tex(1) composition et formatage de texte
</itemize>


Newsgroups d'USENET
<itemize>
<item>comp.os.linux.* une pl&eacute;thore d'informations sur Linux
<item>comp.unix.* groupe de discussion en rapport avec le syst&egrave;me d'exploitation UNIX
</itemize>

</article>
