<!doctype linuxdoc system>

<!-- Ultra-DMA Mini Howto french traduction SGML source -->
<!-- Version 2.0, 7/08/98 -->
<!-- by Brion Vibber -->
  
<article>

<title> Le Linux Ultra-DMA Mini Howto
<author>Brion Vibber, <tt><htmlurl url="mailto:brion@pobox.com"
name="brion@pobox.com">
-- traduction : 
Maxime Baudin <htmlurl url="mailto:mbaudin@club-internet.fr" name="mbaudin@club-internet.fr"></tt>
<date>v2.0, 7 Ao&ucirc;t 1998

<abstract>
Ce document est destin&eacute; &agrave; expliquer comment utiliser des disques et des 
 interfaces UltraDMA (aussi connus sous le nom de Ultra-ATA ou bien Ultra-33)
 sous linux. La version la plus r&eacute;cente de ce document peut &ecirc;tre
 trouv&eacute;e,en version originale, &agrave; l'adresse suivante :
<htmlurl url="http://pobox.com/~brion/linux/Ultra-DMA.html"
name="http://pobox.com/~brion/linux/Ultra-DMA.html">. Et en version
fran&ccedil;aise &agrave; : 
<htmlurl url="http://www.freenix.org/linux/mini/Ultra-DMA.html"
name="http://www.freenix.org/linux/mini/Ultra-DMA.html">.
</abstract>

<toc>
<sect>Introduction<label id="main-intro">
<p>

Ce document est destin&eacute; &agrave; expliquer comment utiliser des disques et des 
interfaces UltraDMA (aussi connus sous le nom de Ultra-ATA ou bien Ultra-33) 
sous Linux. Dans certains cas, vous n'aurez aucun probl&egrave;me pour exploiter ce 
type de mat&eacute;riel, mais quelques conseils permettront d'accro&icirc;tre ses 
performances. Dans d'autres cas vous devrez faire d'&eacute;normes efforts 
simplement pour acc&eacute;der &agrave; vos disques.

<sect1>Mise en garde<label id="mise en garde">
<p>

Les informations contenues dans ce document sont (autant que je sache) correctes
 et devraient fonctionner. Toutefois, il peut y avoir des erreurs de frappe, de 
 myst&eacute;rieuses erreurs de transmission, ou bien des
 incompatibilit&eacute;s dans votre syst&egrave;me qui rendront inefficaces les techniques
 d&eacute;crites dans ce document. Alors avant de &quot;faire le malin&quot; avec vos disques : 
 FAITES DES SAUVEGARDES DE VOS DONN&Eacute;ES VITALES !!! Si vous ne faites pas de
 sauvegardes r&eacute;guli&egrave;res, il serait temps de commencer pour plus de s&eacute;curit&eacute;.

<sect1>Remerciements<label id="remerciements">
<p>

  <url name="Michel Aubry" url="mailto:giovanni@sudfr.com"> -
     patch permettant l'utilisation de l'UDMA sur les jeux de composants (chipsets) VIA et apparent&eacute;s 
     pour les noyaux &lt;=2.0.33
   &amp; d'autres infos, patch "grand unified UDMA" pour le 2.0.34 et +

 <url name="Andrew Balsa" url="mailto:andrebalsa@altern.org">
- Pour ses infos g&eacute;n&eacute;rales sur 
l'UDMA et le patch g&eacute;n&eacute;rique UDMA pour les jeux de composants (chipsets) INTEL TX, 
SiS et VP1

<url name="Maxime Baudin" url="mailto:mbaudin@club-internet.fr"> - Traduction fran&ccedil;aise

Bokonon - ``Contr&ocirc;leur'' contre ``interface''

John G (<htmlurl url="mailto:prefect@ipass.net" name="prefect@ipass.net">) 
- pour la cr&eacute;ation du patch VIA VP2 et pour les informations qu'il m'a 
donn&eacute;es

 <url name="John G." url="mailto:prefect@ipass.net">
- Patch pour l'UDMA et le VIA plus quelques informations

Martin Gaitan - pour la carte Promise ide0/ide1

  <url name="Andre M. Hedrick" url="mailto:hedrick@Astro.Dyer.Vanderbilt.Edu"> -
   Patch "Grand unified UDMA" pour le noyau 2.0.34+, Artop ATP850UF

Norman Jacobowitz - pour m'avoir donn&eacute; des infos sur le VIA3

John Levon - Info sur les jeux de composants TX Pro mobos

Peter Monta - Info sur l'utilisation de deux cartes Ultra33 

Masayoshi Nakano - Traduction Japonaise


<url name="Gadi Oxman" url="mailto:gadio@netvision.net.il">
- pour la cr&eacute;ation du patch pour la 
carte Promise Ultra33 et pour avoir trouv&eacute; les nombres magiques permettant 
un contournement logiciel du probl&egrave;me.

  Andy Pearce - Suggested adding info on the additional device files for hde-h

  <url name="Andrei Pitis" url="mailto:pink@roedu.net"> - LILO patch

  <url name="Brion Vibber" url="mailto:brion@pobox.com">
       - Ce document

<sect1>Historique de ce document<label id="historique de ce document">
<p>

V2.0, 7 Ao&ucirc;t 1998 : Grosses modifications et restructuration presque totale du document en
 deux parties : les interfaces int&eacute;gr&eacute;s aux cartes m&egrave;res et les cartes
 d'extensions. Ajout du patch "Grand Unified UDMA" (composantes du patch Jumbo) pour le noyau
 2.0.35. Les remerciements sont d&eacute;sormais dans l'ordre alphab&eacute;tique. Changement
 du mot "contr&ocirc;leur" par "interface" paraissant plus correct techniquement dans beaucoup de
 cas. Ajout d'info &agrave; propos de l'activation/d&eacute;sactivation
 de l'UDMA, de la liste noire et de bien d'autres choses.
  
v1.45, 6 Juillet 1998 : mise &agrave, jour - Red Hat 5.1 et un patch du noyau 2.0.34
 pour la carte Promise Ultra33. Patch de LILO permettant de d&eacute;marrer
 ind&eacute;pendamment des cartes contr&ocirc;leurs PCI telles que la carte Promise Ultra33.

v1.41, 3 Mai 1998 : Correction de quelques fautes, ajouts des traducteurs dans la
 section Remerciement.

v1.4, 28 Avril 1998 : Patch g&eacute;n&eacute;rique pour L'UDMA, plus quelques informations
 g&eacute;n&eacute;rale. Ajout de la section Copie et distribution.

v1.3, 5 Mars 1998 : infos sur le VIA VP3, de meilleures instructions pour les
 patchs, mise &agrave; jour des pointeurs pour patcher la carte Promise.

v1.2, 27 Janvier 1998 : Infos suppl&eacute;mentaires pour l'environnement de la carte Promise.

v1.1, 21 Janvier 1998 : Nouvelles infos sur le jeu de composant VIA, installation avec  
une Promise Ultra33 et validation des modes de transfert Bus Master et UDMA.

v1.0, 19 Janvier 1998 : Plus ou moins complet, premi&egrave;re version en SGML.

<sect1>Copies et distribution<label id="Copies et distribution">
<p>

Ce document peut &ecirc;tre copi&eacute; et distribu&eacute; sans restriction
 &agrave; titre d'information. 
Il ne doit pas &ecirc;tre modifi&eacute;, except&eacute; pour &ecirc;tre remis en page, sans la permission
 de l'auteur. Vous pouvez traduire ce document dans une autre langue, cependant il
 est conseill&eacute; de contacter l'auteur en premier lieu, de sorte que les mises &agrave;
 jour de ce document vous soient envoy&eacute;es en m&ecirc;me temps qu'au Linux Documentation
 Projet.

<sect>Qu'est ce que l'Ultra DMA et pourquoi l'utiliser<label id="main-UDMA">
<p>

Voici un rapide survol des diff&eacute;rentes technologies bas&eacute;es sur l'IDE.

<sect1>IDE, EIDE et ATAPI<label id="classique"
<p>

Ce sont les &quot;anciens&quot; standards. La plupart des disques et contr&ocirc;leurs non-SCSI
 que l'on trouve actuellement sont, d&eacute;sormais, au standard EIDE. Cependant
 les disques les plus r&eacute;cents sont au standard UDMA.

<sect1>Bus Master DMA<label id="Bus Master DMA">
<p>

Le Bus Master DMA est une technologie permettant d'acc&eacute;l&eacute;rer le d&eacute;bit de vos
 disques durs. Elle requi&egrave;rt des cartes m&egrave;res ainsi que des BIOS sp&eacute;cifiques et
 bien entendu un disque exploitant ces possibilit&eacute;s.

Vous trouverez de plus amples informations &agrave; l'adresse suivante :
<htmlurl url="http://developer.intel.com/design/pcisets/busmatr/FAQs.htm"
name="http://developer.intel.com/design/pcisets/busmatr/FAQs.htm">

<sect1>Ultra-DMA, ou bien Ultra-ATA, ou bien Ultra33 et tous ce qui commence par Ultra...
<label id="udma">
<p>
Comme vous pouvez le constater, l'Ultra-DMA a beaucoup de noms, appelons-le UDMA.

L'UDMA est la technologie IDE la plus avanc&eacute;e &agrave; l'heure actuelle. Elle permet
 d'atteindre des taux de transfert de 33.3 Mb/s, c'est &agrave; dire deux fois plus
 que l'EIDE, et pour un prix largement inf&eacute;rieur au SCSI. La plupart des
 nouveaux ordinateurs sont d&eacute;sormais livr&eacute;s avec des contr&ocirc;leurs et des disques
 UDMA. Il est aussi possible d'ajouter un contr&ocirc;leur UDMA sur un syst&egrave;me pour en
 augmenter les performances (comme la carte Promise Ultra33), m&ecirc;me si vous
 utilisez de &quot;vieux&quot; disques IDE.

Pour en apprendre plus sur l'UDMA, allez donc jeter un coup d'oeil &agrave; l'adresse
 suivante : <htmlurl url="http://www.quantum.com/src/whitepapers/ultraata/"
 name="http://www.quantum.com/src/whitepapers/ultraata/">

&Agrave; noter que la longueur des nappes des disques UDMA doit &ecirc;tre plus courte
 qu'avec du DMA ordinaire, pr&eacute;f&eacute;rez en g&eacute;n&eacute;ral des c&acirc;bles longs de 30 cm (12') au
 maximum.

<sect1>Est-ce vraiment le "nec plus Ultra"<label id="speed">
<p>
Avant d'aller plus loin, &eacute;claircissons un malentendu. Le taux de transfert de 33 Mb/s indiqu&eacute;
 est le <bf/taux de transfert en mode rafale/, et ce n'est pas quelque chose que vous verrez
 tr&egrave;s souvent. Pour comprendre, voici un extrait de l'"udma-generic" : UDMA.txt

<tscreen><verb>
Les taux de transfert en rafale sont suppos&eacute;s aller de 16.6Mb/s (mode PIO 4) &agrave 16.6Mb/s
(DMA mode 2) et jusqu'&agrave; 33Mb/s (UDMA). Dans son patch pour le noyau 2.1.55, Kim-Hoe &agrave;
mesur&eacute; des taux de transfert en rafale avec un analyseur logique : 60ns/mot, ce qui
&eacute;quivaut &agrave; 33Mb/s.

&agrave; noter que ces taux de transfert ne s'appliquent de sur/depuis le cache disque (476kB pour le
disque IBM 6.4 Gb) et &agrave; mon avis ne sont pas particuli&egrave;rement significatifs pour la
majorit&eacute; des utilisateurs de Linux.


Le noyau de Linux utilise le plus de RAM possible comme cache disque, et donc si les donn&eacute;es
ne sont pas dans le cache du noyau, il y a peu de chances qu'elles soient dans le cache disque (de
taille moins important).

</verb></tscreen>

Le <bf/taux de transfert continu/, la vitesse &agrave; laquelle les donn&eacute;es peuvent
 &ecirc;tre transf&eacute;r&eacute;es du disque &agrave; la m&eacute;moire centrale o&ugrave; elles
 pourront &ecirc;tre utilis&eacute;es, est beaucoup plus significatif. Un moyen simple pour mesurer 
 le "taux de transfert continu" est d'utiliser la commande <tt/hdparm/, par exemple "<tt> hdparm -Tt
 /dev/hda</tt>" permet de mesurer le taux de transfert du premier disque IDE.
 

<tscreen><verb>
Voici quelques informations rassembl&eacute;es apr&egrave;s de nombreux tests, en utilisant
 l'utilitaire hdparm (&eacute;crit aussi par Mark Lord) : 

Taux de transfert du mode PIO 4 sous Linux :    +/- 5.2 Mb/s 

Taux de transfert du DMA mode 2 sous Linux :    +/- 7.2 Mb/s 

Taux de transfert de l'UDMA mode 2 sous Linux : +/- 9.8 Mb/s 

</verb></tscreen>

Comme vous pouvez le constater, l'UDMA est toujours deux fois plus rapide que l'EIDE simple et
 plus rapide que le bus Mastering. 

<sect1>Comparer l'UDMA au SCSI<label id="udma-vs-scsi">
<p>

Je n'ai pas de chiffres &agrave; vous donner, mais le consensus g&eacute;n&eacute;ral est que le
 SCSI haut de gamme donne de bien meilleures performances que l'UDMA. Cependant si vous avez
 r&eacute;cemment regard&eacute; les prix des disques durs, vouz avez sans doute remarqu&eacute; que
 les disques UDMA sont largement moins chers. Le rapport qualit&eacute;/prix est en faveur de
 l'UDMA dans pratiquement tous les cas.

<sect>Utiliser vos disques UDMA avec une interface EIDE<label
id="udma-on-ide">
<p>

C'est relativement simple. Dans la mesure o&ugrave; les disques UDMA respectent la
compatilibit&eacute; descendante avec la norme EIDE, vous n'avez qu'&agrave; brancher votre
disque sur votre contr&ocirc;leur EIDE comme n'importe quel disque et Linux ne devrait
avoir aucun probl&egrave;me pour le d&eacute;tecter. Toutefois vous serez bien entendu limit&eacute;
aux taux de transfert de l'EIDE.

<sect>Utiliser vos disques avec une interface UDMA<label id="using-udma">
<p>

Bon, j'ai une bonne nouvelle et une mauvaise nouvelle.
La bonne nouvelle c'est
que le contr&ocirc;leur UDMA peut piloter en m&ecirc;me temps des disques UDMA et des
disques EIDE, et beaucoup plus rapidement qu'avec un contr&ocirc;leur EIDE &eacute;videmment.

La mauvaise nouvelle, c'est que l'actuel noyau stable de Linux (2.0.35) ne
supporte pas parfaitement l'UDMA. 
Les noyaux de d&eacute;veloppement (actuellement 2.1.114) int&egrave;grent un support UDMA, 
mais il existe de nombreux patchs
applicables aux noyaux actuels. De plus certains disques UDMA poss&eacute;dant leur
propre carte int&eacute;gr&eacute;e, plut&ocirc;t que sur la carte m&egrave;re, requi&egrave;rent soit d'utiliser un
patch sp&eacute;cifique soit de ruser pour &ecirc;tre fonctionnel. C'est pourquoi ce
document existe : pour expliquer o&ugrave; trouver les patchs et comment ruser.

<sect>Cartes d'interfaces UDMA PCI<label id="pci">
<p>
Il existe des cartes d'interfaces PCI qui permettent d'utiliser l'UDMA sur un ordinateur sans 
changer de carte m&egrave;re, ou pour ajouter quatre disques suppl&eacute;mentaires sur une machine
dont les interfaces int&eacute;gr&eacute;es sont toutes utilis&eacute;es. Elles peuvent aussi
&ecirc;tre trouv&eacute;es pr&eacute;install&eacute;es sur certains ordinateurs, tels que les Gateway
2000 ou les Dell.

La plupart de ces cartes ne sont pas support&eacute;es par les versions stables du noyau (comme le
2.0.35), vous devez appliquer un patch sur le noyau ou utiliser un noyau de d&eacute;veloppement (la
s&eacute;rie 2.1.x). Si vous devez installer Linux sur un disque pr&eacute;sent sur l'une de ces
interfaces, vous aurez besoin d'utiliser quelques ruses un peu "tordues".

<sect1>La carte Promise Ultra33 IDE<label id="Promise">
<p>
C'est une carte PCI poss&eacute;dant deux canaux UDMA, permettant de connecter 4
disques. Toutes les informations concernant les prix, les sp&eacute;cificit&eacute;s etc.
sont disponibles &agrave; l'adresse : <htmlurl url="http://www.promise.com"
name="http://www.promise.com">.

Cette carte est (par exemple) vendue avec les derniers mod&egrave;les Gateway 2000 &agrave;
base de Pentium II, mais rien ne permet de savoir si elle sera livr&eacute;e avec les
futurs mod&egrave;les.

Le noyau 2.0.35 supporte explicitement l'UDMA et les noyaux de d&eacute;veloppement
(actuellement 2.1.114) int&egrave;grent un support IDE PCI
g&eacute;n&eacute;rique, ce qui inclut la d&eacute;tection automatique de la Promise Ultra33.
Toutefois, les anciennes versions stables (2.0.34 et au dessous) n'int&egrave;grent pas ce support et
dans la mesure o&ugrave; la plupart des distributions Linux incluent ces anciens noyaux, il peut
s'av&eacute;rer un peu difficile d'installer Linux.

<bf/Installer Linux avec une carte Promise/

Bien qu'il existe un patch pour ce contr&ocirc;leur, ce n'est pas tr&egrave;s &eacute;vident de
l'appliquer et de recompiler votre noyau si Linux n'est pas encore install&eacute; !
Il existe pourtant une solution, qui peut peut-&ecirc;tre marcher sur votre syst&egrave;me.
Merci &agrave; Gadi Oxman pour les informations ci-dessous,
permettant d'acc&eacute;der &agrave; la configuration de la carte.

<tscreen><verb>
Si l'on peut acc&eacute;der &agrave; une console, &agrave; partir de la disquette
d'installation, alors on peut utiliser la commande &quot;cat /proc/pci&quot;
permettant d'afficher les param&egrave;tres de la carte:
	
	RAID bus controller: Promise Technology Unknown device (rev 1).
	Vendor id=105a. Device id=4d33
	Medium devsel.   IRQ12.   Master capable.   Latency=32
	I/o at 0xe000.    (a)
	I/o at 0xd804     (b)
	I/o at 0xd400     (c)
	I/o at 0xd004     (d)
	I/o at 0xc800     (e)

et passer en param&egrave;tre du noyau la commande suivante:
&quot;ide2=a,b+2 ide3=c,d+2&quot;
</verb></tscreen>
	
&agrave; noter que les adresses ne seront s&ucirc;rement pas les m&ecirc;mes sur votre syst&egrave;me. Par
exemple, si l'on prend celles d&eacute;crites ci-dessus, la commande sera : 
''<tt/ide2=0xe000,0xd806 ide3=0xd400,0xd006/''. Vous devrez &eacute;ventuellement ajouter
l'IRQ, ce qui donnera : ''<tt/ide2=0xe000,0xd806,12 ide3=0xd400,0xd006,12/''.Si vous
n'utilisez que le premier canal IDE de la carte (si, par exemple, vous ne
poss&eacute;dez qu'un disque, ou deux en ma&icirc;tre et esclave sur le m&ecirc;me canal), il n'est
alors pas n&eacute;cessaire de sp&eacute;cifier <tt/ide3/.

<bf/Red Hat 5.1:/ D&eacute;marrer avec la disquette d'amor&ccedil;age et tapez
sur la touche "enter" &agrave; l'invite de commande. Le noyau se chargera puis
il vous sera demand&eacute; de choisir une langue, un type de clavier et le
type d'installation. D'autres informations, telles que le type de support contenant les
sources, vous seront demand&eacute;es. Vos r&eacute;ponses &agrave; tout cela
importent peu pour le moment, le tout &eacute;tant d'arriver &agrave;
l'&eacute;tape suivante. Ensuite, vous devriez tomber sur un &eacute;cran avec le
message suivant : ``Select Installation Path''. Appuyez sur Alt-F2 pour obtenir
un invite de commande. Tapez ``<tt>cat /proc/pci</tt>'', notez les
param&egrave;tres comme ci-dessus et red&eacute;marrez &agrave; partir de la disquette.
Cette fois-ci, tapez ''<tt>linux ide2=</tt> <em/(entrez vos param&egrave;tres)/
<tt/ ide3=/<em/(encore)/''.Il devrait d&eacute;sormais &ecirc;tre possible
de faire l'installation sur votre disque sans difficult&eacute;, cependant,
LILO ne pourra probablement pas s'installer~; faites plut&ocirc;t une disquette
de d&eacute;marrage &agrave; laquelle vous passerez les param&egrave;tres
d&eacute;crits ci-dessus tant que vous n'aurez pas patché LILO ainsi que le noyau.

Avec la <bf>Red Hat 5.0</bf> et la <bf>Slackware 3.4</bf> : elles sont tr&egrave;s similaires, mais
avec une combine pour que les programmes d'installation ignorent /dev/hde-h (ce sont les disques
identifiant l'ide2 et l'ide3). Pour installer &agrave; partir de ces disques ou sur ceux-ci, il est
n&eacute;cessaire de "surcharger" une interface ou les deux int&eacute;gr&eacute;es sur votre
carte m&egrave;re. Cependant, assurez-vous de ne pas &eacute;craser un p&eacute;riph&eacute;rique
que vous d&eacute;sirez installer~; par exemple si vous installez Linux &agrave; partir d'un lecteur de
CD-ROM sur /dev/hdd (ide1 - interface int&eacute;gr&eacute;e) sur un disque dur sur /dev/hde
(ide2 - la carte Ultra33), vous devrez surcharger le port ide0 (peu important) avec le port ide2 et
laisser le port ide1 intact. En utilisant les num&eacute;ros pr&eacute;c&eacute;dents vous
d&eacute;marrerez avec "ide0=0xe000,0xd806". Avec la RedHat 5.0 vous aurez une invite de commande en
d&eacute;marrant avec la disquette "rescue"~; la Slackware vous propose cette invite avec la disquette
d'amor&ccedil;age standard. Cependant la RedHat 5.0 a des difficult&eacute;es pour d&eacute;marrer 
apr&egrave;s l'installation~; si vous avez des probl&egrave;mes, vous pouvez t&eacute;l&eacute;charger
une disquette d'amor&ccedil;age Slackware sur  <htmlurl
  url="ftp://ftp.cdrom.com/pub/linux/slackware-3.5/bootdsks.144/"
  name="ftp://ftp.cdrom.com/pub/linux/slackware-3.5/bootdsks.144/"> et d&eacute;marrer avec.

Avec d'autres distributions Linux, vous devrez improviser un peu, mais la
proc&eacute;dure devrait &ecirc;tre globalement identique.

<bf><em>IMPORTANT :</em></bf>
Sans le patch (pr&eacute;sent&eacute; dans le chapitre <ref id="generic"
name="UDMA g&eacute;n&eacute;rique">), le noyau <bf>a besoin</bf> de ces
param&egrave;tres pour acc&eacute;der &agrave; vos disques. De plus il est indispensable qu'&agrave; la
configuration de LILO (que ce soit sur un disque ou sur une disquette) vous
donniez <bf>exactement les m&ecirc;mes param&egrave;tres</bf> que ceux utilis&eacute;s &agrave; l'installation.
Autrement votre syst&egrave;me ne d&eacute;marrera pas. Il est toujours possible de les
fournir au prompt de LILO (pressez la touche Majuscule, puis tapez ''<tt/linux 
ide2=/<em/..../'') &agrave; chaque d&eacute;marrage &agrave; condition de toujours avoir vos param&egrave;tres &agrave;
port&eacute;e de la main. Il est recommand&eacute; de patcher le noyau le plus vite possible
pour ne plus avoir &agrave; se soucier de &ccedil;a &agrave; chaque d&eacute;marrage.
Une fois d&eacute;marr&eacute; avec
le noyau patch&eacute;, vous n'aurez plus jamais &agrave; vous soucier de ces param&egrave;tres.
Autant que je sache, il n'y a aucun moyen de passer des param&egrave;tres au
d&eacute;marrage 
d'une disquette contenant un noyau (cr&eacute;e avec la commande ''<tt/make
zdisk/''), vous  
<bf>devrez</bf>donc utiliser LILO ou autres 'loaders' permettant le passage de param&egrave;tres
Au d&eacute;marrage.

Cependant, certains noyaux non patch&eacute;s ont parfois des difficult&eacute;s pour utiliser
les adresses ide2 et ide3, m&ecirc;me lorsque les disques sont correctement
reconnus.
Par cons&eacute;quent, si vous n'avez pas r&eacute;ussi &agrave; installer linux &agrave; partir des infos
ci-dessus, essayez de sp&eacute;cifier les adresses ide0 et ide1 &agrave; la place de ide2 et
ide3 (merci &agrave; Martin Gaitan pour cette technique). Cela remplace alors les
contr&ocirc;leurs int&eacute;gr&eacute;s de votre carte m&egrave;re (s'il y en a)avec ceux de la carte
Promise. Notons que si vous avez un lecteur de CDROM IDE, branch&eacute; sur votre
carte m&egrave;re, &agrave; partir duquel vous installez Linux, vous devrez vous assurer que
vous ne supplanterez pas le contr&ocirc;leur sur lequel ce lecteur est branch&eacute; sous
peine de ne pas pouvoir lancer l'installation ! Si le lecteur de CD est sur hda
ou hdb, utilisez le port ide1 pour vos disques ; si le lecteur est sur hdc ou 
hdd, utilisez le port ide0.

<bf> Installer Linux... puis la carte Promise </bf>

Si &ccedil;a ne marche toujours pas, vous devrez tenter une approche l&eacute;g&egrave;rement plus
brutale. La m&eacute;thode suivante fonctionne de fa&ccedil;on pratiquement garantie, mais
elle requiert que vous ouvriez votre ordinateur et tripatouilliez dedans.
<bf/ATTENTION :/ si vous n'avez pas l'habitude de brancher et d&eacute;brancher des disques
IDE, avant toute chose : <bf/lisez les manuels/ livr&eacute;s avec votre ordinateur, vos
disques durs et/ou la carte Promise ! Si vous bousillez quelque chose sans savoir
le r&eacute;parer, vous pourriez le regretter.

Cela dit, c'est tr&egrave;s simple. De nos jours, la plupart des cartes m&egrave;res poss&egrave;dent
des contr&ocirc;leurs EIDE int&eacute;gr&eacute;s. D&eacute;connectez vos disques de la carte Promise, et
branchez-les sur les contr&ocirc;leurs de votre carte m&egrave;re. Si vous avez d'autres
pr&eacute;rip&eacute;riques IDE sur votre carte m&egrave;re, tels qu'un lecteur de CD-ROM ou un ZIP,
l'installation sera plus facile si vous branchez votre disque UDMA sur
un port libre (le secondaire si le primaire est utilis&eacute;), ou si vous retirez
temporairement un p&eacute;riph&eacute;rique dont vous n'avez pas imm&eacute;diatement besoin
(le lecteur ZIP IDE, ou votre lecteur de bande par exemple). Installez Linux,
t&eacute;l&eacute;chargez et installez le patch pour la carte Promise (d&eacute;crit dans la 
section suivante).

D&eacute;sormais, vous voil&agrave; pr&ecirc;t &agrave; rebrancher votre disque sur la carte Promise....
enfin presque. Pour plus de s&ucirc;ret&eacute; faites une disquette
d'amor&ccedil;age
(<tt>cd /usr/src/linux; make zdisk</tt>) &agrave; partir de laquelle vous pourrez
d&eacute;marrer si LILO
ne fonctionne pas. Soyons <em/tr&egrave;s/ prudent :faites-en deux et mettez la seconde de
cot&eacute; pour le moment.

Bien, maintenant c'est le moment de r&eacute;fl&eacute;chir un peu... Si vous n'avez qu'un
disque et qu'il est sur la carte Promise, il est alors s&ucirc;rement d&eacute;clar&eacute; en 
<tt>/dev/hde</tt> ( <tt/a/ et <tt/b/ pour le contr&ocirc;leur primaire de la
carte m&egrave;re, <tt/c/ et <tt/d/ pour
le secondaire). Si vous branchez d'autres disques sur la carte Promise, alors le
disque esclave sera en <tt>/dev/hdf</tt>, le disque ma&icirc;tre du port secondaire sera en  
<tt>/dev/hdg</tt> et l'esclave en <tt>/dev/hdh</tt>.

&Eacute;ditez le fichier <tt>/etc/fstab</tt>, et changez le nom de toutes les partitions des
disques que vous d&eacute;placez du contr&ocirc;leur de la carte m&egrave;re vers la carte Promise
(<tt>/dev/hda</tt> -&gt; <tt>/dev/hde</tt> ...). Si vous d&eacute;placez d'autres p&eacute;riph&eacute;riques (tels que le
CD-ROM, le lecteur ZIP..) que vous laissez sur la carte m&egrave;re, pensez aussi &agrave; les
renommer comme il se doit. Par exemple si votre CD-ROM &eacute;tait en ma&icirc;tre sur le
port primaire (<tt>/dev/hda</tt>), puis d&eacute;plac&eacute; en
<tt>/dev/hdc</tt> durant l'installation (pour
pouvoir brancher votre disque dur en <tt>/dev/hda</tt>) et que vous le voulez le remettre
en <tt>/dev/hda</tt>, alors pensez &agrave; modifier la fstab.

Si vous utilisez LILO, n'oubliez pas de le reconfigurer pour que vos
modifications soient prises en compte (la configuration de LILO sort du cadre de
ce document, pour en savoir plus sur LILO, consultez le <url
url="http://sunsite.unc.edu/LPD/HOWTO/mini/LILO.html" name="LILO mini-Howto">), sans
quoi vous ne pourrez pas red&eacute;marrer, &agrave; moins d'utiliser la
disquette d'amor&ccedil;age
pr&eacute;c&eacute;demment cr&eacute;&eacute;e; disquette que vous voudrez aussi configurer pour pouvoir
d&eacute;marrer sur la nouvelle partition. Utilisez pour cela la commande <tt/rdev/. Ins&eacute;rez
la disquette dans le lecteur puis tapez ''<tt>rdev /dev/fd0 /dev/hde1</tt>''. Bien entendu
cela signifie que votre partition root est la premi&egrave;re partition de votre disque
UDMA. Si ce n'est pas le cas (la mienne est sur <tt>/dev/hde7</tt> par exemple), utilisez
&eacute;videmment le bon num&eacute;ro de partition.

Red&eacute;marrez. Votre syst&egrave;me devrait d&eacute;sormais fonctionner correctement.

<bf> Patch pour la carte Promise</bf>

Les noyaux 2.0.35 et sup&eacute;rieurs incluent un support la carte Promise en natif,
t&eacute;l&eacute;chargez et mettez &agrave; jour votre noyau &agrave partir de votre distribution
Linux ou &agrave; partir de
<htmlurl name="http://www.kernel.org" url="http://www.kernel.org">.

Pour avoir plus d'instructions &agrave; propos de la compilation d'un noyau, consultez le
<htmlurl name="Kernel HOWTO" url="http://sunsite.unc.edu/LDP/HOWTO/Kernel-HOWTO.html">
 
<bf/Utiliser deux Ultra33 sur une machine/
  
  Cela ne fonctionne pas correctement actuellement... Ne le faites pas &agrave moins d'&ecirc;tre
  dispos&eacute; &agrave bricoler le noyau pour tenter de faire en sorte que cela fonctionne.

<sect1>Artop ATP850UF<label id="artop">
<p>
Cette carte est support&eacute;e par le "udma-generic". L'installation de Linux sur un syst&egrave;me
poss&eacute;dant une telle interface doit &ecirc;tre tr&egrave;s similaire &agrave; celle
effectu&eacute;e pour l'installation de la carte Promise Ultra33.

<sect1>Ajouter des p&eacute;riph&eacute;riques
<p>
Les interfaces IDE tertiaire et quaternaire (ide2 et ide3) utilisent des p&eacute;riph&eacute;riques 
de la forme <tt>/dev/hde*</tt> jusqu'&agrave; <tt>/dev/hdh*</tt>. Sur les anciens noyaux, ces 
p&eacute;riph&eacute;riques n'&eacute;taient pas cr&eacute;&eacute;s automatiquement, vous devrez 
donc les ajouter manuellement pour que tout fonctionne correctement.

Cela peut facilement &ecirc;tre fait si vous avez install&eacute; les sources du noyau Linux. 
Lancez simplement <tt>/usr/src/linux/scripts/MAKEDEV.ide</tt> pour cr&eacute;er tous les 
p&eacute;riph&eacute;riques n&eacute;cessaires.

<sect>Les interfaces UDMA int&eacute;gr&eacute;es<label id="onboard">
<p>
Ce sont des contr&ocirc;leurs de disques UDMA int&eacute;gr&eacute;s aux cartes m&egrave;res. Ils 
utilisent les E/S IDE standards et sont donc pleinement utilisables &agrave; des vitesses "non-UDMA" 
plus lentes tels qu'ils (les contr&ocirc;leurs) sont exploit&eacute;s avec des noyaux non patch&eacute;s (comme ceux 
fournis lors de l'installation de Linux). Par cons&eacute;quent, ces derniers  ne devraient pas
poser de  
difficult&eacute;s durant la phase d'installation, et les patcher pour exploiter la vitesse de 
l'UDMA tient plus du luxe que d'une &eacute;tape fondamentale.

<sect1>Intel FX, HX, VX, TX et LX<label
id="intel-tx">
<p>
Encore merci &agrave; Gadi pour ces infos
<tscreen><verb>
Le bus mastering est support&eacute; sur les jeux de composants  TX &agrave; partir du noyau 
2.0.31 et sup&eacute;rieur.
</verb></tscreen>
	
Avec un noyau plus ancien ( comme la version 2.0.30 de la slackware 3.4) le 
contr&ocirc;leur fonctionnera comme un contr&ocirc;leur EIDE. Dans tous les cas, le 
contr&ocirc;leur sera automatiquement d&eacute;tect&eacute; par le noyau et vous ne devriez avoir 
aucun probl&egrave;me pour l'utiliser.

Le support UDMA complet pour ces jeux de composants (chipsets) est d&eacute;crit dans le chapitre: <ref
id="generic" name="UDMA
g&eacute;n&eacute;rique">.

<sect1> Le VIA VPx et les jeux de composants apparent&eacute;s<label id="via">
<p>
Cette interface est imm&eacute;diatement reconnue par un noyau non patch&eacute; comme un 
contr&ocirc;leur EIDE, mais si en poss&eacute;dez un, vous serez int&eacute;ress&eacute; par le fait
qu'il existe un patch permettant d'un part d'am&eacute;liorer les taux de transfert, et 
d'autre part de se d&eacute;barrasser du message &quot;unknown PCI device&quot;. 

Vous trouverez un patch &agrave; l'adresse <url url="http://www.ipass.net/~prefect/" 
name="http://www.ipass.net/&tilde;prefect/">. Il a &eacute;t&eacute; 
con&ccedil;u pour le jeux de composants VIA VP2/97 que l'on trouve sur les cartes m&egrave;res 
FIC PA-2007 et PA-2011, mais il devrait fonctionner sur des contr&ocirc;leurs 
apparent&eacute;s. Ce patch fonctionne aussi sur les derniers contr&ocirc;leurs VIA VP3, 
mais ce n'est pas une r&egrave;gle absolue. 
 
Ce patch permet uniquemement de faire du Bus Mastering (et pas de l'UDMA), mais 
c'est toujours mieux que le bon vieux mode EIDE. Suivez les instructions du 
site pour activer le Bus Mastering. 
 
Il existe un autre patch qui supporte toutes les fonctionnalit&eacute;s de l'UDMA,
disponible &agrave; <url url="http://www.pyreneesweb.com/Udma/udma.html" 
name="http://www.pyreneesweb.com/Udma/udma.html">, &eacute;crit pour le 
jeux de composants  VIA VT82C586B, et qui devrait aussi fonctionner sur les VP2, VP3, VPX, P6 et 
AGP Appolo. Suivez les instructions d'installation et de mise en oeuvre, mais il 
est conseill&eacute; de sauvegarder vos donn&eacute;es importantes au cas o&ugrave; votre carte m&egrave;re 
serait incompatible. Cependant, si &ccedil;a marche la premi&egrave;re fois, &ccedil;a 
marchera pour les suivantes.
 
À noter que ce patch ne fonctionne pas sur le jeu de composants VP1, mais ce dernier est support&eacute; 
par le patch <ref id="generic" name="g&eacute;n&eacute;rique">. 

<sect1>TX Pro et autres cartes "Pro"
<p>
L'UDMA n'est pour le moment pas support&eacute; par les cartes m&egrave;res TX Pro. Ce ne sont pas les 
m&ecirc;me que les TX mobo, et elles indiquent apparemment mal leurs possibilit&eacute;s DMA, d'o&ugrave; le probl&egrave;me.
J'ai entendu dire que quelqu'un 
travaillait dessus. Un patch devrait donc appara&icirc;tre dans le futur.

<sect>UDMA g&eacute;n&eacute;rique<label id="generic"> 
<p>
Le patch g&eacute;n&eacute;rique pour l'UDMA, modifi&eacute; par Andr&eacute; Balsa 
(<htmlurl url="mailto:andrebalsa@altern.org" name="andrebalsa@altern.org">) et 
<url name="Michel Aubry" url="mailto:giovanni@sudfr.com"> &agrave; partir du driver DMA 
pour le jeu de composants Triton (&eacute;crit par Mark Lord), permet l'utilisation du mode UDMA 
pour les jeux de composants  suivants (pour la version 0.3) : 

<itemize>
<item>Tous les jeux de composants Intel: FX, HX, VX, TX, LX
<item>Tous les jeux de composants SiS (seul le SiS5598 a &eacute;t&eacute; test&eacute, mais toute la 
famille a le m&ecirc;me p&eacute;riph&eacute;rique int&eacute;gr&eacute; : le SiS5513).
<item>Les jeux de composants  VIA (seul le 82C586B a &eacute;t&eacute; test&eacute;, mais ils sont tous 
bass&eacute;s sur la m&ecirc;me interface). Un support de diagnostic sp&eacute;cifique est 
disponible pour l'interface &agrave; base de VIA.
<item>Les cartes interfaces Promise et Artop PCI UDMA. Le support pour la carte interface 
Triones PCI UDMA n'est pas encore inclus.
</itemize>

Il a &eacute;t&eacute; &eacute;crit pour pouvoir int&eacute;grer simplement de nouveaux jeux de composants. 

L'UDMA g&eacute;n&eacute;rique, aussi connu sous le nom de Grand Unified UDMA patch (GUUP -
prononcez "goop" (NDT: "goupe"...avec un accent bien d'chez nous) ) a &eacute;t&eacute; 
incorpor&eacute; dans le patch "Jumbo" qui int&egrave;gre beaucoup d'autres caract&eacute;ristiques 
tr&egrave;s utiles telles que la d&eacute;tection automatique de plus de 64 Mo de m&eacute;moire et 
la d&eacute;tection de la fr&eacute;quence d'horloge du microprocesseur. Vous pouvez obtenir le 
patch Jumbo pour le noyau 2.0.35 &agrave;  <htmlurl url="http://www.altern.org/andrebalsa/linux/" 
name="http://www.altern.org/andrebalsa/linux/">. Ce patch devrait aussi s'appliquer sur le noyau 
2.0.36pre1 et peut &ecirc;tre au del&agrave;. 

Voici quelques notes de l'auteur :
<tscreen><verb>
Les performances avec un disque IBM UDMA sur une bonne carte m&egrave;re avoisinent les 
10 Mb/s de taux de transfert maximum (mesur&eacute; avec hdparm -T -t). 

Le jeu de composant Intel TX ne poss&egrave;de qu'une FIFO simple partag&eacute;e pour ses deux 
contr&ocirc;leurs IDE, par cons&eacute;quent utiliser 2 disques UDMA n'apportera pas de 
grandes am&eacute;liorations par rapport &agrave; l'utilisation d'un seul disque. 
Par contre le jeu de composant SiS5598 poss&egrave;de deux contr&ocirc;leurs s&eacute;par&eacute;s, chacun
avec sa 
propre FIFO. Th&eacute;oriquement, on peut approcher les 66 Mb/s de taux de transfert 
sur les cartes m&egrave;res poss&eacute;dant un SiS5598, en utilisant le driver md et en 
faisant le transfert entre deux disques. Le jeu de composant SiS5571 est globalement 
identique. Je n'ai pas les sp&eacute;cifications du chipset VIA, je ne peux donc pas 
dire grand-chose &agrave; leur propos. 

Le driver (U)DMA &eacute;crit par Mark Lord poss&egrave;de des temps de setup 
particuli&egrave;rement faibles (temps de latence entre les transfert de donn&eacute;es). C'est 
une m&eacute;thode id&eacute;ale pour des transferts de donn&eacute;es fr&eacute;quents, avec des
petits 
fichiers (comme ceux d'un serveur de news sous Linux), qui peut s'av&eacute;rer parfois 
sup&eacute;rieur &agrave; son homologue SCSI. 
</verb></tscreen>


<sect>Activer et d&eacute;sactiver l'UDMA<label id="activate">
<p>
Normalement, un noyau int&eacute;grant l'UDMA doit automatiquement permettre le support UDMA sur 
les disques et les interfaces ad&eacute;quats. Cependant d&eacute;marrant &agrave; partir du noyau 
2.1.113, les transferts DMA sont d&eacute;sactiv&eacute;s par d&eacute;faut tant que vous n'aurez 
pas configur&eacute; sp&eacute;cifiquement votre noyau pour l'activer automatiquement. Cela peut vous
sembler un inconv&eacute;nient, mais quelques disques et certaines interfaces ne fonctionnent pas 
correctement avec l'UDMA activ&eacute : voyez la "liste noire" ci-dessous. 

<sect1>Donner des param&egrave;tres au noyau &agrave; l'amor&ccedil;age<label id="bootparam">
<p>

Sur les noyaux 2.1.113 et sup&eacute;rieurs, vous pouvez activer les transferts DMA sur les deux 
disques d'une interface donn&eacute;e en utilisant le param&egrave;tre <tt/ideX=dma/, o&ugrave; X 
est le num&eacute;ro de l'interface (la premi&egrave;re est 0). 

Les param&egrave;tres de d&eacute;marrage du noyau peuvent &ecirc;tre appliqu&eacute;s en utilisant 
LILO, LOADLIN ou la plupart des m&eacute;todes d'amor&ccedil;age de Linux. Pour plus d'informations, 
consultez le <htmlurl name="Bootdisk HOWTO" 
 url="http://sunsite.unc.edu/LDP/HOWTO/Bootdisk-HOWTO.html">

<sect1>Utiliser hdparm<label id="hdparm">
<p>

<tt/hdparm/ est un programme permettant de forcer les param&egrave;tres de vos disques durs sous
Linux. Parmi toutes ses possibilit&eacute;s, vous pouvez l'utiliser pour activer ou
d&eacute;sactiver l'UDMA d'un disque et tester son taux de transfert continu.  

La plupart des distributions Linux incluent <tt/hdparm/, mais vous devrez appliquer un patch pour 
inclure le support UDMA. Vous pouvez t&eacute;l&eacute;charger <tt/hdparm/ &agrave; 
<htmlurl name="ftp://sunsite.unc.edu/pub/Linux/system/hardware/hdparm-3.3.tar.gz"
url="ftp://sunsite.unc.edu/pub/Linux/system/hardware/hdparm-3.3.tar.gz"> et le patch &agrave;
htmlurl name="http://pobox.com/~brion/linux/hdparm-3.3-udma.patch.gz"
url="http://pobox.com/~brion/linux/hdparm-3.3-udma.patch.gz">.

Compilez-le et installez-le comme suit :


<tscreen><verb>
cd /usr/src
tar zxvf /tmp/download/hdparm-3.3.tar.gz
cd hdparm-3.3
gzip -cd /tmp/download/hdparm-3.3-udma.patch.gz | patch -p0
make
if [ -f /sbin/hdparm ]; then rm -f /sbin/hdparm ; fi
make install
cp /usr/local/sbin/hdparm /sbin/hdparm
</verb></tscreen>

  <bf/Pour activer l'UDMA sur un disque dur :/ <tt>hdparm -d1 /dev/hda</tt>
  
  <bf/Pour d&eacute;sactiver l'UDMA :/ <tt>hdparm -d0 /dev/hda</tt>
  
  <bf/Pour mesurer le taux de transfert d'un disque :/ <tt>hdparm -Tt /dev/hda</tt>
  
  <bf/Pour voir quelles options sont activ&eacute;es :/ <tt>hdparm /dev/hda</tt>
  
  <bf/Pour avoir plus de d&eacute;tails sur votre disque :/ 
  <tt>hdparm -i /dev/hda</tt>
  
  Pour plus de pr&eacute;cisions, lisez le man (``<tt/man 8 hdparm/'').

<sect>Probl&egrave;mes

<sect1>La liste noire<label id="blacklist">
<p>

Les disques suivants sont sur liste noire. Vous <bf/ne devez pas/ utiliser l'UDMA avec ces disques 
sous peine de corrompre vos donn&eacute;es. 


<itemize>
  <item>Western Digital WDC AC22100H
</itemize>

La partie UDMA du patch Jumbo-2.0.35-9 d&eacute;sactivera automatiquement le DMA sur ce disque.

<sect1>Avez-vous "overclock&eacute;" votre machine ?
<p>

Si oui, prenez garde ! Voici un extrait de la documentation de l'"udma-generic" :

<tscreen><verb>
N'OVERCLOCKEZ PAS le bus PCI. La fr&eacute;quence maximum support&eacute;e par le bus PCI est de 
37.5 Mhz. Certains (suppos&eacute;s compatibles) disques UDMA ne fonctionneront m&ecirc;me pas 
&agrave; 37.5 Mhz, mais devraient &ecirc;tre OK &agrave; 33.3 Mhz.

Dans tous les cas,ne JAMAIS, JAMAIS configurer le bus PCI a 41.5 Mhz

La fr&eacute;quence RECOMMAND&Eacute;E et sans danger est de 33 Mhz.

</verb></tscreen>

<sect1>Votre BIOS l'accepte-t-il ?
<p>
Voici un autre extrait de la documentation de l'"udma-generic" :

<tscreen><verb>
Le v&eacute;ritale travail impliquant le param&eacute;trage des composants pour les transferts DMA
 est r&eacute;alis&eacute; principalement par le BIOS de chaque carte m&egrave;re. Maintenant, bien
 entendu, il faut esp&eacute;rer que le BIOS a &eacute;t&eacute; correctement programm&eacute;...

Par exemple, la carte m&egrave;re ASUS SP-97V avec son BIOS original (Rev. 1.03)
 aura un dysfonctionnement avec les pilotes modifi&eacute;s pour les modes UMDA et DMA mode 2;
 Cela fonctionnera correctement si vous utilisez le mode PIO 4, ou sous Windows 95 dans tous 
 les modes. J'ai t&eacute;l&eacute;charg&eacute; la derni&egrave;re image du BIOS (1.06) &agrave;
 partir du site Web ASUS et flash&eacute; l'EPROM avec cette version. Cela fonctionne
 parfaitement depuis (avec un bus &agrave; 66 Mhz).

Cela nous indique bien que c'est le BIOS qui initialise le contr&ocirc;leur DMA avec des
 timing sp&eacute;cifiques, Ma r&eacute;vision de  BIOS initiale avait probablement
 de mauvais timings. Comme les pilotes de Windows 95 les initialise lui-m&ecirc;me(c.a.d. qu'
 il ne se sert pas du BIOS pour param&eacute;trer les timings de l'interface), je n'avais des
 probl&egrave;mes qu'avec les pilotes de Linux, tandis que Windows 95 fonctionnait correctement.

Donc, laissez-moi vous le r&eacute;p&eacute;ter encore une fois : les pilotes (U)DMA Linux s'appuient
 sur des donn&eacute;es du BIOS en supposant qu'elles sont correctes. Si vous avez le moindre
 probl&egrave;me, v&eacute;rifiez d'abord que vous avez la derni&egrave;re r&eacute;vision du BIOS de
 votre carte m&egrave;re.

...

Les derni&egrave;res versions du BIOS sont disponibles sur le site Web de votre fabriquant
 de carte m&egrave;re. "Flasher" une nouvelle image du BIOS est une op&eacute;ration simple, mais
 vous devez respecter strictement les intructions du manuel de votre carte m&egrave;re. 

Les derni&egrave;res r&eacute;visions des BIOS Award semblent suffisamment stables pour utiliser
 l'UDMA. Tout ce qui poss&egrave;de une date avec 1998 devrait &ecirc;tre correct.

</verb></tscreen>

<sect1>Et si &ccedil;a ne marche toujours pas...<label id="help">
<p>

Si aucune des explications contenues dans ce document ne s'av&egrave;rent utile ou au
 moins suffisante pour faire fonctionner votre machine, le mieux est d'envoyer
 un message d&eacute;crivant pr&eacute;cis&eacute;ment votre probl&egrave;me, votre contr&ocirc;leur UDMA (que ce
 soit sur un carte m&egrave;re ou fille), si vos disques sont UDMA ou non, leur
 configuration, votre version de Linux (distribution + version de noyau) et tout
 ce qui peut vous sembler utile.

<sect>Si vous avez des infos sur l'UDMA qui ne sont pas recens&eacute;es ici<label id="suggest">
<p>
Merveilleux ! Si vous savez des choses que je ne sais pas, envoyez-les moi par 
tous les moyens (<htmlurl url="mailto:brion@pobox.com" name="brion@pobox.com">) et je les 
inclurai dans ce document le plus rapidement possible.

</article>

