<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML
><HEAD
><TITLE
>Consoles</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"><LINK
REL="HOME"
TITLE="PA-RISC/Linux Boot HOWTO"
HREF="index.html"><LINK
REL="UP"
TITLE="Preparing to boot"
HREF="preparation.html"><LINK
REL="PREVIOUS"
TITLE="BOOT_ADMIN"
HREF="bootadmin.html"><LINK
REL="NEXT"
TITLE="PALO, the PA/Linux kernel loader"
HREF="palo.html"></HEAD
><BODY
CLASS="sect1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>PA-RISC/Linux Boot HOWTO</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="bootadmin.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Chapter 2. Preparing to boot</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="palo.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="sect1"
><H1
CLASS="sect1"
><A
NAME="consoles"
></A
>2.2. Consoles</H1
><DIV
CLASS="highlights"
><A
NAME="AEN372"
></A
><P
>&#13;				Throughout your PA-RISC experience, you will be often told about
				<EM
>consoles</EM
>. This section aims at de-obfuscating what
				this word means and how to use said <EM
>consoles</EM
>.
			</P
></DIV
><P
>&#13;				In order to boot your PA-RISC system with the PA/Linux kernel,
				you must first set up a <EM
>console</EM
>.
				A <EM
>console</EM
> is basically the device where the kernel
				(and the firmware) will display its output, and where
				input can by sent to control the system at an early boot stage.
				You can use either <EM
>graphic console</EM
>, which requires
				having a monitor and a keyboard attached to the system,
				or <EM
>serial console</EM
>, which allows serial line
				communication between the system and another Linux machine,
				or any VT system.
		  </P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Please note that the firmware console and kernel console
				are not necessarily the same. For instance, it is possible to
				interact with <B
CLASS="command"
>BOOT_ADMIN</B
> using keyboard &#38; monitor, and once PA/Linux is up,
				to have kernel output sent to serial port only. By default,
				<A
HREF="gloss.html#glosspalo"
><I
CLASS="glossterm"
>PA LOader (<SPAN
CLASS="acronym"
>PALO</SPAN
>)</I
></A
> will try to use firmware console as the
				kernel one.
		  </P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="tip"
><P
></P
><TABLE
CLASS="tip"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/tip.gif"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;				Workstations usually boot in graphic mode, whereas servers
				boot in serial mode. Some boxes will also automatically switch
				to serial if no keyboard is connected, or if you hold down
				<TT
CLASS="literal"
>TOC</TT
> switch while powering the system on.
			</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;				If you don't know what the actual console of your box is,
				it's quite simple: find the place where first output is sent when
				the box is turned on (serial line or monitor output, if any), that is
				the console.
		  </P
><P
>&#13;				If you are trying to setup a PA-RISC workstation and have a monitor handy,
				the easiest method is to use <EM
>graphic console</EM
>.
				If you get into troubles, or are trying to configure a server, choose
				<EM
>serial console</EM
>.
		  </P
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="graphicsconsole"
></A
>2.2.1. Using graphic console</H2
><DIV
CLASS="caution"
><P
></P
><TABLE
CLASS="caution"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/caution.gif"
HSPACE="5"
ALT="Caution"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					To use the graphic console, you must first ensure that
					the Linux kernel supports your system's graphic card.
				</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;					There are two ways to deal with the graphic console.
					If you think about bug-reporting any trouble, you must know how to
					differentiate both. First, the <EM
>STI</EM
> console is
					the classical video text console, like <EM
>VGA</EM
> on a
					common PC for example. This name is due to the fact that each PA-RISC
					box with graphical capabilities features the <A
HREF="gloss.html#glosssti"
><I
CLASS="glossterm"
>Standard Text Interface (<SPAN
CLASS="acronym"
>STI</SPAN
>)</I
></A
>
					which defines some standardized ways to access the video memory.
					The other graphic console is the well known
					<EM
>framebuffer</EM
> console (which on
					HP-PA uses STI in a special manner, hence the name
					<EM
>STIfb</EM
>). In this case, when booting,
					you will see a characteristic little penguin appearing on
					the top-left corner. This is the easiest way to differentiate
					the two graphic modes.
				</P
><P
>&#13;					Obviously, if you can use graphic console, it is the easiest way to proceed.
					Nevertheless, you must be sure that your hardware is supported.
				</P
><DIV
CLASS="important"
><P
></P
><TABLE
CLASS="important"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/important.gif"
HSPACE="5"
ALT="Important"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					All HP-provided graphics cards can deal with <A
HREF="gloss.html#glosssticon"
><I
CLASS="glossterm"
>Standard Text Interface Console layer (<SPAN
CLASS="acronym"
>STIcon</SPAN
>)</I
></A
>,
					but not all of them are <A
HREF="gloss.html#glossstifb"
><I
CLASS="glossterm"
>Standard Text Interface FrameBuffer layer (<SPAN
CLASS="acronym"
>STIfb</SPAN
>)</I
></A
> supported in Linux.
					This is especially true for Vis-FX cards that can only be used through STIcon.
				</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="serialconsole"
></A
>2.2.2. Using serial console</H2
><P
>&#13;					The serial console is a good way to obtain all console messages,
					including the <A
HREF="gloss.html#glossbch"
><SPAN
CLASS="acronym"
>BCH</SPAN
></A
> ones.
					It is very useful for bug reports, as its output can be easily dumped.
					Moreover, most of the PA-RISC servers can only be managed with serial console.
				</P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;					The only cases where serial console <EM
>HAS TO</EM
> be used is
					either if you don't have a monitor handy, or if the machine doesn't
					support graphics. It is also possible that the kernel can <EM
>NOT</EM
>
					handle some specific graphics hardware present in the machine, but that is
					pretty rare (<A
HREF="gloss.html#glosssticon"
>STIcon</A
> should work everywhere).
				</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;					Here is the procedure to setup serial console support.
				</P
><DIV
CLASS="sect3"
><H3
CLASS="sect3"
><A
NAME="cable"
></A
>2.2.2.1. Serial Cable</H3
><P
>&#13;						To connect a PA-RISC machine to a PC's RS232 port, you need a
						9-pin-to-9-pin female plugs null-modem cable.
						You should be able to obtain such a cable at your local computer
						hardware reseller.
						Obviously, you can also choose to connect the other end of the
						cable to a terminal (in this case it will probably need
						a 25-pin male plug). Anyway, the most practical method is
						to connect it to another box running <B
CLASS="command"
>minicom</B
>
						or <B
CLASS="command"
>cu</B
>, which makes all output easily available for
						further usage (dump report, session log, and so on).
		  	  </P
></DIV
><DIV
CLASS="sect3"
><H3
CLASS="sect3"
><A
NAME="minicom"
></A
>2.2.2.2. Configuring <B
CLASS="command"
>minicom</B
> on Linux</H3
><P
>&#13;						In order to communicate with a PA-RISC machine on a serial line,
						you have to set it up in serial console mode (see
						<A
HREF="consoles.html#changingtoserial"
>below</A
>),
						and configure a serial communication program. We recommend
						<B
CLASS="command"
>minicom</B
>, which can be found in most
						Linux distributions. If you don't have <B
CLASS="command"
>minicom</B
>
						on your system, you can find the latest package on any major
						Linux software website.
		  	  </P
><P
>&#13;						Most of the <B
CLASS="command"
>minicom</B
> configuration is machine dependent.
						However, you must ensure that:
		  	  </P
><P
></P
><OL
TYPE="a"
><LI
><P
>The baud rate is set to 9600</P
></LI
><LI
><P
>Protocol is set to 8-N-1 (8bit data, No parity check, 1 stop bit)</P
></LI
></OL
><P
>&#13;						Don't worry too much as these are the default values on PA/Linux.
						If you are running <B
CLASS="command"
>minicom</B
> on a PC, you will
						probably need to change the baud rate.
		  	  </P
></DIV
></DIV
><DIV
CLASS="sect2"
><H2
CLASS="sect2"
><A
NAME="switchingconsoles"
></A
>2.2.3. Switching consoles</H2
><P
>&#13;					It might prove useful that you learn how to manage the console mode on a PA-RISC box.
					The following section will explain the various operations regarding console modes.
				</P
><DIV
CLASS="sect3"
><H3
CLASS="sect3"
><A
NAME="checkingcurrentmode"
></A
>2.2.3.1. Checking current console mode</H3
><P
>&#13;						Type: <B
CLASS="command"
>path console</B
> to see the current console mode.
				  </P
><P
>&#13;						If it's <EM
>graphic console</EM
> mode, it will return
						something like: '<TT
CLASS="computeroutput"
>Console path     = graphic_1</TT
>'.
				  </P
><P
>&#13;						If it's <EM
>serial console</EM
>, it will return:
						'<TT
CLASS="computeroutput"
>Console path    = rs232_a.9600.8.none</TT
>'
						or something similar.
		  	  </P
><DIV
CLASS="note"
><P
></P
><TABLE
CLASS="note"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;						On some models, there can be slight differences in the naming, but the idea stays
						the same. If you want to see more descriptions here, please send us a message describing
						the box you use and what you get.
					</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="sect3"
><H3
CLASS="sect3"
><A
NAME="changingtoserial"
></A
>2.2.3.2. Changing to serial console mode</H3
><P
>&#13;						To change to serial console mode, type the following command at the
						'<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' command prompt:
		  	  </P
><P
>&#13;						<B
CLASS="command"
>path console rs232_a.9600.8.none</B
>
				  </P
><P
>or, like on B132L+</P
><P
>&#13;						<B
CLASS="command"
>path console serial_1</B
>
				  </P
><P
>&#13;						Anyway, on most boxes if you try to setup an invalid path for the console,
						you will be warned and prompted again for a valid path.
						To verify that the console path has been correctly set, type
						<B
CLASS="command"
>path console</B
>.  This should return something like
						'<TT
CLASS="computeroutput"
>Console path    = rs232_a.9600.8.none</TT
>',
						indicating that the system is now set up to boot using serial console,
						on RS232 port 'A'.
						If your machine has only one, this is OK, if not, take care to use the right one.
						<B
CLASS="command"
>reset</B
> will reboot your system with the new parameters.
		  	  </P
><DIV
CLASS="sect4"
><H4
CLASS="sect4"
><A
NAME="serial712"
></A
>2.2.3.2.1. How can I change the boot console to serial on a 712?</H4
><P
>&#13;							Unfortunately, it is <EM
>*normally*</EM
> not possible.
							Although 712s are configured for in-house HP development to use serial,
							this cannot be set in <B
CLASS="command"
>BOOT_ADMIN</B
>. You will have to use graphic console on 712s.
							And why the hell would we use this beautiful 712 with serial console when
							we can have X on it?!
						</P
><P
>&#13;							Anyway, if you feel like trying bleeding edge solutions, there is a tip at the
							<A
HREF="http://lists.parisc-linux.org/pipermail/parisc-linux/1999-December/008117.html"
TARGET="_top"
>PA/Linux mailing list archive</A
>.
							This explains how to change the console from an <EM
>HP/UX
							<A
HREF="gloss.html#glossisl"
>ISL</A
></EM
> prompt. Since you actually
							<EM
>need</EM
> HP/UX to be able to do the serial trick,
							you can find a small HP/UX <EM
>lifimage</EM
> here:
							<A
HREF="http://www.pateam.org/archive/uxbootlf"
TARGET="_top"
>http://www.pateam.org/archive/uxbootlf</A
>.
							(See further <A
HREF="bootnetwork.html"
>Section 4.3</A
> to learn how to
							<EM
>netboot</EM
> a lifimage).
							In fact, serial console on 712 is especially useful if you want to boot the box
							without having a keyboard attached to it, which is otherwise not possible.
						</P
><DIV
CLASS="warning"
><P
></P
><TABLE
CLASS="warning"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>&#13;							The following takedown is highly unofficial, unsupported and in a general
							way a <EM
>bad idea</EM
>, as you can make your 712 unbootable,
							needing intervention from a HP-techie, if something goes wrong. Beware!
						</P
></TD
></TR
></TABLE
></DIV
><P
>&#13;							Here is the procedure:
						</P
><P
></P
><OL
TYPE="1"
><LI
><P
>&#13;									Turn the box on and when in <B
CLASS="command"
>BOOT_ADMIN</B
>, boot into <SPAN
CLASS="application"
>HP/UX ISL</SPAN
>.
									For example:
								</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="programlisting"
><TT
CLASS="computeroutput"
>&#13;BOOT_ADMIN&#62; boot lan isl
								</TT
></PRE
></FONT
></TD
></TR
></TABLE
></LI
><LI
><P
>&#13;									Once you get the '<TT
CLASS="computeroutput"
>ISL&#62;</TT
>' prompt,
									type the following:
								</P
><P
></P
><UL
><LI
><P
>Switching to serial: <B
CLASS="command"
>conspath 2/0/4.0x283</B
></P
></LI
><LI
><P
>Switching to graphic: <B
CLASS="command"
>conspath 1/0/0.0</B
></P
></LI
></UL
></LI
><LI
><P
>&#13;									Still at the '<TT
CLASS="computeroutput"
>ISL&#62;</TT
>' prompt,
									type <B
CLASS="command"
>disp</B
>, and check that console path is either
									'<TT
CLASS="computeroutput"
>(hex) 2/0/4.283.0.0.0.0.0</TT
>'
									for serial, or '<TT
CLASS="computeroutput"
>(hex) 1/0/0.0.0.0.0.0.0</TT
>'
									for graphic.
								</P
></LI
><LI
><P
>Power cycle the system to bring it up on the new console.</P
></LI
></OL
></DIV
></DIV
><DIV
CLASS="sect3"
><H3
CLASS="sect3"
><A
NAME="changingtographic"
></A
>2.2.3.3. Changing to graphic console mode</H3
><P
>&#13;				  	This is the reverse of the previous operation.
						By checking your console path, you should see
						'<TT
CLASS="computeroutput"
>Console path    = rs232_a.9600.8.none</TT
>'.
						Now, you can switch to the graphic mode by issuing the following command at
						'<TT
CLASS="computeroutput"
>BOOT_ADMIN&#62;</TT
>' prompt:
					</P
><P
>&#13;						<B
CLASS="command"
>path console graphic_1</B
>
				  </P
><P
>&#13;						The actual <EM
>switch</EM
> will happen after a
						<B
CLASS="command"
>reset</B
>. If the monitor does not seem to
						work properly, try to press the <B
CLASS="keycap"
>Tab</B
> key
						(on the keyboard attached to the box of course)
						at the beginning of the boot sequence to change the resolution of the display.
						By pressing this key, the monitor resolution cycles from one to another.
					</P
><DIV
CLASS="tip"
><P
></P
><TABLE
CLASS="tip"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/tip.gif"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Keep that in mind when changing monitors.</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="bootadmin.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="palo.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><B
CLASS="command"
>BOOT_ADMIN</B
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="preparation.html"
ACCESSKEY="U"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><B
CLASS="command"
>PALO</B
>, the PA/Linux kernel loader</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>