<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.52">
 <META NAME="LFCATEGORY" CONTENT="Hardware">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf379, Hardware: Une alimentation num&eacute;rique CC</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 table.left { margin-right:0.3cm }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 div.tbbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   margin: 2px 5px 2px 5px;
   text-align: center;
   width: 20em;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
 div.bbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   float: left;
   margin: 2px 5px 2px 5px;
   text-align: center;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Guido     Socher
 =LF=CAT___: Hardware
 =LF=TITLE_: Une alimentation num&eacute;rique CC
 =LF=NUMBER: 379
 =LF=ANAME_: article379.shtml
 =LF=PARSER: 2.52
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, current, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><a href="../../index.shtml"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></a></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 
                 <A class="nodec" href="../../index.shtml"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Carte</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Index</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/index.html"><FONT color=
                 "#DDDDDD" size="2">Recherche</FONT></A> </TD>
                 
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/index.shtml"><FONT color=
           "#FFFFFF">Nouvelles</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/index.html"><FONT color=
           "#FFFFFF">Archives</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/index.html"><FONT color=
           "#FFFFFF">Liens</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">A propos</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfdynahead ver 1.5 --><TABLE ALIGN="right" border=0><TR><TD ALIGN="right"><FONT SIZE="-1" FACE="Arial,Helvetica">Ce document est disponible en: <A href="../../English/June2005/article379.shtml">English</a> &nbsp;<A href="../../Francais/June2005/article379.shtml">Francais</a> &nbsp;<A href="../../Turkce/June2005/article379.shtml">Turkce</a> &nbsp;</FONT></TD></TR></TABLE><br>
 


<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_START -->
<TABLE ALIGN="LEFT" BORDER="0" WIDTH="195" summary="about the author" class="left">
<TR>
<TD>

<img src="../../common/images/Guido-S.gif" alt=
    "[Photo de l'Auteur]" height="164" width="173">
<BR>par  Guido Socher <a href="http://linuxfocus.org/~guido/"><font size="1">(homepage)</font></a>
<BR><BR>
<I>L&acute;auteur:</I><BR>
<!-- aboutauthor_start -->
<p>Guido adore Linux parce qu'il est un vraiment bon syst&egrave;me pour d&eacute;velopper
    votre propre mat&eacute;riel.</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED_TO fr -->
<BR><BR><I>Traduit en Français par:</I><BR>
Jean-Etienne Poirrier (<a href="http://jepoirrier.free.fr/"><font size="1">homepage</font></a>)
<br>
<!--
 =LF=TRANSTO=fr: Jean-Etienne Poirrier
-->
<!-- TRANSLATED_TO_STOP -->
<!-- INDEX_START -->
<BR><i>Sommaire</i>:
<UL>
  <LI><A HREF="#379lfindex0">Introduction</A></LI>
  <LI><A HREF="#379lfindex1">L'id&eacute;e de base du plan &eacute;lectrique</A></LI>
  <LI><A HREF="#379lfindex2">L'&eacute;chelle R-2R</A></LI>
  <LI><A HREF="#379lfindex3">Un plan plus d&eacute;taill&eacute;</A></LI>
  <LI><A HREF="#379lfindex4">Le circuit final</A></LI>
  <LI><A HREF="#379lfindex5">Les limites</A></LI>
  <LI><A HREF="#379lfindex6">Les sources de courant</A></LI>
  <LI><A HREF="#379lfindex7">Les tests</A></LI>
  <LI><A HREF="#379lfindex8">Le logiciel</A></LI>
  <LI><A HREF="#379lfindex9">Quelques photos et id&eacute;es</A></LI>
  <LI><A HREF="#379lfindex10">R&eacute;f&eacute;rences/T&eacute;l&eacute;chargement</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=379">Talkback form for this article</A></LI>
</UL>

</TD></TR></TABLE>
<!-- INDEX_STOP -->
<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_STOP -->
<!-- HEAD_OF_THE_ARTICLE_START -->
<br>&nbsp;
<table border="0"><tr><td>
<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfPdf ver 0.1 -->
<TABLE style="border-style:outset; border-width:1px" align="right" bgcolor="#ff9616" cellspacing="1"><TR><TD bgcolor="#ff9616">
        <a href="../Archives/lf-2005_06-0379.pdf"><small>PDF</small></a>
        </TD></TR></TABLE>
         

<H2>Une alimentation num&eacute;rique CC</H2>
 <img src="../../common/images2/article379/title_379.jpg"
    alt="[Illustration]" hspace="10" width="354" height="173">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>R&eacute;sum&eacute;</i>:
<P>
<!-- articleabstract_start -->

    Une alimentation &eacute;lectrique en courant continu (CC) fiable est un
    p&eacute;riph&eacute;rique important pour une passion comme l'&eacute;lectronique. Une alimentation
    &eacute;lectrique stabilis&eacute;e &eacute;lectroniquement peut facilement co&ucirc;ter plus de 150
    Euros.
    <br>
    En utilisant un plan bas&eacute; sur un microcontr&ocirc;leur intelligent, nous pouvons
    construire une alimentation &eacute;lectrique qui a plus de fonctionnalit&eacute;s et qui
    est beaucoup moins ch&egrave;re.
    <br><br>
    Les lecteurs, pour qui tout ceci serait nouveau, devraient d'abord lire <a
    href="../November2004/article352.shtml">Programmer le microcontr&ocirc;leur AVR
    avec GCC, libc 1.0.4</a>.
    <br><br>
    Ne vous inqui&eacute;tez pas si le circuit imprim&eacute; semble trop compliqu&eacute; pour votre
    laboratoire &agrave; la maison. Toutes les pi&egrave;ces et des PCB pr&eacute;-imprim&eacute;s seront,
    encore une fois, disponibles sur <a
    href="http://shop.tuxgraphics.org/electronic/microcontroller.html">
    shop.tuxgraphics.org</a>.

    
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- HEAD_OF_THE_ARTICLE_STOP -->
<!-- BODY_OF_THE_ARTICLE_START -->


    <A NAME="379lfindex0">&nbsp;</A>
<H2>Introduction</H2>


    En 2002, j'ai &eacute;crit un article pour linuxfocus.org sur une alimentation
    &eacute;lectrique se basant sur un microcontr&ocirc;leur (<a
    href="../November2002/article251.shtml">article251 du num&eacute;ro de
    novembre 2002</a>). L'article a re&ccedil;u beaucoup d'int&eacute;r&ecirc;t, comme j'ai pu le
    remarquer des courriels que j'ai re&ccedil;u &agrave; son sujet. Le plan de cette
    alimentation &eacute;lectrique &eacute;tait cependant difficile pour les fans, dont
    l'&eacute;lectronique reste une passion, d&ucirc; &agrave; la complexit&eacute; du circuit.
    <br>
    <br>
    Ainsi, voici maintenant un nouveau plan, moins complexe, mais qui poss&egrave;de
    plus de fonctionnalit&eacute;s.
    <br>
    <ol>
      <li>Seulement des composants pas chers et standards sont utilis&eacute;s</li>
      <li>Seulement une source de courant est n&eacute;cessaire (pas de
      tension n&eacute;gative pour des amplificateurs op&eacute;rationnels)</li>
      <li>L'affichage montre les valeurs pr&eacute;d&eacute;finies et actuelles de la tension
      et du courant en m&ecirc;me temps.</li>
      <li>Vous pouvez compl&egrave;tement contr&ocirc;ler l'alimentation &eacute;lectrique via votre
      ordinateur ou vous pouvez l'utiliser seule.</li>
      <li>Elle est tr&egrave;s petite et tr&egrave;s puissante.</li>
    </ol>
    Comment a-t-il &eacute;t&eacute; possible d'enlever des composants et d'ajouter plus
    de fonctionnalit&eacute;s ? Le truc est de d&eacute;placer les fonctionnalit&eacute;s qui &eacute;taient
    pr&eacute;c&eacute;demment bas&eacute;es sur des composants analogiques (comme les amplificateurs
    op&eacute;rationnels) dans le microcontr&ocirc;leur. En d'autres termes, la complexit&eacute; du
    logiciel et des algorithmes est plus &eacute;lev&eacute;e mais la complexit&eacute; du mat&eacute;riel
    est r&eacute;duite. Cela r&eacute;duit la complexit&eacute; de l'ensemble pour vous puisque le
    logiciel peut &ecirc;tre juste copi&eacute;. Le fait que l'Atmega8 puisse faire beaucoup
    plus que le microcontr&ocirc;leur AT90S4433, maintenant d&eacute;pass&eacute;, a aid&eacute; &eacute;galement.
    <br>
    <br>
    Dans cet article, vous apprendrez aussi de nouvelles choses sur l'Atmega8.
    Vous avez vu comment utiliser le convertisseur analogique-digital. Nous
    allons ajouter un convertisseur digital-analogique tr&egrave;s rapide qui pourra
    &ecirc;tre utile pour beaucoup d'autres circuits.
    <br>
    <br>
    Dans cet article, nous allons discuter du plan mat&eacute;riel et &eacute;lectrique. Il y
    aura ensuite deux articles suppl&eacute;mentaires o&ugrave; j'expliquerai le logiciel.
    Nous allons aussi ajouter plus de fonctionnalit&eacute;s. Cependant, les ajouter ne
    n&eacute;cessitera que des changements logiciels.

    <A NAME="379lfindex1">&nbsp;</A>
<H2>L'id&eacute;e de base du plan &eacute;lectrique</H2>

    Je pourrais bien s&ucirc;r juste vous donner le diagramme du circuit et quelques
    instructions sur la mani&egrave;re de le construire. Cela fonctionnera probablement
    mais vous ne saurez pas comment cela fonctionne. La plupart des kit
    d'&eacute;lectronique de hobby sont comme &ccedil;&agrave;.
    <br>
    <br>
    L'id&eacute;e du magasin en ligne <a href="http://shop.tuxgraphics.org">
    shop.tuxgraphics.org</a> est cependant de fournir de la bonne documentation
    gratuite accompagnant les kits de d&eacute;veloppement. Dans la documentation (par
    exemple, cet article), nous expliquons r&eacute;ellement comment les choses
    fonctionnent et pourquoi elles ont &eacute;t&eacute; con&ccedil;ues de cette mani&egrave;re. Je trouve
    beaucoup plus amusant de construire quelque chose que je comprends et
    j'esp&egrave;re que vous l'appr&eacute;ciez aussi.
    <br>
    <br>
    Commen&ccedil;ons par l'alimentation &eacute;lectrique stabilis&eacute;e &eacute;lectroniquement la plus
    simple possible. Elle consiste en 2 parties de base : un transistor et une
    r&eacute;f&eacute;rence de tension g&eacute;n&eacute;r&eacute;e avec une diode Z.
    <br>
    <center>
    <img src="../../common/images2/article379/basicpower_idea.gif"
    alt="bloc de construction le plus simple possible" width="400"
    height="306">
    </center>
    <br>
    La tension de sortie de ce circuit est Uref - 0.7V. Les 0.7V sont
    approximativement la chute de tension que vous avez entre B et E sur le
    transistor. La diode Z et la r&eacute;sistance g&eacute;n&egrave;rent une tension de r&eacute;f&eacute;rence
    qui est stable, m&ecirc;me si l'entr&eacute;e fluctue et est bruit&eacute;e. Le transistor est
    n&eacute;cessaire pour g&eacute;rer des courants plus &eacute;lev&eacute;s que la diode Z et la
    r&eacute;sistance seuls ne peuvent fournir. Dans cette configuration, le transistor
    amplifie juste le courant. Le courant que la r&eacute;sistance et la diode Z
    doivent fournir est le courant de sortie divis&eacute; par hfe (hfe est un nombre
    que vous pouvez trouver en regardant dans la feuille de sp&eacute;cifications du
    transistor).
    <br>
    <br>
    Quels sont les probl&egrave;mes avec ce circuit ?
    <ul>
      <li>Le transistor va mourir lorsqu'il y aura un court-circuit dans la
      sortie</li>
      <li>Il ne fournit qu'une tension de sortie fixe</li>
    </ul>
    Ce sont des limitations assez importantes qui rendent ce circuit
    inutilisable mais ce circuit est toujours le bloc de construction de base de
    toutes les alimentations &eacute;lectriques r&eacute;gul&eacute;es &eacute;lectroniquement.
    <br>
    <br>
    Pour surmonter ces probl&egrave;mes, vous avez besoin d'une certaine « intelligence »
    qui va r&eacute;guler le courant sur la sortie et une tension de r&eacute;f&eacute;rence
    variable. C'est tout (... et cela rend le circuit beaucoup plus complexe).
    <br>
    <br>
    Pendant les derni&egrave;res d&eacute;cennies, les gens ont utilis&eacute; des amplificateurs
    op&eacute;rationnels pour fournir cette intelligence. Les amplificateurs
    op&eacute;rationnels peuvent, au fond, &ecirc;tre utilis&eacute;s comme des calculateurs
    analogiques pour additionner, soustraire, multiplier ou faire des « ou »
    logiques sur des tensions et des courants.
    <br>
    <br>
    De nos jours, les microcontr&ocirc;leurs sont si rapides que tout cela peut &ecirc;tre
    r&eacute;alis&eacute; facilement par logiciel. La beaut&eacute; est que vous obtenez &eacute;galement un
    voltm&egrave;tre et un amp&egrave;rem&egrave;tre gratuitement, comme effet secondaire. La boucle
    de cont&ocirc;le dans les microcontr&ocirc;leur doit conna&icirc;tre les valeurs de tension et
    de courant, d'une fa&ccedil;on ou d'une autre. Vous n'avez qu'&agrave; l'afficher. Ce dont
    vous avez besoin de la part du microcontr&ocirc;leur, c'est :
    <ul>
      <li>un convertisseur A-D pour mesurer la tension</li>
      <li>un convertisseur D-A pour envoyer les commandes &agrave; notre transistor de
      puissance (qui fournit la tension de r&eacute;f&eacute;rence)</li>
    </ul>
    Le probl&egrave;me est que le convertisseur D-A a besoin d'&ecirc;tre tr&egrave;s rapide. S'il y
    a un court-circuit d&eacute;tect&eacute; dans la sortie, alors il doit imm&eacute;diatement
    r&eacute;duire la tension &agrave; la base du transistor sinon il mourra. Rapide signifie
    en quelques millisecondes (aussi rapide qu'un amplificateur
    op&eacute;rationnel).
    <br>
    <br>
    L'Atmega8 poss&egrave;de un convertisseur A-D qui est plus que rapide mais il
    n'a pas, &agrave; premi&egrave;re vue, de convertisseur D-A. Il est possible d'utiliser
    une modulation en largeur d'impulsion et un filtre passe-bas
    analogique pour obtenir un convertisseur D-A mais elle reste beaucoup trop
    lente pour impl&eacute;menter la protection contre les court-circuits dans le
    logiciel. Comment construire un convertisseur D-A rapide ?

    <A NAME="379lfindex2">&nbsp;</A>
<H2>L'&eacute;chelle R-2R</H2>

    Il y a de nombreuses mani&egrave;res de construire un convertisseur
    digital-analogique mais nous en avons besoin d'un, rapide, pas cher et qui
    peut facilement s'interfacer avec notre microcontr&ocirc;leur. Il existe un
    convertisseur D-A connu sour le nom « d'&eacute;chelle R-2R ». Il consiste en des
    r&eacute;sistances et des interrupteurs seulement. Il y a deux types de r&eacute;sistances. Une
    avec R et une avec deux fois la valeur de R.
    <br>
    <center>
    <img src="../../common/images2/article379/r2rladder.gif" alt="r2rladder"
    width="488" height="424">
    </center>
    <br>
    La figure ci-dessus montre un convertisseur D-A R2R 3 bits. La logique de
    contr&ocirc;le d&eacute;place les interrupteurs entre GND et Vcc. Un « 1 » num&eacute;rique connecte
    l'interrupteur &agrave; Vcc et un « z&eacute;ro » num&eacute;rique &agrave; GND. Que fait ce circuit ? Il fournit
    des tensions par pas de Vcc/8. En g&eacute;n&eacute;ral, la tension de sortie est Z *
    (Vcc/(Zmax+1)) o&ugrave; Z est le nombre num&eacute;rique. Dans le cas du convertisseur A-D
    3 bits, c'est 0-7.
    <br>
    <br>
    La r&eacute;sistance interne du circuit est vue comme la sortie de R.
    <br>
    <br>
    Au lieu d'utiliser des interrupteurs s&eacute;par&eacute;s, nous pouvons connecter l'&eacute;chelle
    R-2R aux lignes de sortie du microcontr&ocirc;leur. Une broche de sortie de l'Atmega8
    peut fournir environ 10mA mais, &agrave; ce courant, vous notez d&eacute;j&agrave; une chute de
    tension. Nous souhaiterions utiliser la gamme totale de sortie 0-5V de
    mani&egrave;re &agrave; ce que la charge sur la sortie soit moindre qu'1 mA. En d'autres
    termes, nous construisons une &eacute;chelle R-2R avec des r&eacute;sistances de 5K et
    10K.
    <br>
    <br>
    Le convertisseur A-D de l'Atmega8 a une r&eacute;solution de 10 bits. Pour utiliser
    compl&egrave;tement cette r&eacute;solution, nous avons &eacute;galement besoin de 10 bits pour
    le convertisseur D-A. En d'autres termes, nous avons besoin de trouver 10
    broches de sortie qui ne sont pas utilis&eacute;es par rien d'autre. C'est un petit
    d&eacute;fi puisque nous souhaitons &eacute;galement avoir un clavier, un affichage LCD et
    une interface s&eacute;rielle I2C vers le PC mais l'Atmega8 est assez bon. Tout
    entre dedans.

    <A NAME="379lfindex3">&nbsp;</A>
<H2>Un plan plus d&eacute;taill&eacute;</H2>

    Ainsi, voici un plan plus d&eacute;taill&eacute; du circuit ci-dessus.
    <br>
    <center>
    <img src="../../common/images2/article379/detailpower_idea.gif" alt="id&eacute;e
    sch&eacute;matique d&eacute;taill&eacute;e" width="400" height="253">
    </center>
    <br>
    Je ne veux pas vous d&eacute;courager mais c'est malheureusement toujours un
    circuit qui n'est pas utilisable. Cependant, il est tr&egrave;s int&eacute;ressant pour
    comprendre l'id&eacute;e qui se trouve derri&egrave;re le circuit final.
    <br>
    Mais qu'est-ce qui ne va pas avec ce circuit ? Il y a principalement deux
    choses :
    <ul>
      <li>Le DAC (digital to analog converter, convertisseur digital vers
      analogique) ne peut pas fournir le courrant pour conduire le transistor de
      puissance.
      <li>Le microcontr&ocirc;lleur op&egrave;re &agrave; 5V ; donc, la sortie maximum du DAC est
      5V, ce qui signifie que la tension de sortie maximale derri&egrave;re le
      transistor de puissance sera 5 - 0.7 = 4.3V.
    </ul>
    Pour r&eacute;soudre cela, nous devons ajouter des amplificateurs pour le courant
    et la tension.

    <A NAME="379lfindex4">&nbsp;</A>
<H2>Le circuit final</H2>

    Lorsqu'on ajoute des amplificateurs, nous devons garder &agrave; l'esprit qu'ils
    doivent fonctionner avec des signaux larges. La plupart des plans
    d'amplificateurs (par exemple, pour l'audio) sont fait avec la supposition
    que les signaux seront petits compar&eacute;s &agrave; la tension fournie. Donc, oubliez
    tous les livres classiques sur la cr&eacute;ation de transistor amplificateurs.
    <br>
    <br>
    Nous pourrions utiliser les amplificateurs op&eacute;rationnels mais ces derniers
    requi&egrave;rent qu'on fournisse des tensions positive et n&eacute;gatives
    suppl&eacute;mentaires, ce que nous cherchons &agrave; &eacute;viter.
    <br>
    <br>
    L'amplificateur nous impose &eacute;galement la condition suppl&eacute;mentaire de
    partir d'une tension fournie de z&eacute;ro jusqu'&agrave; un &eacute;tat stable sans g&eacute;n&eacute;rer
    de pic de sortie. En d'autres termes, il ne doit y avoir aucune
    oscillation courte ou pic de sortie lorsque vous allumer l'alimentation
    &eacute;lectrique.
    <br>
    <br>
    Que faire ? Eh bien, ce n'est pas une t&acirc;che facile du tout et elle requi&egrave;rt
    une petite exp&eacute;rience. Je vais parcourir avec vous le circuit final et
    effectuer les calculs n&eacute;cessaires.
    <br>
    <br>
    Nous partons avec le transistor de puissance. Selon la feuille de
    sp&eacute;cifications, le BD245B a un hfe=20 &agrave; 3A de sortie. Il va ainsi tirer
    environ 15mA sur la Base. Pour amplifier le courant (r&eacute;duire le courant
    n&eacute;cessaire pour conduire le circuit), nous utilisons une configuration
    connue sous le nom de « Darlington transistor ». Pour cela, nous pla&ccedil;ons un
    BD137 devant. Il a une valeur hfe de 50-100. Cela r&eacute;duira le courrant
    n&eacute;cessaire &agrave; moins de 3mA (150mA / 50). 3 mA, c'est g&eacute;rable avec des petits
    transistors de signal comme le BC547/BC557. Il existe aussi des transistors
    pour petite tension qui sont tr&egrave;s bons pour construire des amplificateurs de
    tension.
    <br>
    <br>
    <center>
    <img src="../../common/images2/article379/voltageamplifier.gif"
    alt="amplificateurs" width="420" height="245">
    </center>
    <br>
    <br>
    Pour une sortie de 30V, nous devons au-moins amplifier les 5V du DAC d'un
    facteur de 6. Pour cela, nous combinons un transistor PNP et un NPN comme
    montr&eacute; ci-dessous. L'amplification de tension de ce circuit est :
    <pre class="code">
Vampl = (R10 + R11) / R11
    </pre>
    L'alimentation devrait &ecirc;tre disponible en 2 versions : maximum 30V de sortie
    et maximum 22V de sortie. Une combinaison de 1K et 5.6K donne un facteur de
    6.6, ce qui est bon pour la version 30V. Pour la version 22V, nous utilisons
    1K et 4.7K.
    <br>
    <br>
    La r&eacute;sistance interne du circuit comme vu sur la base du BC547 est :
    <pre class="code">
Rin = hfe1 * S1 * R11 * R9 = 100 * 50 * 1K * 47K = 235 MOhm

- hfe est approximativement 100 &agrave; 200 pour un transistor BC547
- S est la pente de la courbe d'amplification d'un transistor et est
approximativement de 50 [unit = 1/Ohm]
    </pre>
    C'est plus que suffisamment haut pour la connection &agrave; notre DAC qui a une
    r&eacute;sistance interne de 5K.
    <br>
    <br>
    La r&eacute;sistance &eacute;quivalente de notre r&eacute;sistance de sortie est :
    <pre class="code">
Rout = (R10 + R11) / (S1 + S2 * R9 * R11) = approximativement 2 Ohm
    </pre>
    C'est suffisamment bas pour conduire le BD137 suivant.
    <br>
    <br>
    R9 lie la base de BC557 &agrave; l'&eacute;metteur, ce qui signifie « off » pour le
    transistor jusqu'&agrave; ce que le DAC et BC547 arrivent. R11 et R10 lient la base
    du BD137 initialement &agrave; la terre qui coupe la sortie de l'&eacute;tage Darlington.
    <br>
    En d'autres mots, chaque composant dans cet &eacute;tage d'amplification est
    &eacute;teint, initialement. Cela signifie que nous n'obtiendrons aucune
    oscillation, ni pics de sortie de ces transistors &agrave; la mise sous tension.
    <br>
    <br>
    Maintenant que vous avez vu comment un tel circuit est con&ccedil;u, nous devons
    ajouter quelques diodes de protection et des capacit&eacute;s pour stabiliser le
    circuit et ce sera fini.
    <br>
    <center>
    <a href="../../common/images2/article379/powersupply.gif">
    <img src="../../common/images2/article379/powersupply_th.gif"
    alt="circuit final" width="400" height="284"></a>
    <br>
    Le cicuit final est grand comme :
    <a href="../../common/src2/article379/powersupply.png">[PNG]</a>
    <a href="../../common/src2/article379/powersupply.pdf">[PDF]</a>
    <br>
    Les valeurs entre crochets droits sont pour la version de 30V.
    </center>
    <br>
    Le diagramme du circuit et le fichier de conception de la platine (format pcb)
    sont aussi inclus dans le paquet tar.gz qui vous pourrez t&eacute;l&eacute;charger &agrave; la
    fin de cet article.
    <br>
    <br>
    Le connecteur nomm&eacute; « Raw DC in » (= CONN6) poss&egrave;de 3 broches. La broche 1 est le
    « plus », la 2 est le « moins » (= GND) et la broche 3 devrait &ecirc;tre connect&eacute;e &agrave; la
    broche de la terre. En d'autres termes, la « terre » n'est ni directement
    connect&eacute;e &agrave; GND ni &agrave; « plus » non plus.

    <A NAME="379lfindex5">&nbsp;</A>
<H2>Les limites</H2>

    D'exp&eacute;riences pr&eacute;c&eacute;dents, nous savons que la plupart des lecteurs
    souhaiteraient « modifier » un peu le circuit. Voici une liste des limitations
    du mat&eacute;riel et de la mani&egrave;re de les surmonter :
    <pre class="code">
78L05: la tension maximale d'entr&eacute; est de 30V, le ZD8.2 &eacute;tend cette limite &agrave;
    environ 38V. En utilisant une diode Z diff&eacute;rente, vous pouvez &eacute;tendre
    cela un peu. Cela n'ira pas au-del&agrave; de 45V.
    La tension maximale de sortie devrait &ecirc;tre au moins 2V plus basse que
    la tension d'entr&eacute;e.

BD245B: 10A 80W, Les 80W sont cependant &agrave; une temp&eacute;rature de 25°C. En
    d'autres termes, ajoutez une marge de s&eacute;curit&eacute; et calculez avec 60W :
    (tension maximale de sortie * courant maximal &lt; 60W

    Vous pouvez ajouter un second BD245B pour aller jusqu'&agrave; 120W. Pour
    s'assurer que le courant se distribue de mani&egrave;re &eacute;gale, ajoutez une
    r&eacute;sistance de 0.22 Ohms dans la ligne d'Emetteur de chaque BD245B.
    Le m&ecirc;me circuit et la m&ecirc;me carte peuvent &ecirc;tre utilis&eacute;. Montez les
    transistors sur un refroidisseur en aluminium propre et connectez-les
    avec de courts fils &agrave; la carte.

Shunt de mesure du courant :
    Il y a une r&eacute;sistance de 0.5 ou 0.55 Ohm avec 6W. Cela est suffisant
    pour environ 3A de sortie (Iout^2 * 0.55 &lt;= 6W). Utilisez une
    r&eacute;sistance plus puissante pour des courants plus &eacute;lev&eacute;s.
    </pre>

    <A NAME="379lfindex6">&nbsp;</A>
<H2>Les sources de courant</H2>

    Vous pouvez soit utiliser un transformateur, un redresseur et de grands
    condensateurs ou vous pouvez essayer d'obtenir une alimentation &eacute;lectrique
    32/24V d'ordinateur portable. Je me suis dirig&eacute; vers la seconde option. Ces
    « briques » d'alimentation &eacute;lectrique pour ordinateur portable sont parfois
    vendues tr&egrave;s bon march&eacute; (fin de stock) et quelques unes fournissent 70W &agrave;
    24V ou m&ecirc;me 32V DC.
    <br>
    <br>
    La plupart des gens iront probablement vers la solution du transformateur
    parce qu'ils sont tr&egrave;s faciles &agrave; obtenir.
    <pre class="code">
version 22V 2.5A : vous avez besoin d'un transformateur 18V 2.5A, un
                   redresseur et un condensateur de 3000&micro;F (raison :
                   18 * 1.4 = 2.5V, au moins 1000&micro;F par amp&egrave;re)

version 30V 2A : vous avez besoin d'un transformateur 24V 2A, redresseur et
                 un condensateur de 2200&micro;F (raison : 24 * 1.4 = 33.6V, au
                 moins 1000&micro;F par amp&egrave;re)

Cela ne fait pas de tort d'acheter un transformateur qui peut fournir plus
d'amp&egrave;res.
    </pre>

    V&eacute;rifiez que votre circuit poss&egrave;de une isolation correcte. Soyez s&ucirc;r qu'il n'est
    <b>pas</b> possible de toucher aucune partie qui pourrait transporter
    110V/230V, m&ecirc;me quand la bo&icirc;te est ouverte. Connectez toutes les parties
    m&eacute;talliques du chassis &agrave; la terre (pas au GND du circuit).

    <A NAME="379lfindex7">&nbsp;</A>
<H2>Les tests</H2>

    Quand vous avez soud&eacute; tout ensemble, ne connectez pas encore le microcontr&ocirc;leur
    au secteur. Effectuez, d'arbord, quelques tests de base.
    <br>
    <br>
    Test 1 : Connectez une alimentation &eacute;lectrique (au-moins 15V) &agrave; l'entr&eacute;e de
    courant du circuit et v&eacute;rifiez que vous obtenez 5V DC derri&egrave;re le r&eacute;gulateur
    de tension.
    <br>
    <br>
    Test 2 : Mesurez la tension de sortie. Elle devrait &ecirc;tre de 0V.
    <br>
    <br>
    Test 3 : Connectez les broches 7 et 26 sur le microcontr&ocirc;leur avec un fil (le
    microcontr&ocirc;leur n'&eacute;tant pas raccord&eacute; au secteur). Vous devriez
    obtenir, en sortie, quelques volts de moins que ce qui est utilis&eacute; en entr&eacute;e
    DC. Enlevez le fil et la sortie devrait retourner &agrave; z&eacute;ro. Assurez-vous de ne
    pas provoquer de court-circuit sur la sortie.
    <br>
    <br>
    Ins&eacute;rez le microcontr&ocirc;leur et chargez le logiciel de test LCD en lan&ccedil;ant les
    commandes suivantes dans le r&eacute;pertoire du paquet digitaldcpower.tar.gz
    d&eacute;compress&eacute; :
    <pre class="code">
make lcdtest
make lcdtestload
    </pre>
    Vous devriez voir « ok works » sur l'affichage.
    <br>
    <br>
    Maintenant, vous pouvez charger le logiciel final comme d&eacute;crit ci-dessus.

    <A NAME="379lfindex8">&nbsp;</A>
<H2>Le logiciel</H2>

    Pour les curieux, j'ai inclus une description assez longue de chaque fichier
    .c dans le fichier README du paquet digitaldcpower.tar.gz. Le code contient
    &eacute;galement de nombreux commentaires. Sinon, j'ai l'intention d'&eacute;crire
    d'autres articles qui expliqueront juste la partie logiciel. Cet article est
    d&eacute;j&agrave; assez long et vous devez construire le mat&eacute;riel, tout d'abord.
    <br>
    <br>
    J'ajouterai aussi graduellement plus de fonctionnalit&eacute;s avec les prochains
    articles :
    <ul>
      <li>Vous serez capables de stocker les param&egrave;tres (limite de tension et de
      courant) de mani&egrave;re &agrave; ce que l'alimentation &eacute;lectrique s'allume avec les
      m&ecirc;mes param&egrave;tres au prochain allumage</li>
      <li>Vous serez capables de contr&ocirc;ler l'alimentation &eacute;lectrique &agrave; partir de
      votre PC sous Linux via le connecteur rs232.</li>
    </ul>

    Maintenant, vous voulez savoir comment utiliser le logiciel et comment le
    charger.
    <br>
    D&eacute;compressez le paquet digitaldcpower.tar.gz et entrez (« cd ») dans le
    r&eacute;pertoire qui est cr&eacute;&eacute;.
    <br>
    Editez le fichier hardware_settings.h et ajustez-le en fonction du mat&eacute;riel.
    Ici, vous pouvez aussi effectuer les calibrations du voltm&egrave;tre et de
    l'amp&egrave;rem&egrave;tre. Le fichier est bien comment&eacute;.
    <pre class="code">
gedit hardware_settings.h
    </pre>
    Connectez le c&acirc;ble de programmation et allumez le circuit. Ensuite, ex&eacute;cutez
    :
    <pre class="code">
make wrfuse4mhz

Cela va positionner la fr&eacute;quence d'horloge du microcontr&ocirc;leur &agrave; 4MHz. Le
logiciel est con&ccedil;u pour cette fr&eacute;quence.

make

Cela va compiler le logiciel.

make load

Cela va charger le logiciel
    </pre>

    <A NAME="379lfindex9">&nbsp;</A>
<H2>Quelques photos et id&eacute;es</H2>

    Voici quelques photos de l'alimentation &eacute;lectrique que j'ai construite. Les
    photos sont parfois meilleures qu'une longue description, sp&eacute;cialement
    lorsqu'il s'agit de mat&eacute;riel et de parties m&eacute;caniques.

    <br>
    <br>
    <br>
    <br>
    <center>
    <img src="../../common/images2/article379/ddcp1.jpg" alt="ddcp1"
    width="370" height="306">
    <br>
    Vous pouvez construire un bo&icirc;tier simple mais ayant l'air professionnel &agrave;
    partir d'une feuille d'aluminium et deux planches en bois.
    </center>
    <br>
    <br>
    <center>
    <img src="../../common/images2/article379/ddcp2.jpg" alt="ddcp2"
    width="370" height="333">
    <br>
    Pliez simplement l'aluminium deux fois. Cela est facile &agrave; faire, m&ecirc;me sans
    &eacute;quipement professionnel.
    </center>
    <br>
    <br>
    <center>
    <img src="../../common/images2/article379/pcbs.jpg" alt="pcbs" width="370"
    height="318">
    <br>
    Les deux circuits imprim&eacute;s. Le plus petit est pour le clavier.
    </center>
    <br>
    <br>
    <center>
    <img src="../../common/images2/article379/ddcp3.jpg" alt="ddcp3"
    width="370" height="212">
    <br>
    Marquez les positions des boutons poussoirs sur le bo&icirc;tier avant de souder
    les boutons sur la carte. Cela rend plus facile le per&ccedil;age des trous &agrave; la
    bonne position
    </center>
    <br>
    <br>
    <center>
    <img src="../../common/images2/article379/ddcp4.jpg" alt="ddcp4"
    width="370" height="278">
    <br>
    Le circuit. Tr&egrave;s petit, riches en fonctionnalit&eacute;s et puissant.
    </center>
    <br>
    <br>
    <center>
    <img src="../../common/images2/article379/ddcp5.jpg" alt="ddcp4"
    width="370" height="322">
    <br>
    L'alimentation &eacute;lectrique finale.
    </center>
    <br>
    <br>
    Amusez-vous ! ... Et il y aura d'autant plus d'amusement que ce mat&eacute;riel
    pourra faire beaucoup plus ...

    <A NAME="379lfindex10">&nbsp;</A>
<H2>R&eacute;f&eacute;rences/T&eacute;l&eacute;chargement</H2>


    <ul>
      <li><a href="../../common/src2/article379/index.html">Page de t&eacute;l&eacute;chargement</a> de cet article
      (les mises &agrave; jour et corrections y seront &eacute;galement disponibles).</li>

      <li>Programmer le microcontr&ocirc;leur AVR avec GCC, libc 1.0.4 : <a href=
      "../November2004/article352.shtml">article 352 de novembre 2004</a></li>

      <li>Feuille de sp&eacute;cifications pour l'Atmega8 : allez sur
      http://www.atmel.com/ et s&eacute;lectionnez products-&gt;Microcontrollers
      -&gt;AVR-8 bit RISC-&gt;Documentation-&gt;datasheets<br>
      <a href="../../common/src2/article365/atmega8.pdf">(copie locale, pdf,
      2479982 bytes)</a></li>

      <li><a href=
      "http://www.tuxgraphics.org/electronics/">section &eacute;lectronique de
      Tuxgraphics</a>, une collection de tous les articles dans cette
      s&eacute;rie.</li>

      <li><a href=
      "http://shop.tuxgraphics.org/electronic/microcontroller.html">magasin en
      ligne Tuxgraphics, section microcontr&ocirc;leurs</a>, vous pouvez y commander
      touts les composants (transistors, composants passifs, affichage LCD, PCB,
      microcontr&ocirc;leur, ...).</li>

    </ul>
    <!-- vim: set sw=2 ts=2 et tw=80: -->
  



<!-- BODY_OF_THE_ARTICLE_STOP -->
<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback form for this article</h2>
Every article has its own talkback page. On this page you can submit a comment or look at comments from other readers:
<center>
    <table width="250" border=0><tr><td>
    <div class="tbbutton"><A class="nodec" href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=379">&nbsp;talkback page&nbsp;</a></div>
    </td></tr></table>
</center>

<br clear="all">
<HR size="2" noshade>
<table width="250" border=0><tr><td>
<div class="bbutton"><a class="nodec" href="../../index.shtml">&lt;--, LF Sommaire</a></div>
</td><td>
<div class="bbutton"><a class="nodec" href="index.shtml">Sommaire de ce num&eacute;ro</a></div>
</td></tr></table>
<br clear="all">
<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">Site Web maintenu par l&acute;&eacute;quipe d&acute;&eacute;dition LinuxFocus</A>
<BR><FONT COLOR="#1111aa"><a href="../../common/copy.html">&copy; Guido     Socher</a><br>&quot;some rights reserved&quot; see <a href="../../license/index.shtml">linuxfocus.org/license/</a><br><a href="http://www.linuxfocus.org">http://www.LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Translation information:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Guido Socher (<a href="http://linuxfocus.org/~guido/"><font size="1">homepage</font></a>)</font></td></tr>
  <tr><td><font size="2">en --&gt; fr: Jean-Etienne Poirrier (<a href="http://jepoirrier.free.fr/"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2005-07-07, generated by lfparser version 2.52</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
