<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.50">
 <META NAME="LFCATEGORY" CONTENT="Graphics">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf348, Graphics: Panoramabilder mit Hugin, Enblend und The Gimp</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 table.left { margin-right:0.3cm }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 div.tbbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   margin: 2px 5px 2px 5px;
   text-align: center;
   width: 20em;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
 div.bbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   float: left;
   margin: 2px 5px 2px 5px;
   text-align: center;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Katja Socher
 =LF=CAT___: Graphics
 =LF=TITLE_: Panoramabilder mit Hugin, Enblend und The Gimp
 =LF=NUMBER: 348
 =LF=ANAME_: article348.shtml
 =LF=PARSER: 2.50
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, current, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><a href="../../index.shtml"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></a></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 
                 <A class="nodec" href="../../index.shtml"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Plan</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Index</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/index.html"><FONT color=
                 "#DDDDDD" size="2">Suchen</FONT></A> </TD>
                 
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/index.shtml"><FONT color=
           "#FFFFFF">Nachrichten</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/index.html"><FONT color=
           "#FFFFFF">Archiv</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/index.shtml"><FONT color=
           "#FFFFFF">Links</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">&Uuml;ber uns</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfdynahead ver 1.5 --><TABLE ALIGN="right" border=0><TR><TD ALIGN="right"><FONT SIZE="-1" FACE="Arial,Helvetica">Dieses Dokument ist verf&uuml;bar auf: <A href="../../English/September2004/article348.shtml">English</a> &nbsp;<A href="../../Castellano/September2004/article348.shtml">Castellano</a> &nbsp;<A href="../../Deutsch/September2004/article348.shtml">Deutsch</a> &nbsp;<A href="../../Francais/September2004/article348.shtml">Francais</a> &nbsp;<A href="../../Italiano/September2004/article348.shtml">Italiano</a> &nbsp;<A href="../../Portugues/September2004/article348.shtml">Portugues</a> &nbsp;<A href="../../Indonesian/September2004/article348.shtml">Indonesian</a> &nbsp;<A href="../../Turkce/September2004/article348.shtml">Turkce</a> &nbsp;</FONT></TD></TR></TABLE><br>
 


<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_START -->
<TABLE ALIGN="LEFT" BORDER="0" WIDTH="195" summary="about the author" class="left">
<TR>
<TD>

<img src="../../common/images/katjasocher.gif" alt=
    "[Photo of the Author]" height="148" width="120">
<BR>von  Katja Socher <br> <small>&lt;katja(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>&Uuml;ber die Autorin:</I><BR>
<!-- aboutauthor_start -->
<p><p>Katja ist die deutsche Redakteurin von LinuxFocus. Sie mag Tux, Computergraphik, Film &amp; Fotografie, Reisen,
    Montr&eacute;al und das Meer. Schau dir doch mal meine neudesignte Homepage auf <a href=
    "http://www.tuxgraphics.org">http://www.tuxgraphics.org</a> an.</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED_TO de -->
<BR><BR><I>&Uuml;bersetzt ins Deutsche von:</I><BR>
Katja Socher <small>&lt;katja(at)linuxfocus.org&gt;</small>
<br>
<!--
 =LF=TRANSTO=de: Katja Socher
-->
<!-- TRANSLATED_TO_STOP -->
<!-- INDEX_START -->
<BR><i>Inhalt</i>:
<UL>
  <LI><A HREF="#348lfindex0">Panoramabilder mit Hugin, Enblend und The
    Gimp</A></LI>
  <LI><A HREF="#348lfindex1">Die Bilder ausw&auml;hlen</A></LI>
  <LI><A HREF="#348lfindex2">Hugin</A></LI>
  <LI><A HREF="#348lfindex3">Enblend</A></LI>
  <LI><A HREF="#348lfindex4">The Gimp</A></LI>
  <LI><A HREF="#348lfindex5">Referenzen</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=348">Talkback f&uuml;r diesen Artikel</A></LI>
</UL>

</TD></TR></TABLE>
<!-- INDEX_STOP -->
<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_STOP -->
<!-- HEAD_OF_THE_ARTICLE_START -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Panoramabilder mit Hugin, Enblend und The Gimp</H2>
 <img src=
    "../../common/images2/article348/tuxcamerapanorama2a.png" alt=
    "[face texture]" vspace="10" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Zusammenfassung</i>:
<P>
<!-- articleabstract_start -->

    In diesem Artikel erzeugen wir ein Panoramabild mit Hugin, Enblend und The Gimp.

    
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- HEAD_OF_THE_ARTICLE_STOP -->
<!-- BODY_OF_THE_ARTICLE_START -->


    <A NAME="348lfindex0">&nbsp;</A>
<H2>Panoramabilder mit Hugin, Enblend und The
    Gimp</H2>


    <p>Ich bin schon immer beeindruckt gewesen, wenn ich ein Panoramabild gesehen habe. Trotzdem besitze ich immer noch keine Kamera mit Panoramafunktion. Aber das ist auch gar nicht n&ouml;tig. Mit Linux sind alle Dinge m&ouml;glich und man kann nat&uuml;rlich auch tolle Panoramabilder durch Benutzen von hugin, enblend und The Gimp erzeugen. <br>
     Hugin setzt die Bilder zusammen und manchmal ist das Ergebnis schon v&ouml;llig ausreichend. Meistens wird man jedoch das Panoramabild mit enblend und The Gimp noch weiter verbessern wollen. Enblend versucht, dass Ergebnis nahtloser aussehen zu lassen. Und mit The Gimp gibt man seinem Bild dann noch den letzten Schliff.<br>
     Die Versionen, die in diesem Artikel verwendet wurden, sind hugin 0.4 pre, enblend
    1.3 und The Gimp 2.0</p>

    <A NAME="348lfindex1">&nbsp;</A>
<H2>Die Bilder ausw&auml;hlen</H2>


    <p>Okay, la&szlig;t uns anschauen, wie es geht. Hier siehst du ein paar Bilder von Montr&eacute;al, die ich irgendwann im April diesen Jahres vom Mont Royal aus gemacht habe.<br>
    <br>
    </p>

    <center>
      <img src=
      "../../common/images2/article348/2004-04-24_1340-165small.jpg"
       hspace="20" width="160" height="120" alt="[individual images]"> <img src=
      "../../common/images2/article348/2004-04-24_1340-166small.jpg"
       hspace="20" width="160" height="120" alt="[individual images]"> <img src=
      "../../common/images2/article348/2004-04-24_1340-167small.jpg"
       hspace="20" width="160" height="120" alt="[individual images]"> <img src=
      "../../common/images2/article348/2004-04-24_1340-168small.jpg"
       hspace="20" width="160" height="120" alt="[individual images]">
    </center>
    <br>


    <center>
      <img src=
      "../../common/images2/article348/2004-04-24_1340-170small.jpg"
       hspace="20" width="160" height="120" alt="[individual images]"> <img src=
      "../../common/images2/article348/2004-04-24_1340-171small.jpg"
       hspace="20" width="160" height="120" alt="[individual images]"> <img src=
      "../../common/images2/article348/2004-04-24_1341-173small.jpg"
       hspace="20" width="160" height="120" alt="[individual images]"> <img src=
      "../../common/images2/article348/2004-04-24_1341-174small.jpg"
       hspace="20" width="160" height="120" alt="[individual images]">
    </center>
    <br>
     <br>
     Ich werde jetzt beschreiben, wie ich aus diesen Bildern ein Panoramabild erzeugt habe, so da&szlig; du dann selber mit deinen Fotos ebenfalls ein Panorama erzeugen kannst.<br>
     Zuerst habe ich ein neues Verzeichnis angelegt und die Fotos, die ich haben wollte, hineinsortiert. Dies ist nat&uuml;rlich nicht unbedingt notwendig, aber ich finde es so einfacher und &uuml;bersichtlicher. Soweit ich wei&szlig;, kann man seine Fotos auch nicht in hugin selber noch sortieren, sondern mu&szlig; sie in der richtigen Reihenfolge einf&uuml;gen.<br>
     Man mu&szlig; die Fotos schon sehr sorgf&auml;ltig ausw&auml;hlen, da sie ma&szlig;geblich f&uuml;r die Qualit&auml;t des Panoramas verantwortlich sind. Stell sicher, da&szlig; sie alle aus der gleichen Entfernung aufgenommen wurden, so da&szlig; die Objekte mit derselben Entfernung auch ungef&auml;hr dieselbe Gr&ouml;&szlig;e haben. Und nat&uuml;rlich m&uuml;ssen die Fotos sich auch ein bi&szlig;chen &uuml;berlappen (es wird empfohlen, da&szlig; sie sich mindestens 20-30% &uuml;berlappen). <br>
     <br>


    <A NAME="348lfindex2">&nbsp;</A>
<H2>Hugin</H2>


    <p>Okay, nach der Auswahl der Bilder starten wir hugin und f&uuml;gen die Fotos unter "Images" hinzu. Klick auf "Add individual images" und w&auml;hle das Verzeichnis mit deinen Bildern. Wenn du sie alle in ein Verzeichnis kopiert hast, kannst du sie alle auf einmal durch  Klicken auf ctrl plus Klick auf jedes Foto selektieren. Ansonsten mu&szlig;t du jedes Fotos einzeln selektieren. Man bekommt eine Vorschau eines seiner Fotos, wenn man es selektiert hat. Auf diese Weise kann man &uuml;berpr&uuml;fen, da&szlig; man wirklich das richtige Foto ausgew&auml;hlt hat. Manchmal ist es gut, eines der Fotos als Anker (anchor point for position) auszuw&auml;hlen. Dieses Fotos wird dann zum Basisfoto, an dem sich alle anderen Fotos ausrichten.<br>
    <br>
    </p>

    <center>
      <img src="../../common/images2/article348/huginimages.png"
      hspace="20" width="400" height="379" alt="[hugin]">
    </center>
    <br>
     <br>
     Wechsle jetzt zu "Cameras and Lens". Selektiere eines der Fotos. In den meisten F&auml;llen werden dadurch die "Design
    Parameters" schon automatisch ausgef&uuml;llt. Wenn nicht, dann mu&szlig;t du unter "degrees of views" eine Zahl um die 40 eingeben (hugin hat diesem Feld bei mir einen Wert von 41.112 gegeben). Die ist ein Wert, der f&uuml;r die meisten "normalen" Kameras richtig ist. Der Linsentyp (lens typ) is meistens "Normal (rectlinear) und der Wert der Brennweite wurde bei mir von hugin mit 12.48 erkannt, der crop factor
    als 3.8. Jetzt hast du einige Werte f&uuml;r den Fall, da&szlig; hugin deine Kamera nicht erkennt. Wenn du eine spezielle Kamera hast, dann solltest du dein Kamerahandbuch konsultieren oder einfach ein bi&szlig;chen mit verschiedenen Werten herumspielen. <br>
     <br>
     Als n&auml;chstes geht es zu den "Control Points". Hier verbringt man den gr&ouml;&szlig;ten Teil seiner Zeit. Stell sicher, da&szlig; "auto fine
    tune" und "auto add" angekreuzt sind. Dadurch hilft dir hugin, die Kontrollpunkte korrekt zu setzen und korrigiert sie ein bi&szlig;chen, wenn es n&ouml;tig ist. <br>
     <br>


    <center>
      <img src=
      "../../common/images2/article348/hugincontrolpoints.png"
      hspace="20" width="400" height="379" alt="[control points]">
    </center>
    <br>
     <br>
     Jetzt siehst du oben eine Liste mit den Nummern der Fotos. Selektiere links 0 und rechts 1, um die ersten zwei Fotos zu sehen. Klicke auf einen signifikanten Punkt im Bild links und suche dann denselben Punkt im rechten Bild. Wenn du mit deinem zweiten Klick v&ouml;llig daneben liegst, teilt hugin dir das mit und du kannst noch mal klicken. Normalerweise braucht man 3 oder 4 Punkte. Hugin benutzt sie, um zu sehen, wo die Fotos sich &uuml;berlappen. D.h. bei einem schwierigen Foto ben&ouml;tigst du vielleicht mehr Punkte. Nach dem Klicken auf die Punkte siehst du unten einen Text wie "found
    corresponding point, mean xcorr coefficient: 0.987115".
    Leider verbessert ein neuer Punkt diesen Wert nicht immer unbedingt, weswegen du den Punkt dann durch Klicken auf "delete" unten eventuell wieder l&ouml;schen m&ouml;chtest.
    Um gute Punkte f&uuml;r Hugin auszuw&auml;hlen, solltest du versuchen, scharfe Punkte zu nehmen und solche, die sehr kontrastreich sind. Vermeide m&ouml;glichst Punkte, die zu nah an den R&auml;ndern liegen. Und wenn es in deinem Panorama Objekte im Vordergrund gibt, vermeide es, sie zu selektieren, um Parallaxe zu vermeiden. Man kann auch die Gr&ouml;&szlig;e des Bildes, in dem man seine Fotos anschaut, auf 100% und mehr vergr&ouml;&szlig;ern, so da&szlig; man seine Punkte genauer ausw&auml;hlen kann. <br>
     <br>
     Bevor du jetzt mit dem n&auml;chsten Bildpaar weitermachst, geh zuerst zu  "Optimizer", la&szlig; die Defaulteinstellungen "Optimize positions (pairwise...)" wie sie sind und klicke auf "Optimize now!". Geh dann wieder zum "Control
    Points" Abschnitt und wiederhole die ganze Prozedur (klicke links auf Bild 1 und rechts auf Bild 2, um das n&auml;chste Bild auszuw&auml;hlen etc.), bis du dich durch alle Bilder durchgearbeitet hast. Nach dem "Optimieren" des letzten Paares geht es  dann zum "Stitcher" Abschnitt.<br>
     <br>
     La&szlig;t uns hier von unten anfangen. Da mu&szlig;t du dich f&uuml;r ein Bildformat f&uuml;r dein Panoramafoto entscheiden. Wenn du enblend nicht benutzen willst, dann kannst du hier jpg, png oder tiff w&auml;hlen. Wenn du dagegen dein Foto mit enblend weiter bearbeiten willst, dann mu&szlig;t du hier "multiple tiff" w&auml;hlen. Dabei erzeugt hugin dann soviele Fotos, wie du auch in hugin geladen hast.<br>
     Als n&auml;chstes mu&szlig;t du die Stitching engine w&auml;hlen. Die Defaulteinstellung zeigt "PTStitcher", aber wenn du das nicht explizit installiert hast, mu&szlig;t du hier "nona" nehmen.<br>
     Klick auf "Calculate Optimal Size" und auf "Calculate Field of
    View". Du hast es fast geschafft.<br>
     Bevor du jetzt auf "Stitch now" klickst, mu&szlig;t du nur noch &uuml;berlegen, ob dein fertiges Bild geradlinig (rectilinear), zylindisch (cylindrical) oder
    equirectangular sein soll. Wenn man nur zwei Fotos zusammenheftet, ist  "rectilinear" die richtige Wahl, wenn es mehrere Bilder sind, aber keine rundum 360° Ansicht solltest du wahrscheinnlich "cylindrical" w&auml;hlen und f&uuml;r eine rundum Ansicht ist "equirectangular" richtig. Wenn du hier eine falsche Entscheidung triffst, bricht hugin entweder mit einer Fehlermeldung ab (z.B. wenn du "equirectangular" angegeben hast, aber nur 2 Bilder eingegeben hast) oder das Ergebnis sieht einfach komisch aus (z,B. wenn das Ergebnis zylindrisch sein sollte, du aber geradlinig gew&auml;hlt hast).<br>
     Nach dem Klicken auf "Stitch now!" bittet dich hugin, einen Namen f&uuml;r  die Ausgabedatei zu spezifizieren und beginnt dann, die Fotots aneinanderzusetzen. Dies dauert einige Zeit, d.h. du solltest dir eine Tasse Tee kochen und mit deiner Gro&szlig;mutter telefonieren. <br>
     Die Bilder, die du bekommst, sehen so &auml;hnlich aus wie dieses:<br>
     <br>


    <center>
      <img src="../../common/images2/article348/input0000small.jpg"
      hspace="20" width="318" height="75" alt="[hugin output]">
    </center>
    <br>
     <br>
     <br>
     <br>


    <A NAME="348lfindex3">&nbsp;</A>
<H2>Enblend</H2>


    <p>Jetzt ist es Zeit f&uuml;r Enblend, seinen Teil der Arbeit zu tun. Enblend l&auml;uft direkt von der Shell, &ouml;ffne deshalb eine Shell und tippe<br>
    <br>
     enblend -v -o output.tif input1.tif input2.tif...<br>
    <br>
     wobei output.tif die Datei bezeichnet, in der du das Panorama abspeichern willst und  input1.tif steht f&uuml;r das erste Foto etc.<br>
    <br>
     Nach dem Klicken auf die "return" Taste kannst du dir eine zweite Tasse Tee kochen und mit einem weiteren Verwandten telefonieren, vielleicht sogar mit zweien, da dies wirklich lange dauert. Gut, nat&uuml;rlich, wenn du nur zwei Fotos hast, dann geht es recht schnell, aber mit mehreren Bildern ist es wirklich langsam. Das Ergebnis ist es aber wirklich wert...</p>

    <center>
      <img src="../../common/images2/article348/montrealsmall.png"
      hspace="20" width="600" height="184" alt="[after hugin]">
    </center>
    <br>
     <br>


    <A NAME="348lfindex4">&nbsp;</A>
<H2>The Gimp</H2>


    <p>Wenn du dir das Bild jetzt anschaust, dann sieht es ja schon wie ein Panorama aus. Dennoch brauchst du jetzt The Gimp, um deinem Foto den letzen Schliff zu geben. Mit hugin und enblend bekommt man normalerweise ein Foto, dass einige leere Stellen hat. Wenn du The Gimp nicht gut kennst und auch nicht viel Zeit verwenden willst, dann kannst du einfach den Teil des Fotos mit dem rectangular selection Werkzeug <img src=
    "../../common/images2/article348/rectangularselectiontool.png"
    hspace="20" width="33" height="27" alt="[rectangular selection tool]"> selektieren, der keine leeren Teile enth&auml;lt. Rechter Mausklick in das Foto, dann auf Edit--&gt;Copy und dann File--&gt;New. Eine neue Datei &ouml;ffnet sich, dann Edit--&gt;Paste und File--&gt;Save as, um dein neues Foto abzuspeichern.<br>
     Oft ist es aber auch m&ouml;glich, die leeren Stellen mit dem
    clone tool <img src=
    "../../common/images2/article348/clonetool.png" hspace="20"
    width="31" height="28" alt="[clone tool]"> in Kombination mit blur <img src=
    "../../common/images2/article348/blurtool.png" hspace="20"
    width="31" height="29" alt="[blur tool]"> zu schlie&szlig;en. Zuerst wendest du das clone tool sorgf&auml;ltig an. Es ist hier immer gut, mit einer Kopie
    (Image--&gt;Duplicate) zu arbeiten, da dir das Ergebnis m&ouml;glicherweise zun&auml;chst nicht gefallen wird, wenn du mit diesem Tool noch nicht ge&uuml;bt bist. Wenn du das clone tool selektiert hast, klickst du mit der Maus an die Stelle, die geklont werden soll, w&auml;hrend du ctrl gedr&uuml;ckt h&auml;lst. Dann l&auml;&szlig;t du ctrl los und klickst mit der Maus an die Stelle, die du &uuml;bermalen m&ouml;chtest. Du kannst das Clone tool jetzt so benutzen, wie du einen Pinsel benutzen w&uuml;rdest. Manchmal bekommt man ein nat&uuml;rlicher aussehendes Ergebnis, wenn man zwischendurch einige Male eine neue Klonstelle definiert.<br>
     Um schlie&szlig;lich die feinen N&auml;hte loszuwerden, die es eventuell noch gibt, auch wenn sie nicht zu gro&szlig; sein sollten, klickst du auf das blur tool und arbeitest mit der Maus entlang der "Nahtstelle", bis du zufrieden bist. Danach kannst du dann dein Bild abspeichern. Nat&uuml;rlich ist es auch m&ouml;glich, einige L&uuml;cken zu schlie&szlig;en und andere auszuschneiden.<br>
    <br>
     Das Panorama ist fertig. Wenn du Lust hast, kannst du die Qualit&auml;t deines Fotos jetzt noch durch Benutzung der Tools, die ich in meinem Artikel<a href=
    "../../English/September2003/article311.shtml">
    Fotozauber mit Gimp</a> beschrieben habe, verbessern.<br>
    <br>
     Hier ist das fertige Panorama von Montr&eacute;al:<br>
    <br>
    </p>

    <center>
      <img src=
      "../../common/images2/article348/montreal5asmall.png" hspace=
      "20" width="600" height="194" alt="[final image]">
    </center>
    <br>
     <br>
     Viel Spa&szlig;! Und wie immer Happy panoraming! <br>
     <br>


    <A NAME="348lfindex5">&nbsp;</A>
<H2>Referenzen</H2>


    <ul>
      <li>
        Die Hugin Webseite befindet sich unter: <a href=
        "http://hugin.sourceforge.net/">http://hugin.sourceforge.net/</a><br>

         Hier kann man Hugin herunterladen und es gibt auch ein paar n&uuml;tzliche Tutorien.<br>
         Die Installation von hugin ist ein bi&szlig;chen komplex, weil es von so vielen nicht standardm&auml;&szlig;igen Paketen abh&auml;ngig ist.

        <p>Die beste L&ouml;sung ist vermutlich, eine der vorkompilierten rpm Pakete zu installieren<br>
         <a href=
        "http://bugbear.blackfish.org.uk/~bruno/panorama-tools/">http://bugbear.blackfish.org.uk/~bruno/panorama-tools/</a><br>

        <br>
         Um den PTStitcher benutzen zu k&ouml;nnen, ben&ouml;tigt man das panorama-tools-nonfree
        Paket. Ansonsten kann man aber den nona stitcher benutzen.</p>

        <p>Diejenigen, die vom Quellcode installieren wollen, ben&ouml;tigen die folgenden Pakete:</p>

        <ul>
          <li>Hugin ist ein gui frontend f&uuml;r die panotools, d.h. du brauchst die panotools von
          http://panotools.sourceforge.net/ Die panotools tools,
          auch panorama-tools genannt, haben folgende Abh&auml;ngigkeiten: jdk-1.3.1 (von www.javasoft.com) und die folgenden Bibliotheken, die Teil der meisten Linuxsysteme sein sollten: libjpeg libtiff libpng zlib<br>
          <br>
          </li>

          <li>wxGTK GUI package http://www.wxwindows.org/</li>

          <li>fftw Fast Fourier Transform library
          http://www.fftw.org/</li>

          <li>boost development library http://boost.org/</li>

          <li>vigra computer vision library
          http://kogs-www.informatik.uni-hamburg.de/~koethe/vigra/
          Vigra wird f&uuml;r den hugin stitcher 'nona' gebraucht</li>
        </ul>
        Schlie&szlig;lich brauchst du nat&uuml;rlich noch hugin selber, das von
         http://hugin.sourceforge.net/ heruntegeladen werden kann
      </li>

      <li>Enblend ist verf&uuml;gbar unter <a href=
      "http://www-cad.eecs.berkeley.edu/~mihal/enblend/">http://www-cad.eecs.berkeley.edu/~mihal/enblend/</a><br>

       Dort kann man enblend herunterladen und mehr dar&uuml;ber lernen, wie es das macht, was es macht.<br>
       Die Installation von enblend sollte problemlos sein.</li>

      <li>The Gimp ist sehr wahrscheinlich schon auf deinem Rechner installiert, da es bei den meisten Distributionen von Hause aus mit dabei ist. Wahrscheinlich hast du auch schon tausendmal damit gearbeitet. Trotzdem, hier ist die Webseite: <a href=
      "http://www.gimp.org/">http://www.gimp.org</a><br>
      </li>

      <li>Und schlie&szlig;lich, wenn du mehr Artikel von mir lesen willst, findest du sie auf meiner neu &uuml;berarbeiteten Webpage
      <a href=
      "http://www.tuxgraphics.org">http://www.tuxgraphics.org</a><br>

       Dort wird es eventuell sp&auml;ter auch neuere Versionen dieses Artikels auf Englisch geben.</li>
    </ul>
    <!-- vim: set sw=2 ts=2 et: -->
  



<!-- BODY_OF_THE_ARTICLE_STOP -->
<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback f&uuml;r diesen Artikel</h2>
Jeder Artikel hat seine eigene Seite f&uuml;r Kommentare und R&uuml;ckmeldungen. Auf dieser Seite kann jeder eigene Kommentare abgeben und die Kommentare anderer Leser sehen:
<center>
    <table width="250" border=0><tr><td>
    <div class="tbbutton"><A class="nodec" href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=348">&nbsp;Talkback Seite&nbsp;</a></div>
    </td></tr></table>
</center>

<br clear="all">
<HR size="2" noshade>
<table width="250" border=0><tr><td>
<div class="bbutton"><a class="nodec" href="../../index.shtml">&lt;--, LF Home</a></div>
</td><td>
<div class="bbutton"><a class="nodec" href="index.shtml">Zum index dieser Ausgabe</a></div>
</td></tr></table>
<br clear="all">
<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">Der LinuxFocus Redaktion schreiben</A>
<BR><FONT COLOR="#1111aa"><a href="../../common/copy.html">&copy; Katja Socher</a><br>&quot;some rights reserved&quot; see <a href="../../license/index.shtml">linuxfocus.org/license/</a><br><a href="http://www.linuxfocus.org">http://www.LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Autoren und &Uuml;bersetzer:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Katja Socher <small>&lt;katja(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; de: Katja Socher &lt;katja(at)linuxfocus.org&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2004-10-15, generated by lfparser version 2.50</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
