<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Le Francophones-HOWTO : Linux &amp; la langue fran&ccedil;aise: Le vocabulaire : petit lexique</TITLE>
 <LINK HREF="Francophones-HOWTO-4.html" REL=next>
 <LINK HREF="Francophones-HOWTO-2.html" REL=previous>
 <LINK HREF="Francophones-HOWTO.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="Francophones-HOWTO-4.html">Next</A>
<A HREF="Francophones-HOWTO-2.html">Previous</A>
<A HREF="Francophones-HOWTO.html#toc3">Contents</A>
<HR>
<H2><A NAME="s3">3. Le vocabulaire : petit lexique</A></H2>

<P>
<P>Tout d'abord, un mot sur le vocabulaire employ&eacute; :
<P>
<H2><A NAME="ss3.1">3.1 8 bits</A>
</H2>

<P>
<P>Des caract&egrave;res sont dits « 8 bits » s'ils correspondent &agrave; des accents ou
&agrave; des signes sp&eacute;ciaux comme « § », non inclus dans le standard
<CODE>ASCII</CODE> « 7 bits ».
<P>Ce standard, sans accents ni caract&egrave;res sp&eacute;ciaux, correspond aux 128
(2^7) premiers caract&egrave;res des 256 (2^8), de 0 &agrave; 255.
<P>Pour des raisons historiques (place disponible, inutilit&eacute; pour les &eacute;tats
uniens) seuls les 128 (2^7) premiers caract&egrave;res ont &eacute;t&eacute; normalis&eacute;s par
l'ASCII : par exemple le A qui est le 65e caract&egrave;re de la table ASCII
s'&eacute;crit 0100 0001 en notation binaire.
<P>Pour les caract&egrave;res situ&eacute;s hors de la norme ASCII, diff&eacute;rentes « normes
» ou « standards » incompatibles, comme l'Unicode, l'iso-8859, le latin,
le cp (...) fixent ces correspondances.
<P>Par exemple, dans le standard ASCII &eacute;tendu par l'iso-8859-1, le 224&egrave;me
caract&egrave;re &eacute;quivalent not&eacute; « eb » en hexad&eacute;cimal correspond &agrave; « &euml; ».
<P>
<H2><A NAME="ss3.2">3.2 La police de caract&egrave;res</A>
</H2>

<P>
<P>Une police de caract&egrave;res est une correspondance entre des codes
informatiques et des caract&egrave;res (alphanum&eacute;riques...) affichables par
l'ordinateur.
<P>La police de caract&egrave;res est l'ensemble des repr&eacute;sentations graphiques des
caract&egrave;res d'un standard.
<P>
<H2><A NAME="ss3.3">3.3 Les polices de caract&egrave;res</A>
</H2>

<P>
<P>Il existe plusieurs polices de caract&egrave;res 8 bits pouvant r&eacute;pondre au
besoins des francophones.
<P>Je vous recommande de lire &agrave; ce sujet l'excellent site de Roman Czyborra
qui a fait une th&egrave;se sur ce sujet et qui vous donnera une
<A HREF="http://czyborra.com/charsets/iso8859.html">explication fort d&eacute;taill&eacute;e</A><P>Pour r&eacute;sumer, il est n&eacute;cessaire de choisir une police de caract&egrave;res pour
que tous les caract&egrave;res fran&ccedil;ais soient disponibles.
<P>Voici la liste des polices dites « ISO 8859 », mais attention, il existe
leurs &eacute;quivalents en « code page » pour windows (comme cp1252).
<P>
<UL>
<LI> ISO 8859-1 : latin 1 : langues d'Europe de l'ouest, Afrikaans,
Swahili.

Le Swahili, n'utilise aucun caract&egrave;re accentu&eacute; (comme l'Anglais, le
Malais et l'Indon&eacute;sien), donc n'importe quel version fait l'affaire.

Pour l'Afrikaans, je ne sais plus exactement quel &eacute;tait le choix initial
(c'est-&agrave;-dire o&ugrave; avait &eacute;t&eacute; rang&eacute; le 'n au d&eacute;part), mais il ne me semble
pas que ce soit dans Latin 1.

Dans la pratique, bien s&ucirc;r, les Afrikaaner utilisent Latin 1 ; la m&ecirc;me
chose se passe pour un certain nombre des cas qui suivent.
</LI>
<LI> ISO 8859-2 : latin 2 : langues d'Europe centrale et orientale.

Dans les faits : Polonais, Tch&egrave;que, Slovaque, Slov&egrave;ne, Croate, Hongrois,
Roumain, probablement aussi le Sorbe ou Sorabe (Wende en allemand).

Officiellement, je crois que l'Albanais s'&eacute;crit aussi en Latin-2, mais
comme dans les faits c'est identique au Latin 1...
Il y a un probl&egrave;me pour le Roumain, car le Latin 2 contient formellement
les caract&egrave;res avec une c&eacute;dille, quand en roumain on utilise une virgule
souscrite.
</LI>
<LI> ISO 8859-3 : latin 3 : Esp&eacute;ranto et Maltais.

Initialement, c'&eacute;tait pr&eacute;vu pour les langues d'Europe du Sud, y compris
le Turc, les langues d'Espagne (donc Catalan, Basque), le Fran&ccedil;ais.

Mais dans la pratique, c'est limit&eacute; &agrave; ces deux langues.
</LI>
<LI> ISO 8859-4 : latin 4 : langues baltes (incomplet).

Pas utilis&eacute; dans la pratique, remplac&eacute; par Latin 7 (iso-8859-13), ou
plut&ocirc;t en pratique la codepage 1257 Windows.

Pour l'Este ou Estonien, on peut aussi utiliser Latin 9.
</LI>
<LI> ISO 8859-9 : latin 5 (comme latin 1, moins l'Islandais, plus le
Turc).

Usage : le Turc et peut-&ecirc;tre l'Az&eacute;ri, mais il manque le schwa, un « e »
renvers&eacute;.

Codage officiel aux Pays-Bas du fait des Turcs qui y habitent.
</LI>
<LI> ISO 8859-10 : latin 6 : langues nordiques, sauf le Lapon Skolt.

Pas utilis&eacute; dans la pratique : ne servirait que pour les langues sames
(ou lapones), mais il manque des caract&egrave;res, et le public concern&eacute; est
de toute mani&egrave;re assez limit&eacute;.
</LI>
<LI> ISO 8859-11 : Thai.

Pas encore officiellement adopt&eacute;.
</LI>
<LI> ISO 8859-12 : Indien (n'existe pas encore).

Pr&eacute;vu pour le devanagari, pour &eacute;crire l'Hindi, la langue principale de
l'Inde, et aussi un grand nombre d'autres langues indiennes, dont le
Sanskrit.
</LI>
<LI> ISO 8859-13 : latin 7 : langues baltes.

Plus exactement : couvre les langues du pourtour de la mer Baltique,
donc aussi le Polonais, l'Allemand et les langues de scandinavie.

Mais dans la pratique il est r&eacute;duit en utilisation aux langues baltes
et &agrave; l'Este ou Estonien.
</LI>
<LI> ISO 8859-14 : latin 8 : langues celtes.

Pour le Breton, le Ga&eacute;lique et les dialectes parl&eacute;es au Pays de Galles
et en Irlande.
</LI>
<LI> ISO 8859-15 : latin 9 : comme latin 1, en y comblant quelques
manques.

Pour le Fran&ccedil;ais, le Finnois (en concurrence avec Latin 1) et l'Este ou
Estonien (en concurrence avec Latin 7).</LI>
</UL>
<P>De cette longue liste, il convient de ne retenir que :
<P>
<UL>
<LI>ISO 8859-1 latin 1 : police ouest-europ&eacute;enne utilis&eacute;e par la
majorit&eacute; des syst&egrave;mes UNIX, elle permet de disposer de tous les
caract&egrave;res Fran&ccedil;ais sauf les « o e li&eacute;s », l'euro et l'y tr&eacute;ma majuscule</LI>
<LI>cp850 : &eacute;quivalent sous DOS de cette police, mais incompatible :
il faut utiliser un outil de traduction de fichiers tel GNU recode.</LI>
<LI>ISO 8859-15 latin 9 : police de l'union europ&eacute;enne, il s'agit
d'une version r&eacute;vis&eacute;e de l'ISO 8859-1 latin 1 pour inclure tous les
caract&egrave;res des pays europ&eacute;ens ; ainsi on y retrouve les caract&egrave;res
Fran&ccedil;ais manquant, l'euro, et des caract&egrave;res finlandais manquants.</LI>
<LI>latin 0 : l'ISO 8859-15 latin 9 est souvent incorrectement
abr&eacute;g&eacute;e en latin0, qui correspondait au nom du projet, de par
son ambition &agrave; remplacer le latin 1 un jour. Je vous renvoie au
<A HREF="http://www.iso.ch/catf/d29505.html">site de l'ISO</A> et &agrave; la
<A HREF="http://www.indigo.ie/egt/standards/iso8859/8859-15-fr.pdf">documentation compl&egrave;te de ce standard</A></LI>
<LI>cp1252 : &eacute;quivalent sous Windows de cette police, aussi
incompatible, qui apporte les m&ecirc;mes caract&egrave;res manquants, du fait d'une
r&eacute;vision r&eacute;cente de cette norme.</LI>
<LI>ISO 8859-9 latin 5 : police officielle en Turquie et en Hollande,
o&ugrave; les caract&egrave;res Islandais peu utilis&eacute;s ont &eacute;t&eacute; remplac&eacute;s par les
caract&egrave;res turcs.</LI>
<LI>cp1254 : &eacute;quivalent sous Windows de cette police, aussi
incompatible, qui apporte les caract&egrave;res manquant au Fran&ccedil;ais
pr&eacute;c&eacute;demment cit&eacute;s et remplace les caract&egrave;res Islandais peu utilis&eacute;s par
les caract&egrave;res turcs.</LI>
</UL>
<P>Les choix de polices de caract&egrave;res sont souvent des questions ou la
raison se heurte aux habitudes.
<P>Pour ma part, si vous h&eacute;sitez, je vous recommande l'ISO 8859-15 latin 9,
pour diverses raisons :
<P>
<UL>
<LI>Il supporte l'int&eacute;gralit&eacute; des caract&egrave;res utilis&eacute;s en Fran&ccedil;ais de
mani&egrave;re standard sur les UNIX, pour les &eacute;changes de fichiers entre
Solaris et Linux par exemple</LI>
<LI>Il s'agit de la police 8 bits choisie par l'union europ&eacute;enne si
l'Unicode, &eacute;volution du 8 bits, n'est pas disponible</LI>
<LI>Il permet d'&eacute;crire des textes avec l'int&eacute;gralit&eacute; des
caract&egrave;res utilis&eacute;s dans l'union</LI>
<LI>Il est en train de devenir le nouveau standard dans la
messagerie &eacute;lectronique au sens large, supplantant progressivement l'ISO
8859-1 latin 1</LI>
</UL>
<P>Le Francophones HOWTO utilise donc le latin 9 dans tous les exemples, car il y
a de grandes chances que votre syst&egrave;me ne soit pas encore compatible
latin 9... autant donc vous proposer des manipulations et des travaux
pratiques utiles :-)
<P>Toutefois, si vous ne pouvez utiliser l'ISO 8859-15 latin 9 et
d&eacute;cidez d'en choisir une autre, je vous recommande d'&eacute;viter les cp
propres au monde DOS/Windows et de vous rabattre sur l'ISO
8859-1 latin 1 qui est encore un standard fort r&eacute;pandu : dans chaque
exemple je vous invite alors &agrave; remplacer les « latin9 » par des « latin1 »
<P>
<H2><A NAME="ss3.4">3.4 Table de clavier</A>
</H2>

<P>
<P>Une table de clavier est un fichier permettant de faire correspondre
l'empreinte physique des cabochons, « touches » du clavier, au r&eacute;sultat
obtenu sur l'&eacute;cran de l'ordinateur.
<P>Pour linux, ces fichiers sont dans /usr/lib/kbd/keytables/ ou
/usr/share/kbd/keytables/
<P>Par exemple, les claviers fran&ccedil;ais AZERTY ont une table de clavier
diff&eacute;rente des claviers suisse romands QWERTZ, ou des claviers du reste
du monde, QWERTY.
<P>Cela ne concerne que l'apparence du clavier, l'empreinte des cabochons,
donc disposition relative des caract&egrave;res sur le clavier, et non son
&eacute;lectronique interne ; si votre clavier ne vous convient pas, il vous
suffit donc d'utiliser des autocollants pour le transformer en un autre
clavier francophone.
<P>
<H2><A NAME="ss3.5">3.5 « Home », « End », « Page_Up » et « Page_Down »</A>
</H2>

<P>
<P>Les touches « Home », « End », « Page_Up » et « Page_Down » dont les noms
varient selon les claviers sont les touches permettant respectivement
d'aller en d&eacute;but/fin de ligne et de monter/descendre d'une page.
<P>Les codes affectes &agrave; ces touches sont respectivement 102 et 107 pour «
Home » et « End » en mode terminal.
<P>Dans les pictogrammes des claviers ISO 9995-7, ces touches sont
repr&eacute;sent&eacute;s par des fl&egrave;ches aux traits appuy&eacute;s.
<P>Lorsqu'on presse une touche, le clavier &eacute;met un code, qui est
intercept&eacute; par la table de clavier.
<P>La table de clavier, si elle reconnait le code, renvoie la chaine
associ&eacute;e &agrave; la touche, en l'occurence« "\e[4&nbsp; » pour « End ».
<P>Lorsque bash ou un autre programme re&ccedil;oit cette chaine, il ne la connait
pas !
<P>Donc il faut lui dire, dans le .inputrc que "\e[4&nbsp;" signifie "aller &agrave; la
fin de la ligne"
<P>Donc pour que ces touches fonctionnent dans le shell bash, on ajoutera
donc dans le fichier .inputrc (dans votre &nbsp;/ ou dans /etc/inputrc) les
lignes:
<P>
<BLOCKQUOTE><CODE>
<PRE>
set meta-flag on
set convert-meta off
set input-meta on
set output-meta on
set bell-style visible

"\e[1~":beginning-of-line
"\e[3~":delete-char
"\e[4~":end-of-line
"\e\C-h": backward-kill-word
"\e\e[3~": kill-word
</PRE>
</CODE></BLOCKQUOTE>
<P>Les premi&egrave;res lignes permettent d'afficher les caract&egrave;res 8 bits, et de
remplacer le « bip » en cas d'erreur par un &eacute;clair blanc &agrave; l'&eacute;cran.
<P>
<H2><A NAME="ss3.6">3.6 Touches mortes</A>
</H2>

<P>
<P>Les touches mortes sont des touches qui ne produisent pas de caract&egrave;res
en elles-m&ecirc;mes, mais qui modifient la fa&ccedil;on dont la frappe suivante va
&ecirc;tre interpr&eacute;t&eacute;e, par exemple, le tr&eacute;ma ou l'accent circonflexe sont en
g&eacute;n&eacute;ral des touches mortes.
<P>Une touche morte est une touche qui doit donc &ecirc;tre suivie d'un espace
pour obtenir l'accent seul, ou dans le cas o&ugrave; elle est suivie d'une
voyelle y positionne un accent, par exemple :
<P>
<BLOCKQUOTE><CODE>
<PRE>
        « ^ » puis « e » donne « &ecirc; »
        « ^ » puis « espace » donne « ^ »
</PRE>
</CODE></BLOCKQUOTE>
<P>Les touches mortes sont :
<UL>
<LI> be et fr: l'accent aigu en AltGr de 1 pour les Fran&ccedil;ais et en
AltGr de &ugrave; pour les Belges, l'accent grave en AltGr de 7 pour les
fran&ccedil;ais &amp; en AltGr de carr&eacute;/cube pour les Belges, le tr&eacute;ma et
l'accent circonflexe tous deux &agrave; c&ocirc;t&eacute; du P</LI>
<LI> sf et usx: les accent aigus, graves, circonflexes, les
tr&eacute;mas et la tilde</LI>
<LI> qc: les accent graves, circonflexes, les tr&eacute;mas et la c&eacute;dille</LI>
</UL>
<P>
<H2><A NAME="ss3.7">3.7 « BackSpace » et « Delete »</A>
</H2>

<P>
<P>En raison d'une erreur volontaire et historique sous Linux, pour
« &eacute;muler » le fonctionnement d'un clavier de console VT, ces 2 touches
sont fr&eacute;quemments m&eacute;lang&eacute;es, au mieux fonctionnant &agrave; l'identique, au
pire ne fonctionnant pas du tout.
<P>Commen&ccedil;ons donc par bien les d&eacute;finir :
<P>
<UL>
<LI>BackSpace : touche plac&eacute;e en haut &agrave; droite du pav&eacute; principal, au
dessus d' « Entr&eacute;e », au cabochon marqu&eacute; d'une fl&egrave;che vers la gauche.</LI>
<LI>Delete : touche du pav&eacute; curseur au cabochon marqu&eacute; « Suppr » ou
« Del », &agrave; gauche de « Fin » ; en ISO 9995-7 elle correspond &agrave; trois
barres obliques fines orient&eacute;es sud-ouest/nord-est.</LI>
</UL>
<P>Le pav&eacute; num&eacute;rique offre une touche au marquage identique et &agrave; effet
identique lorsque « Verr Num » ou « Num Lock » est d&eacute;sactiv&eacute;.
<P>Ces deux touches correspondent chacune &agrave; un de ces codes :
<P>
<UL>
<LI>BS : caract&egrave;re ASCII 0x08, ou control-h.</LI>
<LI>DEL : caract&egrave;re ASCII 0x7F, ou control-?</LI>
<LI>^D : caract&egrave;re ASCII 0x04, ou control-d.</LI>
</UL>
<P>Ceci dans le but d'effacer &agrave; gauche du curseur avec BackSpace, &agrave; droite du
curseur avec Delete.
<P>
<H2><A NAME="ss3.8">3.8 « UTC » et « GMT »</A>
</H2>

<P>
<P>Chaque partie du monde a sa propre norme horaire, bas&eacute;e sur des
fuseaux.
<P>La France se trouve en zone MET, « heure moyenne europ&eacute;enne » soit GMT+1 ;
la zone « MET DST » correspond &agrave; l'heure d'&eacute;t&eacute; activ&eacute;e soit GMT+2.
<P>
<UL>
<LI>GMT est l'heure solaire moyenne de Greenwich. L'heure est compt&eacute;e &agrave;
partir de midi et est donc d&eacute;cal&eacute;e de 12 h  par rapport au temps
universel. GMT est bas&eacute;e sur la rotation de la terre, ce n'est donc pas
un temps r&eacute;gulier. En effet, la vitesse de rotation de la Terre subit
des variations faibles mais assez chaotiques, en plus elle diminue sur
le long terme.
</LI>
<LI>UTC, « temps universel coordonn&eacute; », est compt&eacute; &agrave; partir de
minuit toujours par rapport au m&eacute;ridien z&eacute;ro. Il est
bas&eacute; sur des &eacute;talons atomiques, mais des secondes intercalaires
sont ajout&eacute;es occasionnellement pour faire en sorte qu'il ne
s'&eacute;carte jamais de plus de une seconde de l'heure solaire moyenne.
<A HREF="http://opdaf1.obspm.fr/">Le site de l'opdaf</A> et
<A HREF="http://opdaf1.obspm.fr/www/lexique.html">le lexique</A> donnent plus de
renseignements.  </LI>
</UL>
<P>C'est le temps UTC, d&eacute;fini &agrave; Paris, qui sert de r&eacute;f&eacute;rence aux
diff&eacute;rentes heures l&eacute;gales.
<P>L'acronyme « GMT » est employ&eacute; 99% du temps pour
d&eacute;signer UTC, mais c'est une erreur ou un abus de langage.
<P>Enfin, &agrave; titre purement indicatif, il existe l'heure astronomique, aussi
compt&eacute;e sur des &eacute;talons atomiques mais d&eacute;cal&eacute;e de 4 minutes par jour de
l'heure terrestre car se basant sur la position de la terre dans
l'espace par rapport aux &eacute;toiles.
<P>
<HR>
<A HREF="Francophones-HOWTO-4.html">Next</A>
<A HREF="Francophones-HOWTO-2.html">Previous</A>
<A HREF="Francophones-HOWTO.html#toc3">Contents</A>
</BODY>
</HTML>
