<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Le Francophones-HOWTO : Linux &amp; la langue fran&ccedil;aise: Pr&eacute;sentation</TITLE>
 <LINK HREF="Francophones-HOWTO-2.html" REL=next>

 <LINK HREF="Francophones-HOWTO.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Francophones-HOWTO-2.html">Next</A>
Previous
<A HREF="Francophones-HOWTO.html#toc1">Contents</A>
<HR>
<H2><A NAME="s1">1. Pr&eacute;sentation</A></H2>

<P>
<P>
<H2><A NAME="ss1.1">1.1 Introduction</A>
</H2>

<P>
<P>Ce document a &eacute;t&eacute; r&eacute;dig&eacute; pour aider &agrave; configurer un ordinateur dot&eacute; du
syst&egrave;me d'exploitation Linux pour des utilisateurs francophones.
<P>Il y est expliqu&eacute; par exemple comment configurer p&eacute;riph&eacute;riques et
applications afin de prendre en compte les particularit&eacute;s et les
sp&eacute;cificit&eacute;s de notre langue...
<P>Toutefois, ce document ne traite pas de l'installation du syst&egrave;me
d'exploitation Linux ; il est implicitement suppos&eacute; que vous ayez
correctement install&eacute; une distribution de Linux, RedHat, Debian ou
Suse, cette liste n'&eacute;tant pas exhaustive, et que vous vous
appr&ecirc;tiez maintenant &agrave; mieux la configurer ; veuillez donc vous
r&eacute;f&eacute;rer &agrave; d'autres HOWTOs pour l'installation.
<P>Les adresses &eacute;lectroniques ont &eacute;t&eacute; volontairement supprim&eacute;es ou
modifi&eacute;es en rempla&ccedil;ant les « a enroul&eacute;s » par des « (&agrave;) » afin d'&eacute;viter
les publipostages tr&egrave;s g&ecirc;nants.
<P>Si quelque terme employ&eacute; vous semble un peu obscur, je vous invite &agrave;
vous reporter au lexique (« Vocabulaire : un petit lexique »),
expliquant certains mots tels 8 bits, AZERTY ou QWERTY, qui sont
employ&eacute;s tout au long de ce document.
<P>
<H2><A NAME="ss1.2">1.2 Fichiers utilis&eacute;s dans ce HOWTO</A>
</H2>

<P>
<P>Tous les fichiers cit&eacute;s dans ce HOWTO, sont disponibles sous licence GPL
sur 
<A HREF="http://metalab.unc.edu/guylhem/">ma page</A><P>Je vous recommande de t&eacute;l&eacute;charger tous ces fichiers pour les utiliser
selon les exemples propos&eacute;s.
<P>
<H2><A NAME="ss1.3">1.3 Les Fran&ccedil;ais ne sont pas les seuls francophones !</A>
</H2>

<P>
<P>
<H3>a) Diff&eacute;rentes versions</H3>

<P>
<P>Pour chaque manipulation d&eacute;pendant du pays concern&eacute;, un certain nombre
de versions peuvent &ecirc;tre propos&eacute;es :
<P>
<UL>
<LI>une canadienne normalis&eacute;e (cn)</LI>
<LI>une belge wallonne (be)</LI>
<LI>une fran&ccedil;aise (fr)</LI>
<LI>une qu&eacute;b&eacute;coise (qc)</LI>
<LI>une suisse romande (sf)</LI>
<LI>une &eacute;tats-unienne internationale (usx)</LI>
</UL>
<P>
<H3>b) Les &eacute;tats-uniens : raccourcis claviers</H3>

<P>
<P>La version &eacute;tats-unienne internationale permet &agrave; tous
les francophones utilisant un clavier « 7 bits » aussi nomm&eacute;
« QWERTY » de b&eacute;n&eacute;ficier de l'&eacute;tendue des caract&egrave;res 8 bits.
<P>Est disponible aussi une version pour ceux qui utilisent un
clavier « Happy Hacking ».
<P>
<H3>c) Le Luxembourg : comme la France</H3>

<P>
<P>Le Grand Duch&eacute; du Luxembourg utilisant les conventions fran&ccedil;aises,
j'invite les lecteurs luxembourgeois &agrave; se reporter aux exemples
fran&ccedil;ais.
<P>
<H3>d) Le Canada : 3 claviers</H3>

<P>
<P>Il est classique de parler des claviers « canadien international »,
surtout destin&eacute;s aux anglophones (qui leur pr&eacute;f&egrave;rent toutefois les claviers
QWERTY standard) et les claviers « canadien fran&ccedil;ais », aux lettres
accentu&eacute;es.
<P>Mais, de nouveaux claviers dits « canadiens normalis&eacute;s » ont fait leur
apparition r&eacute;cemment pour fusionner les mod&egrave;les « canadien international
», non concern&eacute; par le cadre du Francophones HOWTO, et « canadien fran&ccedil;ais ».
<P>Ces nouveaux claviers r&eacute;pondent aux normes CAN/CSA Z243.200-92 et ISO
9995-7 ; ils sont pr&eacute;vus pour &ecirc;tre utilis&eacute;s dans n'importe quelle
langue, en rempla&ccedil;ant par exemple les intitul&eacute;s des touches par des
pictogrammes : « Del », en anglais, qui se traduisait par « Suppr » en
fran&ccedil;ais devient ainsi trois barres obliques fines orient&eacute;es
sud-ouest/nord-est.
<P>Plus d'explications sont disponibles sur le 
<A HREF=" http://www.olf.gouv.qc.ca/technologies/technopages/claviernorm.html">site de l'Office de la Langue Fran&ccedil;aise</A>.
<P>Toutefois je n'ai pas pu r&eacute;ussir &agrave; me procurer un tel clavier ; mes
fichiers de configuration sont donc uniquement bas&eacute;s sur les
(
<A HREF="http://www.olf.gouv.qc.ca/images/clavier.gif">illustrations</A>) et les normes
th&eacute;oriques, et non les normes pratiques.
<P>Par exemple, si j'ai compris que la touche « Control » de droite est
utilis&eacute;e comme une « AltGr » mais sert &agrave; obtenir encore d'autres
caract&egrave;res, je n'ai aucune id&eacute;e du comportement de ces touches lorsque
seule l'autre a une s&eacute;rigraphie pr&eacute;vue...
<P>Si on peut m'envoyer un tel clavier, et surtout son pilote, je promets
de mettre les fichiers de configuration &agrave; jour :-)
<P>
<H2><A NAME="ss1.4">1.4 Attention</A>
</H2>

<P>
<P>
<H3>a) ROOT</H3>

<P>
<P>Certaines manipulations recommand&eacute;es par ce document ne peuvent
&ecirc;tre effectu&eacute;es que sous le compte privil&eacute;gi&eacute; « root » ; la plus grande
prudence est alors de rigueur car toute action inad&eacute;quate peut mettre en
p&eacute;ril le contenu des disques.
<P>Sauvegarder les fichiers existants, par exemple en les copiant sous le
m&ecirc;me nom suivi du pr&eacute;fixe .old, avant de les modifier ou remplacer.
<P>
<H3>b) CHERCHER</H3>

<P>
<P>Le paquetage GNU nomm&eacute; "find" offre un programme appel&eacute;
<CODE>locate</CODE>, gr&acirc;ce auquel l'utilisateur peut retrouver le nom complet,
chemin de r&eacute;pertoires, d'un fichier dont il ne conna&icirc;t que le nom.
<P>Certaines distributions Linux fournissent cela en /usr/bin/locate.
<P>En tant que root, lancer <CODE>updatedb</CODE> invoque un
<CODE>find&nbsp;/</CODE> sur les disques mont&eacute;s et place les noms de tous
les fichiers sous forme hash dans /usr/lib/locate/find.codes (ou
/var/lib/slocate/slocate.db pour slocate, utilis&eacute; dans les distributions
modernes.)
<P><CODE>locate</CODE> permet ensuite de localiser l'un d'eux :
<P>
<BLOCKQUOTE><CODE>
<PRE>
        (guylhem@victis:guylhem)$ locate noms_des_fichiers_&agrave;_retrouver
</PRE>
</CODE></BLOCKQUOTE>
<P>
<HR>
<A HREF="Francophones-HOWTO-2.html">Next</A>
Previous
<A HREF="Francophones-HOWTO.html#toc1">Contents</A>
</BODY>
</HTML>
