<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Le Francophones-HOWTO : Linux &amp; la langue fran&ccedil;aise: Les probl&egrave;mes</TITLE>
 <LINK HREF="Francophones-HOWTO-3.html" REL=next>
 <LINK HREF="Francophones-HOWTO-1.html" REL=previous>
 <LINK HREF="Francophones-HOWTO.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Francophones-HOWTO-3.html">Next</A>
<A HREF="Francophones-HOWTO-1.html">Previous</A>
<A HREF="Francophones-HOWTO.html#toc2">Contents</A>
<HR>
<H2><A NAME="s2">2. Les probl&egrave;mes</A></H2>

<P>
<P>
<H2><A NAME="ss2.1">2.1 Pr&eacute;sentation</A>
</H2>

<P>
<P>Le probl&egrave;me de tout utilisateur francophone apr&egrave;s l'installation de
Linux est de lui faire comprendre qu'il utilise des normes diff&eacute;rentes
des standards par d&eacute;faut &eacute;tats-uniens..
<P>Cela a des cons&eacute;quences sur :
<P>
<UL>
<LI> la police de caract&egrave;res donc les caract&egrave;res sp&eacute;ciaux que l'on utilise,
accentu&eacute;s comme &Eacute; &Egrave; &Agrave; &Ccedil; ou bien ligatur&eacute;s
comme &AElig; , voire « e dans l'o » qui vient d'appara&icirc;tre sous Linux gr&acirc;ce &agrave;
la norme ISO-8859-15 aussi nomm&eacute;e latin-9</LI>
<LI> la correspondance entre la s&eacute;rigraphie des cabochons ou « touches » du clavier sur lesquelles vous appuyez, et les codes que Linux renvoie, celui-ci
supposant un clavier QWERTY &eacute;tats-unien par d&eacute;faut</LI>
<LI> le format de page pris en charge par les programmes que vous utilisez
pour imprimer, diff&eacute;rent entre les &Eacute;tats-Unis; (14×8,5 pouces
pour du papier dit l&eacute;gal) et l'Europe (29,7×21 cm pour des feuilles a4)</LI>
<LI> le format des dates et de l'heure, la position des jours et des
mois &eacute;tant variable selon les r&eacute;gions de la francophonie</LI>
<LI> le format de la monnaie, aussi variable selon les francophones</LI>
<LI> la langue utilis&eacute;e pour les messages d'erreur</LI>
</UL>
<P>
<H2><A NAME="ss2.2">2.2 Solutions</A>
</H2>

<P>
<P>Tout est pr&eacute;configur&eacute; pour un &eacute;tats-unien : bien que ceux-ci ne
repr&eacute;sentent pas la majorit&eacute; de la population mondiale, ils ont &eacute;t&eacute;
pr&eacute;curseurs en informatique.
<P>Il faut donc se faire reconna&icirc;tre comme une « exception » par les
diff&eacute;rents programmes, par des options ou des variables &agrave; exporter voire
dans les pires des cas une modification du code source suivie d'une
recompilation.
<P>Heureusement, la philosophie GNU de Linux rend le syst&egrave;me tr&egrave;s ouvert
&agrave; des modifications de toutes sortes et comme vous allez le d&eacute;couvrir au
fil de ce document, et il est assez simple d'obtenir un r&eacute;sultat tr&egrave;s
correct.
<P>
<H2><A NAME="ss2.3">2.3 Aider</A>
</H2>

<P>
<P>Pour le moment, le futur de l'internationalisation de Linux porte sur la
traduction des messages d'erreur, des programmes comme KDE ou GNOME,
des pages de manuel et de la documentation, alors si vous vous sentez
l'&acirc;me d'un traducteur, n'h&eacute;sitez pas &agrave; contacter l'&eacute;quipe de
traduction des HOWTOs ; pour cela, adressez-vous &agrave; &Eacute;ric Dumas
&lt;dumas(&agrave;)freenix.fr&gt; ou &lt;dumas(&agrave;)linux.eu.org&gt;.
<P>
<HR>
<A HREF="Francophones-HOWTO-3.html">Next</A>
<A HREF="Francophones-HOWTO-1.html">Previous</A>
<A HREF="Francophones-HOWTO.html#toc2">Contents</A>
</BODY>
</HTML>
