<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>German Howto: Deutscher Teil (German Part)</TITLE>
 <LINK HREF="German-HOWTO-2.html" REL=next>

 <LINK HREF="German-HOWTO.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="German-HOWTO-2.html">Next</A>
Previous
<A HREF="German-HOWTO.html#toc1">Contents</A>
<HR>
<H2><A NAME="s1">1. Deutscher Teil (German Part)</A></H2>

<P>
<P>
<H2><A NAME="ss1.1">1.1 Einleitung</A>
</H2>

<P>Die Bezeichnung Howto ist eine Zusammenschreibung von how to, was Sie mit
&quot;so mache ich...&quot; &uuml;bersetzen k&ouml;nnen. Das Linux German Howto
beschreibt also wie man deutschsprachige Eigenheiten unter Linux
aktiviert. Gesprochen wird es als Dsch&ouml;rman Hautu. Im Folgenden schreibe
ich lieber vom Deutschen Sowirdsgemacht f&uuml;r Linux. Schon bin ich Punk.
<P>Was sind denn nun deutsche Eigenheiten? Ledertrachten, Weissw&uuml;rste, Bier
und geb&uuml;gelte Unterw&auml;sche, so wie es jedem ausl&auml;ndischen Besucher im
Bierzelt auf der CeBIT vorgemacht wird? Hm, das w&auml;ren wohl eher
Anpassungen, die man an sich selbst vornimmt. Aber keine Furcht, Linux
l&auml;sst sich auch, dem amerikanischen Einfluss sei dank, ganz leger in Jeans
beim Pizzaessen und einem Schluck Afri-Cola bedienen (f&uuml;r Imis: Afri-Cola
wird in K&ouml;ln gebraut). Auf das Thema geb&uuml;gelte Unterw&auml;sche kann ich an
dieser Stelle, dem amerikanischen Einfluss sei ebenfalls gedankt, nicht
weiter eingehen. Denn obwohl es hier schon sp&auml;t ist, sind dort die Kinder
ja noch wach. Sagt zumindest der Sowirdsgemacht-Projektleiter. Aber genug
gescherzt, sonst entfernen wir uns zu weit vom Vorurteil der unfreundlichen
Deutschen.
<P>Linux wird von einer weltweiten Gemeinde von Hackern im Internet
entwickelt, deren kleinster gemeinsamer Nenner f&uuml;r die Verst&auml;ndigung
Englisch ist. Dagegen m&uuml;ssen Anwender &uuml;blicherweise in ihrer Muttersprache
und mit nationalen Eigenheiten arbeiten: zum Beispiel Zeichen, Zeitzonen
oder Zahlenformaten. Erfreulicherweise hat Linux eine so weite Verbreitung
erfahren, dass die nationalen M&auml;rkte l&auml;ngst Ziele f&uuml;r die
Linux-Distributionen geworden sind. D.h. die regionalen Anpassungen der
Anwendungen und des Systems stecken in Linux weitgehend drin. In
diesem Zusammenhang m&ouml;chte man das KDE-Projekt erw&auml;hnen, welches auf dem
Gebiet der Internationalisierung hinsichtlich Anzahl der Sprachen und
Vollst&auml;ndigkeit der Anpassungen hohe Ma&szlig;st&auml;be gesetzt hat. Dieser
Entwicklung tr&auml;gt auch das Deutsche Sowirdsgemacht Rechnung, indem der
Schwerpunkt ab sofort mehr auf der Beschreibung von Grundlagen liegt. 
<P>
<P>
<H3>Urheberrechte, Lizenz und Haftungsausschluss</H3>

<P>
<P>&copy; Winfried Tr&uuml;mper &lt;me@wt.xpilot.org&gt; 1994-2001. Alle Rechte
vorbehalten.
<P>Vertrieb und Benutzung dieses Dokuments sind unter den folgenden
Bedingungen gestattet: Der Name des Autors darf nicht zur Vermarktung
von Produkten verwendet werden, die auf diesem Dokument beruhen, und
ge&auml;nderte Versionen dieses Dokuments m&uuml;ssen klar als solche erkennbar sein.
<P>Text, Abbildungen und Programme in diesem Dokument wurden mit grosser
Sorgfalt erarbeitet. Trotzdem sind Fehler nicht ganz
auszuschliessen. Angesichts der Komplexit&auml;t und der Schnelllebigkeit
heutiger Computer-Systeme kann der Autor weder die Richtigkeit noch die
Anwendbarkeit der gelieferten Informationen garantieren. Kurz: Benutzung
auf eigene Gefahr.
<P>
<P>
<H3>Verf&uuml;gbarkeit</H3>

<P>Linux Sowirdsgemacht-Beschreibungen f&uuml;llen die L&uuml;cke zwischen B&uuml;chern und
kurzen Liesmich-Dateien. Sie haben den Anspruch, einen Sachverhalt
ausf&uuml;hrlich zu erkl&auml;ren. Eigens zu diesen Zweck wurde
vom Linux-Dokumentations-Projekt (LDP) eine umfangreiche Infrastruktur aus
Autoren, Schreibwerkzeugen und Distributions-Kan&auml;len geschaffen.  Das
vorliegende Sowirdsgemacht ist offizieller Teil des (LDP) und somit wie
alle anderen Dokumente des LPD erh&auml;ltlich.  Entweder auf 
<A HREF="http://www.linuxdoc.org/">dessen Webseiten</A> oder im Verzeichnis
/usr/share/doc/howto/ auf der eigenen Festplatte. Daneben sind gedruckte 
gedruckten Zusammenstellungen verschiedener Verlage &uuml;ber die Buchhandlungen
erh&auml;ltlich.
<P>Die neueste Version des Deutschen Sowirdsgemacht ist ausserdem &uuml;ber meine 
<A HREF="http://wt.xpilot.org/">hauseigene Seite</A> erh&auml;ltlich.
<P>Korrekturen und Verbesserungsvorschl&auml;ge k&ouml;nnen per E-Mail an mich
geschickt werden: me@wt.xpilot.org. Angebote f&uuml;r mehr Schleichwerbung
in der Einleitungen nehme ich dort ebenfalls entgegen.
<P>
<P>
<H3>Offene Punkte</H3>

<P>
<P>
<UL>
<LI> Korrekturlesen lassen. :)</LI>
<LI> Danksagungen auf den neusten Stand bringen und wieder hinzuf&uuml;gen</LI>
<LI> Quelltext in das neue docbook-Format konvertieren.</LI>
</UL>
<P>
<P>
<H2><A NAME="ss1.2">1.2 Menschen</A>
</H2>

<P>
<H3>Benutzergruppen</H3>

<P>
<P>In vielen St&auml;dten haben sich Linux-Anwender zu sogenannten Linux
User Groups (LUGs) zusammengetan. Diese Benutzergruppen sind offen
f&uuml;r jeden und halten regelm&auml;&szlig;ige Sitzungen ab. Sie sind der
ideale Treffpunkt f&uuml;r all diejenigen, die sich nicht nur im "Cyberspace"
mit anderen Linuxern austauschen wollen. Eine &uuml;bersicht befindet sich
beispielsweise auf den 
<A HREF="http://www.linux.de/groups/">deutschen Linux-Portalseiten</A>.
<P>
<P>
<H3>Speziell f&uuml;r Frauen</H3>

<P>Hm, ich habe bisher nur die 
<A HREF="http://women.kde.org/">KDE-Frauen</A> gefunden. Gibt es noch mehr?
<P>
<P>
<H3>Vereine</H3>

<P>Neben den lokalen LUGs gibt es auch noch die folgenden Vereine:
<P>Der 
<A HREF="http://www.linux-verband.de/">Linux-Verband</A> richtet
sich in erster Linie an Firmen-Mitglieder. Die Aktivit&auml;ten sind beachtlich
und konzentrieren sich im Moment auf die Aufkl&auml;rung &uuml;ber die Sch&auml;dlichkeit
von Software-Patenten.
<P>Die 
<A HREF="http://www.guug.de/">German Unix User Group</A> zielt
nach Jahren der Neuorientierung derzeit wieder auf
Unix-Systemadministratoren.
<P>
<P>
<H3>Kongresse</H3>

<P>Derzeit gibt es drei grosse &uuml;berregionale Veranstaltungen zu Linux in
Deutschland: den 
<A HREF="http://www.linuxtag.org/">LinuxTag</A>, den 
<A HREF="http://www.linux-kongress.de">Linux-Kongress</A> und die
<A HREF="http://www.linuxworldexpo.de">LinuxWorld Expo</A>. Dar&uuml;ber
hinaus gibt es zahlreiche lokale Veranstaltungen, die in den Kalendern der
Portal-Seiten zu finden sind.
<P>
<P>
<H3>Diskussionsforen</H3>

<P>Erste Anlaufstelle f&uuml;r deutschsprachige Anwender ist die "Newsgroup"
de.comp.os.unix.linux.infos. Dort sind weitergehende Informationen zu Linux
und &uuml;ber die Benutzung der zugeh&ouml;rigen "Newsgroups" zusammengetragen. Eine
gute Idee ist die Benutzung der web-basierten Archive, in denen man zu
Stichworten eine Menge Antworten findet: 
<A HREF="http://groups.google.com/groups?hl=de&amp;group=de.comp.os.linux">Google-Suche: de.comp.os.linux.*</A> oder 
<A HREF="http://www.dcoul.de/faq">Oft gestellte Fragen der Deutschen Linux-Diskussionsgruppen</A>.
<P>
<P>
<H3>Internet Relay Chat (IRC)</H3>

<P>Der IRC-Kanal #LinuxGER bietet eine Hotline zu Linux in deutscher
Sprache. &Uuml;ber 
<A HREF="http://www.linuxger.de/">dessen hauseigene Web-Seite</A> kann man mehr &uuml;ber die Welt des IRC lernen.
<P>
<P>
<H2><A NAME="ss1.3">1.3 Dokumentation</A>
</H2>

<P>
<H3>Deutschsprachige Portalseiten zu Linux</H3>

<P>Hier ist eine kleine Auswahl von Seiten, die schon l&auml;nger existieren und
auch regelm&auml;ssig gepflegt werden:
<P>
<A HREF="http://www.linux.at/">Linux in &Ouml;sterreich</A><P>
<A HREF="http://www.linux.ch/">Linux in der Schweiz</A><P>
<A HREF="http://www.linux.de/">Linux.de</A><P>
<A HREF="http://www.pro-linux.de/">Pro Linux</A><P>
<P>
<H3>Deutsches Linux Howto Projekt (DLHP)</H3>

<P>Das 
<A HREF="http://www.tu-harburg.de/~semb2204/dlhp/">Deutsche Linux Howto Projekt (DLHP)</A> Projekt besch&auml;ftigt sich mit der
&uuml;bersetzung der originalen englischsprachigen Linux Sowirdsgemacht ins
Deutsche. Auf den Webseiten des Projekts kann man eine Liste aller
&uuml;bersetzten Sowirdsgemacht und n&auml;here Informationen zum Projekt abrufen.
<P>
<P>
<H2><A NAME="ss1.4">1.4 Zeichens&auml;tze</A>
</H2>

<P>Rechner sind Ger&auml;te, die auf der Grundlage von digitalen Zahlen arbeiten.
Menschen sind Wesen, die mit Zahlen und auch mit Namen arbeiten. Setzt man
einen Menschen vor einen Rechner und verkauft dem Menschen den Rechner als
Universalger&auml;t, dann muss der Rechner neben den Zahlen auch mit Namen
umgehen k&ouml;nnen. Dies wird mit einem Kunstgriff erreicht: Das Alfabet wird
durchnummeriert, d.h. Buchstaben werden Zahlen zugeordnet, mit denen der
Rechner wiederum umgehen kann. Beispiel: Der Buchstabe A hat die Nummer
65. Zeichentabelle oder Zeichensatz wird diese Zuordnung genannt. Sie
listet neben den Buchstaben auch noch Symbole und Sonderzeichen auf. Der
Zeichensatz ist eine rein logische Definition; erst die Schriftart bestimmt
die Darstellung des Zeichensatzes auf dem Bildschirm.
<P>Damit Dokumente zwischen Computern austauschbar sind, muss der verwendete
Zeichensatz standardisiert sein. Ein fr&uuml;her Standard war US-ASCII, eine
sehr kleine, aus 127 Zeichen bestehende Zuordnung, bei der jedes Zeichen
genau 7 Bits Speicherplatz belegte. Ein Bit mehr pro Zeichen ben&ouml;tigt der
Zeichensatz ISO-8859-1, mit dem sich die meisten mitteleurop&auml;ischen Sprachen
darstellen lassen. Allerdings legen beide Zeichens&auml;tze das lateinische
Alfabet zugrunde, sind also f&uuml;r Anwender ausserhalb von Europa oder Amerika
nur begrenzt n&uuml;tzlich. So entstanden in den verschiedenen Regionen der Welt
Zeichens&auml;tze, die wegen unterschiedlicher Zeichen mit derselben Nummer
nicht miteinander vertr&auml;glich sind.
<P>Tabelle 1: Ausschnit des Zeichensatzes ISO-8859-1
<BLOCKQUOTE><CODE>
<PRE>
&quot;  quotedbl     '  apostrophe   `  grave        ~  asciitilde
^  asciicircum  _  underscore   !  exclam       ?  question
#  numbersign   $  dollar       %  percent      &amp;  ampersand
|  bar          @  at           +  plus         -  minus
*  asterisk     /  slash        \  backslash    .  period
,  comma        :  colon        ;  semicolon    &lt;  less
=  equal        &gt;  greater      (  parenleft    )  parenright
[  bracketleft  ]  bracketright {  braceleft    }  braceright

¡  exclamdown   ¢  cent         £  sterling     ¤  currency
¥  yen          ¦  brokenbar    §  section      &quot;  diaeresis
©  copyright    ª  ordfeminine  &lt;  guillemotleft
¬  notsign      ­  hyphen       ®  registered
¯  macron       °  degree       ±  plusminus    ²  twosuperior
³  threesuperior                ´  acute        &micro;  mu
¶  paragraph    ·  periodcentered               ¸  cedilla
¹  onesuperior  º  masculine    &gt;  guillemotright
¼  onequarter   ½  onehalf      ¾  threequarters
¿  questiondown &Agrave;  Agrave       &Aacute;  Aacute       &Acirc;  Acircumflex
&Atilde;  Atilde       &auml;  Adiaeresis   °  Aring        &AElig;  AE
&Ccedil;  Ccedilla     &Egrave;  Egrave       &Eacute;  Eacute       &Ecirc;  Ecircumflex
&Euml;  Ediaeresis   &Igrave;  Igrave       &Iacute;  Iacute       &Icirc;  Icircumflex
&Iuml;  Idiaeresis   &ETH;  ETH          &Ntilde;  Ntilde       &Ograve;  Ograve
&Oacute;  Oacute       &Ocirc;  Ocircumflex  &Otilde;  Otilde       &ouml;  Odiaeresis
×  multiply     &Oslash;  Ooblique     &Ugrave;  Ugrave       &Uacute;  Uacute
&Ucirc;  Ucircumflex  &uuml;  Udiaeresis   &Yacute;  Yacute       &THORN;  THORN
&szlig;  ssharp       &agrave;  agrave       &aacute;  aacute       &acirc;  acircumflex
&atilde;  atilde       &auml;  adiaeresis   &aring;  aring        &aelig;  ae
&ccedil;  ccedilla     &egrave;  egrave       &eacute;  eacute       &ecirc;  ecircumflex
&euml;  ediaeresis   &igrave;  igrave       &iacute;  iacute       &icirc;  icircumflex
&iuml;  idiaeresis   &eth;  eth          &ntilde;  ntild        &ograve;  ograve
&oacute;  oacute       &ocirc;  ocircumflex  &otilde;  otilde       &ouml;  odiaeresis
÷  division     &oslash;  oslash       &ugrave;  ugrave       &uacute;  uacute
&ucirc;  ucircumflex  &uuml;  udiaeresis   &yacute;  yacute       &thorn;  thorn
&yuml;  ydiaeresis
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>Die derzeitige L&ouml;sung ist der internationale Unicode-Zeichensatz (identisch
zu ISO-10646). Unicode steht f&uuml;r unique code und bezeichnet eindeutige
Nummern von derzeit &uuml;ber 90.000 definierten Zeichen in einer einzigen
Zuordnungstabelle. Der Prozess der Standardisierung ist weit
fortgeschritten, aber noch nicht abgeschlossen. Sch&auml;tzungen gehen davon
aus, dass niemals mehr als ca. 2.1 Millionen (21 Bit) Zeichen definiert
sein werden. Um eine ausreichende Reserve vorzuhalten, wurden die
Unicode-Tabelle mit 32 Bit pro Zeichen ausgelegt, was zur Nummerierung von
mehr als 4 Millarden Zeichen ausreicht.  Unicode bricht also mit einer
gel&auml;ufigen Annahme: 8 Bit (ein Byte) pro Zeichen. Die vier Byte scheinen
grossz&uuml;gig dimensioniert und werfen Fragen des Speicherverbrauchs auf: Mit
unserem mitteleurop&auml;ischen Zeichensatz ISO-8859-1 belegt jedes Zeichen acht
Bit auf den Speichermedien (RAM, CD-ROM, Festplatte). Ohne spezielle
Massnahmen belegen in Unicode dieselbem Zeichen 32 Bit, d.h. alle
Speichermedien m&uuml;ssten f&uuml;r die Verwendung von Unicode vier mal so gross
ausgelegt werden. Das erschien nicht durchf&uuml;hrbar, weshalb zur effektiveren
Speicherung verschiedene Unicode Bit Transformationen (UTF) eingef&uuml;hrt
wurden: UTF-8, UTF-16 und UTF-32. Letztere Transformation &auml;ndert nichts,
spart deswegen auch nichts und belegt somit in verschwenderischer Manier
f&uuml;r jedes Zeichen konstant 32 Bit im Speicher. Erstere Transformationen
(UTF-8) belegt zwischen acht und 48 Bits, je nach Standort des Zeichens in
der Tabelle. Oft ben&ouml;tigte Zeichen (US-ASCII) stehen vorne in der Tabelle
und belegen nur acht Bits, die deutschen Umlaute stehen mehr zur Mitte hin
und belegen 16 Bits. Ein kleiner Nachteil von UTF-8 ist die
rechenzeitintensive Transformation der Daten. Die Transformation UTF-16
liegt irgendwo zwischen dem Speicherplatzverbrauch von UTF-32 und dem
Rechenzeitverbrauch von UTF-8.
<P>Weitere Informationen zu Unicode sind direkt beim 
<A HREF="http://www.unicode.org/">Unicode-Consortium </A>
und in der 
<A HREF="http://www.cl.cam.ac.uk/~mgk25/unicode.html">UTF-8 and Unicode FAQ</A> for Unix/Linux (engl.) zu finden.
<P>
<P>
<H3>Das Euro-Symbol</H3>

<P>Das ISO W&auml;hrungs-K&uuml;rzel f&uuml;r den Euro ist EUR, wie man es von den
&Uuml;berweisungs-Formularen der Banken schon kennt. Die Schreibweise EUR 10,23
f&uuml;r 10 Euro und 23 Cent ist gleichberechtigt mit der Verwendung des
speziellen W&auml;hrungs-Symbols ¤ (E mit zus&auml;tzlichem Mittelstrich). Falls das
Euro-Symbol eher wie ein mechanischer Wecker aussieht, dann verwenden Sie
noch die alten Schriftarten. In diesem Fall sollten Sie Ihre
Linux-Distribution aktualisieren, denn ein Austausch aller denkbaren
Schriftarten geht weit &uuml;ber die M&ouml;glichkeiten dieses Sowirdsgemacht
hinaus. (Schriftarten waren schon immer ein Problem unter Linux, was das
Euro-Symbol nur best&auml;tigt.)  Ob sich eine Aktualisierung angesichts des
robusteren ISO-K&uuml;rzels EUR &uuml;berhaupt lohnt, m&uuml;ssen Sie selbst entscheiden.
<P>Definiert wird das Euro-Symbol vom Zeichensatz ISO-8859-15. Es liegt in der
Tabelle bei den anderen W&auml;hrungs-Symbolen zwischen Pfund und Yen. &Uuml;ber die
Tastatur k&ouml;nnen Sie es wie aufgedruckt mit AltGr-E eingeben. Die
Tastenkombination AltGr-C gibt das bekannte Cent-Symbol.
<P>
<P>
<H2><A NAME="ss1.5">1.5 Tastatur</A>
</H2>

<P>Alle dem Autor bekannten Distributionen stellen die deutsche
Tastaturbelegung selbstst&auml;ndig bei der Installation ein. Ist man mit dem
Resultat nicht zufrieden, so lassen sich mit den Kommandozeilen-Werkzeugen
loadkeys (Text-Konsolen) und xmodmap (X11) andere Belegungen
einstellen. Eine genauere Beschreibung der Werkzeuge geht &uuml;ber den Anspruch
dieses Dokuments hinaus.
<P>Bei dieser Gelegenheit soll ein wenig Licht in die Konzepte der
Tastaturbelegung gebracht werden, um unter Unix/Linux in Zukunft weniger
Probleme mit den Tastenbelegungen zu haben. Die Bet&auml;tigung einer Taste
sendet eine Kennzahl. Andere Tastaturen geben andere Kennzahlen. &Auml;hnlich zu
den weiter oben beschriebenen Zeichens&auml;tzen, kommen auch bei der Tastatur
Zuordnungstabellen zum Einsatz, die den Kennzahlen Symbole zuordnen. Die
Zuordnungstabellen heissen Tastaturbelegungen. Eine Tastaturbelegung
definiert unter Umst&auml;nden nicht direkt die auszugebenden Zeichen, sondern
machen einen Zwischenschritt &uuml;ber symbolische Namen. Beispiel: Unter X11
sendet eine Taste die Kennzahl 22. Die Tastaturbelegung definiert f&uuml;r diese
Kennzahl (Terminus "keycode") das Symbol BackSpace, womit die Taste zum
L&ouml;schen des linken Zeichens auf der PC-Tastatur gemeint
ist. X11-Anwendungen reagieren direkt auf dieses Tasten-Symbol. F&uuml;r
Anwendungen, die in einem Textdialog-Fenster (xterm, ssh) ablaufen, wird
das Symbol widerum in eine Steuersequenz &uuml;bersetzt, z.B. Steuerung-?  oder
Escape-[3&nbsp;.
<P>
<P>
<H3>Kompositionen</H3>

<P>Gebr&auml;uchliche Tastaturen verf&uuml;gen &uuml;ber ca. 110 Tasten. Um damit den
kompletten Zeichensatz ISO-8859-1 eingeben zu k&ouml;nnen, m&uuml;sste man die Tasten
mit bis zu vier Zeichen belegen. Ben&ouml;tigt man nur selten den Zugriff auf
den kompletten Zeichensatz, dann ist die Vierfach-Belegung ein zu hoher
Lernaufwand. In diesem Fall bietet sich die Kompositions-Taste an. Diese
Taste verursacht selbst keine Ausgabe auf dem Bildschirm, sondern
komponiert die beiden nachfolgend eingegebenen Zeichen zu einem. Mit
anderen Worten: Die Zeichen werden &uuml;bereinander gedruckt. Beispiel: Die
Tastenfolge &lt;Compose&gt; &lt;~&gt; &lt;a&gt; ergibt ein &atilde;.
Unter Linux ist meist eine der Tasten rechts von der Leertaste mit der
Kompositions-Funktion belegt. (Hinweis f&uuml;r Xmodmap-Bastler: Das
XFree-Tasten-Symbol der Kompositions-Taste ist Multi_key.)
<P>
<P>
<H3>St&auml;ndige Komposition</H3>

<P>Bestimmte Tasten k&ouml;nnen als st&auml;ndig komponierend konfiguriert werden. Die
Bet&auml;tigung solcher Tasten f&uuml;hrt zun&auml;chst zu keiner Ausgabe auf dem
Bildschirm, sondern das betreffende Symbol wird &uuml;ber das n&auml;chste
Zeichen gedruckt, das eingetippt wird. 
<P>Die Funktion wird im Englischen manchmal mit "dead keys" bezeichnet, was
eine Fehlbezeichnung ist, denn tote Tasten verursachen &uuml;berhaupt keine
Funktion.
<P>
<P>
<H3>Das Bootprompt</H3>

<P>Beim Starten des Computers wird der Linux-Kernel von einem sogenannten
Boot-Loader in den Arbeitspeicher geladen. &Uuml;ber den Boot-Loader kann man
dem Kernel Parameter &uuml;bergeben - vorausgesetzt, man kennt die amerikanische
Tastenbelegung. Die folgenden Abschnitte beschreiben die M&ouml;glichkeiten
zur Konfiguration der Tastenbelegung f&uuml;r die Boot-Loader von Linux.
<P>
<H3>Lilo</H3>

<P>Seit der Version 2.0 hat die ehrenwerte Dame die F&auml;higkeit zur Verwendung
alternativer Tastenbelegungen. Dem Source-Code liegt das Perl-Skript
keytab-lilo.pl bei, mit der man eine der Tastaturbelegungen
f&uuml;r die Textkonsolen in f&uuml;r Lilo geeignetes Format &uuml;berf&uuml;hrt. Beispiel:
man m&ouml;chte die Tastenbelegung de-latin1-nodeadkeys.map
schon auf dem Lilo-Prompt geladen wissen. Dazu ist folgender Befehl
auszuf&uuml;hren:
<P>
<BLOCKQUOTE><CODE>
<PRE>
./keytab-lilo.pl  de-latin1-nodeadkeys  > /boot/de-latin1-nodeadkeys.ktl
</PRE>
</CODE></BLOCKQUOTE>
<P>Um dises Belegung zu aktivieren mu&szlig; man in der Konfigurationsdatei
/etc/lilo.conf folgenden Eintrag vornehmen und danach das Kommando lilo
ausf&uuml;hren. Die Details k&ouml;nnen sich allerdings von Distribution zu
Distribution unterscheiden, weshalb man bitte die mitgelieferten Handb&uuml;cher
konsultiere.
<P>
<BLOCKQUOTE><CODE>
<PRE>
keytable = /boot/de-latin1-nodeadkeys.klt
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>
<H2><A NAME="ss1.6">1.6 Zeitzone</A>
</H2>

<P>Die Erde ist in Zeitzonen eingeteilt, innerhalb derer die Tageszeit von der
nat&uuml;rlichen Zeit (h&ouml;chster Sonnenstand = Mittag) abweichen kann. Die
Tageszeit der Zeitzone kann sogar springen, wie beispielsweise bei der
Umstellung zwischen Sommer und Winterzeit. Bei den Zeitzonen handelt es
sich also um politische Festlegungen. F&uuml;r kleine L&auml;nder kann man die
Zeitzone &uuml;ber die Hauptstadt ausw&auml;hlen, also Europe/Berlin, Europe/Vienna
oder Europe/Zurich. Hinter diesem Alias-Namen verbirgt sich die
tats&auml;chliche Zeitzone, n&auml;mlich in unserem Fall die Mitteleurop&auml;ische Zeit
(Central European Time, CET) bzw. die Mitteleurop&auml;ische Sommerzeit
(Central European Summer Time, CEST).
<P>Das fr&uuml;her gebr&auml;uchliche MET sollte unter keinen Umst&auml;nden
weiterverwendet werden. Von Markus Kuhn stammt folgende Information zu
diesem Thema: Die Datei MET existiert nur zwecks
R&uuml;ckw&auml;rtskompatibilit&auml;t.  Die Autoren der Zeitzonentabellen
(Olson/Eggert/et al.) wollen eigentlich, da&szlig; deutsche Anwender statt
MET die Datei Europe/Berlin verwenden.  Dann stimmen sogar die
historischen Sommerzeiten vor 1945, die Linux auch alle
kennt. Au&szlig;erdem wird dann in der neuesten Version der
Zeitzonentabelle "Mitteleurop&auml;ische Zeit (MEZ)" endlich korrekt ins
Englische mit "Central European Time (CET)" &uuml;bersetzt, denn "MET" ist
ein &uuml;bersetzungsfehler (siehe z.B. Langenscheid Englisch). Ich habe
deswegen sogar beim Physikalisch-Technischen Bundesamt nachgefragt,
die f&uuml;r die deutsche Zeit verantwortlich sind.
<P>Der gemeinsame Bezugspunkt f&uuml;r alle Zeitzonen ist die Universalzeit
(Universal Time, UTC), fr&uuml;her auch Greenwich Mean Time (GMT) genannt. Unter
Linux l&auml;sst man die CMOS-Uhr auf der Hauptplatine &uuml;blicherweise mit UTC
laufen. Der Linux-Kernel &uuml;bernimmt den Wert der CMOS-Uhr beim Systemstart
und errechnet daraus die Sekunden seit dem 1. Januar 1970, 0 Uhr (Unix
Epoch Time). Intern arbeitet der Linux-Kernel nur mit dieser Sekunden-Zahl,
die &uuml;blicherweise auch in UTC l&auml;uft. Soll dem Anwender ein Datum oder eine
Zeit angezeigt werden, dann wird aus der Systemzeit unter Ber&uuml;cksichtigung
der Zeitzone und der Lokalisierung (siehe oben) eine Zeichenfolge
konstruiert.
<P>Zusammenfassend kann man sagen, dass es unter Linux 3 Zeiten gibt: Die der
auf dem Motherboard installierten CMOS-Uhr, die Systemzeit des
Linux-Kernels und die dem Anwender von verschiedenen Uhren angezeigte
Zeit. Die Kommandozeilen-Werkzeuge hwclock ("hardware clock") und date
&uuml;bersetzen zwischen diesen Uhrzeiten.  Folgende Strichzeichnung
verbildlicht die Zusammenh&auml;nge:
<P>
<BLOCKQUOTE><CODE>
<PRE>
            hwclock -u -w               date -u -s
 CMOS-Uhr  &lt;--------------   Linux    &lt;--------------
  (UTC)                    Systemzeit                 Anwender-Uhr
           -------------->  (Epoch)    -------------->
            hwclock -u -s               date, xclock
</PRE>
</CODE></BLOCKQUOTE>
<P>Zwar liest der Kernel schon beim Booten die CMOS-Uhr aus und interpretiert
sie als UTC. Aber um systematische Fehler der CMOS-Uhr zu korrigieren, wird
die Uhrzeit von einem der Systemstart-Skripte im Verzeichnis /etc/init.d/
ein weiteres Mal gelesen. &Uuml;bernimmt man die Linux-Systemzeit mit dem Kommando
netdate von einem Zeit-Server, dann muss man die CMOS-Uhr mit dem Kommando
hwclock nachziehen.
<P>Die systemweit gew&auml;hlte Zeitzone kann mit der Umgebungsvariable TZ
individuell &uuml;berschrieben werden. Beispiele:
<P>
<BLOCKQUOTE><CODE>
<PRE>
export TZ=Asia/Hong_Kong; xclock &amp;
export TZ=UTC; xclock &amp;
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>
<H2><A NAME="ss1.7">1.7 Anwendungen</A>
</H2>

<P>
<H3>Internationalisierung und Lokalisierung</H3>

<P>Internationalisierung und Lokalisierung sind auch im Englischen lange
W&ouml;rter, weshalb sie mit i18n und i10n abgek&uuml;rzt werden. Die Zahlen geben
an, wieviele Buchstaben in der englischen Schreibweise ausgelassen wurden.
<P>Mit i18n wird die Ver&auml;nderung eines Programms zur Unterst&uuml;tzung mehrerer
Sprachen bezeichnet. Bei diesem Prozess wird normalerweise der angezeigte
Text (Men&uuml;s, Meldungen, usw.) vom Programmcode getrennt. Auf diese Weise
k&ouml;nnen sich mehrere &Uuml;bersetzungen denselben sprachenunabh&auml;ngigen
Programmcodes teilen. Ins Deutsche &uuml;bersetzte Programmeldungen k&ouml;nnen &uuml;ber
die Umgebungsvariable LANG ausgew&auml;hlt bzw. aktiviert werden. Beispiel:
<P>
<BLOCKQUOTE><CODE>
<PRE>
#LANG=de_AT  # in &ouml;sterreich
#LANG=de_CH  # in der deutschsprachigen Schweiz
LANG=de_DE   # in Deutschland
export LANG
</PRE>
</CODE></BLOCKQUOTE>
<P>Das Resultat ist nicht immer zufriedenstellend. Beispielsweise sind nicht
alle Bibliotheken internationalisiert, so dass sich die Ausgabe-Texte mit
Englisch mischen. Die Entwicklung in den vergangenen Jahren
l&auml;sst sich an folgendem Beispiel ablesen:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# im Jahre 1997:
tar: Kann Archiv 'foo.tgz' nicht &ouml;ffnen: Permission denied

# im Jahre 2001:
tar: foo.tgz: Cannot open: Keine Berechtigung
</PRE>
</CODE></BLOCKQUOTE>
<P>i10n bezeichnet die dar&uuml;ber hinaus gehende Feinarbeit der Anpassung an
nationalen Besonderheiten, wie Datums- und Zahlenformate oder das
kulturelle Umfeld. Eine deutsche Lokalisierung wird mittlerweile
automatisch mit der LANG-Umgebungsvariable aktiviert. So macht es am
meisten Sinn. Bei &auml;lteren Systemen kann mit der Umgebungsvariable LC_ALL
die Lokalisierung eingeschaltet werden. Beispiel:
<P>
<BLOCKQUOTE><CODE>
<PRE>
LC_ALL=de
export LC_ALL
</PRE>
</CODE></BLOCKQUOTE>
<P>Die Einstellungen sollten von allen modernen Linux-Distributionen
automatisch vorgenommen werden. Exotischere Lokalisierungen sind zum
Beispiel von IBM erh&auml;ltlich: 
<A HREF="http://www-124.ibm.com/developerworks/projects/locale">IBM developer works: universal locales</A> 
<P>
<P>
<H3>Ausnahmen von der Regel</H3>

<P>Sowohl f&uuml;r die Textkonsole als auch f&uuml;r X11 existieren
Zeichens&auml;tze, die nicht alle Zeichen aus ISO-8859-1 enthalten. Dies
gilt erst recht f&uuml;r Unicode. Die fehlenden Zeichen (z.B. Umlaute) werden
als Leerzeichen oder gar nicht auf dem Bildschirm dargestellt.  In diesem
Fall hilft nat&uuml;rlich die nachfolgend beschriebene Konfiguration der
Anwendungen nicht weiter, sondern es mu&szlig; ein anderer
(vollst&auml;ndiger) Zeichensatz gew&auml;hlt werden.
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Anwendung    Einstellung                vorgenommen in/auf
-------------------------------------------------------------------
LaTex        \usepackage{a4}            im Dokument
gnuplot      set encoding iso_8859_1    ~/.gnuplotrc
xfig         Fig*inches:   false        Xresource
xfig         -metric                    Kommandozeilenoption
lynx         CHARACTER_SET:iso-8859-1   ~/.lynxrc und /etc/lynx.cfg
nn                                      ~/.nn/init und /etc/nn/setup
             set data-bits 8
             set charset iso-8859-1
tin                                     ~/.tin/headers
             Mime-Version: 1.0
             Content-Type: text/plain; charset=iso-8859-1
             Content-Transfer-Encoding: 8bit
elm                                     ~/.elm/elmrc und /usr/lib/elm/elm.rc
             charset = iso-8859-1
             displaycharset = iso-8859-1
             textencoding = 8bit
pine         character-set=ISO-8859-1   ~/.pinerc und /etc/pine.conf
less         LESSCHARSET=latin1         Umgebungsvariable
joe          -asis                      ~/.joerc und /etc/joe/joerc
dosemu                                  ~/.dosrc und /etc/dosemu.conf
             keyboard { layout de-latin1  keybint on  rawkeyboard on }
             X { updatefreq 8 title `DOS in a BOX' icon_name `xdos' keycode }
kermit                                  ~/.mykermrc und /etc/kermit.ini
             set terminal bytesize 8
             set command bytesize 8
             set file bytesize 8
             set language german
             set file character-set latin1-iso
             set transfer character-set latin1-iso
             set terminal character-set latin1-iso
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>
<H3>Texte</H3>

<P>
<P>
<H3>Das Papierformat DIN A4</H3>

<P>In Amerika wird haupts&auml;chlich das Papierformat US-Letter verwendet, welches
ein wenig breiter und niedriger ist als das in Europa gebr&auml;uchliche DIN A4.
Oft muss man Anwendungen ausdr&uuml;cklich auf DIN A4 einstellen. Beispiele:
<P>
<BLOCKQUOTE><CODE>
<PRE>
Anwendung    Einstellung                vorgenommen in/auf
-------------------------------------------------------------------
LaTex        \usepackage{a4}            im Dokument
xdvi         XDvi.paper: a4             X-Resource
ghostview    Ghostview.pageMedia: A4    X-Resource
ghostscript  -sPAPERSIZE=a4             Kommandozeile
dvips                                   Konfigurationsdatei .dvipsrc
             @ a4size 210mm 297mm
             @+ %%PaperSize: a4
ImageMagick  -page A4                   Kommandozeile
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>
<H3>Austausch von Texten mit anderen Systemen</H3>

<P>
<P>Die Textformate von DOS/Windows-basierten System, Apple-Computern und UNIX
unterscheiden sich in zwei Punkten: Zeichensatz und Zeilenenden. Linux
macht am Ende einer Textzeile nur einen Zeilenvorschub, &Auml;pfel machen nur
einen Wagenvorlauf und DOS-basierte Systeme machen beides.
<P>Die Programme <CODE>fromdos</CODE>, <CODE>todos</CODE> und <CODE>frommac</CODE>, <CODE>tomac</CODE>
wandeln ausschlie&szlig;lich die Zeilenenden um, die Zeichen selbst werden
nicht angepa&szlig;t.  Gleiches gilt f&uuml;r die Optionen `conv=auto',
bzw. `conv=text' des mount-Kommandos bezogen auf das MS-DOS
Dateisystem.
<P>Will man auch die Zeichens&auml;tze von Texten konvertieren, dann hilft das
Kommandozeilen-Werkezeug recode weiter. Durch die Definition von Aliasen
kann man sich das Leben etwas einfacher machen:
<P>
<BLOCKQUOTE><CODE>
<PRE>
alias unix2dos='recode lat1.ibmpc'
alias dos2unix='recode ibmpc.lat1'
alias unix2mac='recode lat1.mac'
alias mac2unix='recode mac.lat1'
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>
<H3>Drucken</H3>

<P>
<P>Die folgenden &Uuml;berlegungen betreffen nur Text-Dateien. Grafiken oder die
Ausgabe von Textverarbeitungen werden als Punktmuster zum Drucker
geschickt und sind daher nicht betroffen.
<P>G&auml;ngige Drucker-Modelle erwarten Texte im DOS-Format. Schickt man eine
Textdatei im Unix-Format zum Drucker, dann erh&auml;lt man einen
Treppenstufen-Effekt, weil der Text am Ende der Zeile keinen Wagenr&uuml;cklauf
aufweist. Beispiel: lpr /etc/nsswitch.conf. Entweder konvertiert man
Textdateien wie oben beschrieben in das DOS-Format oder man wandelt sie mit
Werkzeugen wie atp, mpage, a2ps, ascii2ps, encode oder gencode in das
PostScript-Format. F&uuml;r PostScript installieren die modernen
Linux-Distributionen Drucker-Treiber.
<P>
<P>
<HR>
<A HREF="German-HOWTO-2.html">Next</A>
Previous
<A HREF="German-HOWTO.html#toc1">Contents</A>
</BODY>
</HTML>
