<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux Portuguese-HOWTO: Bibliografia comentada</TITLE>
 <LINK HREF="Portuguese-HOWTO-9.html" REL=previous>
 <LINK HREF="Portuguese-HOWTO.html#toc10" REL=contents>
</HEAD>
<BODY>
Next
<A HREF="Portuguese-HOWTO-9.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc10">Contents</A>
<HR>
<H2><A NAME="SEC:BIBLIOGRAFIA"></A> <A NAME="s10">10. Bibliografia comentada</A></H2>

<P>Esta se&ccedil;&atilde;o ainda est&aacute; incompleta e deve ser melhorada nas pr&oacute;ximas vers&otilde;es.
Os HOWTOs mencionados aqui geralmente s&atilde;o distribu&iacute;dos nos CDs de
instala&ccedil;&atilde;o e todas as distribui&ccedil;&otilde;es possuem pelo menos alguns deles em pacotes
prontos para instalar.  Na Slackwre esses pacotes s&atilde;o os da s&eacute;rie F e os
documentos ficam instalados no diret&oacute;rio <CODE>/usr/doc/faq/howto</CODE> e na
Debian o diret&oacute;rio &eacute; <CODE>/usr/doc/HOWTO</CODE>. Eles tamb&eacute;m podem ser obtidos
via WWW em 
<A HREF="http://metalab.unc.edu/LDP/HOWTO/">http://metalab.unc.edu/LDP/HOWTO/</A>.
<P>
<DL>
<DT><B>[BAL97]&nbsp;BALSA,&nbsp;Andr&eacute;&nbsp;D. Linux and X11 internationalization</B><DD><P>Dispon&iacute;vel via WWW em 
<A HREF="http://wauug.erols.com/~balsa/linux/deadkeys/">http://wauug.erols.com/~balsa/linux/deadkeys/</A><P>Uma discuss&atilde;o sobre o problema da acentua&ccedil;&atilde;o no X. Tamb&eacute;m cont&eacute;m
refer&ecirc;ncias para outros documentos que tratam de internacionaliza&ccedil;&atilde;o.
<DT><B>[BRO98]&nbsp;Brower&nbsp;Andries. The Linux Keyboard and Console HOWTO</B><DD><P>Dispon&iacute;vel via WWW em 
<A HREF="http://metalab.unc.edu/LDP/HOWTO/Keyboard-and-Console-HOWTO.html">http://metalab.unc.edu/LDP/HOWTO/Keyboard-and-Console-HOWTO.html</A>.
<P>Descreve o tratamento teclado e console no Linux
(kernel vers&atilde;o 2.0) e tem v&aacute;rias refer&ecirc;ncias ao X. Leitura obrigat&oacute;ria
para quem quer entender a base do assunto.
<DT><B>[GET94]&nbsp;Gettys, James et al. Xlib - C Language X Interface</B><DD><P>Cambridge, X Consortium, Inc., 1994. 473p.
<P>Refer&ecirc;ncia definitiva sobre programa&ccedil;&atilde;o com <CODE>Xlib</CODE>.
<DT><B>[JON89]&nbsp;Jones,&nbsp;Oliver. Introduction to the X Window System</B><DD><P>Englewood Cliffs, Prentice Hall, 1990.
<P>Um livro bastante antigo, mas contendo uma excelente e did&aacute;tica introdu&ccedil;&atilde;o
ao X e &agrave; programa&ccedil;&atilde;o com <CODE>Xlib</CODE>.
<DT><B>[McC94]&nbsp;McCormack,&nbsp;Joel et al.X Toolkit Intrinsics - C Language Interface</B><DD><P>Digital Equipment Corporation/X Consortium, 1994.
<P>A refer&ecirc;ncia b&aacute;sica para programadores interessados em usar Xt.
<DT><B>[OSS92]&nbsp;Ossana,&nbsp;Joseph&nbsp;&amp;&nbsp;Kernighan,&nbsp;Brian. Troff user's manual</B><DD><P>Computer Science Technical Report No. 54. Murray Hill, AT&amp;T Bell
Laboratories, 1992.
<P>Descri&ccedil;&atilde;o detalhada de como usar o Troff para formata&ccedil;&atilde;o de documentos.
<DT><B>[KER82]&nbsp;Kernighan,&nbsp;Brian. A Typesetter-independent TROFF</B><DD><P>Murray Hill, AT&amp;T Bell Laboratories, 1982.
<P>O artigo de um dos pais do UNIX sobre o Troff.
<DT><B>[QUI98]&nbsp;Quinot,&nbsp;Thomas. Dead keys under X11</B><DD><P>Dispon&iacute;vel via WWW em 
<A HREF="http://www.fdn.fr/~tquinot/index.en.html">http://www.fdn.fr/~tquinot/index.en.html</A><P>A vers&atilde;o em ingl&ecirc;s do artigo sobre a modifica&ccedil;&atilde;o da
<EM>Xlib</EM> para dar suporte &agrave; acentua&ccedil;&atilde;o independente da aplica&ccedil;&atilde;o.
<DT><B>[RAY98]&nbsp;Raymond,&nbsp;Eric&nbsp;S. The Linux XFree86 HOWTO</B><DD><P>Dispon&iacute;vel via WWW em 
<A HREF="http://metalab.unc.edu/LDP/HOWTO/XFree86-HOWTO.html">http://metalab.unc.edu/LDP/HOWTO/XFree86-HOWTO.html</A>.
<P>Descreve como obter, instalar e configurar o XFree86. Todas as
distribui&ccedil;&otilde;es de Linux j&aacute; v&ecirc;m com pacotes do XFree86 prontos para instalar,
mas as informa&ccedil;&otilde;es sobre configura&ccedil;&atilde;o podem ser muito &uacute;teis.
<DT><B>[SCH86]&nbsp;Scheifler,&nbsp;Robert;&nbsp;Gettys,&nbsp;James. The X Window System</B><DD><P><EM>ACM Transactions on Graphics</EM>, New York, ACM, <EM>5</EM> (2): 79-109,
april, 1986.
<P>O artigo seminal de Scheifler e Gettys descrevendo o X Window System.
<DT><B>[SUN90a]&nbsp;Sun&nbsp;Microsystems. Using NROFF &amp; TROFF.</B><DD><P>Sun Microsystems, 1990.
<P>Parte da documenta&ccedil;&atilde;o que acompanhava as esta&ccedil;&otilde;es de trabalho Sun® e o
sistema SunOS®, no tempo em que os fabricantes de computadores distribuiam
documenta&ccedil;&atilde;o de verdade.
<DT><B>[SUN90b]&nbsp;Sun&nbsp;Microsystems. Formatting documents</B><DD><P>Sun Microsystems, 1990.
<P>Veja o &iacute;tem anterior.
</DL>
<P>Arquivos cuja leitura pode ser &uacute;til:
<P>
<DL>
<DT><B><CODE>/usr/src/linux/Documentation/unicode.txt</CODE></B><DD><P>Explica como ativar os diversos tipos de fontes no console. Tamb&eacute;m explica
onde obter fontes para o alfabeto Klingon, o que pode ser muito &uacute;til se o
leitor for um habitante daquele Imp&eacute;rio ou admirador de Jornada nas
Estrelas.  Depois das recentes aventuras espaciais do Linux, n&atilde;o duvido de
mais nada...
<P>A respeito deste assunto &eacute; de fundamental import&acirc;ncia saber que, segundo
nosso consultor interestrelar Klaus Steding-Jessen, ``Klingon &eacute; o nome da
ra&ccedil;a e do seu idioma.  Kling &eacute; o nome do planeta.  Mas note que o Imp&eacute;rio
Klingon &eacute; formado n&atilde;o apenas por esse planeta, mas por v&aacute;rias col&ocirc;nias,
teoricamente todas falando Klingon''. Tenho certeza de que sua vida nunca
mais ser&aacute; a mesma depois de saber disto.
<DT><B><CODE>/usr/src/linux/include/linux/keyboard.h</CODE></B><DD><P>Cont&eacute;m as defini&ccedil;&otilde;es de constantes, fun&ccedil;&otilde;es e macros utilizadas por
programas que fazem tratamento de teclado sob Linux.  Normalmente esse
arquivo &eacute; instalado com o pacote que cont&eacute;m o c&oacute;digo fonte do kernel. As
distribui&ccedil;&otilde;es geralmente possuem um pacote apenas com os arquivos
<EM>include</EM> e outros com o resto dos programas-fonte do kernel.
<DT><B><CODE>/usr/X11R6/include/X11/keysymdef.h</CODE></B><DD><P>Cont&eacute;m as defini&ccedil;&otilde;es de constantes, fun&ccedil;&otilde;es e macros utilizadas por
programas que fazem tratamento de teclado sob o X Window System.
Normalmente esse arquivo &eacute; instalado com o pacote que cont&eacute;m as
bibliotecas de desenvolvimento de aplica&ccedil;&otilde;es para X.
</DL>
<P>
<HR>
Next
<A HREF="Portuguese-HOWTO-9.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc10">Contents</A>
</BODY>
</HTML>
