<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux Portuguese-HOWTO: Introdu&ccedil;&atilde;o</TITLE>
 <LINK HREF="Portuguese-HOWTO-2.html" REL=next>

 <LINK HREF="Portuguese-HOWTO.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Portuguese-HOWTO-2.html">Next</A>
Previous
<A HREF="Portuguese-HOWTO.html#toc1">Contents</A>
<HR>
<H2><A NAME="s1">1. Introdu&ccedil;&atilde;o</A></H2>

<P>&Agrave; semelhan&ccedil;a de outras l&iacute;nguas faladas na Europa, a L&iacute;ngua Portuguesa tem
caracter&iacute;sticas especiais, como a utiliza&ccedil;&atilde;o de caracteres acentuados, que
tornam o seu suporte dif&iacute;cil, pouco intuitivo ou at&eacute; mesmo imposs&iacute;vel, por
parte do software utilizado nos nossos computadores. 
<P>Nossa l&iacute;ngua assume particularidades em cada um dos pa&iacute;ses em que &eacute; falada e
mesmo dentro de um &uacute;nico pa&iacute;s como o Brasil, de dimens&otilde;es continentais e com
influ&ecirc;ncias culturais de muitos outros povos. Este documento foi originalmente
escrito por um portugu&ecirc;s, mas agora &eacute; mantido por um brasileiro. H&aacute; uma
mistura de sotaques que deve se manter por um bom tempo, pois n&atilde;o h&aacute; raz&atilde;o
para alterar o texto original sen&atilde;o para fazer de adi&ccedil;&otilde;es e corre&ccedil;&otilde;es, at&eacute; por
respeito ao primeiro autor. Termos ``estrangeiros'' desnecess&aacute;rios foram
substitu&iacute;dos por correspondentes da L&iacute;ngua Portuguesa, preservando-se apenas
os que j&aacute; fazem parte do jarg&atilde;o da inform&aacute;tica.
<P>
<H2><A NAME="ss1.1">1.1 Finalidades deste HOWTO</A>
</H2>

<P>Este HOWTO &eacute; um guia de refer&ecirc;ncia de configura&ccedil;&atilde;o do sistema operativo Linux
e seus programas, teclados e fontes de caracteres, permitindo sua utiliza&ccedil;&atilde;o
mais confort&aacute;vel por pessoas que falem a L&iacute;ngua Portuguesa. Como os programas
mais antigos n&atilde;o foram desenhados com suporte a caracteres acentuados ou
internacionaliza&ccedil;&atilde;o, &agrave;s vezes &eacute; preciso usar algum artif&iacute;cio que permita
contornar o problema, mas o resultado nem sempre &eacute; totalmente satisfat&oacute;rio e
em alguns casos chega ser frustrante. As dificuldades encontradas centram-se
essencialmente em torno de quatro pontos: 
<P>
<UL>
<LI>a introdu&ccedil;&atilde;o de caracteres acentuados atrav&eacute;s do teclado, como seja a
escrita de jo~ao em vez da sua forma correcta: jo&atilde;o; </LI>
<LI>a exibi&ccedil;&atilde;o dos mesmos na tela do computador. O suporte resume-se
normalmente &agrave; correcta localiza&ccedil;&atilde;o das teclas, nada mais;</LI>
<LI>o correto tratamento de conven&ccedil;&otilde;es nacionais de formato de datas, horas e
valores monet&aacute;rios;</LI>
<LI>a exibi&ccedil;&atilde;o de mensagens, t&iacute;tulos e demais informa&ccedil;&otilde;es dos programas em
outra l&iacute;ngua que n&atilde;o o Ingl&ecirc;s, que &eacute; a l&iacute;ngua original da maioria desses
programas.</LI>
</UL>
<P>Vers&otilde;es anteriores do Portuguese HOWTO concentravam-se em contornar as duas
primeiras dificuldades mencionadas, de forma a fazer que, dentro do poss&iacute;vel,
tanto o sistema operativo como os programas nele utilizados aceitassem os
caracteres acentuados e usassem os teclados com suporte para o Portugu&ecirc;s.
Embora esse objetivo ainda seja perseguido, os problemas de teclado e
caracteres j&aacute; t&ecirc;m solu&ccedil;&otilde;es satisfat&oacute;rias, pelo menos para as aplica&ccedil;&otilde;es mais
usadas. As pr&oacute;ximas vers&otilde;es dever&atilde;o se dedicar mais aos dois &uacute;ltimos
problemas.
<P>O texto cont&eacute;m uma j&aacute; n&atilde;o t&atilde;o breve discuss&atilde;o sobre o tratamento
do teclado e das fontes de caracteres do console pelo Linux, bem como do
suporte a v&aacute;rias l&iacute;nguas nacionais. O Sistema de Janelas X tamb&eacute;m &eacute; discutido,
fazendo-se uma compara&ccedil;&atilde;o entre ele e o modo de texto. Por fim, s&atilde;o fornecidas
instru&ccedil;&otilde;es para a configura&ccedil;&atilde;o do sistema operativo e de diversos aplicativos
importantes.
<P>O documento tem se tornado menos <EM>slackwariano</EM>, incluindo cada vez mais
informa&ccedil;&otilde;es relativas a outras distribui&ccedil;&otilde;es. Slackware e Caldera
ainda se baseiam na vers&atilde;o 5 da biblioteca de fun&ccedil;&otilde;es do sistema para Linux
(<EM>libc</EM>), enquanto Debian, Red Hat, TurboLinux, S.u.S.E e Stampede j&aacute;
suportam a vers&atilde;o 6 (que na verdade &eacute; a glibc vers&atilde;o 2). Esta nova vers&atilde;o da
biblioteca est&aacute; um passo adiante no suporte a internacionaliza&ccedil;&atilde;o e
localiza&ccedil;&atilde;o.  A partir da vers&atilde;o 3.2 do Portuguese-HOWTO as particularidades
de cada distribui&ccedil;&atilde;o ser&atilde;o destacadas quando houver necessidade. A tentativa
de tornar Debian uma distribui&ccedil;&atilde;o ``de refer&ecirc;ncia'' a partir da vers&atilde;o 3.0 do
HOWTO fracassou miseravelmente porque o n&uacute;mero de diferen&ccedil;as entre as
distribui&ccedil;&otilde;es &eacute; muito grande.
<P>A inten&ccedil;&atilde;o original de n&atilde;o tentar concentrar toda a informa&ccedil;&atilde;o em um &uacute;nico
texto, tratando apenas de alguns temas essenciais e fornecendo refer&ecirc;ncias
para outras fontes, tamb&eacute;m fracassou. O HOWTO em sua vers&atilde;o 3.1 j&aacute; alcan&ccedil;ava
38 p&aacute;ginas impressas em formato A4, o que est&aacute; longe de poder ser chamado de
sucinto. As principais raz&otilde;es para tal gigantismo s&atilde;o a necessidade de
discutir diferen&ccedil;as entre as distribui&ccedil;&otilde;es e a necessidade de fornecer
informa&ccedil;&otilde;es mais detalhadas sobre aplicativos.
<P>Excetuando-se aspectos muito espec&iacute;ficos do Linux, como a configura&ccedil;&atilde;o do modo
texto e do <EM>kernel</EM>, a maioria das informa&ccedil;&otilde;es contidas neste documento
pode ser aplicada a outros sistemas Unix. Exemplos s&atilde;o as configura&ccedil;&otilde;es do
Sistema de Janelas X e de v&aacute;rios aplicativos, que foram aplicadas em Solaris
2.{5,6,7} e Digital UNIX 3.2. Os mapas de teclado para terminais X e
esta&ccedil;&otilde;es de trabalho Sun foram criados e s&atilde;o usados em m&aacute;quinas que rodam
Solaris. O documento poder&aacute; um dia se tornar o ``Unix Portuguese HOWTO'',
embora no momento n&atilde;o se tenha inten&ccedil;&atilde;o ou meios de faz&ecirc;-lo.
<P>
<H2><A NAME="SEC:ONDE"></A> <A NAME="ss1.2">1.2 Onde encontrar a vers&atilde;o mais atual</A>
</H2>

<P>Os Linux HOWTO fazem parte do Projeto de Documenta&ccedil;&atilde;o Linux (Linux
Documentation Project -- LDP). Os documentos do LDP s&atilde;o mantidos em servidores
da Universidade da Carolina do Norte (UNC) e do Instituto de Tecnologia de
Massachusetts (MIT), nos Estados Unidos da Am&eacute;rica, e podem ser obtidos via
FTP an&ocirc;nimo nos seguintes endere&ccedil;os:
<UL>
<LI>
<A HREF="ftp://metalab.unc.edu/pub/Linux/docs/HOWTO">ftp://metalab.unc.edu/pub/Linux/docs/HOWTO</A> (conhecida
anteriormente como <CODE>sunsite.unc.edu</CODE>).</LI>
<LI>
<A HREF="ftp://tsx-11.mit.edu/pub/linux/docs/HOWTO">ftp://tsx-11.mit.edu/pub/linux/docs/HOWTO</A></LI>
</UL>
<P>Pode-se tamb&eacute;m folhear os documentos HOWTO em formato HTML no endere&ccedil;o
<UL>
<LI>
<A HREF="http://metalab.unc.edu/LDP/HOWTO">http://metalab.unc.edu/LDP/HOWTO</A></LI>
</UL>
<P>Muitas localidades mant&ecirc;m c&oacute;pias desses documentos. Deve-se dar prefer&ecirc;ncia ao
acesso &agrave; c&oacute;pia mais pr&oacute;xima, para economizar o precioso tr&aacute;fego internacional
na Internet e tamb&eacute;m evitar a sobrecarga da m&aacute;quina metalab.unc.edu. Uma lista
completa dessas localidades pode ser obtida em 
<UL>
<LI>
<A HREF="http://metalab.unc.edu/LDP/mirrors.html">http://metalab.unc.edu/LDP/mirrors.html</A></LI>
</UL>
<P>Eis uma lista dos endere&ccedil;os recomendados:
<P>Brasil
<UL>
<LI>
<A HREF="http://linusp.usp.br/LDP/">http://linusp.usp.br/LDP/</A></LI>
<LI>
<A HREF="http://www.conectiva.com.br/LDP/">http://www.conectiva.com.br/LDP/</A></LI>
<LI>
<A HREF="http://www.opensite.com.br/linux/">http://www.opensite.com.br/linux/</A></LI>
<LI>
<A HREF="http://taubate.valley-bbs.com.br/LDP/">http://taubate.valley-bbs.com.br/LDP/</A></LI>
<LI>
<A HREF="http://linux.unicamp.br/docs/">http://linux.unicamp.br/docs/</A></LI>
</UL>
<P>Portugal
<UL>
<LI>
<A HREF="http://gil.di.uminho.pt/mirrors/LDP/">http://gil.di.uminho.pt/mirrors/LDP/</A></LI>
<LI>
<A HREF="http://deneb.cec.pt/LDP/">http://deneb.cec.pt/LDP/</A></LI>
<LI>
<A HREF="http://ftp.dei.uc.pt/LDP/">http://ftp.dei.uc.pt/LDP/</A></LI>
<LI>
<A HREF="http://www.sc.uevora.pt/LDP/">http://www.sc.uevora.pt/LDP/</A></LI>
<LI>
<A HREF="http://lwp.ualg.pt/docs/LDP/">http://lwp.ualg.pt/docs/LDP/</A></LI>
<LI>
<A HREF="http://linux.global-one.pt/LDP/">http://linux.global-one.pt/LDP/</A></LI>
<LI>
<A HREF="http://linux.ispgaya.pt/LDP/">http://linux.ispgaya.pt/LDP/</A></LI>
<LI>
<A HREF="http://ae.fe.up.pt/LDP/">http://ae.fe.up.pt/LDP/</A></LI>
</UL>
<P>Os Linux HOWTO est&atilde;o dispon&iacute;veis em diversos formatos: texto simples,
PostScript, DVI, HTML, RTF e Lyx. O formato original &eacute; SGML e os demais s&atilde;o
gerados usando o SGMLtools (maiores informa&ccedil;&otilde;es em 
<A HREF="http://www.sgmltools.org/">http://www.sgmltools.org/</A>).
<P>
<H2><A NAME="ss1.3">1.3 P&aacute;gina oficial na WWW</A>
</H2>

<P>A p&aacute;gina oficial do Linux Portuguese-HOWTO, assim como os diversos arquivos de
configura&ccedil;&atilde;o do sistema e programas aplicativos mencionados no texto, podem
ser encontrados nos seguintes endere&ccedil;os:
<P>
<UL>
<LI>Brasil: 
<A HREF="http://linusp.usp.br/~casantos/">http://linusp.usp.br/~casantos/</A></LI>
<LI>Portugal: 
<A HREF="http://linux.fe.up.pt/howto/">http://linux.fe.up.pt/howto/</A></LI>
</UL>
<P>
<H2><A NAME="ss1.4">1.4 Como enviar colabora&ccedil;&otilde;es</A>
</H2>

<P>Toda a formata&ccedil;&atilde;o deste HOWTO, incluindo a numera&ccedil;&atilde;o das se&ccedil;&otilde;es &eacute; feita pelo
SGMLtools. Por isso, ao enviar sugest&otilde;es ou corre&ccedil;&otilde;es, mencione <B>os
t&iacute;tulos das se&ccedil;&otilde;es</B> onde as altera&ccedil;&otilde;es sugeridas devem ocorrer e n&atilde;o os
n&uacute;meros. Nunca refira-se a um par&aacute;grafo como sendo ``o terceiro da se&ccedil;&atilde;o
3.1''; cite as palavras inicias do trecho a ser modificado.
<P>Envie sugest&otilde;es e corre&ccedil;&otilde;es via correio eletr&ocirc;nico em texto simples,
opcionalmente com acentua&ccedil;&atilde;o no c&oacute;digo ISO-8859-1.  Se o texto n&atilde;o for
composto em um sistema *NIX, certifique-se de usar a codifica&ccedil;&atilde;o correta.
Todas as mensagens recebidas ser&atilde;o lidas, mas nem todas receber&atilde;o resposta
direta, devido &agrave; falta de tempo para tanto.
<P>N&atilde;o envie documentos no formato propriet&aacute;rio de processadores de texto nem
em formato HTML (o que infelizmente parece ser o comportamento
normal do Netscape Communicator e do Microsoft Outlook).
<P>Mensagens perguntando como configurar seu modem, placa de v&iacute;deo ou rede
n&atilde;o ser&atilde;o respondidas. Para esse tipo de consulta &eacute; aconselh&aacute;vel
procurar uma lista de discuss&atilde;o sobre Linux em Portugu&ecirc;s ou acompanhar os
grupos de discuss&atilde;o de Linux na USENET <CODE>comp.os.linux.*</CODE>.
<P>``Flames'' ter&atilde;o o destino costumeiro: <CODE>/dev/null</CODE>.
<P>
<HR>
<A HREF="Portuguese-HOWTO-2.html">Next</A>
Previous
<A HREF="Portuguese-HOWTO.html#toc1">Contents</A>
</BODY>
</HTML>
