<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux Portuguese-HOWTO: Informa&ccedil;&otilde;es Adicionais</TITLE>
 <LINK HREF="Portuguese-HOWTO-9.html" REL=next>
 <LINK HREF="Portuguese-HOWTO-7.html" REL=previous>
 <LINK HREF="Portuguese-HOWTO.html#toc8" REL=contents>
</HEAD>
<BODY>
<A HREF="Portuguese-HOWTO-9.html">Next</A>
<A HREF="Portuguese-HOWTO-7.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc8">Contents</A>
<HR>
<H2><A NAME="s8">8. Informa&ccedil;&otilde;es Adicionais</A></H2>

<H2><A NAME="ss8.1">8.1 Fontes de informa&ccedil;&atilde;o sobre Linux em Portugu&ecirc;s</A>
</H2>

<P>
<DL>
<DT><B>Grupo de Investiga&ccedil;&atilde;o Linux</B><DD><P>Grupo de usu&aacute;rios de linux da Universidade do Minho, em Portugal que pode
ser visitado em 
<A HREF="http://gil.di.uminho.pt">http://gil.di.uminho.pt</A>.
<DT><B>Grupo de Utilizadores de Linux do ISCTE</B><DD><P>Pode ser visitado em 
<A HREF="http://www.students.iscte.pt/~a12593/gul.html">http://www.students.iscte.pt/~a12593/gul.html</A>.
<DT><B>Linux Brasil</B><DD><P>Servidor da Universidade Estadual de Campinas, Brasil, contendo
informa&ccedil;&otilde;es sobre Linux no Brasil, que absorveu o antigo projeto LDP-br.
Pode ser visitado em 
<A HREF="http://linux.unicamp.br">http://linux.unicamp.br</A>.
<DT><B>Projeto LinUSP</B><DD><P>Desenvolvido na Universidade de S&atilde;o Paulo, Brasil, coordenado por Jorge L.
deLyra. Pode ser visitado em 
<A HREF="http://linusp.usp.br/">http://linusp.usp.br/</A>.
</DL>
<P>
<H2><A NAME="ss8.2">8.2 Free Translation Project</A>
</H2>

<P>Programadores que quiserem desenvolver aplica&ccedil;&otilde;es com suporte a mais de uma
l&iacute;ngua devem usar algum m&eacute;todo de definir mensagens em tempo de execu&ccedil;&atilde;o,
possivelmente usando uma biblioteca de fun&ccedil;&otilde;es para este fim. O projeto GNU
criou o ``Free Translation Project'', com esta finalidade. Muitos
aplicativos GNU j&aacute; permitem que se troquem as mensagens bastando criar um
cat&aacute;logo que &eacute; lido pelo programa ao iniciar. H&aacute; equipes de tradu&ccedil;&atilde;o
respons&aacute;veis por cada l&iacute;ngua.
<P>H&aacute; uma lista de discuss&atilde;o via emeil para cada equipe de tradu&ccedil;&atilde;o, rodando em
um servidor provido pela &lt;
<A HREF="http://www.li.org">Linux International</A>&gt;. Para fazer contato com a equipe de tradu&ccedil;&atilde;o para
Portugu&ecirc;s, envie um emeil para &lt;
<A HREF="mailto:pt@li.org">pt@li.org</A>&gt; e para assinar a lista envie emeil para &lt;
<A HREF="mailto:pt-request@li.org">pt-request@li.org</A>&gt; contendo apenas a
palavra ``subscribe''. Assine a lista somente se voc&ecirc; quiser fazer parte da
equipe de tradutores, pois ela <B>n&atilde;o</B> se destina ao esclarecimento de
d&uacute;vidas de usu&aacute;rios!
<P>Mais informa&ccedil;&otilde;es podem ser encontradas na documenta&ccedil;&atilde;o do pacote <EM>gettext</EM>
dispon&iacute;vel via FTP an&ocirc;nimo em qualquer reposit&oacute;rio de software do GNU.
Provavelmente sua distribui&ccedil;&atilde;o j&aacute; tem um pacote pronto para ser instalado, mas
se voc&ecirc; desejar, os fontes da vers&atilde;o mais recentes podem ser encontrados em
<BLOCKQUOTE>
<A HREF="ftp://ftp.gnu.org/pub/gnu/">ftp://ftp.gnu.org/pub/gnu/</A></BLOCKQUOTE>

e o nome do arquivo a copiar &eacute; ``gettext-&lt;vers&atilde;o&gt;.tar.gz''.
<P>
<H2><A NAME="ss8.3">8.3 LIE-BR</A>
</H2>

<P>
<BLOCKQUOTE>
A informa&ccedil;&atilde;o a seguir &eacute; baseada no conte&uacute;do da p&aacute;gina de apresenta&ccedil;&atilde;o da
lie-br, escrita por Jorge Godoy.
</BLOCKQUOTE>

A lie-br foi criada com o intuito de auxiliar a comunidade Linux brasileira a
obter softwares e documenta&ccedil;&atilde;o em sua l&iacute;ngua nativa: o portugu&ecirc;s.  Essa lista
&eacute; uma ramifica&ccedil;&atilde;o de outra maior, a LIE que visa a internacionaliza&ccedil;&atilde;o do
Linux e sua posterior tradu&ccedil;&atilde;o para todos os idiomas (portugu&ecirc;s incluso). 
<P>Resumo dos objetivos da lie-br:
<UL>
<LI>contribuir para o projeto de internacionaliza&ccedil;&atilde;o do Linux fazendo a parte
relativa ao portugu&ecirc;s para o Brasil;</LI>
<LI>internacionalizar programas, de modo a poderem ser usados nas l&iacute;nguas
nativas de cada pa&iacute;s, e n&atilde;o ficar preso ao idioma original ou ao ingl&ecirc;s;</LI>
<LI>disponibilizar (sic) material em portugu&ecirc;s para consulta e documenta&ccedil;&atilde;o;</LI>
<LI>aumentar o acervo de documenta&ccedil;&atilde;o dispon&iacute;vel e, indiretamente, auxiliar
no desenvolvimento iniciado pelo projeto LDP-BR.</LI>
</UL>
<P>Mais informa&ccedil;&otilde;es podem ser encontradas na p&aacute;gina WWW da lie-br, no endere&ccedil;o
<BLOCKQUOTE>
<A HREF="http://lie-br.conectiva.com.br/">http://lie-br.conectiva.com.br/</A></BLOCKQUOTE>

Ainda h&aacute; uma quantidade enorme de documentos por traduzir. Se voc&ecirc; tem bom
dom&iacute;nio do Ingl&ecirc;s e deseja colaborar, ent&atilde;o <B>primeiro</B> leia as instru&ccedil;&otilde;es
na p&aacute;gina mencionada e assine a lista ``lie-br'', enviando um emeil para
&lt;
<A HREF="lie-br-subscribe@bazar.conectiva.com.br">lie-br-subscribe@bazar.conectiva.com.br</A>&gt;. N&atilde;o &eacute; preciso especificar
o assunto (subject) nem colocar nada no corpo da mensagem.
<P>
<H2><A NAME="SEC:VERSTEST"></A> <A NAME="ss8.4">8.4 Vers&otilde;es de software testadas</A>
</H2>

<P>Todas as informa&ccedil;&otilde;es presentes neste documento foram testadas nas
seguintes vers&otilde;es de software: 
<P>
<UL>
<LI>Distribui&ccedil;&otilde;es Slackware 3.2 (muito modificada), Debian 2.0, Red Hat 5.2,
Conectiva 3.0 (Guarani) e S.u.S.E. 5.6</LI>
<LI>XFree86 vers&otilde;es 3.3 a 3.3.3.1</LI>
<LI>Fvwm 2.0.46</LI>
<LI>Rxvt vers&atilde;o 2.4.5</LI>
<LI>Kernel vers&otilde;es 2.0.33 a 2.0.36</LI>
<LI>Kbd vers&otilde;es 0.92 a 0.96</LI>
<LI>GNU emacs vers&otilde;es 19.34 a 20.3</LI>
<LI>Less vers&otilde;es 321 e 332</LI>
<LI>GNU Bash vers&otilde;es 1.14.7 a 2.01.1</LI>
<LI>tcsh vers&otilde;es 6.07.02 e 6.07.06</LI>
<LI>LyX 0.12.0 a 1.0.0pre6</LI>
<LI>XForms 0.88</LI>
<LI>Joe 2.8</LI>
<LI>Pine 3.96 e 4.0</LI>
<LI>Pico 2.9</LI>
<LI>teTeX vers&otilde;es 0.4 e 0.9-9</LI>
<LI>XEmacs vers&otilde;es 20.3 e 20.4</LI>
</UL>
<P>
<P>
<P>
<HR>
<A HREF="Portuguese-HOWTO-9.html">Next</A>
<A HREF="Portuguese-HOWTO-7.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc8">Contents</A>
</BODY>
</HTML>
