<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux Portuguese-HOWTO: Configura&ccedil;&atilde;o dos v&aacute;rios programas </TITLE>
 <LINK HREF="Portuguese-HOWTO-7.html" REL=next>
 <LINK HREF="Portuguese-HOWTO-5.html" REL=previous>
 <LINK HREF="Portuguese-HOWTO.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="Portuguese-HOWTO-7.html">Next</A>
<A HREF="Portuguese-HOWTO-5.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc6">Contents</A>
<HR>
<H2><A NAME="s6">6. Configura&ccedil;&atilde;o dos v&aacute;rios programas </A></H2>

<P>
<H2><A NAME="ss6.1">6.1 Aplicativos</A>
</H2>

<P>A maioria das aplica&ccedil;&otilde;es que rodam no Unix usa algum tipo de arquivo de
configura&ccedil;&atilde;o que o usu&aacute;rio coloca em seu diret&oacute;rio de trabalho (home) e
cujo nome normalmente &eacute; <CODE>.alguma-coisarc</CODE>. Tanto quanto poss&iacute;vel,
tentei evitar que isso fosse necess&aacute;rio, pois al&eacute;m de dar mais trabalho ao
usu&aacute;rio (e ao administrador da rede ;-) pode dificultar um pouco as
coisas. Por exemplo, aqui no CPMet temos o diret&oacute;rio <EM>home</EM>
compartilhado entre um servidor Alpha rodando DEC UNIX com os PCs rodando
Linux via NFS (at&eacute; a maior parte do Linux est&aacute; instalada no Alpha, os
PCs s&oacute; t&ecirc;m a parti&ccedil;&atilde;o raiz e uma &aacute;rea de swap). Os arquivos podem
necessitar algum ajuste dependendo da plataforma e nem todos os programas
possuem flexibilidade bastante para isso.
<P>Uma op&ccedil;&atilde;o que muitos programas tamb&eacute;m oferecem &eacute; especificar em uma
vari&aacute;vel de ambiente o nome do arquivo de configura&ccedil;&atilde;o ou o uso de
arquivos padr&atilde;o que normalmente ficam em um diret&oacute;rio
<CODE>/usr/lib/alguma-coisa</CODE> ou <CODE>/etc/alguma-coisa</CODE>. 
<P>
<H3>Bash (biblioteca GNU readline)</H3>

<P>Os programas que utilizam a biblioteca GNU readline para ler a linha
de comando procuram por um arquivo chamado <CODE>.inputrc</CODE> no diret&oacute;rio ``HOME''
do usu&aacute;rio caso n&atilde;o exista uma vari&aacute;vel de ambiente <CODE>INPUTRC</CODE> contendo o
caminho para um arquivo de configura&ccedil;&atilde;o.
<P>Coloque uma linha no seu arquivo <CODE>/etc/profile</CODE> contendo
<PRE>
    INPUTRC="/etc/inputrc"
    export INPUTRC
</PRE>

e crie um arquivo /etc/inputrc contendo
<PRE>
    set meta-flag on
    set convert-meta off
    set output-meta on
</PRE>

Outra alternativa &eacute; criar um arquivo <CODE>.inputrc</CODE> no diret&oacute;rio <EM>home</EM>
do usu&aacute;rio com o conte&uacute;do acima, mas &eacute; muito dif&iacute;cil manter atualizados
os arquivos de todos os usu&aacute;rios, principalmente quando eles s&atilde;o muitos.
Um <CODE>inputrc</CODE> mais completo pode ser obtido via WWW na p&aacute;gina do
Portuguese HOWTO. Ele cont&eacute;m op&ccedil;&otilde;es para v&aacute;rios tipos de terminal e permite
usar as teclas de movimento de cursor para percorrer o hist&oacute;rico de
comandos (setas para cima e para baixo); ir para o primeiro e para o &uacute;ltimo
comandos do hist&oacute;rico (teclas PageUp e PageDown); posicionar o cursor na linha
(setas para a esquerda e direita) e posicionar o cursor no in&iacute;cio e no fim da
linha (teclas Home e End).
<P>Para maiores informa&ccedil;&otilde;es leia os manuais do <B>bash</B> e da biblioteca
<B>readline</B> com os comandos
<PRE>
    man bash
    man readline
</PRE>
<P>
<H3>Emacs</H3>

<P>O pai de todos os editores pode ser configurado criando-se um arquivo
chamado <CODE>.emacs</CODE> no diret&oacute;rio do usu&aacute;rio, contendo as seguintes linhas: 
<PRE>
    (set-input-mode nil nil 1)
    (standard-display-european t)
    (require 'iso-syntax)
</PRE>
<P>Para tornar esta configura&ccedil;&atilde;o global, na distribui&ccedil;&atilde;o Slackware coloque os
comandos no arquivo <CODE>/usr/lib/emacs/site-lisp/site-start.el</CODE>. Na
distribui&ccedil;&atilde;o Debian o emacs executa todos os scripts contidos no diret&oacute;rio
<CODE>/etc/emacs/site-start.d</CODE> ao ser carregado. Tudo que se tem a fazer
&eacute; colocar esses comandos em um arquivo chamado, por exemplo,
<CODE>01portugues-emacs.el</CODE>.
<P>Se o estimado leitor, assim como eu, n&atilde;o se agrada do tratamento dado pelo
Emacs &agrave;s teclas de <EM>Delete</EM>, <EM>Home</EM> e <EM>End</EM>, aproveite a oportunidade
e acrescente ao mesmo arquivo o seguinte:
<PRE>
    (global-unset-key [backspace] )
    (global-set-key [backspace] 'delete-backward-char)
    (global-unset-key [delete] )
    (global-set-key [delete] 'delete-char)
    (define-key global-map [home] 'beginning-of-line)
    (define-key global-map [C-home] 'beginning-of-buffer)
    (define-key global-map [end] 'end-of-line)
    (define-key global-map [C-end] 'end-of-buffer)
</PRE>
<P>Arquivos de configura&ccedil;&atilde;o prontos podem ser obtidos via WWW na p&aacute;gina do
Portuguese HOWTO. Para Slackware, h&aacute; um <CODE>site-start-emacs.el</CODE>, que deve
ser copiado para o diret&oacute;rio <CODE>/usr/lib/emacs/site-lisp</CODE> com o nome
de <CODE>site-start.el</CODE>. Para Debian, h&aacute; um <CODE>01portugues-emacs.el</CODE> que
deve ser copiado para o diret&oacute;rio <CODE>/etc/emacs/site-start.d</CODE>.
<P>Certifique-se de estar usando a vers&atilde;o 24-out-1998 ou mais recente do arquivo
de mapa de teclado para o X, pois ela possui uma corre&ccedil;&atilde;o no tratamento das
teclas modificadoras Alt e Meta, que s&atilde;o muito usadas pelo Emacs.
<P>
<H3>flex</H3>

<P>Especifique a op&ccedil;&atilde;o <B>-8</B> se o <EM>parser</EM> a gerar necessitar de ler
dados de 8 bit. 
<P>
<H3>Fortune</H3>

<P>Fortune &eacute; aquele programa que toda vez que &eacute; invocado apresenta uma
pequena mensagem, geralmente bem humorada. Ele &eacute; inspirado nos biscoitos
da fortuna chineses (em ingl&ecirc;s <EM>fortune cookies</EM>, da&iacute; o nome).
Eis algumas mensagens t&iacute;picas:
<PRE>
    dROGA!!oNDE ESTA O cAPSLOCK??

    Mouse n&atilde;o encontrado, bater no gato? (S/N)

    Que fio &eacute; ess&lt;=V++088.../NO CARRIER

    Quem ri por &uacute;ltimo est&aacute; conectado a 2400Bit/s.
</PRE>

Tudo que o programa faz &eacute; escolher aleatoriamente uma mensagem em um
reposit&oacute;rio mantido no diret&oacute;rio <CODE>/usr/games/fortunes</CODE> (Slackware)
ou <CODE>/usr/share/games/fortunes</CODE> (Debian). Neste diret&oacute;rio existem
diversos arquivos com as ``fortunas'' e um arquivo &iacute;ndice para cada um deles,
que possui a extens&atilde;o <CODE>.dat</CODE>. O formato dos arquivos &eacute; muito simples:
cada fortuna &eacute; composta de uma s&eacute;rie de linhas de texto. As fortunas s&atilde;o
separadas umas das outras por linhas contendo apenas um caracter <B>%</B>. Veja
o trecho a seguir:
<PRE>
    O que s&atilde;o quatro pontos na parede? Four migas. Ugh!
    %
    Errar &eacute; humano, botar a culpa no computador &eacute; mais humano ainda.
    %
    A&iacute; ela me disse: Ou eu ou o modem! Sinto muitas saudades dela...
</PRE>

Tudo que temos a fazer &eacute; criar um arquivo com as fortunas chamado, digamos
<CODE>fortunes</CODE> com o formato descrito acima. Depois basta usar o programa
<CODE>strfile</CODE> para gerar o &iacute;ndice:
<PRE>
    strfile fortunes
</PRE>

e um arquivo chamado <CODE>fortunes.dat</CODE> ser&aacute; criado. Claro que se quisermos
que o fortune mostre apenas mensagens em Portugu&ecirc;s, teremos que remover os
arquivos existentes no diret&oacute;rio original. Sugiro simplesmente renome&aacute;-lo para
<CODE>fortunes-en</CODE> (de <EM>En</EM>glish) e criar outro vazio.  Eu coletei algumas
fortunas e as coloquei no arquivo <CODE>fortunes-pt.tar.gz</CODE> que pode ser
obtido via WWW na p&aacute;gina do Portuguese HOWTO. N&atilde;o esque&ccedil;a de colocar no seu
/etc/profile algumas linhas contendo uma chamada ao fortune, por exemplo
<PRE>
    if [ -x /usr/games/fortune -a ! -e $HOME/.hushlogin ]; then
       echo
       /usr/games/fortune
       echo
    fi
</PRE>

Uma &uacute;ltima informa&ccedil;&atilde;o: se o nome de um arquivo termina com o sufixo
<CODE>-o</CODE> o fortune s&oacute; o consulta se for chamado com a op&ccedil;&atilde;o
<CODE>-o</CODE>. Esses arquivos s&atilde;o os que cont&eacute;m mensagens cujo conte&uacute;do pode
ser considerado ofensivo por algumas pessoas, tais como
<PRE>
    S&oacute; n&atilde;o mando a sogra pro inferno, com pena do Diabo.
</PRE>

Claro que existem coisas muito mais ofensivas por a&iacute;, mas este &eacute; um
Linux HOWTO e n&atilde;o queremos realmente ofender ningu&eacute;m, certo?
<P>
<H3>Ispell</H3>

<P>Dicion&aacute;rios para o Portugu&ecirc;s de Portugal podem ser obtidos via WWW
na p&aacute;gina do <EM>Projecto Natura</EM> em
<A HREF="http://www.di.uminho.pt/~jj/pln/pln.html">http://www.di.uminho.pt/~jj/pln/pln.html</A>. Para o Brasil, h&aacute;
uma vers&atilde;o compilada pelo Ueda:
<A HREF="http://www.ime.usp.br/~ueda/">http://www.ime.usp.br/~ueda/</A>.
<P>
<BLOCKQUOTE>
Eu gostaria de poder
colocar maiores informa&ccedil;&otilde;es, mas ainda n&atilde;o tenho conhecimento suficiente
sobre o Ispell e n&atilde;o posso ensinar o que n&atilde;o sei. Preciso de ajuda
aqui.
</BLOCKQUOTE>
<P>
<H3>JDK (inclui ICQJava)</H3>

<P>
<BLOCKQUOTE>
Esta informa&ccedil;&atilde;o &eacute; baseada em uma mensagem da qual guardei o conte&uacute;do mas n&atilde;o o
remetente. Pe&ccedil;o desculpas e espero que perdoe a falha. N&atilde;o testei pessoalmente
a informa&ccedil;&atilde;o e pe&ccedil;o que me escrevam confirmando tanto a corre&ccedil;&atilde;o quanto, se
poss&iacute;vel, a identidade do autor.
</BLOCKQUOTE>
<P>O JDK utiliza fontes padr&atilde;o que n&atilde;o suportam acentos. Isto quer dizer que
letras com acentos s&atilde;o ignoradas e, geralmente, confundem o resto do texto.
Resolver isto &eacute; extremamente f&aacute;cil:
<UL>
<LI>entre no diret&oacute;rio <CODE>jdk1.1.5/lib</CODE> (no meu caso,
<CODE>/jdk1.1.5/lib</CODE>);</LI>
<LI>copie o arquivo <CODE>font.properties.hu</CODE> sobrescrevendo o
<CODE>font.properties</CODE> atual (lembre-se de fazer backups!);</LI>
<LI>entre no jdk e divirta-se! Fazendo isto, seu ICQ e todos os
aplicativos que usem o jdk estar&atilde;o aptos a lerem acentos! (f&aacute;cil, n&atilde;o?)</LI>
</UL>
<P>
<H3>Joe</H3>

<P>Invoque o joe com a op&ccedil;&atilde;o <CODE>-asis</CODE> na linha de comando ou altere os
arquivos de configura&ccedil;&atilde;o para ativar tal op&ccedil;&atilde;o. Na Slackware eles est&atilde;o no
diret&oacute;rio <CODE>/usr/lib/joe</CODE>. Tudo que se tem a fazer &eacute; remover o
espa&ccedil;o em branco existente no in&iacute;cio de cada linha. Outra alternativa &eacute;
acrescentar a seguinte linha ao arquivo <CODE>/etc/profile</CODE>:
<PRE>
    alias joe='joe -asis'
</PRE>
<P>Joe pode emular os editores Pico, emacs e WordStar. Um arquivo <EM>joerc</EM> est&aacute;
dispon&iacute;vel via WWW na p&aacute;gina do Portuguese HOWTO, contendo configura&ccedil;&otilde;es que
permitem usar as teclas <EM>Home</EM> e <EM>End</EM> para movimentar o cursor para o
in&iacute;cio e fim da linha.
<P>
<H3>Less</H3>

<P>Coloque as seguintes linhas no seu arquivo <CODE>/etc/profile</CODE>: 
<PRE>
    LESS="-MM -i"
    LESSCHARSET="latin1"
    LESSKEY="/etc/lesskey"
    LESSOPEN='|lesspipe.sh "%s"'
    export LESS LESSCHARSET LESSKEY LESSOPEN
</PRE>

LESSKEY informa o nome de um arquivo contendo uma tabela de seq&uuml;&ecirc;ncias de
caracteres geradas por cada tecla e as a&ccedil;&otilde;es a serem tomadas pelo less.  Para
criar o arquivo <CODE>/etc/lesskey</CODE>, crie primeiro o arquivo
<CODE>/etc/lesskey.in</CODE> contendo as seguintes linhas: 
<PRE>
    # Termianl ANSI (console do Linux, XTerm, etc)
    \e[1~       goto-line
    \e[4~       goto-end
    \e[5~       back-screen
    \e[6~       forw-screen
    \e[7~       goto-line
    \e[8~       goto-end
    \e[A        back-line
    \e[B        forw-line
    # XTerm
    \eOH        goto-line
    \eOF        goto-end
    \e[H        goto-line
    \e[F        goto-end
    # Console Sun (testado com teclados Type 4/5)
    \e[214z     goto-line
    \e[220z     goto-end
    \e[216z     back-screen
    \e[222z     forw-screen
    # Arquivo seguinte/anterior
    :n  next-file
    :N  next-file
    :p  prev-file
</PRE>

Depois ``compile-o'' usando o comando
<PRE>
    # lesskey -o /etc/lesskey /etc/lesskey.in
</PRE>

Crie o arquivo <CODE>/usr/bin/lesspipe.sh</CODE> contendo
<PRE>
    #!/bin/sh
    # This is a preprocessor for 'less'.  It is used when this environment
    # variable is set:   LESSOPEN="|lesspipe.sh %s"

    case "$1" in
      *.rpm) rpm -qilp "$1" 2>/dev/null ;;
      *.tar) tar tvvf "$1" 2>/dev/null ;;
      *.tgz | *.tar.gz | *.taz | *.tar.Z | *.tar.z)
        tar tzvvf "$1" 2>/dev/null ;;
      *.tbz2 | *.tar.bz2)
        bzip2 -dc "$1" | tar tvvf - 2>/dev/null ;;
      *.Z) gzip -dc "$1"  2>/dev/null ;;
      *.z) gzip -dc "$1"  2>/dev/null ;;
      *.[1-9].gz | *.n.gz | *.man.gz)
        FILE=`file -Lz "$1" | cut -d ' ' -f 2`
        if [ "$FILE" = "troff" ]; then
          gzip -dc "$1" | groff -s -p -t -e -Tlatin1 -mandoc
        fi ;;
      *.gz) gzip -dc "$1"  2>/dev/null ;;
      *.zip) unzip -l "$1" 2>/dev/null ;;
      *.[1-9] | *.n | *.man)
        FILE=`file -L "$1" | cut -d ' ' -f 2`
        if [ "$FILE" = "troff" ]; then
          groff -s -p -t -e -Tlatin1 -mandoc "$1"
        fi ;;
    esac
</PRE>

N&atilde;o esque&ccedil;a de torn&aacute;-lo execut&aacute;vel:
<PRE>
    chmod 755 /usr/bin/lesspipe.sh
</PRE>
<P>Na distribui&ccedil;&atilde;o Debian j&aacute; existe um script <CODE>/usr/bin/lesspipe</CODE>
(note a aus&ecirc;ncia da extens&atilde;o <CODE>.sh</CODE>). Para os curiosos a
respeito da refer&ecirc;ncia a ``*.rpm'', embora na m&aacute;quina em quest&atilde;o se use
Slackware, &eacute; poss&iacute;vel ter o utilit&aacute;rio RPM instalado tamb&eacute;m, o que facilita
tomar ``emprestados'' pacotes do Red Hat, Caldera e S.u.S.E.. Existe um
<EM>RPM+Slackware Mini-HOWTO</EM> que explica como fazer isso.
<P>
<H3>ls</H3>

<P>Acrescente a seguinte linha ao arquivo <CODE>/etc/profile</CODE> :
<PRE>
    alias ls="ls -N"
</PRE>

ou
<PRE>
    alias ls="ls -b"
</PRE>

Se a sua distribui&ccedil;&atilde;o de Linux usa o GNU ls (todas as que eu conhe&ccedil;o usam)
basta acrescentar ao arquivo <CODE>/etc/profile</CODE> ou <CODE>.profile</CODE> as
seguintes linhas:
<PRE>
    # -----------------------------------------
    # Set up the color-ls environment variables
    # -----------------------------------------
    if [   "$SHELL" = "/bin/bash" -o \
           "$SHELL" = "/bin/sh" ]; then
       eval `dircolors -b`
    elif [ "$SHELL" = "/bin/zsh" ]; then
       eval `dircolors -z`
    elif [ "$SHELL" = "/bin/ash" ]; then
       eval `dircolors -s`
    elif [ "$SHELL" = "/bin/ksh" -o \
           "$SHELL" = "/bin/pdksh" ]; then
       eval `dircolors -k`
    elif [ "$SHELL" = "/bin/csh" -o \
           "$SHELL" = "/bin/tcsh" ]; then
       eval `dircolors -c`
    else
       eval `dircolors -b`
    fi
</PRE>

Se o seu shell &eacute; o csh ou tcsh, acrescente a seguinte linha ao arquivo
<CODE>/etc/csh.login</CODE> ou <CODE>~/.login</CODE>:
<PRE>
    alias ls 'ls --color'
</PRE>
<P>
<H3><A NAME="SEC:LYX"></A> LyX</H3>

<P>Para aqueles que acham trabalhoso escrever documentos para o LaTeX usando um
simples editor de texto (e realmente &eacute;) LyX &eacute; uma excelente op&ccedil;&atilde;o.  Este
programa cria uma interface gr&aacute;fica atrav&eacute;s da qual editamos os documentos que
ser&atilde;o depois formatados pelo LaTeX. O ambiente &eacute; quase-WYSIWYG (What You See
Is What You Get - O que tu v&ecirc;s &eacute; o que tu obt&eacute;ns). LyX n&atilde;o roda apenas em
Linux, mas em qualquer Unix. Maiores informa&ccedil;&otilde;es podem ser obtidas em
<P>
<BLOCKQUOTE>
<A HREF="http://www.lyx.org">http://www.lyx.org</A></BLOCKQUOTE>
<P>A partir da vers&atilde;o 1.0.1 do LyX j&aacute; tem a interface com o usu&aacute;rio em Portugu&ecirc;s,
traduzida por Pedro Kr&ouml;ger, que tamb&eacute;m est&aacute; traduzindo os manuais, junto
com Roberto Mello. Estas tradu&ccedil;&otilde;es j&aacute; fazem parte da
distribui&ccedil;&atilde;o oficial do LyX.
<P>Tendo o LyX instalado, &eacute; muito f&aacute;cil criar documentos com acentua&ccedil;&atilde;o em
Portugu&ecirc;s. Seguindo as seguintes regras:
<P>
<UL>
<LI>Se o teclado foi configurado para ter <EM>dead keys</EM> usando um dos
mapas aqui fornecidos, n&atilde;o &eacute; necess&aacute;rio fazer mais nada. Basta digitar o
texto normalmente usando as seq&uuml;&ecirc;ncias de acentua&ccedil;&atilde;o. A &uacute;nica exce&ccedil;&atilde;o &eacute;
o c-cedilha que n&atilde;o pode ser gerado usando a seq&uuml;&ecirc;ncia <CODE>'c</CODE>, pois o
LyX gera um c com acento. Temos que usar a seq&uuml;&ecirc;ncia Compose-v&iacute;rgula-c.</LI>
<LI>Se o teclado <B>n&atilde;o</B> foi configurado para ter <EM>dead keys</EM> ainda
assim &eacute; poss&iacute;vel acentuar no LyX. Selecione o <EM>menu</EM>
<CODE>Options/Keyboard</CODE>. Na caixa de di&aacute;logo ``Key Mappings'',
selecione no &iacute;tem <CODE>Language/Primary</CODE> a op&ccedil;&atilde;o ``American''.
Com isto o LyX far&aacute; a composi&ccedil;&atilde;o dos caracteres acentuados usando regras
semelhantes &agrave;s das <EM>dead keys</EM>.
<UL>
<LI>A v&iacute;rgula ser&aacute; tratada como cedilha. Para obter um `&Ccedil;'digite
<CODE>,C</CODE> e para obter uma v&iacute;rgula digite <CODE>,,</CODE>. Cuidado! A
seq&uuml;&ecirc;ncia <CODE>,</CODE>&lt;espa&ccedil;o&gt; gerar&aacute; uma cedilha isolada e
n&atilde;o uma v&iacute;rgula!</LI>
<LI><CODE>~ ^ ' e `</CODE> ser&atilde;o tratados como acentos. Vale a mesma
regra anterior: para obter apenas o acento, pressione a tecla duas
vezes consecutivas. </LI>
<LI><CODE>: ; . / ?</CODE> e <CODE>-</CODE> tamb&eacute;m ser&atilde;o tratados como
acentos. <CODE>?a</CODE> gerar&aacute; um `&aring;' e assim por diante.</LI>
</UL>
</LI>
</UL>
<P>Para o LyX imprimir corretamente, &eacute; necess&aacute;rio que, ao criar um novo
documento, sejam selecionados a l&iacute;ngua e a codifica&ccedil;&atilde;o de caracteres
adequadas. Crie um documento selecionando o <EM>menu</EM> <CODE>File/New</CODE>.
Depois selecione o <EM>menu</EM> <CODE>Layout/Document</CODE>. Na caixa de di&aacute;logo
``Document Layout'' selecione no &iacute;tem <CODE>Language</CODE> a op&ccedil;&atilde;o ``brazil'' ou
``portuges'' (sem o <EM>u</EM> mesmo); no &iacute;tem <CODE>Encoding</CODE> selecione
``latin1''.
<P>Veja a observa&ccedil;&atilde;o sobre o pacote <EM>algorithm</EM> na se&ccedil;&atilde;o&nbsp;
<A HREF="#SEC:LATEX">TeX e LaTeX</A><P>Uma observa&ccedil;&atilde;o final sobre o LyX: a vers&atilde;o atual (1.0.x) utiliza a biblioteca
XForms para construir a interface com o usu&aacute;rio. Como essa biblioteca n&atilde;o tem
suporte para acentua&ccedil;&atilde;o, n&atilde;o &eacute; poss&iacute;vel digitar letras acentuadas nas caixas
de di&aacute;logo, somente no corpo do documento editado. Segundo os desenvolvedores,
nas novas vers&otilde;es do LyX ser&aacute; poss&iacute;vel escolher o tipo de interface ao
compilar o programa, o que permitir&aacute; o uso de <EM>toolkits</EM> mais flex&iacute;veis. J&aacute;
existe uma vers&atilde;o de LyX portada para o toolkit Qt, usado no KDE, chamada
KLyX. Os autores s&atilde;o Matthias Ettrich -- autor original do LyX -- e Kalle
Dalheimer. Para maiores informa&ccedil;&otilde;es, consulte via WWW: 
<A HREF="http://www-pu.informatik.uni-tuebingen.de/users/ettrich/">http://www-pu.informatik.uni-tuebingen.de/users/ettrich/</A>.
<P>
<H3><A NAME="SEC:MAN"></A> Man, groff, troff</H3>

<P>Pode-se usar a op&ccedil;&atilde;o de linha de comando <CODE>-Tlatin1</CODE> para o groff,
mas &eacute; mais simples colocar uma linha no seu arquivo <CODE>/etc/profile</CODE>
contendo
<PRE>
    GROFF_TYPESETTER="latin1" 
    export GROFF_TYPESETTER
</PRE>

Para maiores informa&ccedil;&otilde;es leia o manual do groff com o comando
<PRE>
    man groff
</PRE>
<P>No Linux, o comando <EM>man</EM> usa o <EM>groff</EM> para formatar os manuais e deve
ser configurado para usar o conjunto Latin 1, ou n&atilde;o ser&aacute; poss&iacute;vel formatar
satisfatoriamente manuais que contenham caracteres n&atilde;o pertencentes ao
conjunto ASCII, como &eacute; o caso do ``man iso_8859_1''. Na distribui&ccedil;&atilde;o
Slackware, &eacute; preciso editar o arquivo <CODE>/usr/lib/man.config</CODE> e
alterar as defini&ccedil;&otilde;es NROFF e NEQN, trocando a op&ccedil;&atilde;o ``-Tascii'' para
``-Tlatin1'':
<PRE>
    NROFF           /usr/bin/groff -Tlatin1 -mandoc
    NEQN            /usr/bin/geqn -Tlatin1
</PRE>

ou, se usarmos a vari&aacute;vel de ambiente GROFF_TYPESETTER, podemos simplesmente
eliminar a op&ccedil;&atilde;o -Tascii. Na distribui&ccedil;&atilde;o Debian n&atilde;o &eacute; necess&aacute;rio fazer
nenhuma configura&ccedil;&atilde;o para o man, bastando configurar GROFF_TYPESETTER e na
Red Hat (incluindo Conectiva) o arquivo &eacute; <CODE>/etc/man.config</CODE>
<P>Groff tamb&eacute;m pode ser configurado para fazer a separa&ccedil;&atilde;o sil&aacute;bica em
portugu&ecirc;s, o que &eacute; muito &uacute;til se tivermos p&aacute;ginas de manual em Portugu&ecirc;s. Isto
&eacute; bastante simples, porque quando James Clarck p&ocirc;s suporte a hifeniza&ccedil;&atilde;o no
groff ele usou o mesmo algoritmo de hifeniza&ccedil;&atilde;o do TeX. Para ter hifeniza&ccedil;&atilde;o
em portugu&ecirc;s, basta copiar o arquivo de regras do TeX e fazer o <CODE>groff</CODE>
us&aacute;-lo. O arquivo <CODE>hyphen.pt</CODE> pode ser obtido junto com os demais na p&aacute;gina
do HOWTO. Trata-se do arquivo <CODE>pt8hyph.tex</CODE> (ver se&ccedil;&atilde;o 
<A HREF="#SEC:LATEX">TeX e LaTeX</A>) ao qual foi adicionado apenas um coment&aacute;rio.
<P>Ele deve ser copiado para o diret&oacute;rio
<CODE>/usr/share/groff/tmac/</CODE> ou <CODE>/usr/lib/groff/tmac/</CODE>,
dependendo da distribui&ccedil;&atilde;o. &Eacute; conveniente criar um ``link'' simb&oacute;lico para
<CODE>hyphen.br</CODE>. Para usar esse arquivo, basta colocar no in&iacute;cio do seu
documento troff/groff as linhas a seguir:
<PRE>
    .if \n(.g \{\
    .hla pt
    .hpf hyphen.pt
    .\}
</PRE>

O <CODE>.if</CODE> n&atilde;o &eacute; necess&aacute;rio para a acentua&ccedil;&atilde;o, mas ele testa se o
processador usado &eacute; o groff. Deste modo pode-se usar o mesmo documento em
outros UNIX nos quais se use o troff normal sem que ele gere mensagens de erro
sobre comandos desconhecidos.
<P>
<H3>Midnight Comander (mc)</H3>

<P>No menu <CODE>Options</CODE> sub-menu <CODE>Display bits...</CODE> ligue a op&ccedil;&atilde;o
``Full 8 bits'' ou ``ISO 8859-1''. Na vers&atilde;o 3.2.11 isso permite
que sejam mostrados nomes de arquivos contendo caracteres acentuados, mas
n&atilde;o foi poss&iacute;vel digitar tais caracteres na linha de comando ou nas caixas
de di&aacute;logo.
<P>
<H3>Minicom</H3>

<P>Coloque uma linha no seu arquivo <CODE>/etc/profile</CODE> contendo
<PRE>
    MINICOM="-m -c on" 
    export MINICOM
</PRE>

Isso permitir&aacute; usar a tecla Alt para ativar os comandos (exatamente como o
Telix) e tamb&eacute;m usar cores. Para maiores informa&ccedil;&otilde;es, leia o manual do
Minicom usando o comando
<PRE>
    man minicom
</PRE>

Mais uma dica sobre o Minicom: para faz&ecirc;-lo usar usar corretamante a tecla
<EM>Meta</EM> para ativa&ccedil;&atilde;o dos comandos rodando dentro de um <EM>xterm</EM>, deve-se
invoc&aacute;-lo com a op&ccedil;&atilde;o ``-m'' e passar a op&ccedil;&atilde;o ``-xrm "*eightBitInput: false"''
para o xterm. Se usarmos o <EM>rxvt</EM> ent&atilde;o o minicom deve ser chamado com a
op&ccedil;&atilde;o ``-m'' e a tecla de ativa&ccedil;&atilde;o dos comandos ser&aacute; <EM>Alt</EM>. Fiz uma
adapta&ccedil;&atilde;o no script <CODE>xminicom</CODE> que pode ser obtido via WWW na p&aacute;gina do
Portuguese HOWTO.
<P>Segundo Arnaldo Carvalho de Melo, as vers&otilde;es mais recentes do Minicom suportam
internacionaliza&ccedil;&atilde;o. Suporte para o Portugu&ecirc;s foi acrescentado pelo pessoal da
Conectiva. O c&oacute;digo fonte pode ser obtido na p&aacute;gina do Jukka (atual mantenedor
do Minicom) em
<BLOCKQUOTE>
<A HREF="http://www.clinet.fi/~walker/minicom.html">http://www.clinet.fi/~walker/minicom.html</A></BLOCKQUOTE>
<P>
<H3>Netscape Communicator</H3>

<P>O Communicator, assim como muitas aplica&ccedil;&otilde;es que utilizam <EM>toolkits</EM>
baseados no X Toolkit (Xt), permite que se modifiquem muitas de suas
caracter&iacute;sticas por meio de arquivos de configura&ccedil;&atilde;o (X Resources). No caso
espec&iacute;fico do Communicator, pode-se criar um arquivo chamado <CODE>Netscape</CODE>
no diret&oacute;rio <CODE>/usr/X11R6/lib/X11/app-defaults</CODE> contendo estas
op&ccedil;&otilde;es.
<P>Na distribui&ccedil;&atilde;o brasileira Conectiva, o pacote do Communicator vem com um
arquivo <CODE>/usr/lib/netscape/i18n/Netscape.ad.pt_BR</CODE> e um script
<CODE>/usr/bin/netscape</CODE> que executa o Communicator fazendo-o ler este
arquivo. Uma c&oacute;pia do <CODE>Netscape.ad.pt_BR</CODE> pode ser obtida na p&aacute;gina
oficial do Portuguese-HOWTO. Para us&aacute;-lo, simplesmente copie-o para
<CODE>/usr/X11R6/lib/X11/app-defaults/Netscape</CODE>, se sua distribui&ccedil;&atilde;o n&atilde;o
o possuir, mas fique atento que seu uso pode criar problemas com novas vers&otilde;es
do programa.
<P>Maiores informa&ccedil;&otilde;es sobre ``X Resources'' podem ser obtidas em [GET94],
[McC94] e no manual do programa <CODE>xrdb</CODE>, com o comando
<P>
<PRE>
    man xrdb
</PRE>
<P>
<H3>nn</H3>

<P>
<BLOCKQUOTE>
Al&ocirc;, al&ocirc;, algu&eacute;m usa nn? Informa&ccedil;&atilde;o mais atualizada ser&aacute; bem recebida.
</BLOCKQUOTE>

Acrescente a seguinte linha ao arquivo <CODE>~/.nn/init</CODE>:
<PRE>
    set data-bits 8
</PRE>
<P>
<H3>Pine e Pico</H3>

<P>Para o Pine utilizar o conjunto de caracteres Latin 1, coloque uma linha
no arquivo .pinerc, no diret&oacute;rio do usu&aacute;rio, contendo
<PRE>
    character-set=ISO-8859-1
</PRE>

ou crie um arquivo geral de configura&ccedil;&atilde;o contendo tal linha. Esse arquivo
normalmente &eacute; <CODE>/usr/local/lib/pine.conf</CODE> ou
<CODE>/usr/lib/pine.conf</CODE>
<P>A configura&ccedil;&atilde;o tamb&eacute;m pode ser feita usando o pr&oacute;prio programa. No <EM>menu</EM>
de entrada selecione as op&ccedil;&otilde;es Setup/Configuration. V&aacute; at&eacute; o &iacute;tem
``character-set'' e preencha-o com ``ISO-8859-1''. Para maiores informa&ccedil;&otilde;es
leia o manual do pine com o comando
<PRE>
    man pine
</PRE>
<P>
<H3>tcsh</H3>

<P>Nenhuma medida especial &eacute; necess&aacute;ria se for feita a correta configura&ccedil;&atilde;o das
vari&aacute;veis de ambiente ``LANG'' e ``LC_ALL'', conforme mostrado mostrado na
se&ccedil;&atilde;o&nbsp;
<A HREF="Portuguese-HOWTO-4.html#SEC:LIBC">Biblioteca libc</A>.
<P>Tcsh tem suporte a internacionaliza&ccedil;&atilde;o e na distribui&ccedil;&atilde;o Debian h&aacute; um pacote
chamado tcsh-i18n com suporte para French, German, Greek and Spanish.
<P>
<H3><A NAME="SEC:LATEX"></A> TeX e LaTeX</H3>

<P>
<BLOCKQUOTE>
Esta se&ccedil;&atilde;o foi escrita com ajuda de Klaus Steding-Jessen.
</BLOCKQUOTE>
<P>
<H3>O pacote Babel</H3>

<P>O pacote <EM>Babel</EM>, criado por Johannes Braams prov&ecirc; suporte a um grande
n&uacute;mero de idiomas para o LaTeX. De acordo com o idioma selecionado ele define
muitas coisa como, por exemplo, os t&iacute;tulos dos cap&iacute;tulos (Chapter, Cap&iacute;tulo,
Kapitel) e o t&iacute;tulo das tabelas (Tabela, Table, Tabelle). Para usar o pacote,
basta incluir no pre&acirc;mbulo de seu documento LaTeX o comando
<P>
<PRE>
    \usepackage[portuges]{babel}

    ou

    \usepackage[brazil]{babel}
</PRE>
<P>H&aacute; diferen&ccedil;as sutis entre o Portugues do Brasil e o de Portugal, tais como
as normas para escrita de datas e nomes de meses com a primeira letra
mai&uacute;scula ou min&uacute;scula.
<P>Pode-se misturar mais de um idioma no mesmo documento. Para Alem&atilde;o e
Portugu&ecirc;s ficaria:
<P>
<PRE>
    \usepackage[german,brazil]{babel}
</PRE>
<P>Nesse caso a &uacute;ltima op&ccedil;&atilde;o (brazil) fica sendo o idioma corrente. Para
mudar ao longo do texto, entre um e outro, use:
<P>
<PRE>
    \selectlanguage{german}

    [...]

    \selectlanguage{brazil}
</PRE>
<P>Isto &eacute; muito &uacute;til tamb&eacute;m quando queremos que uma palavra n&atilde;o seja separada.
Basta definir um novo idioma e us&aacute;-lo nas palavras que n&atilde;o podem ser
separadas. Coloque no pre&acirc;mbulo:
<P>
<PRE>
    \newlanguage\nohyphen
    \newcommand\nh[1]{{\language\nohyphen #1}}
</PRE>
<P>E use com \nh{FOO BAR}. &Eacute; melhor do que usar <CODE>\mbox</CODE>, que
impede quebra no espaco em <CODE>\mbox{FOO BAR}</CODE>.
<P>
<H3>Separa&ccedil;&atilde;o sil&aacute;bica</H3>

<P>Normalmente apenas os suportes a separa&ccedil;&atilde;o sil&aacute;bica para Ingl&ecirc;s e Alem&atilde;o s&atilde;o
carregados.  Para configurar hifeniza&ccedil;&atilde;o no <B>teTeX</B>, execute o utilit&aacute;rio
<EM>texconfig</EM>, que na distribui&ccedil;&atilde;o Slackware deve ser o programa
<CODE>/usr/lib/teTeX/bin/texconfig</CODE> e na Debian &eacute;
<CODE>/usr/bin/texconfig</CODE>.  Digite o comando
<P>
<PRE>
    texconfig hyphen
</PRE>
<P>O editor usado normalmente &eacute; o <B>vi</B>. Se o seu editor predileto for
outro, crie uma vari&aacute;vel de ambiente chamada <B>EDITOR</B> contendo o nome desse
programa, como no exemplo a seguir:
<P>
<PRE>
    EDITOR=pico
    export EDITOR
</PRE>
<P>O editor de texto ser&aacute; carregado, para editar o arquivo
<CODE>language.dat</CODE>. Procure uma linha que come&ccedil;a por <B>%portuges</B> e
remova o <B>%</B>. Grave o arquivo e saia do editor. O texconfig atualizar&aacute;
diversos arquivos de configura&ccedil;&atilde;o (n&atilde;o se assuste com a quantidade de
mensagens que aparecem na tela).
<P>Se o nome da tabela de hifeniza&ccedil;&atilde;o que consta no seu <CODE>language.dat</CODE>
&eacute; <CODE>pthyph.tex</CODE> ent&atilde;o provavelmente trata-se da vers&atilde;o 1.0, de
1987. A vers&atilde;o 1.2, de 1996, pode ser obtida via FTP an&ocirc;nimo em
<BLOCKQUOTE>
<A HREF="ftp://ftp.tex.ac.uk/tex-archive/language/portuguese/pt8hyph.tex">ftp://ftp.tex.ac.uk/tex-archive/language/portuguese/pt8hyph.tex</A></BLOCKQUOTE>

Copie-o para o mesmo diret&oacute;rio onde se encontra o <CODE>pthyph.tex</CODE>, que
dependendo de sua distribui&ccedil;&atilde;o pode ser
<CODE>/usr/lib/texmf/tex/generic/hyphen</CODE>
<CODE>/usr/share/texmf/tex/generic/hyphen</CODE> ou
<CODE>/usr/lib/teTeX/texmf/tex/generic/hyphen</CODE>. Execute o comando
<CODE>texconfig~hash</CODE> e na mesma linha mencionada anteriormente insira um `8'
no nome do arquivo, de modo que fique <CODE>pt8hyph.tex</CODE>.
<P>
<H3>Uso de Font Encoding T1</H3>

<P>Se o conjunto de caracteres (<EM>encoding</EM>) de uma fonte n&atilde;o prov&ecirc; acesso
direto a caracteres acentuados, (como &eacute; o caso do OT1, padr&atilde;o do LaTeX) ent&atilde;o
o TeX gera estes caracteres sobrepondo o caracter base mais o acento. O
algoritmo de hifeniza&ccedil;&atilde;o, contudo, n&atilde;o hifeniza palavras formadas dessa forma.
<P>Se uma fonte j&aacute; prov&ecirc; acesso direto a caracteres acentuados, como as de
codifica&ccedil;&atilde;o T1, estes caracteres s&atilde;o usados diretamente sem preju&iacute;zo do
algoritmo de hifeniza&ccedil;&atilde;o.  O uso de <EM>encoding</EM> T1 &eacute; fundamental para a
correta hifeniza&ccedil;&atilde;o em Portugu&ecirc;s.
<P>Note que trata-se da mesma fonte, por falta a Computer Modern, apenas o que
muda &eacute; o seu <EM>encoding</EM>, isto &eacute;, a ordem/disponibilidade dos caracteres
dentro da mesma. Para selecionar estas fontes, inclua no pre&acirc;mbulo do seu
documento o comando
<P>
<PRE>
    \usepackage[T1]{fontenc}
</PRE>
<P>O antigo pacote <CODE>t1enc</CODE> n&atilde;o deve mais ser usado e existe hoje apenas por
quest&otilde;es de compatibilidade com documentos antigos. O <CODE>fontenc</CODE> &eacute; mais
atual, continua a ser mantido e &eacute; de uso mais geral, portanto prefer&iacute;vel.
<P>
<H3>Edi&ccedil;&atilde;o de documentos</H3>

<P>Normalmente a introdu&ccedil;&atilde;o de caracteres acentuados no texto exige o uso
de <EM>seq&uuml;&ecirc;ncias de escape</EM> bastante trabalhosas. Para gerar um ``&ouml;''
deve-se digitar \"o. Com <EM>babel</EM> pode-se digitar apenas "o, o que n&atilde;o
deixa de ser inconveniente para ler o fonte do documento. H&aacute; um pacote chamado
<B>inputenc</B> que permite especificar a codifica&ccedil;&atilde;o em que est&atilde;o os
caracteres de um documento. Lembre-se por&eacute;m que se o seu documento for
enviado para outro usu&aacute;rio que n&atilde;o possua o <B>inputenc</B> ele poder&aacute; n&atilde;o
conseguir process&aacute;-lo, mas esse recurso j&aacute; est&aacute; dispon&iacute;vel desde a
libera&ccedil;&atilde;o do LaTeX2e em dezembro 1994. Todas as distribui&ccedil;&otilde;es de Linux
atuais o incluem.
<P>Sugest&atilde;o: uma configura&ccedil;&atilde;o do GNU Emacs para gerar caracteres
acentuados, pr&oacute;pria para o uso com o pacote inputenc:
<P>
<PRE>
    (add-hook 'LaTeX-mode-hook
              (lambda ()
                (standard-display-european 1)
                (load-library "iso-acc")
                (iso-accents-mode 1)
                (iso-accents-customize "portuguese")
                (auto-fill-mode 1)
                ))
</PRE>
<P>E outra que n&atilde;o requer o inputenc.  O uso da biblioteca `iso-cvt' faz a
transforma&ccedil;&atilde;o de ISO-8859-1 (no buffer do Emacs) para o padr&atilde;o do LaTeX (no
arquivo).
<P>
<PRE>
    (add-hook 'LaTeX-mode-hook
              (lambda ()
                (standard-display-european 1)
                (load-library "iso-cvt")
                (load-library "iso-acc")
                (iso-accents-mode 1)
                (iso-accents-customize "portuguese")
                (auto-fill-mode 1)
                ))
</PRE>
<P>Muitas vezes o usuario j&aacute; possui muitos arquivos num formato de acento do
LaTeX e gostaria de passar tudo para o formato ISO, pr&oacute;prio para uso do pacote
inputenc. Uma boa op&ccedil;&atilde;o para isto &eacute; usar o programa <CODE>recode</CODE>. Se voc&ecirc;
possui arquivos .tex e deseja converte-lo para formato ISO-8859-1 pode usar:
<P>
<PRE>
    recode -d LaTeX:l1 file.tex
</PRE>
<P>O c&oacute;digo-fonte do GNU recode pode ser obtido via FTP an&ocirc;nimo em 
<A HREF="ftp://prep.ai.mit.edu/pub/gnu/recode/recode-3.4.tar.gz">ftp://prep.ai.mit.edu/pub/gnu/recode/recode-3.4.tar.gz</A> e em muitos
espelhos do GNU mundo afora. A distribui&ccedil;&atilde;o Debian tem um pacote pronto e
outras tamb&eacute;m devem ter.
<P>
<H3>Teste da configura&ccedil;&atilde;o do LaTeX</H3>

<P>Para testar a nova configura&ccedil;&atilde;o copie o seguinte trecho para um arquivo
chamado, digamos, <CODE>exemplo.tex</CODE>:
<P>
<PRE>
    \documentclass[a4paper]{article}
    \usepackage[latin1]{inputenc}
    \usepackage[T1]{fontenc}
    \usepackage[portuges]{babel}
    %%
    %% ou \usepackage[brazil]{babel}
    %%

    \begin{document}
    \title{Linux Portuguese-HOWTO}
    \author{Carlos Augusto Moreira dos Santos}
    \date{\today}

    \maketitle

    \section{Introdu&ccedil;&atilde;o}

    Este documento pretende ser um guia de refer&ecirc;ncia de configura&ccedil;&atilde;o
    do \textbf{Linux} e seus programas, teclados e fontes de
    caracteres, permitindo sua internacionaliza&ccedil;&atilde;o/utiliza&ccedil;&atilde;o confort&aacute;vel
    por pessoas que falem a L&iacute;ngua Portuguesa.

    \end{document}
</PRE>
<P>Esse texto cont&eacute;m de prop&oacute;sito uma ``palavra'' bastante longa para for&ccedil;ar a
separa&ccedil;&atilde;o sil&aacute;bica. Ele est&aacute; dispon&iacute;vel via WWW no arquivo <CODE>exemplo.tex</CODE>
na p&aacute;gina do Portuguese HOWTO. Para process&aacute;-lo, use o comando <CODE>latex</CODE>,
conforme mostrado a seguir:
<PRE>
    bash$ latex exemplo.tex
    This is TeX, Version 3.14159 (C version 6.1)
    (exemplo.tex
    LaTeX2e &lt;1996/06/01>
    Hyphenation patterns for english, german, portuges, loaded.
    (/usr/lib/teTeX/texmf/tex/latex/base/article.cls
    Document Class: article 1996/05/26 v1.3r Standard LaTeX document class
    (/usr/lib/teTeX/texmf/tex/latex/base/size10.clo))
    (/usr/lib/teTeX/texmf/tex/latex/base/inputenc.sty beta test version
    (/usr/lib/teTeX/texmf/tex/latex/base/latin1.def))
    (/usr/lib/teTeX/texmf/tex/latex/base/fontenc.sty
    (/usr/lib/teTeX/texmf/tex/latex/base/T1enc.def))
    (/usr/lib/teTeX/texmf/tex/generic/babel/babel.sty (portuges.ldf
    (/usr/lib/teTeX/texmf/tex/generic/babel/babel.def))) (exemplo.aux) [1]
    (exemplo.aux) )
    (see the transcript file for additional information)
    Output written on exemplo.dvi (1 page, 812 bytes).
    Transcript written on exemplo.log.
</PRE>

A mensagem ``Hyphenation patterns for english, german, <B>portuges</B>,
loaded.'' indica que a configura&ccedil;&atilde;o foi bem sucedida. Se o seu computador
est&aacute; rodando o X o documento formatado poder&aacute; ser visto com
o comando
<PRE>
    xdvi exemplo.dvi
</PRE>
<P>Observe que o ``<CODE>\today</CODE>'' gera a data corrente. No ``portugues'' seria
``17 de Julho de 1998'' mas no ``brazil'' seria ``17 de julho de 1998''.
<P>
<H3>Problemas com alguns pacotes do teTeX</H3>

<P>H&aacute; um problema com o pacote <EM>algorithm</EM> do LaTeX, que n&atilde;o &eacute; suportado pelo
babel, fazendo com que a lista de algoritmos saia com o t&iacute;tulo ``List of
Algorithms'' e o t&iacute;tulo de cada um deles seja impresso como ``Algorithm #''.
Para evitar esse problema, coloque no pre&acirc;mbulo de seu documento LaTeX, ap&oacute;s o
comando ``<CODE>\usepackage{algorithm}</CODE>'' o seguinte:
<P>
<PRE>
    \makeatletter
    \renewcommand{\ALG@name}}{Algoritmo}}
    \makeatother
    \renewcommand{\listalgorithmname}}{Lista de Algoritmos}}
</PRE>
<P>No teTeX 0.4 (vers&atilde;o 1.2h do portuges.ldf) o t&iacute;tulo do ambiente <EM>proof</EM>,
encontrado nas classes <EM>amsbook</EM>, <EM>amsart</EM>, etc., sai como ``Proof.''.
Para corrigir isso, coloque no pre&acirc;mbulo de seu documento o comando
<P>
<PRE>
    \renewcommand{\proofname}}{Demonstra\c{c}\~ao}
</PRE>
<P>mas o mais recomend&aacute;vel &eacute; que se atualize a vers&atilde;o do teTeX.
<P>Usu&aacute;rios do LyX podem incluir esses comandos no pre&acirc;mbulo do documento usando
o menu <CODE>Layout/LaTeX Preamble</CODE>. Pode-se resolver o problema
alterando o arquivo <CODE>portuges.ldf</CODE> que cont&eacute;m as defini&ccedil;&otilde;es necess&aacute;rias
ao Portugu&ecirc;s, mas esta solu&ccedil;&atilde;o n&atilde;o &eacute; port&aacute;vel, pois exigir&aacute; que tal arquivo
seja alterado em todas os computadores em que o documento deva ser processado.
<P>A licen&ccedil;a do Babel n&atilde;o me permite distribuir o <CODE>portuges.ldf</CODE> separado do
resto do pacote, mas para os interessados, coloquei &agrave; disposi&ccedil;&atilde;o na p&aacute;gina do
HOWTO um arquivo chamado <CODE>portuges.ldf.patch</CODE> que criei para o meu teTeX
antigo (Slackware 3.4).  Para aplicar a atualiza&ccedil;&atilde;o, copie-o para o diret&oacute;rio
<CODE>/usr/lib/teTeX/texmf/tex/generic/babel</CODE> (Slackware), fa&ccedil;a uma
c&oacute;pia de reserva do <CODE>portuges.ldf</CODE> original e invoque o utilit&aacute;rio
<CODE>patch</CODE>:
<P>
<PRE>
    cp -p portuges.ldf portuges.ldf.backup
    patch &lt; portuges.ldf.patch
</PRE>
<P>Use o patch por sua conta e risco! Se voc&ecirc; deixar o backup no diret&oacute;rio
original ele ser&aacute; inclu&iacute;do no arquivo <CODE>ls-R</CODE> da pr&oacute;xima vez que o
programa <EM>texhash</EM> for executado.  Isso n&atilde;o far&aacute; mal algum, mas pode-se
mover o backup para algum lugar seguro (eu uso <CODE>/usr/backup</CODE>).
<P>
<H3>Lista TeX-BR</H3>

<P>H&aacute; uma lista de discuss&atilde;o brasileira de usu&aacute;rios de TeX/LaTeX, chamada TeX-BR,
que roda no servidor de listas da FURG. Para entrar da lista mande um mail
contendo apenas a palavra ``subscribe'' no corpo para &lt;
<A HREF="mailto:tex-br-request@listas.furg.br">tex-br-request@listas.furg.br</A>&gt;. Esta lista &eacute; administrada por Rafael
Rodrigues Obelheiro.
<P>H&aacute; uma p&aacute;gina na WWW em 
<A HREF="http://biquinho.furg.br/tex-br/">http://biquinho.furg.br/tex-br/</A> por meio
da qual se pode ler o hist&oacute;rico de mensagens. Tamb&eacute;m h&aacute; refer&ecirc;ncias para
muitos documentos sobre LaTeX, alguns em Portugu&ecirc;s e outros em Ingl&ecirc;s.
<P>
<H3>LaTeX-demo</H3>

<P>Pode ser &uacute;til tamb&eacute;m um documento de exemplo para ter onde come&ccedil;ar.  Pensando
nisso, Klaus Steding-Jessen preparou
um pequeno documento em Portugu&ecirc;s com o objetivo de ser um guia ``by example''
para o usu&aacute;rio de LaTeX iniciante e intermedi&aacute;rio, que pode ser obtido via WWW
em 
<A HREF="http://biquinho.furg.br/doc/LaTeX-demo/">http://biquinho.furg.br/doc/LaTeX-demo/</A>.
<P>Klaus ecreveu tamb&eacute;m uma s&eacute;rie tr&ecirc;s artigos destinados a ``descrever o sistema
LaTeX como uma alternativa mais eficiente aos processadores de texto WYSIWYG''
que podem ser lidos via WWW em 
<A HREF="http://biquinho.furg.br/tex-br/doc/artigo-1-jessen/">http://biquinho.furg.br/tex-br/doc/artigo-1-jessen/</A>.
<P>
<P>
<H3>WordPerfect</H3>

<P>O Corel Wordperfect para Linux vers&atilde;o 8 suporta a acentua&ccedil;&atilde;o por teclas
mortas. N&atilde;o &eacute; necess&aacute;rio nenhum procedimento especial. Como um entusiasta de
software livre, entretanto, recomendo enfaticamente que se use o 
<A HREF="http://www.lyx.org/">LyX</A>, que j&aacute; foi inclusive traduzido para
nossa l&iacute;ngua, conforme mencionado na se&ccedil;&atilde;o&nbsp;
<A HREF="#SEC:LYX">LyX</A>.
<P>
<H3>Xemacs (antigo lucid emacs)</H3>

<P>
<BLOCKQUOTE>
Agrade&ccedil;o a colabora&ccedil;&atilde;o de Judson Santos Santiago e Goedson Teixeira
Paix&atilde;o que ajudaram a identificar os problemas com o Xemacs.
</BLOCKQUOTE>
<P>O 
<A HREF="http://www.xemacs.org/">Xemacs</A> j&aacute; tem suporte &agrave;
acentua&ccedil;&atilde;o direta no teclado usando ``dead keys'', mas h&aacute; um erro na
configura&ccedil;&atilde;o original que o impede de reconhecer o acento circunflexo.  Este
problema n&atilde;o ocorre se for usada a biblioteca <EM>Xlib</EM> aterada por Thomas
Quinot, mencionada na se&ccedil;&atilde;o&nbsp;
<A HREF="Portuguese-HOWTO-5.html#SEC:CONTOR-X">Contornando os limites do X</A>, mas mesmo que n&atilde;o a usemos, basta colocar os seguintes
comandos no seu arquivo de configura&ccedil;&atilde;o <CODE>.emacs</CODE>:
<PRE>
    ;; Ajuste para fazer o acento circunflexo funcionar
    ;; Contribui&ccedil;&atilde;o de Goedson Teixeira Paixao &lt;gopaixao@dcc.ufmg.br>
    (require 'x-compose)
    (define-key global-map 'dead-circumflex compose-circumflex-map)
</PRE>
<P>Na distribui&ccedil;&atilde;o Debian 2.0 o Xemacs 20.4 executa todos os scripts contidos no
diret&oacute;rio <CODE>/etc/xemacs20/site-start.d</CODE> ao ser carregado. Tudo que
se tem a fazer &eacute; colocar esses comandos em um arquivo chamado, por exemplo,
<CODE>01portugues-xemacs.el</CODE>. N&atilde;o &eacute; necess&aacute;rio instalar o <EM>xemacs20-mule</EM>,
que possui extens&otilde;es para l&iacute;nguas que n&atilde;o usam o alfabeto romano. Os pacotes a
instalar s&atilde;o os seguintes:
<P>
<UL>
<LI>xemacs20-bin</LI>
<LI>xemacs20-nomule</LI>
<LI>xemacs20-support</LI>
<LI>xemacs20-supportel</LI>
</UL>
<P>Se voc&ecirc; instalou o Xemacs no Slackware ou outro Unix, &agrave; moda antiga (dowload,
compila&ccedil;&atilde;o, insta&ccedil;&atilde;o), ent&atilde;o o arquivo a alterar &eacute; o <CODE>site-start.el</CODE>, que
deve estar no diret&oacute;rio <CODE>/usr/lib/xemacs/site-lisp</CODE> ou
<CODE>/usr/local/lib/xemacs/site-lisp</CODE>, dependendo de sua instala&ccedil;&atilde;o.
<P>Observe que a partir da vers&atilde;o 20.3 o Xemacs usa uma vari&aacute;vel especial para
controlar o comportamento da tecla ``Delete'', n&atilde;o existente nos outros emacs
chamada <B>delete-key-deletes-forward</B>. Para ativar este comportamento
coloque no seu arquivo <CODE>.emacs</CODE> uma linha contendo
<P>
<PRE>
    (setq delete-key-deletes-forward t)
</PRE>
<P>Arquivos de configura&ccedil;&atilde;o prontos podem ser obtidos via WWW na p&aacute;gina do
Portuguese HOWTO. Para Slackware, h&aacute; um <CODE>site-start-xemacs.el</CODE>, que deve
ser copiado para o diret&oacute;rio correto com o nome de <CODE>site-start.el</CODE>. Para
Debian, h&aacute; um <CODE>01portugues-xemacs.el</CODE> que deve ser copiado para o
diret&oacute;rio <CODE>/etc/xemacs20/site-start.d</CODE>.
<P>Certifique-se de estar usando a vers&atilde;o 24-out-1998 ou mais recente do arquivo
de 
<A HREF="Portuguese-HOWTO-7.html#SEC:FICHEIROS">mapa de teclado</A> para o X, pois ela possui
uma corre&ccedil;&atilde;o no tratamento das teclas modificadoras Alt e Meta, que s&atilde;o muito
usadas pelo Xemacs.
<P>
<P>
<H2><A NAME="ss6.2">6.2 Rede local e Internet</A>
</H2>

<P>
<H3>FTP (File Transfer Protocol)</H3>

<P>Existem dois modos de transfer&ecirc;ncia de arquivos: <EM>binary</EM> e <EM>ASCII</EM>,
sendo este  utilizado para textos.  Deve-se tomar cuidado ao transferir um
arquivo, pois o modo de transf&ecirc;rencia
<CODE>ASCII</CODE> remove o oitavo bit de cada caracter transmitido, o que ter&aacute; como
conseq&uuml;&ecirc;ncia a perda de todos os caracteres acentuados. Desta forma &eacute;
aconselhado o envio de documenta&ccedil;&atilde;o em modo <CODE>binary</CODE> de forma a manter a
integridade da mesma.
<P>Cuidado! Algumas vers&otilde;es mais antigas do pacote net-tools do Linux t&ecirc;m
um cliente FTP que n&atilde;o reconhece corretamente quando o servidor remoto
roda Unix. Deste modo ele n&atilde;o comutar&aacute; o modo de transfer&ecirc;ncia para
bin&aacute;rio automaticamente. Al&eacute;m disso,
alguns servidores FTP tamb&eacute;m n&atilde;o fornecem a informa&ccedil;&atilde;o corretamente.
Certifique-se de digitar o comando <CODE>bin</CODE> antes de um <CODE>get</CODE> quando
quiser que a transfer&ecirc;ncia seja bin&aacute;ria!
<P>
<H3>Correio eletr&ocirc;nico</H3>

<P>O mesmo tipo de restri&ccedil;&otilde;es do FTP se aplica ao envio de documentos contendo
caracteres acentuados atrav&eacute;s de correio eletr&ocirc;nico. Embora isto n&atilde;o aconte&ccedil;a
em todos os sistemas em uso na internet, bastar&aacute; que o correio enviado passe
no seu trajecto por um sistema que n&atilde;o suporte 8 bits de informa&ccedil;&atilde;o para que o
nosso documento seja deturpado. 
<P>Para que n&atilde;o hajam problemas, deve-se utilizar um programa de emeil, que
suporte o formato MIME (Multipurpose Internet Mail Extensions), formato
este que permite o envio de documenta&ccedil;&atilde;o em modo 8 bits.  Exemplos de
programas de correio eletr&ocirc;nico com suporte para MIME, s&atilde;o o Eudora e o
Pine. 
<P>Se o destinat&aacute;rio da mensagem n&atilde;o usa um agente com suporte para MIME,
existe a op&ccedil;&atilde;o de codificar os documentos com o utilit&aacute;rio UUENCODE. Para
maiores informa&ccedil;&otilde;es a esse respeito, leia a documenta&ccedil;&atilde;o usando os
comandos
<P>
<PRE>
    man uuencode
    man uudecode
</PRE>
<P>
<HR>
<A HREF="Portuguese-HOWTO-7.html">Next</A>
<A HREF="Portuguese-HOWTO-5.html">Previous</A>
<A HREF="Portuguese-HOWTO.html#toc6">Contents</A>
</BODY>
</HTML>
