<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.52">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf372, Applications: Bayonne: das quelloffene Projekt in Telefon- und IVR-Diensten</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 table.left { margin-right:0.3cm }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 div.tbbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   margin: 2px 5px 2px 5px;
   text-align: center;
   width: 20em;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
 div.bbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   float: left;
   margin: 2px 5px 2px 5px;
   text-align: center;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Luca Bariani
 =LF=CAT___: Applications
 =LF=TITLE_: Bayonne: das quelloffene Projekt in Telefon- und IVR-Diensten
 =LF=NUMBER: 372
 =LF=ANAME_: article372.shtml
 =LF=PARSER: 2.52
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, current, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><a href="../../index.shtml"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></a></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 
                 <A class="nodec" href="../../index.shtml"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Plan</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Index</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/index.html"><FONT color=
                 "#DDDDDD" size="2">Suchen</FONT></A> </TD>
                 
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/index.shtml"><FONT color=
           "#FFFFFF">Nachrichten</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/index.html"><FONT color=
           "#FFFFFF">Archiv</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/index.shtml"><FONT color=
           "#FFFFFF">Links</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">&Uuml;ber uns</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfdynahead ver 1.5 --><TABLE ALIGN="right" border=0><TR><TD ALIGN="right"><FONT SIZE="-1" FACE="Arial,Helvetica">Dieses Dokument ist verf&uuml;bar auf: <A href="../../English/April2005/article372.shtml">English</a> &nbsp;<A href="../../ChineseGB/April2005/article372.shtml">ChineseGB</a> &nbsp;<A href="../../Deutsch/April2005/article372.shtml">Deutsch</a> &nbsp;<A href="../../Francais/April2005/article372.shtml">Francais</a> &nbsp;<A href="../../Italiano/April2005/article372.shtml">Italiano</a> &nbsp;</FONT></TD></TR></TABLE><br>
 


<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_START -->
<TABLE ALIGN="LEFT" BORDER="0" WIDTH="195" summary="about the author" class="left">
<TR>
<TD>

<IMG SRC="../../common/images2/LucaBariani.jpg" ALT="[Photo of the Author]" width="190" height="322">
<BR>von  Luca Bariani <br> <small>&lt;lucabariani /at/ ferrara.linux.it&gt;</small>
<BR><BR>
<I>&Uuml;ber den Autor:</I><BR>
<!-- aboutauthor_start -->
<p>Ich wurde 1977 in Ferrara (Italien) geboren und graduierte 2002 in Ferrara mit einem Abschluss in Elektronik und Ingenieurwesen. Ich bin ein Mitglied der Ferrara Linux User Group und der GNU Bayonne-Gruppe. Ich entwickle IVR- und SMS-Dienste. Innerhalb des GNU Bayonne-Projektes erstelle ich einige Dokumentationen und Artikel, ich spreche &uuml;ber Bayonne bei einigen OpenSource-Treffen und verwalte die italienische Webseite <a href="http://bayonne.it/">bayonne.it</a>.



<!-- aboutauthor_stop -->
<!-- TRANSLATED_TO de -->
<BR><BR><I>&Uuml;bersetzt ins Deutsche von:</I><BR>
Hermann J. Beckers <small>&lt;hj.beckers /at/ onlinehome.de&gt;</small>
<br>
<!--
 =LF=TRANSTO=de: Hermann J. Beckers
-->
<!-- TRANSLATED_TO_STOP -->
<!-- INDEX_START -->
<BR><i>Inhalt</i>:
<UL>
  <LI><A HREF="#372lfindex0">IVR-Systeme und Dienste</A></LI>
  <LI><A HREF="#372lfindex1">Bayonne</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=372">Talkback f&uuml;r diesen Artikel</A></LI>
</UL>

</TD></TR></TABLE>
<!-- INDEX_STOP -->
<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_STOP -->
<!-- HEAD_OF_THE_ARTICLE_START -->
<br>&nbsp;
<table border="0"><tr><td>
<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfPdf ver 0.1 -->
<TABLE style="border-style:outset; border-width:1px" align="right" bgcolor="#ff9616" cellspacing="1"><TR><TD bgcolor="#ff9616">
        <a href="../Archives/lf-2005_04-0372.pdf"><small>PDF</small></a>
        </TD></TR></TABLE>
         

<H2>Bayonne: das quelloffene Projekt in Telefon- und IVR-Diensten</H2>
 <IMG SRC="../../common/images2/article372.jpg" ALT="[Illustration]" HSPACE=10 width="376" height="215">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Zusammenfassung</i>:
<P>
<!-- articleabstract_start -->


Bayonne ist der IVR- und Telefon-Server des GNU-Projektes, und daher eine freie und quelloffene Software.
<br><br>
IVR (Interactive Voice Response) steht f&uuml;r interaktive Sprachdienste. Ein IVR-System verbindet die Computerwelt mit Telefonnetzwerken (mit entsprechender Hardware) und kann mit diesen  &uuml;ber entsprechende Befehle agieren, die es von ihnen empfangen hat (durch Tastendr&uuml;cke erzeugte Tonsignale oder auch manchmal durch echte Sprachbefehle). IVR-System erm&ouml;glichen die Erstellung und Verwaltung vollst&auml;ndig automatisierter Telefondienste ohne menschliche Bedienungskr&auml;fte.


<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- HEAD_OF_THE_ARTICLE_STOP -->
<!-- BODY_OF_THE_ARTICLE_START -->


<A NAME="372lfindex0">&nbsp;</A>
<H2>IVR-Systeme und Dienste</H2>




  <p>Heutzutage hat fast jeder schon mindestens einmal eine Verbindung mit einem IVR-System gehabt (vielleicht ohne es zu merken). Tats&auml;chlich werden sie von jeder Telefongesellschaft (mobil oder nicht) f&uuml;r ihre eigenen Call- oder Dienstzentren benutzt. Denken Sie nur daran, wie oft Sie von automatischen und aufgezeichneten Stimmen aufgefordert wurden, aus einem Menu einen Dienst zu w&auml;hlen oder bevor Sie mit einem menschlichen Operator verbunden wurden. IVR-Server k&ouml;nnen auf verschiedenste Weise mit lokalen und entfernten Ressourcen agieren, und auch auf Dateisysteme, Datenbanken, Netzwerke usw. zugreifen ... daher k&ouml;nnen IVR-Systeme leicht in bestehende Systeme integriert oder Teil eines verteilten Systems werden.
 </p>
  <p>
  Mit IVR-Systemen k&ouml;nnen eine Vielzahl von Telefondiensten erstellt und genutzt werden, einige Beispiele:
  </p><ul>
    <li>
Antwortdienst: ein einfacher Telefondienst, der normalerweise mit einfacheren und billigeren Systemen als IVR-Systemen implementiert wird; durch die Benutzung eines IVR-Systems wird jedoch eine Menge an M&ouml;glichkeiten und Anpassungen m&ouml;glich:
 <ul>
      <li> wir k&ouml;nnen verschiedene Sprachboxen f&uuml;r verschiedene Benutzer verwalten;
      </li><li> wir k&ouml;nnen die Authentifizierung des Anwenders verwalten;
      </li><li> wir k&ouml;nnen f&uuml;r jede empfangene Nachricht eine Benachrichtigung hinzuf&uuml;gen (mittels Email oder etwas anderem);
      </li><li> wir k&ouml;nnen die Sprachnachrichten an einen entfernten Server weiterleiten (durch Internet und/oder Email).
    </li></ul>
    </li><li>
On-line-Aktualisierungen sehr dynamischer Informationen: IVR-Systeme k&ouml;nnen mit Informationen umgehen, die sich t&auml;glich oder st&uuml;ndlich &auml;ndern. Dies erm&ouml;glicht die Erstellung von Informationsdiensten, z. B. B&ouml;rsenpreislisten, aktuelle Nachrichten, Wetterinformationen und -vorhersagen, t&auml;gliche Sonderangebote f&uuml;r Superm&auml;rkte und L&auml;den ...</li><li> On-line- Katalogdurchsicht: IVR-Systeme k&ouml;nnen leicht mit Datenbanken und anderen Datenquellen (lokal oder entfernt) verbunden werden, daher k&ouml;nnen wir einfach Katalogdienste erstellen (z. B. f&uuml;r B&uuml;cher, Filme, CDs, Magazine usw.). &Uuml;ber die Auswahl der Kategorie, Kosten und sonstige Informationen k&ouml;nnen Anwender Listen und Informationen &uuml;ber alle gew&auml;hlten Eintrage erhalten. </li><li> Buchungs- und Einkaufsdienste: Mittels Datenbanken und anderen dynamischen Datenquellen k&ouml;nnen IVR-Dienste Buchung und Einkauf von Diensten und G&uuml;tern bieten, z. B. Buchung eines Kinotickets oder eines Films in einem Mietladen, den Erwerb eines Gutes, eines Buches oder einer DVD. Ein Katalog kann enthalten sein (s. vorherigen Punkt) wie auch die Bezahlung mittels Kreditkarte oder anderen Geldarten (siehe n&auml;chsten Punkt).
</li><li> Bezahldienste: in jedem Land gibt es verschiedene Arten von Telefonnummern mit unterschiedlichen Kosten f&uuml;r den Anwender:
    <ul>
      <li>
"normale Telefonnummern": Kosten sind von der Telefongesellschaft, den Anrufbereichen und der Anrufzeit abh&auml;ngig (dies sind die Nummern, die normalerweise jeder Zuhause oder im B&uuml;ro hat); </li><li> "freie Telefonnummern": ohne Anrufkosten f&uuml;r den Benutzer (diese Nummern werden oft von den Call-Zentren der Telefongesellschaften benutzt);
      </li><li>
"Bezahl-Telefonnummern": die Anrufkosten werden vom Telefonanbieter gew&auml;hlt und sind normalerweise h&ouml;her als f&uuml;r "normale Telefonnummern"; die Kosten k&ouml;nnen von der Anrufzeit abh&auml;ngen oder einen festen Betrag ausmachen.</li></ul> &Uuml;ber "Bezahl-Telefonnummern" k&ouml;nnen IVR-Systeme Telefondienste anbieten, die eine Bezahlung durch den Benutzer enthalten, dadurch k&ouml;nnen Waren und Informationen ohne Kreditkarten und elektronische Geldtransaktionen verkauft werden. </li><li> Ereignis-Benachrichtigung: IVR-Systeme sind bidirektional: sie k&ouml;nnen sowohl Anrufe empfangen als auch selbst automatisierte und programmierte Anrufe ausf&uuml;hren; IVR-Systeme k&ouml;nnen &uuml;ber Ereignisse durch Telefonleitungen benachrichtigen (z. B. Verabredungen, Treffen, Ablaufzeiten, Alarme f&uuml;r einige wichtige F&auml;lle ...).
 </li></ul>
  <p></p>
  <p> IVR-Systeme arbeiten auf Telefonleitungen mittels Audio f&uuml;r Eingaben vom und Ausgaben zum Anwender, was eine sehr einfache Integration mit Sprachsystemen wie TTS (Text To Speech, Text-zu-Sprache; Audiosynthesizer, der geschriebenen Text in Sprache wandelt) und ASR (Asynchronous Speech Recognition, asynchrone Spracherkennung: Stimmanalysator, der menschliche Sprache in geschriebenen Text wandelt). Die ersteren erm&ouml;glichen es IVR-Systemen, Sprachausgabe von geschriebenen Text zu verwenden und nicht nur von aufgezeichneten Stimmen, die letzteren erm&ouml;glichen IVR-Systemen die Erkennung sprachlicher Befehle der Eingabestimme. </p>
  <p>
  Mit TTS- und ASR-Systemen k&ouml;nnen wir weitere IVR-Dienste anbieten:
  </p><ul>
    <li>
    Gesprochene Email: unser Email-Server erh&auml;lt eine normale Nachricht, TTS konvertiert diese in eine Audiodatei, die (nach entsprechender Authentifizierung) von einem Anwender mit einem Telefonanruf beim IVR-System abgeh&ouml;rt werden kann. </li><li>
    Fortschrittliche Anwortdienste: ASR kann den oben beschriebenen Antwortdienst durch eine Sprachkonvertierung der &uuml;ber das Telefonnetzwerk empfangenen Stimme zu einem Text verbessern, der einfach mittels Email versandt, auf einen Webserver gestellt oder sonst wie erforderlich behandelt werden kann. </li><li>
   Telefondienste f&uuml;r taube und/oder stumme Menschen: wir k&ouml;nnen das Telefonnetz und Telefondienste f&uuml;r Menschen verf&uuml;gbar machen, die diese normalerweise aufgrund einer Behinderung nicht nutzen k&ouml;nnen: <ul>
      <li> stumme Menschen k&ouml;nnen eine normale Tastatur benutzen, um einen Text zu schreiben, der von einem TTS-System konvertiert wird und von einem IVR-System ins Telefonnetzwerk geleitet wird;
      </li><li>
taube Menschen k&ouml;nnen einen Sprachanruf mittels IVR erhalten, diesen durch ein AVR-System zu Text konvertieren lassen und ihn auf einem Display angezeigt bekommen; </li><li> obige L&ouml;sungen k&ouml;nnen f&uuml;r Menschen kombiniert werden, die sowohl taub als auch stumm sind und es diesen erm&ouml;glichen, Sprachanrufe zu t&auml;tigen und zu empfangen.
    </li></ul>
  </li></ul>
  <p></p>
  <p>
  Allgemein gesprochen, kann ein IVR-System in einem Telefonnetzwerk jeden Dienst und jedes St&uuml;ck Information anbieten, die von einem Webserver auf einer &uuml;blichen Webseite angeboten werden. Eine Menge an Diensten und M&ouml;glichkeiten kann daher &uuml;ber IVR-Systeme verf&uuml;gbar gemacht werden. Aber IVR-Systeme k&ouml;nnen mehr bieten: Telefonnetzwerke und Kan&auml;le sind bidirektional, daher k&ouml;nnen IVR-Systeme Dienste anbieten, die Anwender direkt anrufen (Webdienste verf&uuml;gen nicht &uuml;ber diese F&auml;higkeit).</p>

<A NAME="372lfindex1">&nbsp;</A>
<H2>Bayonne</H2>



    <p>F&uuml;r eine lange Zeit waren IVR-Systeme ein Monopol geschlossener, nicht freier Software-L&ouml;sungen von einigen IVR-Board-Herstellern. Jeder von ihnen entwickelte IVR-Server f&uuml;r die eigene Hardware; Bayonne ist die Antwort der OpenSource-Welt und des GNU-Projektes auf diese Situation.
</p>

    <p>Haupt- und offizielle Webseite von Bayonne ist <a href="http://www.gnu.org/software/bayonne">www.gnu.org/software/bayonne</a>, wo Sie die Quellen und Dokumentation (Installations- und Administrations-Handb&uuml;cher, eine Menge an Beispielen und einige HowTos) finden. Unter <a href="http://bayonne.sourceforge.org/">bayonne.sourceforge.org</a>
gibt es Referenzen zu externen Ressourcen und die aktuellste Entwickler-Version. F&uuml;r Bayonne gibt es einen &ouml;ffentlichen (nur-Lese-)CVS-Zugang zu den Quellen:
auf savannah.org ist die Version 1.2 (die derzeit stabile Version f&uuml;r Produktions-Anwendungen) verf&uuml;gbar, w&auml;hrend auf sourceforge.org die Version 1.3/2.0 (die Entwickler- und Experimental-Version) zu finden ist.</p>

    <p>Hauptzweck und Charakteristika von Bayonne ist es, eine virtuelle IVR-Plattform zu bieten, die unabh&auml;ngig ist von der benutzten Hardware. Tats&auml;chlich kann Bayonne mit verschiedenen IVR-Board-Familien arbeiten (noch nicht mit allen), ohne irgendeine von ihnen zu ben&ouml;tigen. F&uuml;r jede IVR-Board-Familie und/oder -Hersteller enth&auml;lt Bayonne einen modularen Treiber, der einen gemeinsamen Instruktionssatz bietet und eine virtuelle Umgebung f&uuml;r die allgemeine Benutzung und ohne jeden Hardware-Bezug. Innerhalb dieser virtuellen Umgebung k&ouml;nnen wir unsere IVR-Dienste entwickeln, ohne auf die verwendete Hardware zu achten; daher erfordert der Wechsel des IVR-Boards oder die Portierung eines IVR-Dienstes auf ein anderes System mit einem anderen Board keine &Auml;nderung im Dienst-Code.
<p>

    <p>Wie bereits angegeben, unterst&uuml;tzt Bayonne verschiedene Boards, auch sehr verschiedene, von 2 bis 120 Leitungen (analog oder digital). Weiterhin kann Bayonne mehrere Boards der gleichen Familie zur gleichen Zeit nutzen (in der neuen Bayonne-Version k&ouml;nnen wir sogar Boards verschiedener Familien zur gleichen Zeit nutzen), so dass Hunderte verschiedener Telefonleitungen gleichzeitig behandelt werden k&ouml;nnen. Leider unterst&uuml;tzt Bayonne keine seriellen/USB-Modems (analog, ISDN oder GSM).
</p>

    <p>Um Bayonne auszuprobieren oder allgemein f&uuml;r Tests ben&ouml;tigen wir kein teueres IVR-Board. Tats&auml;chlich ben&ouml;tigen wir nur eine Soundkarte, da Bayonne einen Treiber bereitstellt, der ein IVR-Board emuliert und Ein-/Ausgabe &uuml;ber Tastatur, Mikrofon und Lautsprecher des PCs durchf&uuml;hrt:
Bayonne kann auf Ihrem Arbeitsplatz-PC laufen.
</p>

    <p>Zum Erstellen von IVR-Diensten verf&uuml;gt Bayonne &uuml;ber eine eigene Skriptsprache namens CcScript (eine externe Komponente f&uuml;r Version 1.2, f&uuml;r die Entwicklungsversion 1.3/2.0 in das Hauptpaket integriert). Diese Sprache ist recht einfach, mit vollst&auml;ndigen Berechnungsf&auml;higkeiten und wesentlichen Programmstrukturen: bedingte Bl&ouml;cke, Schleifen, bedingte und unbedingte Spr&uuml;nge, Unterroutinen ... Eine Haupteigenschaft von CcScript sind "zeitbegrenzte" Instruktionen: bevor eine Anweisung ausgef&uuml;hrt wird, kennt die Sprache die maximale Ausf&uuml;hrungszeit. F&uuml;r Operationen, die externe Systeme wie Dateisysteme, Datenbanken und Netzwerkverbindungen ber&uuml;hren, gibt es einen Timeout-Parameter; wenn die Ausf&uuml;hrungszeit den Timeout &uuml;berschreitet, wird die Operation abgebrochen. Aus Serversicht ist diese F&auml;higkeit sehr wichtig, da sie es Bayonne erm&ouml;glicht, deterministische und verl&auml;ssliche Dienste anzubieten.
</p>

    <p>Bayonnes Berechnungsf&auml;higkeiten sind absolut nicht auf die F&auml;higkeiten von CcScript beschr&auml;nkt. Tats&auml;chlich kann Bayonne ohne Probleme mit Hochsprachen wie Perl und Python zusammenarbeiten. Aufgrund dieser direkten Integration erbt Bayonne alle Bibliotheken und Module, die f&uuml;r diese Sprachen verf&uuml;gbar sind: jede Berechnungsoperation, gew&ouml;hnliche und ungew&ouml;hnliche Algorithmen, Datenmanipulation, Verbindungen zu Datenbanken oder externen Server (Web, Email, LDAP, gemeinsame Dateibenutzung) ... Daher kann Bayonne alles berechnen, was erforderlich ist.
</p>

    <p>Selbst ohne Perl und Python kann Bayonne direkte Verbindungen mit MySql- und Postgres-Datenbanken erstellen und SQL-Abfragen selbst innerhalb von CcScript durchf&uuml;hren. Auf die gleiche Weise kann Bayonne auf Dateisysteme zugreifen und sich per Netzwerk mit entfernen Ressourcen verbinden. Weiterhin kann Bayonne direkt mit Stimm-Synthesizer-TTS-Systemen wie Flite, Theta (nur englische Stimmen verf&uuml;gbar) und Festival (mehrsprachig) zusammenarbeiten.
Bayonne kann sich derzeit nicht direkt mit Spracherkennungssystemen verbinden, aber diese F&auml;higkeit ist in Entwicklung.</p>

    <p>F&uuml;r einen Gro&szlig;teil der IVR-Dienste ben&ouml;tigt Bayonne keine externen Text-zu-Sprache-Systeme, da es &uuml;ber eigene mehrsprachige Stimm-Module verf&uuml;gt (Englisch, Franz&ouml;sisch 	, Italienisch und Russisch), welche Zahlen (Ordinal- und Kardinalzahlen), Datums- und Zeitwerte aussprechen k&ouml;nnen (diese Module und die Audioausgabe sind vollst&auml;ndig anpassbar). Diese Sprachmodule umfassen menschliche, voraufgezeichnete Stimmen und k&ouml;nnen benutzt werden, um die meisten IVR-Telefondienste direkt innerhalb des Bayonne-Rahmenwerks zu realisieren.</p>

    <p>Bayonne kann Eingaben von Telefonverbindungen und Eingaben vom System auf verschiedene Arten verwalten: synchrone Verwaltung, wobei Bayonne auf eine bekannte Eingabe wartet (z. B. einen Tastendruck des Anwenders), und asynchrone Verwaltung, wobei Bayonne eine Benachrichtigung erh&auml;lt, wenn ein definiertes Ereignis eintritt (z. B. ein Tastendruck oder ein Zeitablauf), ohne darauf ausdr&uuml;cklich zu warten. Diese beiden Eingabeverwaltungsmodi erm&ouml;glichen Bayonne eine schnelle Reaktion auf Anwender- und Systemereignisse ohne Zeit zu vergeuden.</p>

    <p>Wie bereits erw&auml;hnt, wurde Bayonne entwickelt, um eine gro&szlig;e Anzahl von Telefonleitungen gleichzeitg zu verwalten, daher verf&uuml;gt es &uuml;ber Befehle und Instruktionen f&uuml;r Multithread-Verwaltung. Jeder Thread kann mit anderen &uuml;ber Signale interagieren. Dies erm&ouml;glicht Thread-Synchronisation und Datenaustausch zwischen Threads und dar&uuml;berhinaus die Verbindung von zwei Threads, die verschiedene Telefonleitungen nutzen (z. B. k&ouml;nnen so zwei Anwender durch Bayonne miteinander sprechen).</p>

    <p>Alle diese F&auml;higkeiten machen Bayonne n&uuml;tzlich in einem weiten Bereich von Situationen. Es kann sowohl f&uuml;r kleine IVR-Telefondienste mit wenigen Telefonleitungen als auch f&uuml;r gro&szlig;e Service-Zentren benutzt werden, die hunderte von Leitungen verwalten. Mit Bayonne k&ouml;nnen wir "schnelle und einfache" Dienste oder komplexe Dienste, die auch externe Systeme involvieren, erstellen. Daher ist Bayonne der richtige IVR-Server f&uuml;r jede Art von IVR-Diensten.</p>



    
    
<!-- vim: set sw=2 ts=2 et : -->

<!-- BODY_OF_THE_ARTICLE_STOP -->
<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback f&uuml;r diesen Artikel</h2>
Jeder Artikel hat seine eigene Seite f&uuml;r Kommentare und R&uuml;ckmeldungen. Auf dieser Seite kann jeder eigene Kommentare abgeben und die Kommentare anderer Leser sehen:
<center>
    <table width="250" border=0><tr><td>
    <div class="tbbutton"><A class="nodec" href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=372">&nbsp;Talkback Seite&nbsp;</a></div>
    </td></tr></table>
</center>

<br clear="all">
<HR size="2" noshade>
<table width="250" border=0><tr><td>
<div class="bbutton"><a class="nodec" href="../../index.shtml">&lt;--, LF Home</a></div>
</td><td>
<div class="bbutton"><a class="nodec" href="index.shtml">Zum index dieser Ausgabe</a></div>
</td></tr></table>
<br clear="all">
<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">Der LinuxFocus Redaktion schreiben</A>
<BR><FONT COLOR="#1111aa"><a href="../../common/copy.html">&copy; Luca Bariani</a><br>&quot;some rights reserved&quot; see <a href="../../license/index.shtml">linuxfocus.org/license/</a><br><a href="http://www.linuxfocus.org">http://www.LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Autoren und &Uuml;bersetzer:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Luca Bariani <small>&lt;lucabariani /at/ ferrara.linux.it&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; de: Hermann J. Beckers &lt;hj.beckers /at/ onlinehome.de&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2005-07-21, generated by lfparser version 2.52</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
