<!DOCTYPE article PUBLIC "-//OASIS//DTD DocBook V4.2//EN">

<article>
  <articleinfo>
    <title>&#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;-&#2447; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494;</title>

    <authorgroup>
      <author>
        <firstname>&#2468;&#2494;&#2472;&#2495;&#2478;</firstname><surname>&#2438;&#2489;&#2478;&#2503;&#2470;</surname>

        <affiliation><address><email>taneem@_NOSPAM_bengalinux.org</email></address></affiliation>
      </author>

      <author>
        <firstname>&#2486;&#2494;&#2472;&#2509;&#2468;&#2472;&#2497;</firstname><surname>&#2458;&#2509;&#2479;&#2494;&#2463;&#2494;&#2480;&#2509;&#2460;&#2495;</surname>

        <affiliation><address><email>santanu@_NOSPAM_softhome.net</email></address></affiliation>
      </author>

      <author>
        <othername>&#2474;&#2509;&#2480;&#2460;&#2509;&#2462;&#2494;</othername>

        <affiliation><address><email>abulfazl@_NOSPAM_juniv.edu</email></address></affiliation>
      </author>

      <author>
        <firstname>&#2488;&#2494;&#2527;&#2478;&#2495;&#2472;&#2509;&#2470;&#2497;</firstname><surname>&#2470;&#2494;&#2486;&#2455;&#2497;&#2474;&#2509;&#2468;</surname>

        <affiliation><address><email>unmadindu@_NOSPAM_bengalinux.org</email></address></affiliation>
      </author>

      <othercredit>
        <firstname>&#2486;&#2480;&#2496;&#2475;</firstname><surname>&#2439;&#2488;&#2482;&#2494;&#2478;</surname>

        <affiliation><address><email>mislam@_NOSPAM_staff.uiuc.edu</email></address></affiliation>

        <contrib>&#2537;&#2527; &#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470; &#2451; &#2474;&#2480;&#2495;&#2486;&#2495;&#2487;&#2509;&#2463;&#2503;&#2480; &#2476;&#2457;&#2509;&#2455;&#2494;&#2472;&#2497;&#2476;&#2494;&#2470;</contrib>
      </othercredit>       

      <othercredit>
        <firstname>&#2453;&#2494;&#2460;&#2496;</firstname><othername>&#2438;&#2486;&#2475;&#2494;&#2453;-&#2441;&#2480;</othername><surname>&#2480;&#2489;&#2478;&#2494;&#2472;</surname>
        <affiliation><address><email>ashfaq_csdu@_NOSPAM_yahoo.com</email></address></affiliation>
        <contrib>&#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470; &#2536;.&#2536;.&#2536;. &#2469;&#2503;&#2453;&#2503; &#2536;.&#2538;.&#2535;. &#2447;&#2480; &#2476;&#2457;&#2509;&#2455;&#2494;&#2472;&#2497;&#2476;&#2494;&#2470;</contrib>
      </othercredit>       

      <othercredit>
        <othername>&#2474;&#2509;&#2480;&#2460;&#2509;&#2462;&#2494;</othername>
        <contrib>&#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470; &#2535; &#2469;&#2503;&#2453;&#2503; &#2536;.&#2536;.&#2535;. &#2447;&#2480; &#2476;&#2457;&#2509;&#2455;&#2494;&#2472;&#2497;&#2476;&#2494;&#2470;</contrib>
      </othercredit>       
    </authorgroup>

    <subjectset>
      <subject><subjectterm>&#2476;&#2494;&#2434;&#2482;&#2494;i</subjectterm></subject>
      <subject><subjectterm>Localization</subjectterm></subject>
    </subjectset>

    <pubdate>&#2536;&#2534;&#2534;&#2537;-&#2535;&#2534;-&#2534;&#2535;</pubdate>

    <revhistory>
      <revision>
        <revnumber>&#2534;.&#2534;</revnumber><date>&#2536;&#2534;&#2534;&#2537;-&#2535;&#2534;-&#2534;&#2535;</date><authorinitials>&#2474;&#2509;&#2480;</authorinitials>
        <revremark>&#2478;&#2498;&#2482; &#2489;&#2494;&#2451;&#2463;&#2497;'&#2480; &#2535;.&#2535;.&#2537;. &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; &#2469;&#2503;&#2453;&#2503; &#2474;&#2509;&#2480;&#2469;&#2478;&#2476;&#2494;&#2480;&#2503;&#2480; &#2478;&#2468; &#2476;&#2457;&#2509;&#2455;&#2494;&#2472;&#2497;&#2476;&#2494;&#2470; &#2453;&#2480;&#2494; &#2489;&#2527;&#2404;</revremark>
      </revision>
    </revhistory>

    <abstract><para> &#2447;&#2439; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503;&#2480; &#2441;&#2470;&#2509;&#2470;&#2503;&#2486;&#2509;&#2479; &#2489;&#2482; <systemitem class="osname"><acronym>&#2455;&#2472;&#2497;&#2489;</acronym>/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;</systemitem>-&#2447; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494;
&#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2503; &#2453;&#2480;&#2467;&#2496;&#2527; &#2476;&#2495;&#2487;&#2527;&#2488;&#2478;&#2498;&#2489;&#2503;&#2480; &#2476;&#2480;&#2509;&#2467;&#2472;&#2494; &#2447;&#2476;&#2434; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455; &#2441;&#2472;&#2509;&#2472;&#2468;&#2468;&#2480; &#2453;&#2480;&#2494;&#2480; &#2476;&#2509;&#2479;&#2494;&#2474;&#2494;&#2480;&#2503; &#2472;&#2495;&#2480;&#2509;&#2470;&#2503;&#2486;&#2472;&#2494; &#2474;&#2509;&#2480;&#2470;&#2494;&#2472;&#2404; </para>
    </abstract>
  </articleinfo>

  <sect1 id="intro">
    <title>&#2488;&#2498;&#2458;&#2472;&#2494;</title>

    <sect2 id="preface">
      <title>&#2535;.&#2535;. &#2474;&#2509;&#2480;&#2488;&#2457;&#2509;&#2455;-&#2453;&#2469;&#2494;</title>

      <para>&#2437;&#2488;&#2434;&#2454;&#2509;&#2479; &#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496;&#2480; &#2478;&#2472;&#2503;&#2480; &#2439;&#2458;&#2509;&#2459;&#2494;&#2468;&#2494;&#2482;&#2495;&#2453;&#2494;&#2480; &#2488;&#2480;&#2509;&#2476;&#2494;&#2455;&#2509;&#2480;&#2503; &#2479;&#2503; &#2460;&#2495;&#2472;&#2495;&#2487;&#2463;&#2495; &#2469;&#2494;&#2453;&#2503;, &#2468;&#2494; &#2489;&#2482; &#2474;&#2509;&#2480;&#2495;&#2527; &#2437;&#2474;&#2494;&#2480;&#2503;&#2463;&#2495;&#2434; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2463;&#2495;&#2468;&#2503; &#2468;&#2494;&#2470;&#2503;&#2480; &#2478;&#2494;&#2468;&#2499;&#2477;&#2494;&#2487;&#2494;
&#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2488;&#2497;&#2476;&#2509;&#2479;&#2476;&#2488;&#2509;&#2469;&#2494;&#2404; &#2453;&#2495;&#2472;&#2509;&#2468;&#2497; &#2476;&#2495;&#2486;&#2509;&#2476;&#2503;&#2480; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2477;&#2494;&#2487;&#2494;&#2480; &#2478;&#2471;&#2509;&#2479;&#2503; &#2477;&#2494;&#2480;&#2468;&#2496;&#2527; &#2441;&#2474;&#2478;&#2489;&#2494;&#2470;&#2503;&#2486;&#2503;&#2480; &#2477;&#2494;&#2487;&#2494;&#2488;&#2478;&#2498;&#2489; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2476;&#2509;&#2479;&#2476;&#2488;&#2509;&#2469;&#2494; &#2453;&#2480;&#2494; &#2447;&#2453;&#2463;&#2495; &#2437;&#2468;&#2509;&#2479;&#2472;&#2509;&#2468; &#2470;&#2497;&#2480;&#2498;&#2489; &#2453;&#2494;&#2460;&#2404; &#2479;&#2497;&#2453;&#2509;&#2468;&#2494;&#2453;&#2509;&#2487;&#2480;&#2503;&#2480;
&#2441;&#2474;&#2488;&#2509;&#2469;&#2495;&#2468;&#2495;, &#2437;&#2474;&#2509;&#2480;&#2478;&#2495;&#2468; (Nonstandard) &#2476;&#2494;&#2472;&#2494;&#2472; &#2439;&#2468;&#2509;&#2479;&#2494;&#2470;&#2495; &#2453;&#2494;&#2480;&#2467;&#2503; &#2447;&#2439; &#2477;&#2494;&#2487;&#2494;&#2455;&#2497;&#2482;&#2507; &#2488;&#2509;&#2476;&#2477;&#2494;&#2476;&#2468;&#2439; &#2460;&#2463;&#2495;&#2482;&#2404; &#2438;&#2486;&#2494;&#2480; &#2453;&#2469;&#2494; &#2489;&#2482;, &#2475;&#2509;&#2480;&#2496;/&#2482;&#2495;&#2476;&#2494;&#2480;/&#2451;&#2474;&#2503;&#2472;-&#2488;&#2507;&#2480;&#2509;&#2488; &#2488;&#2478;&#2494;&#2460;&#2451; &#2488;&#2489;&#2460;&#2503; &#2489;&#2494;&#2482; &#2459;&#2503;&#2524;&#2503;
&#2470;&#2503;&#2527;&#2494;&#2480; &#2474;&#2494;&#2468;&#2509;&#2480; &#2472;&#2527;&#2404; &#2447;&#2439; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503; <acronym>FLOSS</acronym> &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2488;&#2478;&#2498;&#2489;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494;&#2480; &#2480;&#2498;&#2474;&#2480;&#2503;&#2454;&#2494; &#2470;&#2503;&#2527;&#2494; &#2489;&#2527;&#2503;&#2459;&#2503;&#2404; &#2441;&#2474;&#2480;&#2472;&#2509;&#2468;&#2497;, &#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2447;
&#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2438;&#2480;&#2507; &#2441;&#2472;&#2509;&#2472;&#2468; &#2453;&#2480;&#2468;&#2503; &#2438;&#2455;&#2509;&#2480;&#2489;&#2496; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480;&#2455;&#2467;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;&#2451; &#2447;&#2463;&#2495; &#2447;&#2453;&#2463;&#2495; "&#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480; &#2455;&#2494;&#2439;&#2465;" &#2489;&#2495;&#2488;&#2503;&#2476;&#2503; &#2453;&#2494;&#2460; &#2453;&#2480;&#2476;&#2503;&#2404;</para>
    </sect2>

    <sect2 id="copyright">
      <title>&#2535;.&#2536;. &#2453;&#2474;&#2495;&#2480;&#2494;&#2439;&#2463;</title>

      <blockquote><para> &#2453;&#2474;&#2495;&#2480;&#2494;&#2439;&#2463; (c) &#2536;&#2534;&#2534;&#2536;-&#2536;&#2534;&#2534;&#2537; &#2468;&#2494;&#2472;&#2495;&#2478; &#2438;&#2489;&#2478;&#2503;&#2470;, &#2486;&#2494;&#2472;&#2509;&#2468;&#2472;&#2497; &#2458;&#2509;&#2479;&#2494;&#2463;&#2494;&#2480;&#2509;&#2460;&#2496;, &#2474;&#2509;&#2480;&#2460;&#2509;&#2462;&#2494;, &#2488;&#2494;&#2527;&#2478;&#2495;&#2472;&#2509;&#2470;&#2497; &#2470;&#2494;&#2486;&#2455;&#2497;&#2474;&#2509;&#2468;&#2404; &#2475;&#2509;&#2480;&#2496; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480; &#2475;&#2494;&#2441;&#2472;&#2509;&#2465;&#2503;&#2486;&#2472; &#2453;&#2480;&#2509;&#2468;&#2499;&#2453; &#2474;&#2509;&#2480;&#2453;&#2494;&#2486;&#2495;&#2468;
&#2455;&#2472;&#2497;&#2489; &#2475;&#2509;&#2480;&#2496; &#2465;&#2453;&#2497;&#2478;&#2503;&#2472;&#2509;&#2463;&#2503;&#2486;&#2472; &#2482;&#2494;&#2439;&#2488;&#2503;&#2472;&#2509;&#2488;&#2503;&#2480; &#2535;.&#2535; &#2476;&#2494; &#2474;&#2480;&#2476;&#2480;&#2509;&#2468;&#2496; &#2453;&#2507;&#2472;&#2507; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;&#2503;&#2480; &#2437;&#2471;&#2496;&#2472;&#2503; &#2453;&#2474;&#2495;, &#2474;&#2497;&#2472;&#2435;&#2476;&#2495;&#2468;&#2480;&#2467; &#2447;&#2476;&#2434;/&#2437;&#2469;&#2476;&#2494; &#2474;&#2480;&#2495;&#2476;&#2480;&#2509;&#2468;&#2472;&#2503;&#2480; &#2437;&#2472;&#2497;&#2478;&#2468;&#2495; &#2470;&#2503;&#2451;&#2527;&#2494; &#2455;&#2503;&#2482;&#2404; &#2468;&#2476;&#2503; &#2453;&#2507;&#2472;
&#2474;&#2480;&#2495;&#2476;&#2480;&#2509;&#2468;&#2495;&#2468; &#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470;, &#2474;&#2509;&#2480;&#2458;&#2509;&#2459;&#2470; &#2463;&#2503;&#2453;&#2509;&#2488;&#2463; &#2447;&#2476;&#2434; &#2474;&#2503;&#2459;&#2472;&#2503;&#2480; &#2453;&#2477;&#2494;&#2480; &#2463;&#2503;&#2453;&#2509;&#2488;&#2463; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2479;&#2494;&#2476;&#2503; &#2472;&#2494;&#2404; &#2447;&#2439; &#2482;&#2494;&#2439;&#2488;&#2503;&#2472;&#2509;&#2488;&#2503;&#2480; &#2447;&#2453;&#2463;&#2495; &#2453;&#2474;&#2495; &#2474;&#2494;&#2451;&#2527;&#2494; &#2479;&#2494;&#2476;&#2503;
<ulink url="http://www.gnu.org/licences/fdl.html">http://www.gnu.org/licences/fdl.html</ulink> &#2447;&#2439; &#2464;&#2495;&#2453;&#2494;&#2472;&#2494;&#2527;&#2404;</para>
      </blockquote>
    </sect2>

    <sect2 id="disclaimer">
      <title>&#2535;.&#2537;. &#2470;&#2494;&#2476;&#2495;&#2468;&#2509;&#2479;&#2494;&#2455;</title>

      <para> &#2474;&#2499;&#2469;&#2453;&#2477;&#2494;&#2476;&#2503; &#2476;&#2482;&#2494; &#2472;&#2494; &#2469;&#2494;&#2453;&#2482;&#2503; &#2488;&#2453;&#2482; &#2488;&#2509;&#2476;&#2468;&#2509;&#2468;&#2509;&#2476; &#2482;&#2503;&#2454;&#2453;&#2455;&#2467; &#2453;&#2480;&#2509;&#2468;&#2499;&#2453; &#2488;&#2434;&#2480;&#2453;&#2509;&#2487;&#2495;&#2468;&#2404; &#2447;&#2439; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503; &#2453;&#2507;&#2472; &#2463;&#2494;&#2480;&#2509;&#2478; (Term) &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2489;&#2482;&#2503; &#2468;&#2494; &#2453;&#2507;&#2472; &#2463;&#2509;&#2480;&#2503;&#2465;&#2478;&#2494;&#2480;&#2509;&#2453; &#2476;&#2494;
&#2488;&#2494;&#2480;&#2509;&#2477;&#2495;&#2488;-&#2478;&#2494;&#2480;&#2509;&#2453; &#2477;&#2457;&#2509;&#2455; &#2453;&#2480;&#2459;&#2503; &#2476;&#2482;&#2503; &#2471;&#2480;&#2503; &#2472;&#2503;&#2527;&#2494; &#2441;&#2458;&#2495;&#2468;&#2509;&#8205; &#2489;&#2476;&#2503; &#2472;&#2494;&#2404; </para>

      <para> &#2453;&#2507;&#2472; &#2470;&#2509;&#2480;&#2476;&#2509;&#2479; &#2476;&#2494; &#2476;&#2509;&#2480;&#2509;&#2479;&#2494;&#2472;&#2509;&#2465;&#2503;&#2480; &#2472;&#2494;&#2478; &#2441;&#2482;&#2509;&#2482;&#2503;&#2454; &#2453;&#2480;&#2494;&#2480; &#2437;&#2480;&#2509;&#2469; &#2447;&#2439; &#2472;&#2527; &#2479;&#2503; &#2468;&#2494;&#2480; &#2474;&#2453;&#2509;&#2487;&#2503; &#2474;&#2509;&#2480;&#2458;&#2494;&#2480;&#2467;&#2494; &#2458;&#2494;&#2482;&#2494;&#2472;&#2507; &#2489;&#2458;&#2509;&#2459;&#2503;&#2404; </para>

      <para> &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; &#2453;&#2507;&#2472; &#2474;&#2480;&#2495;&#2476;&#2480;&#2509;&#2468;&#2472;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2503; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2496;&#2527; &#2476;&#2509;&#2479;&#2494;&#2453;&#2438;&#2474; &#2468;&#2504;&#2480;&#2495;&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2474;&#2472;&#2494;&#2453;&#2503; &#2437;&#2468;&#2509;&#2479;&#2472;&#2509;&#2468; &#2460;&#2507;&#2480;&#2494;&#2482;&#2507;&#2477;&#2494;&#2476;&#2503; &#2474;&#2480;&#2494;&#2478;&#2480;&#2509;&#2486; &#2470;&#2503;&#2527;&#2494; &#2489;&#2458;&#2509;&#2459;&#2503;&#2404; </para>
    </sect2>

    <sect2 id="newversions">
      <title>&#2535;.&#2538;. &#2472;&#2468;&#2497;&#2472; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;</title>

      <para> &#2447;&#2439; &#2489;&#2494;&#2451;&#2463;&#2497;&#2480; &#2488;&#2480;&#2509;&#2476;&#2486;&#2503;&#2487; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;&#2463;&#2495; &#2488;&#2476;&#2488;&#2478;&#2527;&#2439; <ulink url="www.bengalinux.org">www.Bengalinux.Org</ulink> &#2451;&#2527;&#2503;&#2476; &#2488;&#2494;&#2439;&#2463;&#2503; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2480;&#2498;&#2474;&#2503;
&#2474;&#2494;&#2451;&#2527;&#2494; &#2479;&#2494;&#2476;&#2503;&#2404; </para>

      <itemizedlist>
        <listitem>
          <para><ulink url="http://www.bengalinux.org/bn/howto/Bangla-HOWTO.bn.html"><acronym>&#2447;&#2439;&#2458;&#2463;&#2495;&#2447;&#2478;&#2447;&#2482;</acronym></ulink>
          </para>
        </listitem>

        <listitem>
          <para><ulink url="http://www.bengalinux.org/bn/howto/Bangla-HOWTO.bn.txt">&#2488;&#2494;&#2471;&#2494;&#2480;&#2467; &#2463;&#2503;&#2453;&#2509;&#2488;&#2463;</ulink></para>
        </listitem>

        <listitem>
          <para><ulink url="http://www.bengalinux.org/bn/howto/Bangla-HOWTO.bn.pdf"><acronym>&#2474;&#2495;&#2465;&#2495;&#2447;&#2475;</acronym></ulink></para>
        </listitem>

        <listitem>
          <para><ulink url="http://www.bengalinux.org/bn/howto/Bangla-HOWTO.bn.xml"><acronym>&#2447;&#2453;&#2509;&#2488;&#2447;&#2478;&#2447;&#2482;</acronym></ulink>
          </para>
        </listitem>
      </itemizedlist>
    </sect2>

    <sect2 id="credits">
      <title>&#2535;.&#2539;. &#2488;&#2509;&#2476;&#2496;&#2453;&#2499;&#2468;&#2495;</title>

      <para> &#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2447; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503; &#2460;&#2524;&#2495;&#2468; &#2488;&#2453;&#2482; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480;/&#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496;&#2480; &#2472;&#2495;&#2453;&#2463; &#2438;&#2478;&#2480;&#2494; &#2438;&#2472;&#2509;&#2468;&#2480;&#2495;&#2453;&#2477;&#2494;&#2476;&#2503; &#2453;&#2499;&#2468;&#2460;&#2509;&#2462;&#2404; &#2476;&#2495;&#2486;&#2503;&#2487;&#2477;&#2494;&#2476;&#2503;
<ulink url="http://www.AnkurBangla.Org">&#2437;&#2457;&#2509;&#2453;&#2497;&#2480;</ulink> &#2451; <ulink url="http://www.savannah.nongnu.org/freebangfont/"> &#2475;&#2509;&#2480;&#2496; &#2476;&#2494;&#2434;&#2482;&#2494; &#2475;&#2472;&#2509;&#2463;
&#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503;&#2480; </ulink> &#2453;&#2469;&#2494; &#2472;&#2494; &#2476;&#2482;&#2482;&#2503;&#2439; &#2472;&#2527;&#2404;</para>

      <para> &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2463;&#2495;&#2480; <acronym>&#2447;&#2453;&#2509;&#2488;&#2447;&#2478;&#2447;&#2482;</acronym> (XML) &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; &#2468;&#2504;&#2480;&#2495;&#2480; &#2488;&#2478;&#2527; &#2479;&#2503; &#2472;&#2478;&#2497;&#2472;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2489;&#2527;&#2503;&#2459;&#2503; &#2468;&#2494; &#2468;&#2504;&#2480;&#2495; &#2453;&#2480;&#2503;&#2459;&#2503;&#2472;
<othercredit><firstname>&#2488;&#2509;&#2463;&#2503;&#2439;&#2472;</firstname><surname>&#2460;&#2495;&#2451;&#2472;</surname></othercredit>,<othercredit><firstname>&#2455;&#2509;&#2480;&#2503;&#2455;&#2480;&#2496;</firstname>
<surname>&#2482;&#2503;&#2476;&#2509;&#2482;&#2494;&#2433;</surname></othercredit> &#2451; <othercredit><firstname>&#2455;&#2509;&#2480;&#2503;&#2455;</firstname><surname>&#2475;&#2494;&#2480;&#2509;&#2455;&#2497;&#2488;&#2472;</surname></othercredit>&#2404;
      </para>
    </sect2>

    <sect2 id="feedback">
      <title>&#2535;.&#2540;. &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479;</title>

      <para> &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2494;&#2480; &#2453;&#2507;&#2472; &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479;, &#2488;&#2478;&#2494;&#2482;&#2507;&#2458;&#2472;&#2494;, &#2488;&#2497;&#2458;&#2495;&#2472;&#2509;&#2468;&#2495;&#2468; &#2478;&#2468;&#2494;&#2478;&#2468;, &#2488;&#2434;&#2479;&#2507;&#2460;&#2472; &#2476;&#2494; &#2474;&#2509;&#2480;&#2486;&#2509;&#2472; &#2469;&#2494;&#2453;&#2503; &#2468;&#2476;&#2503; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2439;-&#2478;&#2503;&#2439;&#2482; &#2453;&#2480;&#2497;&#2472; &#2447;&#2439; &#2464;&#2495;&#2453;&#2494;&#2472;&#2494;&#2527;
<email>users@bengalinux.org</email> &#2404; &#2438;&#2474;&#2472;&#2494;&#2453;&#2503; &#2488;&#2494;&#2489;&#2494;&#2479;&#2509;&#2479; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2482;&#2503; &#2438;&#2478;&#2494;&#2480; &#2437;&#2468;&#2509;&#2479;&#2472;&#2509;&#2468; &#2438;&#2472;&#2472;&#2509;&#2470;&#2495;&#2468; &#2489;&#2476;&#2507;&#2404; </para>
    </sect2>

    <sect2 id="conventions">
      <title>&#2535;.&#2541;. &#2447;&#2439; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2480;&#2496;&#2468;&#2495;&#2472;&#2496;&#2468;&#2495;</title>

      <para> &#2488;&#2468;&#2480;&#2509;&#2453;&#2476;&#2494;&#2467;&#2496;, &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;, &#2475;&#2494;&#2439;&#2482;&#2503;&#2480; &#2472;&#2494;&#2478;, &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503;&#2480; &#2438;&#2441;&#2463;&#2474;&#2497;&#2463; &#2439;&#2468;&#2509;&#2479;&#2494;&#2470;&#2495; &#2472;&#2495;&#2480;&#2509;&#2470;&#2503;&#2486; &#2453;&#2480;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2478;&#2480;&#2494; &#2453;&#2495;&#2459;&#2497; &#2476;&#2495;&#2486;&#2503;&#2487; &#2471;&#2480;&#2472;&#2503;&#2480; &#2482;&#2503;&#2454;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2503;&#2459;&#2495;&#2404; &#2472;&#2495;&#2478;&#2509;&#2472;&#2503;
&#2447;&#2470;&#2503;&#2480; &#2468;&#2494;&#2482;&#2495;&#2453;&#2494; &#2474;&#2509;&#2480;&#2470;&#2494;&#2472; &#2453;&#2480;&#2494; &#2489;&#2482;&#2404; </para>

      <variablelist>
        <varlistentry>
          <term>&#2486;&#2503;&#2482; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;</term>
          <listitem><para><prompt>bash$</prompt> <userinput>ls</userinput></para></listitem>
        </varlistentry>

        <varlistentry>
          <term>&#2476;&#2495;&#2486;&#2503;&#2487;&#2477;&#2494;&#2476;&#2503; &#2482;&#2453;&#2509;&#2487;&#2509;&#2479;&#2467;&#2496;&#2527; &#2476;&#2495;&#2487;&#2527;&#2494;&#2476;&#2482;&#2496;</term>
          <listitem><note><para>&#2482;&#2453;&#2509;&#2487;&#2509;&#2479;&#2467;&#2496;&#2527;</para></note></listitem>
        </varlistentry>

        <varlistentry>
          <term>&#2488;&#2468;&#2480;&#2509;&#2453;&#2468;&#2494;</term>
          <listitem><caution><para>&#2488;&#2468;&#2480;&#2509;&#2453;&#2468;&#2494;</para></caution></listitem>
        </varlistentry>

        <varlistentry>
          <term>&#2476;&#2495;&#2486;&#2503;&#2487; &#2468;&#2469;&#2509;&#2479;</term>
          <listitem><tip><para>&#2439;&#2457;&#2509;&#2455;&#2495;&#2468;</para></tip></listitem>
        </varlistentry>

        <varlistentry>
          <term>&#2488;&#2468;&#2480;&#2509;&#2453;&#2476;&#2494;&#2467;&#2496;</term>
          <listitem><warning><para>&#2488;&#2468;&#2480;&#2509;&#2453;&#2476;&#2494;&#2467;&#2496;</para></warning></listitem>
        </varlistentry>

        <varlistentry>
          <term>&#2475;&#2494;&#2439;&#2482;/&#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2480; &#2472;&#2494;&#2478;</term>
          <listitem><para><filename class="directory">/usr/src/linux/</filename></para></listitem>
        </varlistentry>

        <varlistentry>
          <term>&#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2503;&#2480; &#2472;&#2494;&#2478;</term>
          <listitem><para><application>&#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;</application></para></listitem>
        </varlistentry>

        <varlistentry>
          <term>&#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503;&#2480; &#2438;&#2441;&#2463;&#2474;&#2497;&#2463;</term>
          <listitem><para><computeroutput>&#2447;&#2480;&#2453;&#2478; &#2453;&#2507;&#2472; &#2475;&#2494;&#2439;&#2482; &#2476;&#2494; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2480; &#2437;&#2488;&#2509;&#2468;&#2495;&#2468;&#2509;&#2476; &#2472;&#2503;&#2439;</computeroutput></para></listitem>
        </varlistentry>
   
        <varlistentry>
          <term>&#2453;&#2507;&#2465;/&#2488;&#2509;&#2453;&#2509;&#2480;&#2495;&#2474;&#2509;&#2463;</term>
          <listitem><programlisting>#!/bin/bash</programlisting></listitem>
        </varlistentry>
 
        <varlistentry>
          <term>&#2476;&#2524; &#2453;&#2480;&#2503; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2495;&#2468; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503;&#2480; &#2438;&#2441;&#2463;&#2474;&#2497;&#2463;</term>
          <listitem><screen>logfile begins</screen></listitem>
        </varlistentry>
      </variablelist>
    </sect2>

    <sect2 id="purpose">
      <title>&#2535;.&#2542;. &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503;&#2480; &#2441;&#2470;&#2509;&#2470;&#2503;&#2486;&#2509;&#2479;</title>

      <para> &#2447;&#2439; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503;&#2480; &#2476;&#2495;&#2487;&#2527;&#2476;&#2488;&#2509;&#2468;&#2497; &#2489;&#2482; &#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2437;&#2474;&#2494;&#2480;&#2503;&#2463;&#2495;&#2434; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2503; &#2453;&#2480;&#2467;&#2496;&#2527; &#2453;&#2494;&#2460;&#2488;&#2478;&#2498;&#2489;&#2503;&#2480; &#2476;&#2480;&#2509;&#2467;&#2472;&#2494;&#2404; &#2468;&#2494;&#2459;&#2494;&#2524;&#2494; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;
&#2438;&#2480;&#2507; &#2441;&#2472;&#2509;&#2472;&#2468; &#2451; &#2476;&#2509;&#2479;&#2494;&#2474;&#2453; &#2453;&#2480;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2479;&#2494;&#2480;&#2494; &#2453;&#2494;&#2460; &#2453;&#2480;&#2468;&#2503; &#2439;&#2458;&#2509;&#2459;&#2497;&#2453;, &#2468;&#2494;&#2470;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;&#2451; &#2447;&#2468;&#2503; &#2453;&#2495;&#2459;&#2497; &#2472;&#2495;&#2480;&#2509;&#2470;&#2503;&#2486;&#2472;&#2494; &#2480;&#2527;&#2503;&#2459;&#2503;&#2404; &#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;-&#2447; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455; &#2447;&#2454;&#2472;&#2507; &#2474;&#2480;&#2495;&#2474;&#2498;&#2480;&#2509;&#2467;
&#2472;&#2527;&#2404; &#2453;&#2495;&#2472;&#2509;&#2468;&#2497; &#2438;&#2471;&#2497;&#2472;&#2495;&#2453; &#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488; &#2465;&#2495;&#2488;&#2509;&#2463;&#2509;&#2480;&#2495;&#2476;&#2495;&#2441;&#2486;&#2472;&#2503; &#2438;&#2474;&#2472;&#2495; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2503; &#2482;&#2503;&#2454;&#2494;&#2482;&#2503;&#2454;&#2495;, &#2439;-&#2478;&#2503;&#2439;&#2482; &#2474;&#2494;&#2464;&#2494;&#2472;&#2507;, &#2438;&#2465;&#2509;&#2465;&#2494; (Chat) &#2470;&#2503;&#2451;&#2527;&#2494;, &#2475;&#2494;&#2439;&#2482;&#2503;&#2480; &#2472;&#2494;&#2478; &#2488;&#2434;&#2480;&#2453;&#2509;&#2487;&#2467;
(Save) &#2453;&#2480;&#2494; (<acronym>&#2439;&#2441;&#2463;&#2495;&#2447;&#2475;-&#2542;</acronym>...), &#2458;&#2495;&#2468;&#2509;&#2480;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; (GUI) &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2503;&#2480; &#2439;&#2472;&#2509;&#2463;&#2494;&#2480;&#2475;&#2503;&#2488; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2439;&#2468;&#2509;&#2479;&#2494;&#2470;&#2495; &#2453;&#2494;&#2460; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472;&#2404; &#2441;&#2474;&#2480;&#2472;&#2509;&#2468;&#2497; ,
&#2438;&#2478;&#2480;&#2494; &#2536;&#2534;&#2534;&#2537; &#2488;&#2494;&#2482;&#2503;&#2480; &#2438;&#2455;&#2488;&#2509;&#2463; &#2478;&#2494;&#2488;&#2503;&#2480; &#2478;&#2471;&#2509;&#2479;&#2503; <acronym>&#2455;&#2497;&#2489;&#2509;&#8204;&#2472;&#2507;&#2478;</acronym> (GNOME) &#2447;&#2480; &#2478;&#2498;&#2482; &#2437;&#2434;&#2486;&#2463;&#2497;&#2453;&#2497; &#2476;&#2494;&#2434;&#2482;&#2494;&#2527; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2453;&#2480;&#2494;&#2480; &#2482;&#2453;&#2509;&#2487;&#2509;&#2479; &#2472;&#2495;&#2480;&#2509;&#2471;&#2494;&#2480;&#2467; &#2453;&#2480;&#2503;&#2459;&#2495; &#2479;&#2503;&#2472;
&#2468;&#2494; &#2455;&#2497;&#2489;&#2509;&#8204;&#2472;&#2507;&#2478; &#2536;.&#2538; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;&#2503; &#2437;&#2472;&#2509;&#2468;&#2480;&#2509;&#2477;&#2497;&#2453;&#2509;&#2468; &#2453;&#2480;&#2494; &#2479;&#2494;&#2527;&#2404; </para>

      <note><para> &#2447;&#2439; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2463;&#2495; &#2486;&#2497;&#2471;&#2497;&#2478;&#2494;&#2468;&#2509;&#2480; &#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;-&#2447;&#2480; &#2458;&#2495;&#2468;&#2509;&#2480;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2474;&#2509;&#2480;&#2479;&#2507;&#2460;&#2509;&#2479; - &#2453;&#2472;&#2488;&#2507;&#2482;-&#2447; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2453;&#2507;&#2472;
&#2474;&#2480;&#2495;&#2453;&#2482;&#2509;&#2474;&#2472;&#2494; &#2438;&#2474;&#2494;&#2468;&#2468; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2472;&#2503;&#2439;&#2404; </para>
      </note>

      <note><para> &#2447;&#2454;&#2494;&#2472;&#2503; &#2479;&#2503; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494;&#2527; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2453;&#2469;&#2494; &#2476;&#2482;&#2494; &#2489;&#2458;&#2509;&#2459;&#2503;, &#2468;&#2494; &#2488;&#2478;&#2509;&#2474;&#2498;&#2480;&#2509;&#2467;&#2439; &#2439;&#2441;&#2472;&#2495;&#2453;&#2507;&#2465;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453;&#2404; &#2438;&#2478;&#2480;&#2494; &#2453;&#2507;&#2472; &#2478;&#2494;&#2482;&#2495;&#2453;&#2494;&#2472;&#2494;&#2471;&#2496;&#2472; (Proprietery) &#2476;&#2494;
&#2437;&#2474;&#2509;&#2480;&#2478;&#2495;&#2468; &#2447;&#2472;&#2453;&#2507;&#2465;&#2495;&#2434; &#2472;&#2495;&#2527;&#2503; &#2453;&#2494;&#2460; &#2453;&#2480;&#2495; &#2472;&#2494;&#2404; </para>
      </note>
    </sect2>
  </sect1>

  <sect1 id="usersguide">
    <title>&#2536;. &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2476;&#2495;&#2471;&#2495;</title>

    <para> &#2479;&#2494;&#2480;&#2494; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2468;&#2503; &#2458;&#2494;&#2472;, &#2447;&#2439; &#2437;&#2434;&#2486;&#2463;&#2495; &#2468;&#2494;&#2470;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;&#2404; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455; &#2438;&#2480;&#2507; &#2476;&#2509;&#2479;&#2494;&#2474;&#2453; &#2453;&#2480;&#2494;&#2480; &#2460;&#2463;&#2495;&#2482;&#2468;&#2494; &#2472;&#2495;&#2527;&#2503; &#2447;&#2454;&#2494;&#2472;&#2503; &#2438;&#2482;&#2507;&#2458;&#2472;&#2494; &#2453;&#2480;&#2494; &#2489;&#2527;
&#2472;&#2495;&#2404; &#2468;&#2476;&#2503;, &#2479;&#2494;&#2480;&#2494; &#2447; &#2476;&#2495;&#2487;&#2527;&#2503; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480; &#2489;&#2495;&#2488;&#2503;&#2476;&#2503; &#2453;&#2494;&#2460; &#2453;&#2480;&#2468;&#2503; &#2438;&#2455;&#2509;&#2480;&#2489;&#2496;, &#2468;&#2494;&#2470;&#2503;&#2480;&#2451; &#2447;&#2439; &#2437;&#2434;&#2486;&#2463;&#2495; &#2474;&#2524;&#2494; &#2441;&#2458;&#2495;&#2468;&#2509;&#8205;&#2404; &#2447;&#2480; &#2475;&#2482;&#2503; &#2468;&#2494;&#2480;&#2494; &#2476;&#2494;&#2434;&#2482;&#2494;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455;&#2453;&#2503; &#2438;&#2480;&#2507; &#2441;&#2472;&#2509;&#2472;&#2468; &#2453;&#2480;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479;
&#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2496;&#2527; &#2474;&#2480;&#2495;&#2476;&#2503;&#2486; &#2488;&#2509;&#2469;&#2494;&#2474;&#2472; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472;&#2404; </para>

    <sect2 id="locale">
      <title>&#2536;.&#2535;. &#2476;&#2494;&#2434;&#2482;&#2494; Locale &#2488;&#2509;&#2469;&#2494;&#2474;&#2472;</title>

      <para> &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2474;&#2509;&#2480;&#2469;&#2478;&#2503; &#2438;&#2474;&#2472;&#2494;&#2453;&#2503; &#2479;&#2503; &#2453;&#2494;&#2460;&#2463;&#2495; &#2453;&#2480;&#2468;&#2503; &#2489;&#2476;&#2503; &#2468;&#2494; &#2489;&#2482; &#2476;&#2494;&#2434;&#2482;&#2494; Locale &#2488;&#2509;&#2469;&#2494;&#2474;&#2472;&#2404; &#2453;&#2507;&#2472; &#2470;&#2503;&#2486;&#2503;&#2480; &#2476;&#2495;&#2486;&#2503;&#2487; &#2488;&#2494;&#2434;&#2488;&#2509;&#2453;&#2499;&#2468;&#2495;&#2453; &#2476;&#2504;&#2486;&#2495;&#2487;&#2509;&#2463;&#2509;&#2479; &#2447;&#2476;&#2434; &#2488;&#2434;&#2486;&#2509;&#2482;&#2495;&#2487;&#2509;&#2463;
&#2453;&#2495;&#2459;&#2497; &#2486;&#2476;&#2509;&#2470;&#2503;&#2480; &#2474;&#2509;&#2480;&#2468;&#2495;&#2486;&#2476;&#2509;&#2470;&#2453;&#2503; &#2447;&#2453;&#2468;&#2509;&#2480;&#2503;&#2468;&#2509;&#2453;&#2509;&#2468;&#2448; &#2437;&#2462;&#2509;&#2458;&#2482;&#2503;&#2480; <quote>Locale</quote> &#2476;&#2482;&#2503;&#2404; &#2447;&#2439; &#2441;&#2474;-&#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470;&#2503; <filename>bn_BD</filename> &#2472;&#2494;&#2478;&#2453; Locale &#2447;&#2480; &#2460;&#2472;&#2509;&#2479;
&#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2496;&#2527; &#2475;&#2494;&#2439;&#2482; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; &#2476;&#2480;&#2509;&#2467;&#2472;&#2494; &#2453;&#2480;&#2494; &#2489;&#2527;&#2503;&#2459;&#2503; &#2479;&#2494; &#2476;&#2494;&#2434;&#2482;&#2494;&#2470;&#2503;&#2486;&#2496; &#2476;&#2494;&#2434;&#2482;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2474;&#2509;&#2480;&#2479;&#2507;&#2460;&#2509;&#2479;&#2404; &#2468;&#2476;&#2503; &#2477;&#2494;&#2480;&#2468;&#2496;&#2527; &#2476;&#2494;&#2434;&#2482;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2496;&#2527; &#2475;&#2494;&#2439;&#2482;&#2451; &#2447;&#2453;&#2439; &#2441;&#2474;&#2494;&#2527;&#2503;
&#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2503; &#2479;&#2494;&#2476;&#2503;&#2404; </para>


      <note><para> &#2447;&#2439; &#2441;&#2474;-&#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470;&#2503; Locale &#2447;&#2480; &#2460;&#2472;&#2509;&#2479; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2496;&#2527; &#2475;&#2494;&#2439;&#2482; &#2468;&#2504;&#2480;&#2495;&#2480; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; &#2476;&#2480;&#2509;&#2467;&#2472;&#2494; &#2453;&#2480;&#2494; &#2489;&#2527; &#2472;&#2495;&#2404; &#2447;&#2454;&#2494;&#2472;&#2503; &#2486;&#2497;&#2471;&#2497;&#2478;&#2494;&#2468;&#2509;&#2480; &#2476;&#2494;&#2434;&#2482;&#2494;&#2470;&#2503;&#2486;&#2496; &#2476;&#2494;&#2434;&#2482;&#2494;&#2480; Locale
&#2475;&#2494;&#2439;&#2482; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; &#2476;&#2480;&#2509;&#2467;&#2472;&#2494; &#2453;&#2480;&#2494; &#2489;&#2527;&#2503;&#2459;&#2503;&#2404; </para>
      </note>

      <para> glibc &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460;&#2503;&#2480; &#2488;&#2480;&#2509;&#2476;&#2486;&#2503;&#2487; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503; bn_BD-&#2480; &#2460;&#2472;&#2509;&#2479; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2496;&#2527; &#2475;&#2494;&#2439;&#2482; &#2470;&#2503;&#2527;&#2494; &#2469;&#2494;&#2453;&#2503;&#2404; &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2495; glibc'&#2480; &#2453;&#2507;&#2472; &#2474;&#2497;&#2480;&#2472;&#2507; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;
&#2453;&#2480;&#2503;&#2472;, &#2468;&#2476;&#2503; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2496;&#2527; &#2475;&#2494;&#2439;&#2482; Bengalinux.org &#2447;&#2480; <ulink url="http://www.bengalinux.org/downloads/">&#2465;&#2494;&#2441;&#2472;&#2482;&#2507;&#2465;</ulink> &#2437;&#2434;&#2486; &#2469;&#2503;&#2453;&#2503; &#2465;&#2494;&#2441;&#2472;&#2482;&#2507;&#2465;
&#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2472;&#2404; 
      </para>

      <caution><para>  &#2438;&#2474;&#2472;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; &#2453;&#2507;&#2472; &#2439;&#2441;&#2472;&#2495;&#2453;&#2507;&#2465; &#2447;&#2472;&#2453;&#2507;&#2465;&#2503;&#2465; &#2475;&#2472;&#2509;&#2463; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494; &#2438;&#2459;&#2503; &#2453;&#2495;&#2472;&#2494; &#2468;&#2494; &#2472;&#2495;&#2486;&#2509;&#2458;&#2495;&#2468; &#2489;&#2507;&#2472;&#2404; &#2479;&#2470;&#2495; &#2472;&#2494; &#2469;&#2494;&#2453;&#2503;, &#2468;&#2476;&#2503;
<link linkend="fonts">&#2475;&#2472;&#2509;&#2463;&#2503;&#2480; &#2451;&#2474;&#2480; &#2482;&#2495;&#2454;&#2495;&#2468; &#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470;&#2463;&#2495;</link> &#2470;&#2503;&#2454;&#2497;&#2472;&#2404;  </para>
      </caution>

      <para> &#2447;&#2454;&#2472; <systemitem class="username">Root</systemitem> &#2489;&#2495;&#2488;&#2503;&#2476;&#2503; &#2472;&#2495;&#2478;&#2509;&#2472;&#2507;&#2453;&#2509;&#2468; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2463;&#2495; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455; &#2453;&#2480;&#2497;&#2472; </para>

      <para><prompt>bash$</prompt> <userinput>localdef -f UTF-8 -i bn_BD.UTF-8</userinput></para>

      <para> &#2447;&#2480;&#2475;&#2482;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2463;&#2495; bn_BD &#2472;&#2494;&#2478;&#2453; Locale &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2441;&#2474;&#2479;&#2507;&#2455;&#2496; &#2489;&#2476;&#2503;&#2404; </para>

      <para> &#2447;&#2480;&#2474;&#2480; &#2472;&#2495;&#2486;&#2509;&#2458;&#2495;&#2468; &#2489;&#2507;&#2472; &#2479;&#2503;, &#2438;&#2474;&#2472;&#2494;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2447;&#2453;&#2509;&#2488; &#2488;&#2494;&#2480;&#2509;&#2477;&#2494;&#2480;&#2463;&#2495; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2441;&#2474;&#2479;&#2507;&#2455;&#2496; &#2453;&#2495;&#2472;&#2494;&#2404; &#2447;&#2460;&#2472;&#2509;&#2479;
<filename>/usr/X11R6/lib/X11/locale/locale.dir</filename> &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2470;&#2503;&#2454;&#2497;&#2472;&#2404; &#2447;&#2468;&#2503; &#2472;&#2495;&#2478;&#2509;&#2472;&#2503;&#2480; &#2482;&#2494;&#2439;&#2472;&#2455;&#2497;&#2482;&#2507; &#2469;&#2494;&#2453;&#2494;&#2480; &#2453;&#2469;&#2494; </para>

      <programlisting>
     en_US.UTF-8/XLC_LOCALE  bn_BD.UTF-8
     en_US.UTF-8/XLC_LOCALE:  bn_BD.UTF-8
      </programlisting>

      <para> &#2447;&#2454;&#2472; &#2438;&#2474;&#2472;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2463;&#2495; bn_BD.UTF-8 &#2472;&#2494;&#2478;&#2453; Locale &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2441;&#2474;&#2479;&#2507;&#2455;&#2496; &#2489;&#2527;&#2503;&#2459;&#2503;&#2404; &#2441;&#2470;&#2494;&#2489;&#2480;&#2467;&#2488;&#2509;&#2476;&#2480;&#2498;&#2474;, &#2438;&#2478;&#2495; &#2472;&#2495;&#2458;&#2503;&#2480; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2463;&#2495; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2503; &#2438;&#2478;&#2494;&#2480;
&#2472;&#2495;&#2460;&#2488;&#2509;&#2476; &#2477;&#2494;&#2457;&#2509;&#2455;&#2494;&#2458;&#2507;&#2480;&#2494; &#2447;&#2453;&#2463;&#2495; &#2475;&#2472;&#2509;&#2463;&#2503;&#2480; &#2488;&#2494;&#2489;&#2494;&#2479;&#2509;&#2479;&#2503; <command>xterm</command> &#2458;&#2494;&#2482;&#2494;&#2439; </para>

      <para>
        <prompt>bash$</prompt> 
        <userinput>LC_ALL=bn_BD.UTF-8 xterm -fn "-misc-Probhat-medium-r-normal--0-0-0-0-p-0-iso10646-1" -u8</userinput></para>

      <para> &#2478;&#2472;&#2503; &#2480;&#2494;&#2454;&#2476;&#2503;&#2472;, &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2495; &#2453;&#2507;&#2472; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2468;&#2503; &#2458;&#2494;&#2472;, &#2468;&#2476;&#2503; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2463;&#2495;&#2453;&#2503; bn_BD.UTF-8 &#2472;&#2494;&#2478;&#2453; Locale &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496;
&#2447;&#2472;&#2477;&#2494;&#2527;&#2480;&#2472;&#2478;&#2503;&#2472;&#2509;&#2463; &#2469;&#2503;&#2453;&#2503; &#2458;&#2494;&#2482;&#2494;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; &#2437;&#2472;&#2509;&#2479;&#2469;&#2494;&#2527; &#2468;&#2494; &#2476;&#2494;&#2434;&#2482;&#2494;&#2527; &#2453;&#2494;&#2460; &#2453;&#2480;&#2476;&#2503; &#2472;&#2494;&#2404; </para>
    </sect2>

    <sect2 id="fonts">
      <title>&#2536;.&#2536;. &#2476;&#2494;&#2434;&#2482;&#2494; &#2475;&#2472;&#2509;&#2463; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495;</title>

      <sect3 id="installing-rpm">
        <title>&#2536;.&#2536;.&#2535;. &#2438;&#2480;&#2474;&#2495;&#2447;&#2478; (RPM) &#2469;&#2503;&#2453;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2475;&#2472;&#2509;&#2463; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495;</title>

        <para> &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2495; &#2447;&#2453;&#2460;&#2472; <acronym>&#2438;&#2480;&#2474;&#2495;&#2447;&#2478;</acronym> (RPM) &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496; &#2489;&#2472;, &#2468;&#2476;&#2503; &#2475;&#2509;&#2480;&#2496; &#2476;&#2494;&#2434;&#2482;&#2494; &#2475;&#2472;&#2509;&#2463; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503;&#2480; (FBFP) &#2475;&#2472;&#2509;&#2463;&#2488;&#2478;&#2498;&#2489; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482;
&#2453;&#2480;&#2494;&#2480; &#2488;&#2476;&#2458;&#2503;&#2527;&#2503; &#2488;&#2489;&#2460; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; &#2489;&#2482; &#2475;&#2472;&#2509;&#2463;&#2503;&#2480; &#2438;&#2480;&#2474;&#2495;&#2447;&#2478; &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494;&#2404; &#2438;&#2480;&#2474;&#2495;&#2447;&#2478; &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460; &#2465;&#2494;&#2441;&#2472;&#2482;&#2507;&#2465; &#2453;&#2480;&#2494; &#2479;&#2494;&#2476;&#2503;
<ulink url="http://www.bengalinux.org/downloads/freebanglafont-0.2.-1.noarch.rpm"> 
http://www.Bengalinux.org/downloads/freebanglafont-0.2.-1.noarch.rpm </ulink> &#2437;&#2469;&#2476;&#2494;
<ulink url="http://savannah.nongnu.org/files/?group=freebanglafont"> http://savannah.nongnu.org/files/?group=freebanglafont </ulink>
&#2447;&#2439; &#2464;&#2495;&#2453;&#2494;&#2472;&#2494; &#2469;&#2503;&#2453;&#2503; &#2404; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; &#2438;&#2480;&#2474;&#2495;&#2447;&#2478; &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460; &#2479;&#2503;&#2477;&#2494;&#2476;&#2503; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2503; &#2469;&#2494;&#2453;&#2503;&#2472;, &#2475;&#2472;&#2509;&#2463;&#2503;&#2480; &#2438;&#2480;&#2474;&#2495;&#2447;&#2478;'&#2463;&#2495;&#2451; &#2447;&#2439; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2463;&#2495;&#2480; &#2488;&#2494;&#2489;&#2494;&#2479;&#2509;&#2479;&#2503; &#2488;&#2503;&#2477;&#2494;&#2476;&#2503;&#2439; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2497;&#2472;
        </para>

        <para><prompt>bash$</prompt> <userinput>rpm -ivh freebanglafont-0.2-1.noarch.rpm</userinput></para>
      </sect3>

      <sect3 id="installing-tarball">
        <title>&#2536;.&#2536;.&#2536;. &#2474;&#2499;&#2469;&#2453; &#2474;&#2499;&#2469;&#2453; &#2475;&#2472;&#2509;&#2463; &#2475;&#2494;&#2439;&#2482; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495;</title>

        <para> &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2495; &#2438;&#2480;&#2474;&#2495;&#2447;&#2478; (RPM) &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2468;&#2503; &#2437;&#2474;&#2494;&#2480;&#2455; &#2489;&#2472; &#2468;&#2476;&#2503; &#2474;&#2497;&#2480;&#2472;&#2507; &#2451; &#2453;&#2494;&#2480;&#2509;&#2479;&#2453;&#2480;&#2496; tgz &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460;&#2468;&#2507; &#2438;&#2459;&#2503;&#2439;&#2404; &#2478;&#2472;&#2503; &#2480;&#2494;&#2454;&#2476;&#2503;&#2472;, &#2447;&#2454;&#2494;&#2472;&#2503;
&#2441;&#2482;&#2509;&#2482;&#2503;&#2454;&#2495;&#2468; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2455;&#2497;&#2482;&#2507; &#2458;&#2494;&#2482;&#2494;&#2468;&#2503; &#2438;&#2474;&#2472;&#2494;&#2453;&#2503; &#2437;&#2476;&#2486;&#2509;&#2479;&#2439; Root &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496;&#2480; &#2476;&#2495;&#2486;&#2503;&#2487;&#2494;&#2471;&#2495;&#2453;&#2494;&#2480; &#2469;&#2494;&#2453;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; </para>

        <para> &#2479;&#2503;&#2488;&#2453;&#2482; &#2475;&#2494;&#2439;&#2482; &#2438;&#2474;&#2472;&#2495; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2468;&#2503; &#2458;&#2494;&#2472; &#2468;&#2494; &#2447;&#2439; &#2488;&#2494;&#2439;&#2463; &#2469;&#2503;&#2453;&#2503; &#2465;&#2494;&#2441;&#2472;&#2482;&#2507;&#2465; &#2453;&#2480;&#2503; &#2472;&#2495;&#2472; -
<ulink url="http://savannah.nongnu.org/files/?group=freebangfont">
http://savannah.nongnu.org/files/?group=freebangfont</ulink> </para>

        <note><para> &#2475;&#2509;&#2480;&#2496; &#2476;&#2494;&#2434;&#2482;&#2494; &#2475;&#2472;&#2509;&#2463; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503; (FBFP) &#2438;&#2474;&#2472;&#2495; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; tgz &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460; &#2454;&#2497;&#2433;&#2460;&#2503; &#2474;&#2494;&#2476;&#2503;&#2472;&#2404; &#2474;&#2509;&#2480;&#2468;&#2495;&#2463;&#2495;&#2468;&#2503; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2438;&#2453;&#2499;&#2468;&#2495;&#2480; &#2475;&#2472;&#2509;&#2463; &#2438;&#2459;&#2503;; &#2437;&#2480;&#2509;&#2469;&#2494;&#2468;&#2509;&#8205; &#2468;&#2494;&#2480;&#2494; &#2488;&#2476;&#2494;&#2439;
&#2447;&#2453;&#2503; &#2437;&#2474;&#2480;&#2503;&#2480; &#2469;&#2503;&#2453;&#2503; &#2477;&#2495;&#2472;&#2509;&#2472;&#2404; </para>
        </note>

        <para> &#2438;&#2474;&#2472;&#2494;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2478;&#2468; &#2488;&#2453;&#2482; &#2475;&#2494;&#2439;&#2482; &#2465;&#2494;&#2441;&#2472;&#2482;&#2507;&#2465; &#2453;&#2480;&#2497;&#2472;; &#2488;&#2478;&#2488;&#2509;&#2468; <acronym>ttf</acronym> &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507; &#2447;&#2453;&#2509;&#2488;&#2463;&#2509;&#2480;&#2509;&#2479;&#2494;&#2453;&#2509;&#2463; (Extract) &#2453;&#2480;&#2497;&#2472;&#2404; &#2478;&#2498;&#2482;&#2468;
&#2474;&#2509;&#2480;&#2468;&#2495;&#2463;&#2495; <filename>*.tgz</filename> &#2437;&#2469;&#2476;&#2494; <filename>*.tar.gz</filename> &#2475;&#2494;&#2439;&#2482;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2472;&#2495;&#2478;&#2509;&#2472;&#2507;&#2453;&#2509;&#2468; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2463;&#2495; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455; &#2453;&#2480;&#2497;&#2472; </para>

        <para><prompt>bash$</prompt> <userinput>tar zxvf your_font_package.tar.gz</userinput></para>

        <para> &#2447;&#2463;&#2495; &#2447;&#2453;&#2463;&#2495; &#2472;&#2468;&#2497;&#2472; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495; &#2468;&#2504;&#2480;&#2495; &#2453;&#2480;&#2476;&#2503; &#2479;&#2503;&#2463;&#2495;&#2468;&#2503; &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460;&#2503;&#2480; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507; &#2469;&#2494;&#2453;&#2476;&#2503;&#2404; &#2438;&#2478;&#2480;&#2494; &#2486;&#2497;&#2471;&#2497; <filename>*.ttf</filename> &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507;&#2480;
&#2474;&#2509;&#2480;&#2468;&#2495; &#2438;&#2455;&#2509;&#2480;&#2489;&#2496;&#2404;</para>

        <para> &#2447;&#2453;&#2463;&#2495; &#2472;&#2468;&#2497;&#2472; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495; &#2468;&#2504;&#2480;&#2495; &#2453;&#2480;&#2497;&#2472; &#2479;&#2503;&#2454;&#2494;&#2472;&#2503; &#2438;&#2474;&#2472;&#2495; &#2475;&#2472;&#2509;&#2463; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2476;&#2503;&#2472;&#2404; &#2447;&#2454;&#2472; &#2469;&#2503;&#2453;&#2503; &#2476;&#2494;&#2453;&#2495; &#2437;&#2434;&#2486;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2478;&#2480;&#2494; &#2471;&#2480;&#2503; &#2472;&#2495;&#2458;&#2509;&#2459;&#2495; &#2479;&#2503; &#2475;&#2472;&#2509;&#2463; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482;
&#2453;&#2480;&#2459;&#2495; <filename class="directory">/usr/X11R6/lib/X11/fonts/bengali/</filename> &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2468;&#2503;&#2404;</para>

        <para> &#2474;&#2509;&#2480;&#2468;&#2495;&#2463;&#2495; <acronym>ttf</acronym> &#2475;&#2494;&#2439;&#2482; &#2447;&#2439; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2468;&#2503; &#2453;&#2474;&#2495; &#2453;&#2480;&#2497;&#2472; &#2447;&#2476;&#2434; &#2472;&#2495;&#2478;&#2509;&#2472;&#2507;&#2453;&#2509;&#2468; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2455;&#2497;&#2482;&#2507; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455; &#2453;&#2480;&#2497;&#2472;: </para>

        <para><prompt>bash$</prompt> <userinput>cd /usr/X11R6/lib/X11/fonts/bengali/</userinput></para>
        <para><prompt>bash$</prompt> <userinput>ttmkfdir</userinput></para>
        <para><prompt>bash$</prompt> <userinput>mkfontdir</userinput></para>
        <para><prompt>bash$</prompt> <userinput>chkfontpath -q -a /usr/X11R6/lib/X11/fonts/bengali/</userinput></para>

        <para> &#2447;&#2454;&#2472; &#2438;&#2478;&#2480;&#2494; &#2472;&#2468;&#2497;&#2472; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2453;&#2503; <application>fontconfig</application> &#2447;&#2480; &#2453;&#2472;&#2475;&#2495;&#2455;&#2494;&#2480;&#2503;&#2486;&#2472;&#2503; &#2479;&#2507;&#2455; &#2453;&#2480;&#2476;&#2507;&#2404; &#2488;&#2458;&#2480;&#2494;&#2458;&#2480; &#2447;&#2439; &#2453;&#2472;&#2475;&#2495;&#2455;&#2494;&#2480;&#2503;&#2486;&#2472;
&#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2489;&#2482; <filename>/etc/fonts/fonts.conf</filename> &#2404; &#2438;&#2474;&#2472;&#2494;&#2480; &#2474;&#2459;&#2472;&#2509;&#2470;&#2478;&#2468; &#2463;&#2503;&#2453;&#2509;&#2488;&#2463; &#2447;&#2465;&#2495;&#2463;&#2480; &#2470;&#2495;&#2527;&#2503; &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2454;&#2497;&#2482;&#2497;&#2472; &#2447;&#2476;&#2434; &#2472;&#2495;&#2478;&#2509;&#2472;&#2507;&#2453;&#2509;&#2468; &#2453;&#2495;&#2459;&#2497; &#2482;&#2494;&#2439;&#2472;&#2503;&#2480; &#2478;&#2468; &#2437;&#2434;&#2486;
&#2454;&#2497;&#2433;&#2460;&#2503; &#2476;&#2503;&#2480; &#2453;&#2480;&#2497;&#2472;:</para>

        <programlisting>
          <![CDATA[
 <dir> /usr/X11R6/lib/X11/fonts/Type1 </dir>
 <dir> /usr/share/fonts/ </dir>
 <dir> ~/.fonts/ </dir>
          ]]>
        </programlisting>

        <para> &#2447;&#2454;&#2494;&#2472;&#2503; &#2472;&#2495;&#2478;&#2509;&#2472;&#2503;&#2480; &#2482;&#2494;&#2439;&#2472;&#2463;&#2495; &#2479;&#2507;&#2455; &#2453;&#2480;&#2497;&#2472; - </para>

        <programlisting>
          <![CDATA[
 <dir> /usr/X11R6/lib/X11/fonts/bengali/ </dir>
          ]]>
        </programlisting>

        <para> &#2475;&#2482;&#2503; &#2479;&#2494; &#2470;&#2494;&#2433;&#2524;&#2494;&#2476;&#2503; &#2468;&#2494; &#2489;&#2482;&#2507; - </para>

        <programlisting>
          <![CDATA[
 <dir> /usr/X11R6/lib/X11/fonts/Type1 </dir>
 <dir> /usr/share/fonts/ </dir>
 <dir> ~/.fonts/ </dir>
 <dir> /usr/X11R6/lib/X11/fonts/bengali/ </dir>
          ]]>
        </programlisting>

        <para> &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2488;&#2503;&#2477; &#2453;&#2480;&#2497;&#2472; &#2447;&#2476;&#2434; &#2472;&#2495;&#2478;&#2509;&#2472;&#2507;&#2453;&#2509;&#2468; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2463;&#2495; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455; &#2453;&#2480;&#2497;&#2472; - </para>

        <para><prompt>bash$</prompt> <userinput>fc-cache</userinput></para>

        <para> &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2494;&#2480; &#2455;&#2497;&#2489;&#2509;&#8204;&#2472;&#2507;&#2478; &#2474;&#2509;&#2480;&#2495;&#2472;&#2509;&#2463; &#2482;&#2494;&#2439;&#2476;&#2509;&#2480;&#2503;&#2480;&#2496; (<systemitem class="library">libgnomeprint</systemitem>) &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494; &#2469;&#2494;&#2453;&#2503; &#2468;&#2476;&#2503; &#2472;&#2495;&#2478;&#2509;&#2472;&#2503;&#2480;
&#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2455;&#2497;&#2482;&#2507; &#2458;&#2494;&#2482;&#2494;&#2472; - </para>

        <para><prompt>bash$</prompt> <userinput>cd /usr/X11R6/lib/X11/fonts/bengali/</userinput></para>
        <para><prompt>bash$</prompt> <userinput>libgnomeprint-2.0-font-install --dynamic</userinput></para>

        <para> &#2476;&#2509;&#2479;&#2488;, &#2447;&#2439;! &#2479;&#2503;&#2453;&#2507;&#2472; &#2488;&#2478;&#2488;&#2509;&#2479;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2460;&#2494;&#2472;&#2495;&#2527;&#2503; &#2478;&#2503;&#2439;&#2482; &#2453;&#2480;&#2497;&#2472; &#2447;&#2439; &#2464;&#2495;&#2453;&#2494;&#2472;&#2494;&#2527; <email>users@bengalinux.org</email> </para>
      </sect3>
    </sect2>

    <sect2 id="keyboard">
      <title>&#2536;.&#2537;. &#2476;&#2494;&#2434;&#2482;&#2494; &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465; &#2488;&#2509;&#2469;&#2494;&#2474;&#2472;</title>

      <para> XKB &#2488;&#2495;&#2478;&#2509;&#2476;&#2482; &#2475;&#2494;&#2439;&#2482; &#2453;&#2495; &#2476;&#2494; &#2453;&#2495;&#2477;&#2494;&#2476;&#2503; &#2472;&#2468;&#2497;&#2472; &#2482;&#2503;&#2438;&#2441;&#2463; &#2468;&#2504;&#2480;&#2495; &#2453;&#2480;&#2494; &#2489;&#2527; &#2439;&#2468;&#2509;&#2479;&#2494;&#2470;&#2495; &#2476;&#2509;&#2479;&#2494;&#2454;&#2509;&#2479;&#2494; &#2453;&#2480;&#2494; &#2447;&#2439; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471;&#2503;&#2480; &#2441;&#2470;&#2509;&#2470;&#2503;&#2486;&#2509;&#2479; <emphasis>&#2472;&#2527;</emphasis>&#2404;
&#2439;&#2472;&#2509;&#2463;&#2494;&#2480;&#2472;&#2503;&#2463;&#2503; &#2437;&#2488;&#2434;&#2454;&#2509;&#2479; &#2451;&#2527;&#2503;&#2476; &#2488;&#2494;&#2439;&#2463; &#2438;&#2459;&#2503; &#2479;&#2503;&#2454;&#2494;&#2472;&#2503; &#2479;&#2503;&#2453;&#2503;&#2441; <application>XFree86</application> &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2503; &#2438;&#2480;&#2507; &#2477;&#2494;&#2482;&#2507; &#2447;&#2476;&#2434; &#2474;&#2497;&#2457;&#2509;&#2454;&#2494;&#2472;&#2497;&#2474;&#2497;&#2457;&#2509;&#2454; &#2476;&#2495;&#2476;&#2480;&#2467;
&#2474;&#2494;&#2476;&#2503;&#2472;&#2404; </para>

      <para> &#2476;&#2494;&#2434;&#2482;&#2494; &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465; &#2488;&#2509;&#2469;&#2494;&#2474;&#2472; &#2453;&#2480;&#2494; &#2454;&#2497;&#2476;&#2439; &#2488;&#2489;&#2460;&#2404; &#2486;&#2497;&#2471;&#2497; &#2472;&#2495;&#2458;&#2503;&#2480; &#2471;&#2494;&#2474;&#2455;&#2497;&#2482;&#2507; &#2437;&#2472;&#2497;&#2488;&#2480;&#2467; &#2453;&#2480;&#2482;&#2503;&#2439; &#2489;&#2476;&#2503;&#2404; &#2472;&#2495;&#2458;&#2503; &#2479;&#2494; &#2479;&#2494; &#2476;&#2480;&#2509;&#2467;&#2472;&#2494; &#2453;&#2480;&#2494; &#2489;&#2458;&#2509;&#2459;&#2503; &#2468;&#2494;&#2480; &#2488;&#2476;&#2439; &#2438;&#2474;&#2472;&#2495; 
<ulink url="http://www.bengalinux.org/downloads/">&#2474;&#2503;&#2468;&#2503;</ulink> &#2474;&#2494;&#2480;&#2503;&#2472; Bengalinux.org &#2488;&#2494;&#2439;&#2463;&#2503;&#2404; </para>

      <caution>
        <para> &#2438;&#2474;&#2472;&#2494;&#2480; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2503; &#2439;&#2441;&#2472;&#2495;&#2453;&#2507;&#2465;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2476;&#2494;&#2434;&#2482;&#2494; &#2475;&#2472;&#2509;&#2463; &#2438;&#2459;&#2503; &#2453;&#2495;&#2472;&#2494; &#2472;&#2495;&#2486;&#2509;&#2458;&#2495;&#2468; &#2489;&#2527;&#2503; &#2472;&#2495;&#2472;&#2404; &#2479;&#2470;&#2495; &#2472;&#2494; &#2469;&#2494;&#2453;&#2503; &#2468;&#2476;&#2503; <link linkend="fonts"> &#2475;&#2472;&#2509;&#2463; &#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470; 
</link> &#2470;&#2503;&#2454;&#2503; &#2472;&#2495;&#2472;&#2404; </para>
      </caution>

      <para> XKB &#2488;&#2495;&#2478;&#2509;&#2476;&#2482; &#2475;&#2494;&#2439;&#2482; <filename>ben</filename> &#2465;&#2494;&#2441;&#2472;&#2482;&#2507;&#2465; &#2453;&#2480;&#2497;&#2472; &#2447;&#2476;&#2434; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; XKB &#2488;&#2495;&#2478;&#2509;&#2476;&#2482; &#2475;&#2494;&#2439;&#2482; &#2479;&#2503;&#2454;&#2494;&#2472;&#2503; &#2469;&#2494;&#2453;&#2503; &#2488;&#2503;&#2454;&#2494;&#2472;&#2503; &#2453;&#2474;&#2495; &#2453;&#2480;&#2497;&#2472;&#2404;
&#2488;&#2494;&#2471;&#2494;&#2480;&#2467;&#2468; &#2474;&#2494;&#2469;&#2463;&#2495; &#2489;&#2527; <filename class="directory">/usr/X11R6/lib/X11/xkb/symbols/</filename> </para>

      <note><para> &#2486;&#2497;&#2471;&#2497;&#2478;&#2494;&#2468;&#2509;&#2480; Root &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496; &#2447;&#2439; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2468;&#2503; &#2475;&#2494;&#2439;&#2482; &#2453;&#2474;&#2495; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2404; </para></note>

      <para> &#2476;&#2494;&#2434;&#2482;&#2494; &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2469;&#2503;&#2453;&#2503; &#2438;&#2474;&#2472;&#2495; &#2438;&#2480; &#2478;&#2494;&#2468;&#2509;&#2480; &#2447;&#2453;&#2463;&#2495; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465; &#2470;&#2498;&#2480;&#2503; &#2438;&#2459;&#2503;&#2472;&#2404; &#2438;&#2478;&#2495; &#2438;&#2478;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; &#2472;&#2495;&#2458;&#2503;&#2480; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2463;&#2495; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2495;: </para>

      <para><prompt>bash$</prompt> <userinput>setxkbmap -symbols "us(pc101)+ben+group(ctrl_shift_toggle)"</userinput></para>

      <para> &#2454;&#2497;&#2476; &#2488;&#2478;&#2509;&#2477;&#2476;&#2468; &#2438;&#2474;&#2472;&#2494;&#2453;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; <option>-symbols</option> &#2437;&#2474;&#2486;&#2472;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2477;&#2495;&#2472;&#2509;&#2472; &#2453;&#2507;&#2472; &#2478;&#2494;&#2472; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; &#2438;&#2478;&#2495; &#2447;&#2455;&#2497;&#2482;&#2507;&#2480;
&#2437;&#2480;&#2509;&#2469; &#2476;&#2497;&#2461;&#2495;&#2527;&#2503; &#2470;&#2495;&#2458;&#2509;&#2459;&#2495;&#2404; &#2468;&#2454;&#2472; &#2438;&#2474;&#2472;&#2495; &#2472;&#2495;&#2460;&#2503;&#2439; &#2438;&#2474;&#2472;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2478;&#2494;&#2472;&#2463;&#2495; &#2453;&#2495; &#2489;&#2476;&#2503; &#2468;&#2494; &#2472;&#2495;&#2480;&#2509;&#2471;&#2494;&#2480;&#2467; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472;&#2404; &#2447;&#2453;&#2509;&#2488; &#2441;&#2439;&#2472;&#2509;&#2465;&#2507;'&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2478;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503;&#2480; &#2465;&#2495;&#2475;&#2482;&#2509;&#2463;
&#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465; &#2489;&#2458;&#2509;&#2459;&#2503; <literal>us(pc101)</literal>&#2404; &#2438;&#2474;&#2472;&#2495; &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2494;&#2480; &#2465;&#2495;&#2475;&#2482;&#2509;&#2463; &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465;&#2503;&#2480; &#2472;&#2494;&#2478; &#2472;&#2494; &#2460;&#2494;&#2472;&#2503;&#2472; &#2468;&#2476;&#2503; <filename>XF86Config</filename> &#2475;&#2494;&#2439;&#2482;&#2463;&#2495;
&#2454;&#2497;&#2482;&#2503; &#2470;&#2503;&#2454;&#2503; &#2472;&#2495;&#2472;&#2404; &#2479;&#2503;&#2489;&#2503;&#2468;&#2497; &#2536;&#2527; &#2455;&#2509;&#2480;&#2497;&#2474;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465; &#2482;&#2503;&#2438;&#2441;&#2463; &#2476;&#2482;&#2494; &#2438;&#2459;&#2503;, &#2438;&#2478;&#2480;&#2494; &#2486;&#2497;&#2471;&#2497; <filename>ben</filename> &#2469;&#2503;&#2453;&#2503; &#2474;&#2480;&#2476;&#2480;&#2509;&#2468;&#2496; &#2437;&#2434;&#2486; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465;
&#2482;&#2503;&#2438;&#2441;&#2463;&#2503; &#2488;&#2434;&#2479;&#2507;&#2460;&#2472; &#2453;&#2480;&#2476;&#2507;&#2404; &#2447;&#2454;&#2472; &#2438;&#2474;&#2472;&#2495; &#2438;&#2474;&#2472;&#2494;&#2480; &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465;&#2463;&#2495;&#2480; &#2474;&#2509;&#2480;&#2469;&#2478; &#2455;&#2509;&#2480;&#2497;&#2474; &#2489;&#2495;&#2488;&#2503;&#2476;&#2503; <literal>us(pc101)</literal> &#2447;&#2476;&#2434; &#2536;&#2527; &#2455;&#2509;&#2480;&#2497;&#2474; &#2489;&#2495;&#2488;&#2503;&#2476;&#2503; <literal>ben</literal>
&#2472;&#2495;&#2480;&#2509;&#2471;&#2494;&#2480;&#2467; &#2453;&#2480;&#2503;&#2459;&#2503;&#2472;&#2404; &#2447;&#2480; &#2437;&#2480;&#2509;&#2469; &#2453;&#2495; ? &#2488;&#2489;&#2460; &#2477;&#2494;&#2487;&#2494;&#2527;: &#2447;&#2453;&#2509;&#2488; &#2441;&#2439;&#2472;&#2509;&#2465;&#2507;&#2468;&#2503; &#2438;&#2474;&#2472;&#2495; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2455;&#2509;&#2480;&#2497;&#2474;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2482;&#2503;&#2438;&#2441;&#2463; &#2480;&#2494;&#2454;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2472;&#2404; &#2479;&#2503;&#2453;&#2507;&#2472; &#2488;&#2478;&#2527; &#2447;&#2439; &#2482;&#2503;&#2438;&#2441;&#2463;&#2455;&#2497;&#2482;&#2507;&#2480; &#2479;&#2503;&#2453;&#2507;&#2472;
&#2447;&#2453;&#2463;&#2495;&#2453;&#2503; &#2476;&#2503;&#2459;&#2503; &#2472;&#2503;&#2451;&#2527;&#2494; &#2479;&#2494;&#2527;&#2404; &#2447;&#2460;&#2472;&#2509;&#2479;&#2439; &#2438;&#2478;&#2480;&#2494; &#2479;&#2507;&#2455; &#2453;&#2480;&#2503;&#2459;&#2495;&#2482;&#2494;&#2478; <quote>group(ctrl_shift_toggle)</quote> &#2479;&#2494;&#2480; &#2478;&#2494;&#2472;&#2503; &#2489;&#2482; &#2438;&#2474;&#2472;&#2495; &#2479;&#2503;&#2453;&#2507;&#2472; &#2488;&#2478;&#2527;
<keycombo><keycap>Ctrl</keycap><keycap>Shift</keycap></keycombo> &#2476;&#2494;&#2463;&#2472; &#2447;&#2453;&#2488;&#2494;&#2469;&#2503; &#2458;&#2503;&#2474;&#2503; &#2470;&#2497;&#2463;&#2507; &#2455;&#2509;&#2480;&#2497;&#2474;&#2503;&#2480; &#2447;&#2453;&#2463;&#2495;&#2453;&#2503; &#2476;&#2503;&#2459;&#2503; &#2472;&#2495;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472;&#2404;
&#2438;&#2488;&#2482; &#2453;&#2469;&#2494; &#2489;&#2482; - Toggle Swith &#2447;&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2480;&#2507; &#2437;&#2472;&#2503;&#2453; &#2437;&#2474;&#2486;&#2472; &#2438;&#2459;&#2503;&#2404; &#2479;&#2470;&#2495; &#2438;&#2474;&#2472;&#2494;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; XFree86 &#2479;&#2469;&#2503;&#2487;&#2509;&#2463; &#2472;&#2468;&#2497;&#2472; &#2472;&#2494; &#2489;&#2527;, &#2468;&#2476;&#2503; &#2438;&#2474;&#2472;&#2495; &#2479;&#2503; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2468;&#2503;
<filename>ben</filename> &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2453;&#2474;&#2495; &#2453;&#2480;&#2503;&#2459;&#2503;&#2472; &#2488;&#2503;&#2454;&#2494;&#2472;&#2503;&#2439; <filename>group</filename> &#2472;&#2494;&#2478;&#2503; &#2447;&#2453;&#2463;&#2495; &#2475;&#2494;&#2439;&#2482; &#2454;&#2497;&#2433;&#2460;&#2503; &#2474;&#2494;&#2476;&#2503;&#2472;&#2404; &#2479;&#2470;&#2495; &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2472;&#2494; &#2469;&#2494;&#2453;&#2503;
&#2468;&#2476;&#2503; &#2441;&#2470;&#2509;&#2476;&#2495;&#2455;&#2509;&#2472; &#2489;&#2451;&#2527;&#2494;&#2480; &#2453;&#2507;&#2472; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472; &#2472;&#2503;&#2439;&#2404; &#2438;&#2474;&#2472;&#2495; &#2447;&#2453;&#2463;&#2495; &#2437;&#2474;&#2486;&#2472; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2472;, &#2479;&#2503;&#2478;&#2472;: <quote>grp:shift_toggle</quote> &#2479;&#2494;&#2480; &#2475;&#2482;&#2503; &#2470;&#2497;&#2463;&#2507;
<keycap>Shift</keycap> &#2476;&#2494;&#2463;&#2472; &#2458;&#2503;&#2474;&#2503;&#2439; &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465; &#2482;&#2503;&#2438;&#2441;&#2463; &#2474;&#2480;&#2495;&#2476;&#2480;&#2509;&#2468;&#2472; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472;&#2404; &#2475;&#2482;&#2503; &#2447;&#2454;&#2472; &#2438;&#2474;&#2472;&#2494;&#2480; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465; &#2489;&#2476;&#2503;: </para>

      <para><prompt>bash$</prompt> <userinput>sexxkbmap -symbols "us(pc101)+ben" -option "grp:shift_toggle"</userinput></para>
    </sect2>

    <sect2 id="Bangla-Application">
      <title>&#2536;.&#2538;. &#2476;&#2495;&#2486;&#2503;&#2487; &#2453;&#2495;&#2459;&#2497; &#2476;&#2494;&#2434;&#2482;&#2494; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;</title>

      <sect3 id="lekho">
        <title>&#2536;.&#2538;.&#2535;. &#2482;&#2503;&#2454; (Lekho)</title>

        <para> '&#2482;&#2503;&#2454;' &#2447;&#2453;&#2463;&#2495; &#2463;&#2503;&#2453;&#2509;&#2488;&#2463; &#2447;&#2465;&#2495;&#2463;&#2480; &#2479;&#2494; &#2470;&#2495;&#2527;&#2503; &#2453;&#2507;&#2472; &#2439;&#2441;&#2472;&#2495;&#2453;&#2507;&#2465;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2476;&#2494;&#2434;&#2482;&#2494; &#2475;&#2472;&#2509;&#2463; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2472;&#2494; &#2453;&#2480;&#2503;&#2439; &#2476;&#2494;&#2434;&#2482;&#2494; &#2475;&#2494;&#2439;&#2482; &#2468;&#2504;&#2480;&#2495; &#2453;&#2480;&#2494; &#2479;&#2494;&#2527;&#2404; </para>

        <note><para> &#2447;&#2439; &#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470;&#2463;&#2495; &#2453;&#2454;&#2472;&#2507;&#2439; '&#2482;&#2503;&#2454;'-&#2447;&#2480; &#2488;&#2478;&#2509;&#2474;&#2498;&#2480;&#2509;&#2467; &#2468;&#2469;&#2509;&#2479;&#2472;&#2495;&#2480;&#2509;&#2470;&#2503;&#2486;&#2495;&#2453;&#2494; &#2472;&#2527;&#2404; &#2454;&#2497;&#2476; &#2476;&#2503;&#2486;&#2495; &#2489;&#2482;&#2503; &#2447;&#2463;&#2495;&#2453;&#2503; &#2447;&#2480; &#2477;&#2498;&#2478;&#2495;&#2453;&#2494; &#2476;&#2482;&#2494; &#2479;&#2503;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2404; &#2447;&#2439; &#2437;&#2434;&#2486;&#2503;&#2480; &#2474;&#2509;&#2480;&#2471;&#2494;&#2472;
&#2441;&#2470;&#2509;&#2470;&#2503;&#2486;&#2509;&#2479; &#2438;&#2474;&#2472;&#2494;&#2453;&#2503; &#2447;&#2439; &#2437;&#2488;&#2494;&#2471;&#2494;&#2480;&#2467; &#2447;&#2465;&#2495;&#2463;&#2480;&#2463;&#2495;&#2480; &#2441;&#2474;&#2488;&#2509;&#2469;&#2495;&#2468;&#2495; &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2503; &#2437;&#2476;&#2455;&#2468; &#2453;&#2480;&#2494;&#2404; &#2479;&#2503;&#2453;&#2507;&#2472; &#2476;&#2509;&#2479;&#2494;&#2474;&#2494;&#2480;&#2503;&#2439; '&#2482;&#2503;&#2454;' &#2488;&#2478;&#2509;&#2474;&#2480;&#2509;&#2453;&#2495;&#2468; &#2478;&#2498;&#2482; &#2468;&#2469;&#2509;&#2479;&#2488;&#2498;&#2468;&#2509;&#2480; &#2489;&#2482; &#2447;&#2480; &#2451;&#2527;&#2503;&#2476; &#2488;&#2494;&#2439;&#2463; &#2437;&#2469;&#2476;&#2494; '&#2482;&#2503;&#2454;'&#2480;
&#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460; &#2465;&#2495;&#2488;&#2509;&#2463;&#2509;&#2480;&#2495;&#2476;&#2495;&#2441;&#2486;&#2472;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503; &#2474;&#2509;&#2480;&#2470;&#2468;&#2509;&#2468; &#2465;&#2453;&#2497;&#2478;&#2503;&#2472;&#2509;&#2463;&#2503;&#2486;&#2472;&#2404; </para>
        </note>

        <para> &#2438;&#2474;&#2472;&#2495; <application>&#2482;&#2503;&#2454;</application> &#2470;&#2509;&#2476;&#2494;&#2480;&#2494; &#2441;&#2474;&#2453;&#2499;&#2468; &#2489;&#2476;&#2503;&#2472; &#2479;&#2470;&#2495; - </para>

        <itemizedlist>
          <listitem>
            <para> &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2496;&#2527; Locale, &#2451;&#2474;&#2503;&#2472;&#2463;&#2494;&#2439;&#2474; &#2475;&#2472;&#2509;&#2463;, &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465; &#2439;&#2468;&#2509;&#2479;&#2494;&#2470;&#2495; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2478;&#2468; &#2479;&#2469;&#2503;&#2487;&#2509;&#2463; &#2441;&#2468;&#2509;&#8205;&#2488;&#2494;&#2489; &#2476;&#2494; &#2488;&#2478;&#2527; &#2438;&#2474;&#2472;&#2494;&#2480; &#2472;&#2494; &#2469;&#2494;&#2453;&#2503;&#2404; </para>
          </listitem>

          <listitem>
            <para> &#2476;&#2480;&#2509;&#2468;&#2478;&#2494;&#2472;&#2503; &#2438;&#2474;&#2472;&#2495; &#2479;&#2503; &#2455;&#2497;&#2489;&#2509;&#8204;&#2472;&#2507;&#2478; (GNOME) &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2459;&#2503;&#2472; &#2468;&#2494;&#2480; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; &#2536;.&#2534; &#2489;&#2468;&#2503; &#2474;&#2497;&#2480;&#2507;&#2472;&#2507;&#2404; </para>
          </listitem>

          <listitem>
            <para> &#2438;&#2474;&#2472;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; &#2438;&#2470;&#2508; GTK+ &#2472;&#2503;&#2439;&#2404; </para>
          </listitem>

          <listitem>
            <para> Bangtex &#2478;&#2509;&#2479;&#2494;&#2453;&#2509;&#2480;&#2507; &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2482;&#2503;&#2454;&#2494;&#2453;&#2503; &#2482;&#2503;&#2463;&#2503;&#2453;&#2509;&#2488; (Latex) &#2447; &#2480;&#2498;&#2474;&#2494;&#2472;&#2509;&#2468;&#2480; &#2453;&#2480;&#2468;&#2503; &#2458;&#2494;&#2472;&#2404; </para>
          </listitem>
        </itemizedlist>

        <para> <application>&#2482;&#2503;&#2454;</application>'&#2480; &#2453;&#2495;&#2459;&#2497; &#2478;&#2498;&#2482; &#2476;&#2504;&#2486;&#2495;&#2487;&#2509;&#2463;&#2509;&#2479; &#2472;&#2495;&#2478;&#2509;&#2472;&#2480;&#2498;&#2474; - </para>

        <itemizedlist>
          <listitem>
            <para> &#2453;&#2496;&#2476;&#2507;&#2480;&#2509;&#2465; &#2482;&#2503;&#2438;&#2441;&#2463;: &#2471;&#2509;&#2476;&#2472;&#2495; &#2472;&#2495;&#2480;&#2509;&#2477;&#2480; (&#2479;&#2503;&#2478;&#2472;, &#2453;=K, &#2454;=kh &#2439;&#2468;&#2509;&#2479;&#2494;&#2470;&#2495;) </para>
          </listitem>

          <listitem>
            <para> &#2475;&#2472;&#2509;&#2463; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; - &#2438;&#2470;&#2480;&#2509;&#2486;&#2482;&#2495;&#2474;&#2495; (Adarshalipi) </para>
          </listitem>
 
          <listitem>
            <para> &#2475;&#2494;&#2439;&#2482; &#2488;&#2434;&#2480;&#2453;&#2509;&#2487;&#2467; &#2453;&#2480;&#2494; &#2479;&#2494;&#2527; - UTF-8, UTF-16, ISO-8859-1 &#2476;&#2495;&#2472;&#2509;&#2479;&#2494;&#2488; &#2437;&#2472;&#2497;&#2488;&#2494;&#2480;&#2503; </para>
          </listitem>

          <listitem>
            <para> &#2475;&#2494;&#2439;&#2482; &#2480;&#2498;&#2474;&#2494;&#2472;&#2509;&#2468;&#2480; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503; - HTML, Bangtex &#2447; </para>
          </listitem>

          <listitem>
            <para> &#2476;&#2480;&#2509;&#2468;&#2478;&#2494;&#2472; &#2437;&#2476;&#2488;&#2509;&#2469;&#2494; - &#2476;&#2503;&#2463;&#2494; (Beta) </para>
          </listitem>

          <listitem>
            <para> &#2488;&#2489;&#2494;&#2527;&#2468;&#2494; - &#2478;&#2503;&#2439;&#2482;&#2495;&#2434; &#2482;&#2495;&#2488;&#2509;&#2463;&#2503;&#2480; &#2478;&#2494;&#2471;&#2509;&#2479;&#2478;&#2503; </para>
          </listitem>
        </itemizedlist>

        <para> &#2482;&#2503;&#2454;'&#2480; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2474;&#2509;&#2480;&#2453;&#2509;&#2480;&#2495;&#2527;&#2494; &#2472;&#2495;&#2478;&#2509;&#2472;&#2480;&#2498;&#2474; - </para>

        <orderedlist>
          <listitem>
            <para> &#2482;&#2503;&#2454;'&#2480; &#2451;&#2527;&#2503;&#2476; &#2488;&#2494;&#2439;&#2463; <ulink url="http://www.lekho.sourceforge.net/"> http://www.lekho.sourceforge.net/ </ulink> &#2469;&#2503;&#2453;&#2503;
&#2447;&#2465;&#2495;&#2463;&#2480;&#2463;&#2495;&#2480; &#2488;&#2480;&#2509;&#2476;&#2486;&#2503;&#2487; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; &#2465;&#2494;&#2441;&#2472;&#2482;&#2507;&#2465; &#2453;&#2480;&#2497;&#2472;&#2404; &#2486;&#2507;&#2472;&#2494;&#2458;&#2509;&#2459;&#2503; &#2479;&#2503;, &#2437;&#2482;&#2509;&#2474;&#2470;&#2495;&#2472;&#2503;&#2480; &#2477;&#2503;&#2468;&#2503;&#2480;&#2503;&#2439; &#2482;&#2503;&#2454;'&#2480; RPM &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; &#2474;&#2509;&#2480;&#2453;&#2494;&#2486; &#2453;&#2480;&#2494; &#2489;&#2476;&#2503;&#2404; &#2438;&#2474;&#2472;&#2495; &#2479;&#2454;&#2472; &#2447;&#2439; &#2482;&#2503;&#2454;&#2494;&#2463;&#2495; &#2474;&#2524;&#2459;&#2503;&#2472;
&#2468;&#2454;&#2472; &#2489;&#2527;&#2468;&#2507; RPM'&#2463;&#2495; &#2474;&#2509;&#2480;&#2453;&#2494;&#2486;&#2495;&#2468; &#2489;&#2527;&#2503; &#2455;&#2495;&#2527;&#2503;&#2459;&#2503;&#2404; &#2488;&#2497;&#2468;&#2480;&#2494;&#2434; &#2438;&#2474;&#2472;&#2495; &#2479;&#2470;&#2495; RPM &#2447;&#2480; &#2477;&#2453;&#2509;&#2468; &#2489;&#2472;, &#2468;&#2476;&#2503; &#2437;&#2472;&#2497;&#2455;&#2509;&#2480;&#2489; &#2453;&#2480;&#2503; &#2451;&#2527;&#2503;&#2476; &#2488;&#2494;&#2439;&#2463;&#2503; &#2454;&#2507;&#2433;&#2460; &#2453;&#2480;&#2497;&#2472;&#2404; &#2447;&#2454;&#2472; &#2463;&#2494;&#2480;&#2476;&#2482;&#2463;&#2495; (tarball)
&#2438;&#2472;&#2463;&#2494;&#2480; (Untar) &#2453;&#2480;&#2497;&#2472;: </para>

            <para><prompt>bash$</prompt> <userinput>tar xfz Lekho.tar.gz</userinput></para>
          </listitem>

          <listitem>
            <para> &#2482;&#2503;&#2454;'&#2480; &#2488;&#2507;&#2480;&#2509;&#2488; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2468;&#2503; &#2479;&#2494;&#2472; &#2447;&#2476;&#2434; &#2474;&#2509;&#2480;&#2469;&#2494;&#2455;&#2468; &#2441;&#2474;&#2494;&#2527;&#2503; &#2453;&#2478;&#2509;&#2474;&#2494;&#2439;&#2482;&#2503;&#2486;&#2472; &#2451; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482;&#2503;&#2486;&#2472; &#2488;&#2478;&#2509;&#2474;&#2472;&#2509;&#2472; &#2453;&#2480;&#2497;&#2472;: </para>

            <para><prompt>bash$</prompt> <userinput>./configure</userinput></para>
            <para><prompt>bash$</prompt> <userinput>make</userinput></para>
            <para><prompt>bash$</prompt> <userinput>make install</userinput></para>
          </listitem>

          <listitem>
            <para> 'make install' &#2486;&#2503;&#2487; &#2489;&#2451;&#2527;&#2494;&#2480; &#2474;&#2480;&#2474;&#2480; &#2438;&#2470;&#2480;&#2509;&#2486;&#2482;&#2495;&#2474;&#2495; (Adarshalipi) &#2475;&#2472;&#2509;&#2463;&#2488;&#2478;&#2498;&#2489; &#2447;&#2453;&#2463;&#2495; &#2477;&#2495;&#2472;&#2509;&#2472; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2468;&#2503; &#2453;&#2474;&#2495; &#2453;&#2480;&#2494; &#2489;&#2527; &#2447;&#2476;&#2434; &#2447;&#2439; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2495;&#2480;&#2495;&#2480; &#2472;&#2494;&#2478;
&#2460;&#2494;&#2472;&#2494;&#2472;&#2507; &#2489;&#2527;&#2404; &#2447;&#2454;&#2472; &#2438;&#2474;&#2472;&#2494;&#2480; &#2475;&#2472;&#2509;&#2463;&#2474;&#2494;&#2469;-&#2447; &#2447;&#2439; &#2465;&#2495;&#2480;&#2503;&#2453;&#2509;&#2463;&#2480;&#2495;&#2463;&#2495; &#2479;&#2507;&#2455; &#2453;&#2480;&#2497;&#2472;&#2404; &#2438;&#2474;&#2472;&#2495; XFree86 &#2447;&#2480; &#2453;&#2507;&#2472; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;&#2463;&#2495; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2503;&#2459;&#2503;&#2472; &#2468;&#2494;&#2480; &#2451;&#2474;&#2480; &#2472;&#2495;&#2480;&#2509;&#2477;&#2480; &#2453;&#2480;&#2503; &#2475;&#2472;&#2509;&#2463;
&#2439;&#2472;&#2488;&#2509;&#2463;&#2482; &#2453;&#2480;&#2494;&#2480; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2441;&#2474;&#2494;&#2527; &#2438;&#2459;&#2503;&#2404; &#2447; &#2476;&#2509;&#2479;&#2494;&#2474;&#2494;&#2480;&#2503; &#2476;&#2495;&#2488;&#2509;&#2468;&#2494;&#2480;&#2495;&#2468; &#2460;&#2494;&#2472;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2482;&#2503;&#2454;'&#2480; &#2465;&#2453;&#2497;&#2478;&#2503;&#2472;&#2509;&#2463;&#2503;&#2486;&#2472; &#2470;&#2503;&#2454;&#2497;&#2472;&#2404; </para>
          </listitem>
        </orderedlist> 
 
        <para> &#2479;&#2470;&#2495;&#2451; '&#2482;&#2503;&#2454;' &#2447;&#2454;&#2472;&#2507; &#2468;&#2504;&#2480;&#2495;&#2480; &#2474;&#2480;&#2509;&#2479;&#2494;&#2527;&#2503; &#2480;&#2527;&#2503;&#2459;&#2503; &#2468;&#2476;&#2497;&#2451; &#2438;&#2478;&#2495; &#2478;&#2472;&#2503; &#2453;&#2480;&#2495; &#2479;&#2503;, &#2437;&#2471;&#2495;&#2453;&#2494;&#2434;&#2486; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472; &#2478;&#2503;&#2463;&#2494;&#2472;&#2507;&#2480; &#2478;&#2468; &#2479;&#2469;&#2503;&#2487;&#2509;&#2463; &#2488;&#2497;&#2479;&#2507;&#2455;-&#2488;&#2497;&#2476;&#2495;&#2471;&#2494; &#2447;&#2439;
&#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478;&#2463;&#2495;&#2468;&#2503; &#2439;&#2468;&#2495;&#2478;&#2471;&#2509;&#2479;&#2503;&#2439; &#2480;&#2527;&#2503;&#2459;&#2503;&#2404; </para>
      </sect3>
    </sect2>
  </sect1>

  <sect1 id="devguide">
    <title>&#2537;. &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480;&#2503;&#2480; &#2488;&#2489;&#2494;&#2527;&#2495;&#2453;&#2494;</title>

    <para> &#2447;&#2439; &#2437;&#2434;&#2486;&#2463;&#2495; &#2478;&#2498;&#2482;&#2468; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480;&#2470;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;&#2503;&#2404; &#2438;&#2455;&#2509;&#2480;&#2489;&#2496; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496;&#2480;&#2494;&#2451; &#2447;&#2463;&#2495; &#2474;&#2524;&#2503; &#2441;&#2474;&#2453;&#2499;&#2468; &#2489;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2404; &#2468;&#2476;&#2503; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480;&#2470;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2476;&#2480;&#2509;&#2468;&#2496; &#2437;&#2471;&#2509;&#2479;&#2494;&#2527; (&#2453;&#2495;&#2477;&#2494;&#2476;&#2503;
&#2476;&#2494;&#2434;&#2482;&#2494; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478; &#2488;&#2503;&#2463; &#2438;&#2474; &#2453;&#2480;&#2494; &#2489;&#2527;) &#2469;&#2503;&#2453;&#2503; &#2474;&#2524;&#2494; &#2486;&#2497;&#2480;&#2497; &#2453;&#2480;&#2494; &#2441;&#2458;&#2495;&#2468;&#2404; </para>

    <sect2>
      <title>&#2537;.&#2535;. &#2488;&#2494;&#2471;&#2494;&#2480;&#2467; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2478;&#2503;&#2472;&#2509;&#2463; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495;</title>

      <para> <ulink url="http://www.bengalinux.org">www.Bengalinux.org</ulink> &#2451;&#2527;&#2503;&#2476; &#2488;&#2494;&#2439;&#2463;&#2463;&#2495; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2478;&#2503;&#2472;&#2509;&#2463; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503;&#2480; &#2478;&#2498;&#2482; &#2488;&#2494;&#2439;&#2463;&#2404; &#2447;&#2439;
&#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;&#2503; &#2438;&#2478;&#2480;&#2494; FLOSS &#2478;&#2465;&#2503;&#2482; &#2437;&#2472;&#2497;&#2488;&#2494;&#2480;&#2503; &#2453;&#2494;&#2460; &#2453;&#2480;&#2503; &#2479;&#2494;&#2458;&#2509;&#2459;&#2495;&#2404; &#2438;&#2474;&#2472;&#2495; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480; &#2489;&#2495;&#2488;&#2503;&#2476;&#2503; <acronym>&#2488;&#2495;&#2477;&#2495;&#2447;&#2488;</acronym> (CVS), &#2486;&#2503;&#2482;,
<acronym>&#2447;&#2488;&#2488;&#2495;&#2474;&#2495;</acronym> (scp), &#2439;-&#2478;&#2503;&#2439;&#2482; &#2482;&#2495;&#2488;&#2509;&#2463; &#2474;&#2509;&#2480;&#2477;&#2499;&#2468;&#2495; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2496;&#2527; &#2463;&#2497;&#2482; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472;&#2404; &#2438;&#2474;&#2472;&#2495; &#2479;&#2470;&#2495; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2453;&#2494;&#2460;&#2503;&#2480; &#2474;&#2509;&#2480;&#2468;&#2495; &#2438;&#2455;&#2509;&#2480;&#2489;&#2496; &#2489;&#2472;, &#2468;&#2476;&#2503;
&#2438;&#2474;&#2472;&#2494;&#2480; &#2479;&#2503; &#2453;&#2507;&#2472; &#2480;&#2453;&#2478;&#2503;&#2480; &#2488;&#2494;&#2489;&#2494;&#2479;&#2509;&#2479;, &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479;, &#2447;&#2476;&#2434; &#2474;&#2480;&#2494;&#2478;&#2480;&#2509;&#2486; &#2488;&#2476; &#2488;&#2478;&#2527;&#2439; &#2453;&#2494;&#2478;&#2509;&#2479;&#2404; &#2479;&#2507;&#2455;&#2494;&#2479;&#2507;&#2455;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;&#2503; <email>core@bengalinux.org</email>-&#2447; &#2439;-&#2478;&#2503;&#2439;&#2482; &#2453;&#2480;&#2497;&#2472;&#2404;
      </para>

      <para> &#2447;&#2453;&#2460;&#2472; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480;&#2453;&#2503; &#2437;&#2476;&#2486;&#2509;&#2479;&#2439; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503;&#2480; &#2439;-&#2478;&#2503;&#2439;&#2482; &#2482;&#2495;&#2488;&#2509;&#2463;&#2503;&#2480; &#2488;&#2470;&#2488;&#2509;&#2479; &#2489;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; &#2476;&#2495;&#2488;&#2509;&#2468;&#2494;&#2480;&#2495;&#2468; &#2468;&#2469;&#2509;&#2479;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;&#2503; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; 
<ulink url="http://www.bengalinux.org/projects/">&#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474; &#2488;&#2494;&#2439;&#2463;&#2463;&#2495;</ulink> &#2470;&#2503;&#2454;&#2497;&#2472;&#2404; 
      </para>

      <para> &#2439;-&#2478;&#2503;&#2439;&#2482; &#2482;&#2495;&#2488;&#2509;&#2463;&#2503; &#2479;&#2507;&#2455;&#2494;&#2479;&#2507;&#2455;&#2503;&#2480; &#2488;&#2478;&#2527;&#2503; &#2488;&#2494;&#2471;&#2494;&#2480;&#2467; &#2472;&#2503;&#2463;&#2495;&#2453;&#2507;&#2527;&#2503;&#2463; (netiquette) &#2476;&#2494; &#2477;&#2470;&#2509;&#2480;&#2468;&#2494; &#2476;&#2460;&#2494;&#2527; &#2480;&#2494;&#2454;&#2497;&#2472;&#2404; &#2470;&#2527;&#2494; &#2453;&#2480;&#2503; HTML-&#2447; &#2439;-&#2478;&#2503;&#2439;&#2482; &#2474;&#2494;&#2464;&#2494;&#2476;&#2503;&#2472; &#2472;&#2494;&#2404;
      </para>
    </sect2>

    <sect2>
      <title>&#2537;.&#2536;. &#2474;&#2498;&#2480;&#2509;&#2476;&#2486;&#2480;&#2509;&#2468;</title>

      <itemizedlist>
        <listitem><para> &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494; &#2482;&#2503;&#2454;&#2494; &#2447;&#2476;&#2434; &#2474;&#2524;&#2494;&#2480; &#2470;&#2453;&#2509;&#2487;&#2468;&#2494;&#2404; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2494;&#2453;&#2480;&#2467;&#2503;&#2480; &#2472;&#2509;&#2479;&#2497;&#2472;&#2468;&#2478; &#2460;&#2509;&#2462;&#2494;&#2472; &#2438;&#2476;&#2486;&#2509;&#2479;&#2453;&#2404; </para> </listitem>
        
        <listitem><para> &#2439;&#2441;&#2472;&#2495;&#2453;&#2507;&#2465; &#2441;&#2474;&#2479;&#2507;&#2455;&#2496; &#2476;&#2494;&#2434;&#2482;&#2494; &#2447;&#2465;&#2495;&#2463;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2437;&#2477;&#2495;&#2460;&#2509;&#2462;&#2468;&#2494;&#2404; (Proprietary &#2447;&#2465;&#2495;&#2463;&#2480;&#2503;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2455;&#2509;&#2480;&#2489;&#2467;&#2479;&#2507;&#2455;&#2509;&#2479; &#2472;&#2527;&#2404; ) </para></listitem>
  
        <listitem><para> (&#2437;&#2468;&#2509;&#2479;&#2494;&#2476;&#2486;&#2509;&#2479;&#2453; &#2472;&#2527;) - l10n &#2488;&#2478;&#2472;&#2509;&#2471;&#2503; &#2471;&#2494;&#2480;&#2467;&#2494;&#2404; &#2476;&#2495;&#2488;&#2509;&#2468;&#2494;&#2480;&#2495;&#2468; &#2468;&#2469;&#2509;&#2479;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; <application>GNU gettext</application> &#2447;&#2480; &#2439;&#2472;&#2475;&#2507; (Info)
&#2474;&#2494;&#2468;&#2494; &#2470;&#2503;&#2454;&#2497;&#2472;&#2404; </para>
        </listitem>
  
        <listitem><para> FLOSS- &#2447;&#2480; &#2478;&#2498;&#2482;&#2472;&#2496;&#2468;&#2495; &#2437;&#2472;&#2497;&#2488;&#2494;&#2480;&#2503; &#2453;&#2494;&#2460; &#2453;&#2480;&#2494;&#2480; &#2439;&#2458;&#2509;&#2459;&#2494; &#2438;&#2476;&#2486;&#2509;&#2479;&#2453;&#2404; </para></listitem>
      </itemizedlist>
    </sect2>

    <sect2>
      <title>&#2537;.&#2537;. &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453;&#2503;&#2480; &#2488;&#2489;&#2494;&#2527;&#2495;&#2453;&#2494;</title>

      <sect3>
        <title>&#2537;.&#2537;.&#2535;. &#2474;&#2470;&#2509;&#2471;&#2468;&#2495;&#2455;&#2468; &#2488;&#2489;&#2494;&#2527;&#2495;&#2453;&#2494;</title>

        <para> &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2503;&#2480; &#2474;&#2509;&#2480;&#2471;&#2494;&#2472; &#2437;&#2434;&#2486; &#2489;&#2458;&#2509;&#2459;&#2503;  <filename>*.po</filename> (&#2474;&#2507;&#2480;&#2509;&#2463;&#2503;&#2476;&#2482; &#2437;&#2476;&#2460;&#2503;&#2453;&#2509;&#2463;) &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2488;&#2478;&#2509;&#2474;&#2494;&#2470;&#2472; &#2453;&#2480;&#2494;&#2404; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2503; &#2437;&#2472;&#2497;&#2455;&#2509;&#2480;&#2489; &#2453;&#2480;&#2503;
,<ulink url="http://developer.gnome.org/projects/gtp/status/gnome-2.4/bn/index.html"> &#2488;&#2509;&#2463;&#2509;&#2479;&#2494;&#2463;&#2494;&#2488; &#2474;&#2494;&#2468;&#2494;&#2463;&#2495; </ulink> &#2470;&#2503;&#2454;&#2497;&#2472;&#2404; &#2479;&#2503; &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;
&#2453;&#2480;&#2494; &#2489;&#2527; &#2472;&#2495;, &#2468;&#2494; &#2469;&#2503;&#2453;&#2503; &#2479;&#2503;&#2453;&#2507;&#2472; &#2447;&#2453;&#2463;&#2495; &#2465;&#2494;&#2441;&#2472;&#2482;&#2507;&#2465; &#2453;&#2480;&#2497;&#2472;&#2404; &#2447;&#2454;&#2472; &#2439;&#2441;&#2472;&#2495;&#2453;&#2507;&#2465; &#2441;&#2474;&#2479;&#2507;&#2455;&#2496; &#2463;&#2503;&#2453;&#2509;&#2488;&#2463; &#2447;&#2465;&#2495;&#2463;&#2480;&#2503; &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2454;&#2497;&#2482;&#2497;&#2472;&#2404; &#2476;&#2480;&#2509;&#2468;&#2478;&#2494;&#2472;&#2503; &#2477;&#2495; &#2438;&#2439; (VI) &#2476;&#2494; &#2439;&#2478;&#2503;&#2453;&#2488;&#2503;
(Emacs) &#2476;&#2494;&#2434;&#2482;&#2494; &#2453;&#2494;&#2460; &#2453;&#2480;&#2503; &#2472;&#2494;&#2404; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2488;&#2470;&#2488;&#2509;&#2479;&#2470;&#2503;&#2480; &#2478;&#2471;&#2509;&#2479;&#2503; <ulink url="http://www.yudit.org/"> <application>&#2441;&#2465;&#2495;&#2463;</application> </ulink> (Yudit),
<ulink url="http://www.lekho.sf.net/"><application>&#2482;&#2503;&#2454;</application></ulink> (lekho) &#2447;&#2476;&#2434; <application>&#2460;&#2496;&#2447;&#2465;&#2495;&#2463;</application> &#2476;&#2503;&#2486; &#2460;&#2472;&#2474;&#2509;&#2480;&#2495;&#2527;&#2404;
        </para>
   
        <para> &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2486;&#2497;&#2480;&#2497;&#2480; &#2474;&#2509;&#2480;&#2494;&#2453;&#2509;&#2453;&#2494;&#2482;&#2503; <email>gnome-translations@bengalinux.org</email> &#2439;-&#2478;&#2503;&#2439;&#2482; &#2482;&#2495;&#2488;&#2509;&#2463;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2453;&#2494;&#2460;&#2503;&#2480; &#2456;&#2507;&#2487;&#2472;&#2494; &#2474;&#2509;&#2480;&#2470;&#2494;&#2472; &#2453;&#2480;&#2497;&#2472;&#2404;
        </para>

        <para> &#2475;&#2494;&#2439;&#2482;&#2503;&#2480; &#2486;&#2497;&#2480;&#2497;&#2468;&#2503; &#2482;&#2453;&#2509;&#2487;&#2509;&#2479; &#2453;&#2480;&#2482;&#2503; &#2470;&#2503;&#2454;&#2468;&#2503; &#2474;&#2494;&#2476;&#2503;&#2472; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453;&#2503;&#2480; &#2472;&#2494;&#2478;, &#2439;-&#2478;&#2503;&#2439;&#2482;, &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2503;&#2480; &#2488;&#2478;&#2527; &#2439;&#2468;&#2509;&#2479;&#2494;&#2470;&#2495; &#2474;&#2498;&#2480;&#2467; &#2453;&#2480;&#2494;&#2480; &#2460;&#2494;&#2527;&#2455;&#2494; &#2480;&#2527;&#2503;&#2459;&#2503;&#2404; &#2447;&#2439; &#2468;&#2469;&#2509;&#2479;&#2455;&#2497;&#2482;&#2507;
&#2474;&#2498;&#2480;&#2467; &#2453;&#2480;&#2503; &#2474;&#2480;&#2476;&#2480;&#2509;&#2468;&#2496; &#2474;&#2480;&#2509;&#2479;&#2494;&#2527;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2474;&#2509;&#2480;&#2488;&#2509;&#2468;&#2497;&#2468; &#2489;&#2507;&#2472;&#2404; </para>

        <para> &#2438;&#2474;&#2472;&#2495; &#2447;&#2439; &#2471;&#2480;&#2472;&#2503;&#2480; &#2453;&#2527;&#2503;&#2453;&#2463;&#2495; &#2482;&#2494;&#2439;&#2472; &#2470;&#2503;&#2454;&#2468;&#2503; &#2474;&#2494;&#2476;&#2503;&#2472; </para>

        <programlisting>
          <![CDATA[
#: atk/atkobject.c:1183
msgid "invalid"
msgstr ""
          ]]>
        </programlisting>

        <para> &#2474;&#2509;&#2480;&#2469;&#2478; &#2482;&#2494;&#2439;&#2472;&#2503; &#2475;&#2494;&#2439;&#2482;&#2503;&#2480; &#2472;&#2494;&#2478; &#2447;&#2476;&#2434; &#2470;&#2509;&#2476;&#2495;&#2468;&#2496;&#2527; &#2482;&#2494;&#2439;&#2472;&#2503; &#2479;&#2503; &#2474;&#2434;&#2453;&#2509;&#2468;&#2495;&#2463;&#2495; &#2438;&#2459;&#2503; &#2468;&#2494;&#2480; &#2488;&#2509;&#2469;&#2494;&#2472; (&#2488;&#2494;&#2480;&#2495;,&#2453;&#2482;&#2494;&#2478;) &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2468;&#2469;&#2509;&#2479; &#2469;&#2494;&#2453;&#2503;&#2404; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2479;&#2507;&#2455;&#2509;&#2479; &#2474;&#2434;&#2453;&#2509;&#2468;&#2495;&#2463;&#2495; &#2470;&#2509;&#2476;&#2495;&#2468;&#2496;&#2527;
&#2482;&#2494;&#2439;&#2472;&#2503; &#2439;&#2434;&#2480;&#2503;&#2460;&#2495;&#2468;&#2503; &#2469;&#2494;&#2453;&#2476;&#2503;&#2404; &#2447;&#2476;&#2434; &#2468;&#2499;&#2468;&#2496;&#2527; &#2482;&#2494;&#2439;&#2472;&#2463;&#2495;&#2468;&#2503; &#2438;&#2474;&#2472;&#2495; &#2476;&#2494;&#2434;&#2482;&#2494; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2463;&#2495; &#2482;&#2495;&#2454;&#2476;&#2503;&#2472;, &#2475;&#2482;&#2503; &#2447;&#2453;&#2463;&#2495; &#2475;&#2494;&#2439;&#2482;&#2503;&#2480; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453;&#2499;&#2468; &#2437;&#2434;&#2486;&#2463;&#2495; &#2447;&#2480;&#2453;&#2478; &#2470;&#2503;&#2454;&#2494;&#2476;&#2503; </para>
  
        <programlisting>
          <![CDATA[
#: atk/atkobject.c:1183
msgid "invalid"
msgstr "&#2477;&#2497;&#2482;"
          ]]>
        </programlisting>
       
        <para> &#2447;&#2439; &#2471;&#2480;&#2472;&#2503;&#2480; &#2488;&#2476;&#2453;&#2463;&#2495; &#2474;&#2434;&#2453;&#2509;&#2468;&#2495; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2453;&#2480;&#2494; &#2489;&#2482;&#2503; &#2475;&#2494;&#2439;&#2482;&#2503;&#2480; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2453;&#2494;&#2460; &#2486;&#2503;&#2487; &#2489;&#2476;&#2503;&#2404; &#2438;&#2474;&#2472;&#2494;&#2480; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2486;&#2503;&#2487; &#2489;&#2482;&#2503; &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503;&#2480;
&#2439;-&#2478;&#2503;&#2439;&#2482; &#2482;&#2495;&#2488;&#2509;&#2463; <email>gnome-translation@bengalinux.org</email>-&#2447; &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;&#2503; &#2474;&#2503;&#2486; &#2453;&#2480;&#2497;&#2472;&#2404; </para>
    
        <important><para> &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2474;&#2509;&#2480;&#2503;&#2480;&#2467;&#2503;&#2480; &#2474;&#2498;&#2480;&#2509;&#2476;&#2503; &#2472;&#2495;&#2478;&#2507;&#2453;&#2509;&#2468; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465; &#2470;&#2509;&#2476;&#2494;&#2480;&#2494; &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2474;&#2480;&#2496;&#2453;&#2509;&#2487;&#2494; &#2453;&#2480;&#2503; &#2470;&#2503;&#2454;&#2497;&#2472; </para>

          <para><prompt>bash$</prompt> <userinput>msgfmt -c filename_bn.po -o /dev/null</userinput></para>

          <para> &#2447;&#2454;&#2494;&#2472;&#2503; filename_bn.po &#2489;&#2458;&#2509;&#2459;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2453;&#2480;&#2494; &#2475;&#2494;&#2439;&#2482;&#2503;&#2480; &#2472;&#2494;&#2478;&#2404; </para>
        </important>
      </sect3>

      <sect3>
        <title>&#2537;.&#2537;.&#2536;. &#2477;&#2494;&#2487;&#2494;&#2480;&#2496;&#2468;&#2495;</title>

        <para> &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2503;&#2480; &#2488;&#2478;&#2527; &#2477;&#2494;&#2487;&#2494;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2453;&#2495;&#2459;&#2497; &#2476;&#2495;&#2487;&#2527;&#2503; &#2488;&#2468;&#2480;&#2509;&#2453;&#2468;&#2494; &#2437;&#2476;&#2482;&#2478;&#2509;&#2476;&#2472; &#2453;&#2480;&#2494; &#2441;&#2458;&#2495;&#2468;&#2509;&#8205;&#2404; &#2488;&#2494;&#2471;&#2497; &#2477;&#2494;&#2487;&#2494;&#2480; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2469;&#2503;&#2453;&#2503; &#2476;&#2495;&#2480;&#2468; &#2469;&#2494;&#2453;&#2497;&#2472;, &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480; &#2479;&#2454;&#2472;
&#2447;&#2453;&#2460;&#2472; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2496;&#2453;&#2503; &#2488;&#2478;&#2509;&#2476;&#2507;&#2471;&#2472; &#2453;&#2480;&#2476;&#2503; &#2468;&#2454;&#2472; &#2488;&#2478;&#2509;&#2478;&#2494;&#2472;&#2488;&#2498;&#2458;&#2453; (&#2479;&#2503;&#2478;&#2472; &#2453;&#2480;&#2497;&#2472;, &#2476;&#2482;&#2497;&#2472;) &#2453;&#2509;&#2480;&#2495;&#2527;&#2494;&#2474;&#2470; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; &#2438;&#2476;&#2494;&#2480; &#2479;&#2454;&#2472; &#2453;&#2478;&#2509;&#2474;&#2495;&#2441;&#2463;&#2494;&#2480;&#2453;&#2503; &#2453;&#2507;&#2472; &#2472;&#2495;&#2480;&#2509;&#2470;&#2503;&#2486; &#2470;&#2503;&#2451;&#2527;&#2494;
&#2489;&#2458;&#2509;&#2459;&#2503; &#2468;&#2454;&#2472; <emphasis>&#2453;&#2480;, &#2476;&#2482;</emphasis> &#2474;&#2509;&#2480;&#2477;&#2499;&#2468;&#2495; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2479;&#2494;&#2476;&#2503;&#2404;  &#2437;&#2474;&#2509;&#2480;&#2458;&#2482;&#2495;&#2468; &#2476;&#2494; &#2488;&#2494;&#2471;&#2494;&#2480;&#2467;&#2468; &#2437;&#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2486;&#2476;&#2509;&#2470;&#2494;&#2480;&#2509;&#2469;&#2503;&#2480; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2439;&#2434;&#2480;&#2503;&#2460;&#2495; &#2486;&#2476;&#2509;&#2470;&#2463;&#2495; &#2476;&#2494;&#2434;&#2482;&#2494; &#2489;&#2480;&#2475;&#2503;
&#2482;&#2495;&#2454;&#2497;&#2472;&#2404; &#2453;&#2507;&#2472;&#2477;&#2494;&#2476;&#2503;&#2439; <emphasis>&#2437;&#2468;&#2495; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;</emphasis> &#2453;&#2480;&#2476;&#2503;&#2472; &#2472;&#2494;&#2404; </para>

        <para> &#2472;&#2494;&#2478;&#2488;&#2498;&#2458;&#2453; &#2486;&#2476;&#2509;&#2470; &#2447;&#2476;&#2434; &#2463;&#2509;&#2480;&#2503;&#2465;&#2478;&#2494;&#2480;&#2509;&#2453;, &#2474;&#2467;&#2509;&#2479;&#2503;&#2480; &#2472;&#2494;&#2478; &#2474;&#2509;&#2480;&#2477;&#2499;&#2468;&#2495; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2453;&#2480;&#2494;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472; &#2472;&#2503;&#2439;&#2404; &#2479;&#2503;&#2478;&#2472; <application> Bourne Again Shell (BASH) 
</application> &#2453;&#2454;&#2472;&#2439; '&#2438;&#2476;&#2494;&#2480; Bourne Shell' &#2472;&#2527;&#2404; </para>

        <para> &#2474;&#2509;&#2480;&#2458;&#2482;&#2495;&#2468; &#2486;&#2476;&#2509;&#2470; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2497;&#2472;&#2404; &#2479;&#2503;&#2478;&#2472; <emphasis>&#2455;&#2476;&#2494;&#2453;&#2509;&#2487;&#2503;&#2480; &#2474;&#2480;&#2495;&#2476;&#2480;&#2509;&#2468;&#2503; &#2460;&#2494;&#2472;&#2494;&#2482;&#2494;</emphasis>&#2404; </para>

        <para>  &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453; &#2489;&#2495;&#2488;&#2494;&#2476;&#2503; &#2437;&#2472;&#2503;&#2453; &#2488;&#2478;&#2527; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480;&#2453;&#2503; &#2486;&#2476;&#2509;&#2470;&#2503;&#2480; &#2472;&#2468;&#2497;&#2472; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2474;&#2509;&#2480;&#2468;&#2495; &#2454;&#2503;&#2527;&#2494;&#2482; &#2480;&#2494;&#2454;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; &#2441;&#2470;&#2494;&#2489;&#2480;&#2467;&#2488;&#2509;&#2476;&#2480;&#2497;&#2474; &#2476;&#2482;&#2494; &#2479;&#2494;&#2527;, &#2453;&#2527;&#2503;&#2453; &#2470;&#2486;&#2453; &#2438;&#2455;&#2503;
&#2439;&#2434;&#2480;&#2503;&#2460;&#2495; &#2477;&#2494;&#2487;&#2496;&#2480;&#2494; &#2453;&#2454;&#2472;&#2507; &#2489;&#2527;&#2468;&#2507; <quote>save</quote> &#2486;&#2476;&#2509;&#2470;&#2463;&#2495;&#2480; &#2476;&#2480;&#2509;&#2468;&#2478;&#2494;&#2472; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2482;&#2509;&#2474;&#2472;&#2494; &#2453;&#2480;&#2503;&#2472;&#2495;&#2404; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480;&#2453;&#2503; &#2489;&#2527;&#2468;&#2507;&#2476;&#2494; &#2488;&#2503; &#2471;&#2480;&#2472;&#2503;&#2480; &#2453;&#2507;&#2472;&#2507; &#2486;&#2476;&#2509;&#2470;&#2503;&#2480; &#2472;&#2468;&#2497;&#2472;
&#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2438;&#2476;&#2495;&#2487;&#2509;&#2453;&#2494;&#2480; &#2453;&#2480;&#2468;&#2503; &#2489;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2404; </para>

        <para> &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2503;&#2480; &#2475;&#2494;&#2439;&#2482;&#2503; &#2438;&#2474;&#2472;&#2495; &#2454;&#2497;&#2476; &#2488;&#2489;&#2460;&#2503; &#2472;&#2495;&#2460;&#2488;&#2509;&#2476; &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479; &#2441;&#2482;&#2509;&#2482;&#2503;&#2454; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2472;&#2404; &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479; &#2488;&#2478;&#2498;&#2489;  <quote>#</quote> &#2474;&#2480;&#2503; &#2479;&#2507;&#2455; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2472;&#2404; &#2475;&#2482;&#2503;
&#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453;&#2480;&#2494; &#2472;&#2495;&#2480;&#2496;&#2453;&#2509;&#2487;&#2467;&#2503;&#2480; &#2488;&#2478;&#2527; &#2438;&#2474;&#2472;&#2494;&#2480; &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479; &#2474;&#2524;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2404; &#2479;&#2470;&#2495; &#2447;&#2453;&#2463;&#2495; &#2486;&#2476;&#2509;&#2470;&#2503;&#2480; &#2476;&#2503;&#2486; &#2453;&#2527;&#2503;&#2453;&#2463;&#2495; &#2437;&#2480;&#2509;&#2469; &#2474;&#2509;&#2480;&#2479;&#2507;&#2460;&#2509;&#2479; &#2489;&#2527;, &#2468;&#2476;&#2503; &#2488;&#2503;&#2455;&#2497;&#2482;&#2507;&#2451; &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479; &#2438;&#2453;&#2494;&#2480;&#2503; &#2441;&#2482;&#2509;&#2482;&#2503;&#2454;
&#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2472;&#2404; </para>

        <para> &#2468;&#2476;&#2503;, &#2482;&#2453;&#2509;&#2487;&#2509;&#2479; &#2480;&#2494;&#2454;&#2476;&#2503;&#2472;, <emphasis>msgid</emphasis> &#2447;&#2476;&#2434; <emphasis>msgstr</emphasis>-&#2447;&#2480; &#2478;&#2471;&#2509;&#2479;&#2503; &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479; &#2437;&#2472;&#2509;&#2468;&#2480;&#2509;&#2477;&#2497;&#2453;&#2509;&#2468; &#2453;&#2480;&#2494; &#2479;&#2494;&#2476;&#2503;&#2472;&#2494;&#2404;
&#2468;&#2494;&#2480; &#2478;&#2494;&#2472;&#2503; </para>

        <programlisting>
          <![CDATA[
#: atk/atkobject.c:1183
msgid "invalid"
# &#2474;&#2494;&#2455;&#2482;&#2503; &#2453;&#2495;&#2472;&#2494; &#2476;&#2482;&#2503;
msgstr "&#2477;&#2497;&#2482;"
          ]]>
        </programlisting>
        
        <para> &#2455;&#2509;&#2480;&#2489;&#2472;&#2479;&#2507;&#2455;&#2509;&#2479; &#2472;&#2527;&#2404; &#2447;&#2480; &#2474;&#2480;&#2495;&#2476;&#2480;&#2509;&#2468;&#2503; &#2482;&#2495;&#2454;&#2497;&#2472; - </para> 

        <programlisting>
          <![CDATA[
#: atk/atkobject.c:1183
msgid "invalid"
msgstr "&#2477;&#2497;&#2482;"
# &#2477;&#2497;&#2482; &#2488;&#2476;&#2439;  &#2477;&#2497;&#2482; .....
          ]]>
        </programlisting>
    
        <para> &#2488;&#2464;&#2495;&#2453; &#2476;&#2494;&#2472;&#2494;&#2472;&#2503;&#2480; &#2474;&#2509;&#2480;&#2468;&#2495; &#2454;&#2503;&#2527;&#2494;&#2482; &#2480;&#2494;&#2454;&#2476;&#2503;&#2472;&#2404; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2503;&#2480; &#2488;&#2478;&#2527;&#2503; &#2437;&#2477;&#2495;&#2471;&#2494;&#2472; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2472;&#2404; <citetitle pubwork="book"> &#2476;&#2494;&#2434;&#2482;&#2494; &#2447;&#2453;&#2494;&#2465;&#2503;&#2478;&#2496;&#2480;
&#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2494;&#2472;&#2494;&#2472; &#2437;&#2477;&#2495;&#2471;&#2494;&#2472; </citetitle> &#2447;&#2439; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2453;&#2494;&#2460;&#2503; &#2438;&#2488;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2404; Bengalinux-&#2447;&#2480;
<ulink url="http://www.bengalinux.org/projects/dictionary/bspeller.php"> <application>bspeller</application> </ulink> &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478;&#2463;&#2495;&#2451; &#2476;&#2503;&#2486;
&#2441;&#2474;&#2479;&#2507;&#2455;&#2496;&#2404; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; &#2437;&#2477;&#2495;&#2471;&#2494;&#2472;&#2503;&#2480; &#2478;&#2471;&#2509;&#2479;&#2503; &#2437;&#2486;&#2507;&#2453; &#2478;&#2498;&#2454;&#2494;&#2480;&#2509;&#2460;&#2495; &#2474;&#2509;&#2480;&#2467;&#2496;&#2468; <citetitle pubwork="book"> &#2488;&#2494;&#2489;&#2495;&#2468;&#2509;&#2479; &#2488;&#2434;&#2488;&#2470;&#2503;&#2480; &#2488;&#2478;&#2494;&#2480;&#2509;&#2469;-&#2486;&#2476;&#2509;&#2470;&#2453;&#2507;&#2487; </citetitle> (Bangla
Thesaraus) &#2441;&#2482;&#2509;&#2482;&#2503;&#2454;&#2479;&#2507;&#2455;&#2509;&#2479;&#2404; </para>
      </sect3>

      <sect3>
        <title>&#2537;.&#2537;.&#2537;. &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2474;&#2480;&#2496;&#2453;&#2509;&#2487;&#2494; &#2453;&#2480;&#2494;</title>

        <para>&#2476;&#2495;&#2487;&#2527;&#2476;&#2488;&#2509;&#2468;&#2497; &#2488;&#2494;&#2474;&#2503;&#2453;&#2509;&#2487;&#2503; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470; &#2453;&#2480;&#2494;&#2480; &#2474;&#2509;&#2480;&#2468;&#2495; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2454;&#2503;&#2527;&#2494;&#2482; &#2480;&#2494;&#2454;&#2468;&#2503; &#2489;&#2476;&#2503;&#2404; &#2486;&#2497;&#2471;&#2497;&#2478;&#2494;&#2468;&#2509;&#2480; po &#2475;&#2494;&#2439;&#2482; &#2470;&#2503;&#2454;&#2503; &#2437;&#2509;&#2479;&#2494;&#2474;&#2509;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472; &#2488;&#2478;&#2509;&#2476;&#2472;&#2509;&#2471;&#2503; &#2471;&#2494;&#2480;&#2467;&#2494; &#2482;&#2494;&#2477; &#2453;&#2480;&#2494; &#2453;&#2464;&#2495;&#2472;&#2404; &#2479;&#2503;&#2478;&#2472;
<emphasis>Open</emphasis> &#2447;&#2480; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2454;&#2507;&#2482;&#2507; &#2437;&#2469;&#2476;&#2494; &#2454;&#2507;&#2482;&#2494; &#2441;&#2477;&#2527;&#2439; &#2489;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2404; &#2447;&#2439; &#2453;&#2494;&#2480;&#2467;&#2503; &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453;&#2499;&#2468; po &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507; &#2437;&#2509;&#2479;&#2494;&#2474;&#2509;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472; &#2488;&#2489;&#2453;&#2494;&#2480;&#2503;
&#2488;&#2464;&#2495;&#2453;&#2477;&#2494;&#2476;&#2503; &#2474;&#2480;&#2496;&#2453;&#2509;&#2487;&#2494;-&#2472;&#2495;&#2480;&#2496;&#2453;&#2509;&#2487;&#2494; &#2453;&#2480;&#2494; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2404; &#2447;&#2439; &#2437;&#2471;&#2509;&#2479;&#2494;&#2527;&#2503; &#2438;&#2478;&#2480;&#2494; &#2474;&#2497;&#2480;&#2507; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478; &#2438;&#2476;&#2494;&#2480; &#2453;&#2478;&#2509;&#2474;&#2494;&#2439;&#2482; &#2472;&#2494; &#2453;&#2480;&#2503;&#2439; po &#2475;&#2494;&#2439;&#2482; &#2474;&#2480;&#2496;&#2453;&#2509;&#2487;&#2494; &#2453;&#2480;&#2494;&#2480; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; &#2472;&#2495;&#2527;&#2503; &#2438;&#2482;&#2507;&#2458;&#2472;&#2494;
&#2453;&#2480;&#2476;&#2507;&#2404; </para>

        <note><para> &#2447;&#2439; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; &#2488;&#2476; &#2471;&#2480;&#2472;&#2503;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; (<application>&#2460;&#2495;&#2465;&#2495;&#2447;&#2478;</application> &#2479;&#2497;&#2453;&#2509;&#2468;) &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2479;&#2494;&#2476;&#2503;&#2404; &#2468;&#2476;&#2503; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2474;&#2453;&#2509;&#2487;&#2503; &#2488;&#2476; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503;
&#2474;&#2480;&#2496;&#2453;&#2509;&#2487;&#2494; &#2453;&#2480;&#2494; &#2488;&#2478;&#2509;&#2477;&#2476;&#2474;&#2480; &#2489;&#2527;&#2503; &#2441;&#2464;&#2503;&#2472;&#2495;&#2404; &#2475;&#2482;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; &#2474;&#2480;&#2496;&#2453;&#2509;&#2487;&#2494;&#2463;&#2495; &#2488;&#2475;&#2482; &#2489;&#2451;&#2527;&#2494;&#2480; &#2453;&#2507;&#2472;&#2507; &#2472;&#2495;&#2486;&#2509;&#2458;&#2527;&#2468;&#2494; &#2472;&#2503;&#2439;&#2404; </para>
        </note>
  
        <para> &#2474;&#2509;&#2480;&#2469;&#2478;&#2503; <link linkend="locale">&#2476;&#2494;&#2434;&#2482;&#2494; Locale</link> &#2447;&#2476;&#2434; &#2453;&#2495;&#2459;&#2497; <link linkend="fonts">&#2476;&#2494;&#2434;&#2482;&#2494; &#2475;&#2472;&#2509;&#2463; &#2439;&#2472;&#2509;&#2488;&#2463;&#2482;</link> &#2453;&#2480;&#2497;&#2472;&#2404; &#2439;&#2472;&#2509;&#2488;&#2463;&#2482; &#2453;&#2480;&#2494;
&#2486;&#2503;&#2487; &#2489;&#2482;&#2503; po &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507; &#2447;&#2453;&#2463;&#2495; &#2475;&#2507;&#2482;&#2509;&#2465;&#2494;&#2480;&#2503; &#2480;&#2494;&#2454;&#2497;&#2472;&#2404; &#2447;&#2480;&#2474;&#2480;&#2503; &#2447;&#2453;&#2463;&#2495; &#2447;&#2453;&#2463;&#2495; &#2453;&#2480;&#2503; po &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507;&#2453;&#2503; <acronym>MO</acronym> &#2475;&#2494;&#2439;&#2482;&#2503; &#2472;&#2495;&#2478;&#2509;&#2472;&#2507;&#2453;&#2509;&#2468; &#2453;&#2478;&#2494;&#2472;&#2509;&#2465; &#2470;&#2509;&#2476;&#2494;&#2480;&#2494;
&#2480;&#2498;&#2474;&#2494;&#2472;&#2509;&#2468;&#2480; &#2453;&#2480;&#2497;&#2472;&#2404; </para>

        <para><prompt>bash$</prompt> <userinput>msgfmt -o file.mo file.version.gnomeversion_bn.po</userinput></para>

        <caution><para> &#2480;&#2498;&#2474;&#2494;&#2472;&#2509;&#2468;&#2480; &#2453;&#2480;&#2494;&#2480; &#2488;&#2478;&#2527; &#2477;&#2494;&#2487;&#2494; &#2447;&#2476;&#2434; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2468;&#2469;&#2509;&#2479;&#2455;&#2497;&#2482;&#2507; mo &#2475;&#2494;&#2439;&#2482;&#2503;&#2480; &#2472;&#2494;&#2478; &#2469;&#2503;&#2453;&#2503; &#2488;&#2480;&#2495;&#2527;&#2503; &#2475;&#2503;&#2482;&#2497;&#2472;&#2404; &#2441;&#2470;&#2494;&#2489;&#2480;&#2467;&#2488;&#2509;&#2476;&#2480;&#2497;&#2474;,
<filename>gnome-games.gnome-2-4.bn.po</filename> &#2480;&#2498;&#2474;&#2494;&#2472;&#2509;&#2468;&#2480;&#2495;&#2468; &#2489;&#2527;&#2503; &#2489;&#2476;&#2503; <filename>gnome-games.mo</filename> &#2489;&#2495;&#2488;&#2494;&#2476;&#2503;&#2404; &#2453;&#2507;&#2472;&#2507;
&#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460; &#2488;&#2478;&#2509;&#2476;&#2472;&#2509;&#2471;&#2503; &#2488;&#2472;&#2509;&#2470;&#2503;&#2489; &#2469;&#2494;&#2453;&#2482;&#2503; <cmdsynopsis><command>rpm</command> <arg>-ql <replaceable>packagename</replaceable></arg>
</cmdsynopsis> &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2463;&#2495; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455; &#2453;&#2480;&#2497;&#2472;&#2404; &#2447;&#2439; &#2472;&#2495;&#2480;&#2509;&#2470;&#2503;&#2486;&#2463;&#2495; &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460;&#2503;&#2480; &#2472;&#2494;&#2478; &#2488;&#2434;&#2453;&#2509;&#2480;&#2494;&#2472;&#2509;&#2468; &#2488;&#2453;&#2482; &#2468;&#2469;&#2509;&#2479; &#2474;&#2509;&#2480;&#2470;&#2494;&#2472; &#2453;&#2480;&#2476;&#2503;&#2404; &#2479;&#2503;&#2478;&#2472;, <command>rpm 
<option>-ql</option> <parameter>gdm</parameter></command> &#2472;&#2495;&#2478;&#2509;&#2472;&#2503;&#2480; &#2468;&#2469;&#2509;&#2479;&#2455;&#2497;&#2482;&#2507; &#2474;&#2509;&#2480;&#2470;&#2494;&#2472; &#2453;&#2480;&#2503; </para>

          <screen>        
  	  /usr/share/locale/ru/LC_MESSAGES/gdm-2.4.mo
  	  /usr/share/locale/sk/LC_MESSAGES/gdm-2.4.mo
  	  /usr/share/locale/sl/LC_MESSAGES/gdm-2.4.mo
  	  /usr/share/locale/sv/LC_MESSAGES/gdm-2.4.mo
  	  /usr/share/locale/ta/LC_MESSAGES/gdm-2.4.mo
          </screen>
	  
          <para> &#2441;&#2474;&#2480;&#2507;&#2453;&#2509;&#2468; &#2468;&#2469;&#2509;&#2479; &#2470;&#2503;&#2454;&#2503; &#2438;&#2474;&#2472;&#2495; &#2476;&#2497;&#2461;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472; &#2479;&#2503; &#2460;&#2495;&#2465;&#2495;&#2447;&#2478; &#2474;&#2509;&#2479;&#2494;&#2453;&#2503;&#2460;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; <command>msgfmt <option>-o</option> 
<parameter>gdm-2.4.mo</parameter> <parameter>gdm2.gnome-2-4.bn.po</parameter></command> &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2463;&#2495; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472;&#2404; </para>
        </caution>

        <para> &#2488;&#2476; &#2475;&#2494;&#2439;&#2482; &#2480;&#2498;&#2474;&#2494;&#2472;&#2509;&#2468;&#2480; &#2453;&#2480;&#2494; &#2486;&#2503;&#2487; &#2489;&#2482;&#2503; MO &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507; <filename>/usr/share/locale/bn_IN.UTF-8</filename> &#2437;&#2469;&#2476;&#2494;
<filename>/usr/share/locale/bn_BD.UTF-8</filename> &#2475;&#2507;&#2482;&#2509;&#2465;&#2494;&#2480;&#2503; &#2480;&#2494;&#2454;&#2497;&#2472;&#2404; <emphasis>bn_BD</emphasis> &#2476;&#2494; <emphasis>bn_IN</emphasis>
&#2472;&#2495;&#2480;&#2509;&#2477;&#2480; &#2453;&#2480;&#2476;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2482;&#2508;&#2453;&#2494;&#2482; &#2439;&#2472;&#2488;&#2509;&#2463;&#2482;&#2503;&#2480; &#2441;&#2474;&#2480;&#2404; &#2447;&#2454;&#2472; <filename>/etc/X11/gdm/locale.alias</filename> &#2475;&#2494;&#2439;&#2482;&#2463;&#2495; &#2454;&#2497;&#2482;&#2497;&#2472; &#2447;&#2476;&#2434; &#2472;&#2495;&#2458;&#2503;&#2480; &#2482;&#2494;&#2439;&#2472;&#2455;&#2497;&#2482;&#2507;
&#2475;&#2494;&#2439;&#2482;&#2463;&#2495;&#2468;&#2503; &#2482;&#2495;&#2454;&#2497;&#2472; </para>

        <programlisting>
    	Bengali                 bn_IN.UTF-8,bn_IN
	</programlisting>

        <para> &#2447;&#2480;&#2474;&#2480;&#2503; <application>X</application> &#2480;&#2495;&#2480;&#2509;&#2488;&#2509;&#2463;&#2494;&#2463; &#2453;&#2480;&#2497;&#2472; &#2447;&#2476;&#2434; <application><acronym>GNOME</acronym></application> &#2482;&#2455;-&#2439;&#2472;
&#2478;&#2503;&#2472;&#2497; &#2469;&#2503;&#2453;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2488;&#2495;&#2482;&#2503;&#2453;&#2509;&#2463; &#2453;&#2480;&#2497;&#2472;&#2404; &#2447;&#2454;&#2472; &#2438;&#2474;&#2472;&#2494;&#2480; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2489;&#2480;&#2475; &#2470;&#2503;&#2454;&#2468;&#2503; &#2474;&#2494;&#2476;&#2503;&#2472;&#2404; </para>
 
        <para> &#2486;&#2497;&#2471;&#2497;&#2478;&#2494;&#2468;&#2509;&#2480; &#2447;&#2453;&#2463;&#2495; &#2437;&#2509;&#2479;&#2494;&#2474;&#2509;&#2482;&#2495;&#2453;&#2486;&#2472; &#2474;&#2480;&#2496;&#2453;&#2509;&#2487;&#2494; &#2453;&#2480;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479;&#2503; &#2441;&#2474;&#2480;&#2503;&#2480; &#2488;&#2476;&#2453;&#2495;&#2459;&#2497; &#2453;&#2480;&#2494;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2460;&#2472; &#2472;&#2503;&#2439;&#2404; &#2447;&#2439; &#2474;&#2470;&#2509;&#2471;&#2468;&#2495; &#2468;&#2454;&#2472;&#2439; &#2482;&#2494;&#2455;&#2476;&#2503; &#2479;&#2454;&#2472; &#2438;&#2474;&#2472;&#2495; &#2474;&#2497;&#2480;&#2507; &#2488;&#2495;&#2488;&#2509;&#2463;&#2503;&#2478;
&#2476;&#2494;&#2434;&#2482;&#2494;&#2527; &#2472;&#2495;&#2468;&#2503; &#2458;&#2494;&#2472;&#2404; &#2447;&#2453;&#2463;&#2495; &#2437;&#2509;&#2479;&#2494;&#2474;&#2509;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2503;&#2480; &#2460;&#2472;&#2509;&#2479;&#2503; &#2474;&#2509;&#2480;&#2469;&#2478;&#2503; &#2482;&#2508;&#2453;&#2494;&#2482; &#2447;&#2476;&#2434; &#2475;&#2472;&#2509;&#2463; &#2488;&#2503;&#2463;-&#2438;&#2474; &#2453;&#2480;&#2497;&#2472;&#2404; MO &#2475;&#2494;&#2439;&#2482;&#2455;&#2497;&#2482;&#2507; &#2488;&#2464;&#2495;&#2453; &#2475;&#2507;&#2482;&#2509;&#2465;&#2494;&#2480;&#2503; &#2480;&#2494;&#2454;&#2497;&#2472;,
<command>xterm</command> &#2458;&#2494;&#2482;&#2497; &#2453;&#2480;&#2497;&#2472;&#2404; <command>export <parameter>LANG=bn_IN.UTF-8</parameter></command> &#2476;&#2494;
<command>export <parameter>LANG=bn_BD.UTF-8</parameter></command> &#2453;&#2478;&#2494;&#2472;&#2509;&#2465;&#2463;&#2495; &#2482;&#2495;&#2454;&#2497;&#2472;&#2404; &#2447;&#2480;&#2474;&#2480;&#2503;
<command>xterm</command> &#2469;&#2503;&#2453;&#2503; &#2474;&#2509;&#2480;&#2507;&#2455;&#2509;&#2480;&#2494;&#2478;&#2463;&#2495; &#2458;&#2494;&#2482;&#2497; &#2453;&#2480;&#2497;&#2472;&#2404; &#2488;&#2476;&#2453;&#2495;&#2459;&#2497; &#2464;&#2495;&#2453;&#2478;&#2468; &#2453;&#2480;&#2494; &#2489;&#2482;&#2503; &#2438;&#2474;&#2472;&#2495; &#2476;&#2494;&#2434;&#2482;&#2494; &#2439;&#2472;&#2509;&#2463;&#2494;&#2480;&#2475;&#2503;&#2488; &#2470;&#2503;&#2454;&#2468;&#2503; &#2474;&#2494;&#2476;&#2503;&#2472;&#2404; </para>
      </sect3>
    </sect2>
  </sect1>  

  <appendix id="appendix">
    <title>&#2474;&#2480;&#2495;&#2486;&#2495;&#2487;&#2509;&#2463;</title>

    <para> &#2447;&#2439; &#2437;&#2472;&#2497;&#2458;&#2509;&#2459;&#2503;&#2470;&#2503; &#2453;&#2495;&#2459;&#2497; &#2438;&#2472;&#2497;&#2487;&#2457;&#2509;&#2455;&#2495;&#2453; &#2468;&#2469;&#2509;&#2479; &#2438;&#2459;&#2503;&#2404; </para>

    <sect1 id="sites">
      <title>&#2488;&#2434;&#2486;&#2509;&#2482;&#2495;&#2487;&#2509;&#2463; &#2451;&#2527;&#2503;&#2476; &#2488;&#2494;&#2439;&#2463;</title>

      <itemizedlist>
        <listitem>
          <para>
            <ulink url="http://www.Bengalinux.Org">www.Bengalinux.Org</ulink> &#2476;&#2494; <ulink url="http://www.AnkurBangla.Org">
www.AnkurBangla.Org </ulink>: &#2476;&#2494;&#2434;&#2482;&#2494; &#2488;&#2434;&#2486;&#2509;&#2482;&#2495;&#2487;&#2509;&#2463; &#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2488;&#2478;&#2498;&#2489;&#2503;&#2480; &#2453;&#2503;&#2472;&#2509;&#2470;&#2509;&#2480;&#2496;&#2527; &#2488;&#2494;&#2439;&#2463;&#2404;
          </para>
        </listitem>

        <listitem>
          <para><ulink url="http://www.nongnu.org/freebangfont">www.nongnu.org/freebangfont</ulink>: &#2437;&#2434;&#2453;&#2497;&#2480; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503;&#2480; &#2475;&#2472;&#2509;&#2463; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2478;&#2503;&#2472;&#2509;&#2463;
&#2437;&#2434;&#2486;&#2404; </para>
        </listitem>

        <listitem>
          <para><ulink url="http://www.unicode.org">www.unicode.org</ulink>: &#2439;&#2441;&#2472;&#2495;&#2453;&#2507;&#2465; &#2453;&#2472;&#2488;&#2507;&#2480;&#2509;&#2463;&#2495;&#2527;&#2494;&#2478;&#2503;&#2480; &#2451;&#2527;&#2503;&#2476;&#2488;&#2494;&#2439;&#2463;&#2404; </para>
        </listitem>
      </itemizedlist>
    </sect1>

    <sect1 id="volunteering">
      <title>&#2455;&#2472;&#2497;&#2489;/&#2482;&#2495;&#2472;&#2494;&#2453;&#2509;&#2488;-&#2447; &#2476;&#2494;&#2434;&#2482;&#2494; &#2477;&#2494;&#2487;&#2494;&#2480; &#2474;&#2509;&#2480;&#2527;&#2507;&#2455; &#2441;&#2472;&#2509;&#2472;&#2468;&#2468;&#2480; &#2453;&#2480;&#2494;&#2480; &#2482;&#2453;&#2509;&#2487;&#2509;&#2479;&#2503; &#2488;&#2509;&#2476;&#2503;&#2458;&#2509;&#2459;&#2494;&#2488;&#2503;&#2476;&#2496;&#2480; &#2477;&#2498;&#2478;&#2495;&#2453;&#2494; &#2455;&#2509;&#2480;&#2489;&#2467;</title>

      <para> &#2438;&#2474;&#2472;&#2495; &#2479;&#2470;&#2495; <systemitem class="osname"><acronym>GNU</acronym>/Linux</systemitem> &#2476;&#2494; &#2437;&#2472;&#2509;&#2479;&#2494;&#2472;&#2509;&#2479; &#2475;&#2509;&#2480;&#2496;/&#2482;&#2495;&#2476;&#2494;&#2480;/&#2451;&#2474;&#2503;&#2472; &#2488;&#2507;&#2480;&#2509;&#2488;
(<acronym>FLOSS</acronym>) &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2474;&#2509;&#2480;&#2468;&#2495; &#2438;&#2455;&#2509;&#2480;&#2489;&#2496; &#2489;&#2472;, &#2468;&#2476;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2479;&#2503;&#2453;&#2507;&#2472; &#2480;&#2453;&#2478;&#2503;&#2480; &#2488;&#2494;&#2489;&#2494;&#2479;&#2509;&#2479;, &#2478;&#2472;&#2509;&#2468;&#2476;&#2509;&#2479;, &#2447;&#2476;&#2434; &#2474;&#2480;&#2494;&#2478;&#2480;&#2509;&#2486; &#2488;&#2476; &#2488;&#2478;&#2527;&#2439;
&#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2453;&#2494;&#2478;&#2509;&#2479;&#2404; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503; &#2479;&#2507;&#2455;&#2494;&#2479;&#2507;&#2455; &#2453;&#2480;&#2494;&#2480; &#2488;&#2476;&#2458;&#2503;&#2527;&#2503; &#2488;&#2489;&#2460; &#2441;&#2474;&#2494;&#2527; &#2489;&#2458;&#2509;&#2459;&#2503; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2439;-&#2478;&#2503;&#2439;&#2482; &#2482;&#2495;&#2488;&#2509;&#2463; <email>users@bengalinux.org</email>&#2404; &#2438;&#2478;&#2480;&#2494;
&#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480;, &#2437;&#2472;&#2497;&#2476;&#2494;&#2470;&#2453;, &#2475;&#2472;&#2509;&#2463; &#2465;&#2495;&#2460;&#2494;&#2439;&#2472;&#2494;&#2480; &#2459;&#2494;&#2524;&#2494;&#2451; &#2488;&#2494;&#2471;&#2494;&#2480;&#2467; GNU/Linux &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2453;&#2494;&#2480;&#2495;&#2470;&#2503;&#2480; &#2478;&#2471;&#2509;&#2479; &#2469;&#2503;&#2453;&#2503; &#2488;&#2509;&#2476;&#2503;&#2458;&#2509;&#2459;&#2494;&#2488;&#2503;&#2476;&#2453; &#2454;&#2497;&#2433;&#2460;&#2459;&#2495;&#2404; GNU/Linux &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503; &#2470;&#2453;&#2509;&#2487;&#2468;&#2494; &#2472;&#2494;
&#2469;&#2494;&#2453;&#2482;&#2503;&#2451; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2476;&#2495;&#2477;&#2495;&#2472;&#2509;&#2472; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503; &#2438;&#2474;&#2472;&#2495; &#2488;&#2494;&#2489;&#2494;&#2479;&#2509;&#2479; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2472;&#2404; </para>

      <para> &#2438;&#2474;&#2472;&#2495; &#2479;&#2470;&#2495; &#2475;&#2472;&#2509;&#2463; &#2465;&#2503;&#2477;&#2503;&#2482;&#2474;&#2494;&#2480; &#2489;&#2527;&#2503; &#2469;&#2494;&#2453;&#2503;&#2472; &#2468;&#2476;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2472;&#2495;&#2460;&#2488;&#2509;&#2476; &#2453;&#2494;&#2460;&#2455;&#2497;&#2482;&#2507; &#2455;&#2472;&#2497;&#2489; (GNU) <acronym>&#2460;&#2495;&#2474;&#2495;&#2447;&#2482;</acronym> &#2482;&#2494;&#2439;&#2488;&#2503;&#2472;&#2509;&#2488;&#2503;&#2480; &#2437;&#2471;&#2496;&#2472;&#2503;
(&#2474;&#2497;&#2472;&#2435;)&#2474;&#2509;&#2480;&#2453;&#2494;&#2486; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2472;&#2404; &#2447;&#2480; &#2475;&#2482;&#2503; &#2438;&#2474;&#2472;&#2494;&#2480; &#2475;&#2472;&#2509;&#2463;&#2463;&#2495; &#2438;&#2478;&#2494;&#2470;&#2503;&#2480; &#2474;&#2509;&#2480;&#2453;&#2482;&#2509;&#2474;&#2503;&#2480; &#2488;&#2494;&#2469;&#2503; &#2479;&#2497;&#2453;&#2509;&#2468; &#2489;&#2468;&#2503; &#2474;&#2494;&#2480;&#2476;&#2503;&#2404; </para>
      
    </sect1>

    <sect1 id="software">
      <title>&#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2507;&#2474;&#2479;&#2507;&#2455;&#2496; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;</title>

      <para> &#2439;&#2441;&#2472;&#2495;&#2453;&#2507;&#2465;&#2477;&#2495;&#2468;&#2509;&#2468;&#2495;&#2453; &#2476;&#2494;&#2434;&#2482;&#2494; &#2489;&#2480;&#2475; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472; &#2453;&#2480;&#2494; &#2447;&#2453;&#2463;&#2495; &#2460;&#2463;&#2495;&#2482; &#2453;&#2494;&#2460;&#2404; &#2447; &#2460;&#2472;&#2509;&#2479; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468; &#2474;&#2509;&#2480;&#2479;&#2497;&#2453;&#2509;&#2468;&#2495;&#2463;&#2495; &#2437;&#2468;&#2495; &#2488;&#2494;&#2478;&#2509;&#2474;&#2509;&#2480;&#2468;&#2495;&#2453; &#2447;&#2476;&#2434; &#2447; &#2453;&#2494;&#2480;&#2467;&#2503; &#2453;&#2495;&#2459;&#2497; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2503;&#2480; 
&#2486;&#2497;&#2471;&#2497;&#2478;&#2494;&#2468;&#2509;&#2480; &#2488;&#2480;&#2509;&#2476;&#2486;&#2503;&#2487; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;&#2455;&#2497;&#2482;&#2507;&#2439; &#2447; &#2453;&#2494;&#2460;&#2463;&#2495; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2404; &#2441;&#2470;&#2494;&#2489;&#2480;&#2467;&#2488;&#2509;&#2476;&#2480;&#2498;&#2474; <application><acronym>&#2453;&#2503;&#2465;&#2495;&#2439;</acronym></application>-&#2468;&#2503; &#2476;&#2509;&#2479;&#2476;&#2489;&#2499;&#2468;
<systemitem class="library">Qt</systemitem> &#2463;&#2497;&#2482;&#2453;&#2495;&#2463;-&#2447;&#2480; &#2486;&#2497;&#2471;&#2497;&#2478;&#2494;&#2468;&#2509;&#2480; &#2488;&#2480;&#2509;&#2476;&#2486;&#2503;&#2487; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; (Qt &#2537;.&#2536;) &#2447;&#2476;&#2434;
<systemitem class="library">GTK 2</systemitem>-&#2447;&#2480; &#2463;&#2503;&#2453;&#2509;&#2488;&#2463; &#2480;&#2503;&#2472;&#2465;&#2494;&#2480;&#2495;&#2434;/&#2482;&#2503;&#2438;&#2441;&#2463; &#2439;&#2462;&#2509;&#2460;&#2495;&#2472; <ulink url="http://www.pango.org"> 
<application>&#2474;&#2509;&#2479;&#2494;&#2457;&#2509;&#2455;&#2507;</application> </ulink> &#2476;&#2494;&#2434;&#2482;&#2494; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2404; &#2474;&#2509;&#2479;&#2494;&#2457;&#2509;&#2455;&#2507;-&#2447;&#2480; &#2535;.&#2535;.&#2535;. &#2476;&#2494; &#2474;&#2480;&#2476;&#2480;&#2509;&#2468;&#2496; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;&#2455;&#2497;&#2482;&#2507;&#2468;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494;&#2480; &#2460;&#2472;&#2509;&#2479; &#2447;&#2453;&#2463;&#2495; &#2474;&#2499;&#2469;&#2453; &#2478;&#2465;&#2495;&#2441;&#2482;
&#2480;&#2527;&#2503;&#2459;&#2503;&#2404; &#2447;&#2459;&#2494;&#2524;&#2494; &#2475;&#2509;&#2480;&#2496; &#2488;&#2475;&#2463;&#2451;&#2527;&#2494;&#2480;&#2488;&#2478;&#2498;&#2489;&#2503;&#2480; &#2478;&#2471;&#2509;&#2479;&#2503; <ulink url="http://www.yudit.org"><application>Yudit</application></ulink> &#2477;&#2494;&#2482;&#2477;&#2494;&#2476;&#2503; &#2476;&#2494;&#2434;&#2482;&#2494; &#2463;&#2503;&#2453;&#2509;&#2488;&#2463;
&#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472; &#2453;&#2480;&#2468;&#2503; &#2474;&#2494;&#2480;&#2503;&#2404; &#2468;&#2476;&#2503; &#2471;&#2496;&#2480;&#2503; &#2471;&#2496;&#2480;&#2503; &#2447; &#2437;&#2476;&#2488;&#2509;&#2469;&#2494;&#2480; &#2441;&#2472;&#2509;&#2472;&#2468;&#2495; &#2456;&#2463;&#2459;&#2503;, &#2447;&#2476;&#2434; &#2437;&#2470;&#2498;&#2480; &#2477;&#2476;&#2495;&#2487;&#2509;&#2479;&#2468;&#2503; &#2488;&#2478;&#2509;&#2477;&#2476;&#2468; <application>&#2478;&#2460;&#2495;&#2482;&#2494;</application>,
<application>&#2451;&#2474;&#2503;&#2472;-&#2437;&#2475;&#2495;&#2488;</application> &#2439;&#2468;&#2509;&#2479;&#2494;&#2470;&#2495;&#2468;&#2503;&#2451; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2479;&#2494;&#2476;&#2503;&#2404; &#2438;&#2488;&#2482;&#2503; &#2451;&#2474;&#2503;&#2472;-&#2437;&#2475;&#2495;&#2488;&#2503;&#2480; &#2476;&#2503;&#2463;&#2494; &#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467;&#2503; (&#2447;&#2439; &#2474;&#2509;&#2480;&#2476;&#2472;&#2509;&#2471; &#2482;&#2503;&#2454;&#2494;&#2480; &#2488;&#2478;&#2527;) &#2447;
&#2478;&#2497;&#2489;&#2498;&#2480;&#2509;&#2468;&#2503;&#2439; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480;&#2503;&#2480; &#2438;&#2434;&#2486;&#2495;&#2453; &#2488;&#2497;&#2479;&#2507;&#2455; &#2480;&#2527;&#2503;&#2459;&#2503;; &#2468;&#2476;&#2503; &#2451;-&#2453;&#2494;&#2480; &#2447;&#2476;&#2434; &#2452;-&#2453;&#2494;&#2480; &#2474;&#2509;&#2480;&#2470;&#2480;&#2509;&#2486;&#2472;&#2503;&#2480; &#2453;&#2509;&#2487;&#2503;&#2468;&#2509;&#2480;&#2503; &#2447;&#2468;&#2503; &#2447;&#2454;&#2472;&#2507; &#2476;&#2503;&#2486; &#2453;&#2495;&#2459;&#2497; &#2476;&#2524; &#2471;&#2480;&#2472;&#2503;&#2480; &#2488;&#2478;&#2488;&#2509;&#2479;&#2494; &#2480;&#2527;&#2503;&#2459;&#2503;&#2404; &#2438;&#2480; &#2537;.&#2536;.&#2534;
&#2488;&#2434;&#2488;&#2509;&#2453;&#2480;&#2467; &#2469;&#2503;&#2453;&#2503; &#2438;&#2480;&#2478;&#2509;&#2477; &#2453;&#2480;&#2503; &#2453;&#2503;&#2465;&#2495;&#2439; &#2437;&#2509;&#2479;&#2494;&#2474;&#2482;&#2495;&#2453;&#2503;&#2486;&#2472;&#2488;&#2478;&#2498;&#2489;&#2503;&#2451; &#2476;&#2494;&#2434;&#2482;&#2494; &#2476;&#2509;&#2479;&#2476;&#2489;&#2494;&#2480; &#2453;&#2480;&#2494; &#2479;&#2494;&#2476;&#2503;&#2404; </para>
    </sect1>
  </appendix>
</article>
