<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.51">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf363, Applications: ParallelKnoppix</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 table.left { margin-right:0.3cm }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 div.tbbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   margin: 2px 5px 2px 5px;
   text-align: center;
   width: 20em;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
 div.bbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   float: left;
   margin: 2px 5px 2px 5px;
   text-align: center;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Majid Hameed
 =LF=CAT___: Applications
 =LF=TITLE_: ParallelKnoppix
 =LF=NUMBER: 363
 =LF=ANAME_: article363.shtml
 =LF=PARSER: 2.51
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, current, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><a href="../../index.shtml"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></a></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 
                 <A class="nodec" href="../../index.shtml"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Plan</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Index</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/index.html"><FONT color=
                 "#DDDDDD" size="2">Suchen</FONT></A> </TD>
                 
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/index.shtml"><FONT color=
           "#FFFFFF">Nachrichten</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/index.html"><FONT color=
           "#FFFFFF">Archiv</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/index.shtml"><FONT color=
           "#FFFFFF">Links</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">&Uuml;ber uns</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfdynahead ver 1.5 --><TABLE ALIGN="right" border=0><TR><TD ALIGN="right"><FONT SIZE="-1" FACE="Arial,Helvetica">Dieses Dokument ist verf&uuml;bar auf: <A href="../../English/January2005/article363.shtml">English</a> &nbsp;<A href="../../Deutsch/January2005/article363.shtml">Deutsch</a> &nbsp;<A href="../../Francais/January2005/article363.shtml">Francais</a> &nbsp;<A href="../../Nederlands/January2005/article363.shtml">Nederlands</a> &nbsp;<A href="../../Russian/January2005/article363.shtml">Russian</a> &nbsp;<A href="../../Turkce/January2005/article363.shtml">Turkce</a> &nbsp;</FONT></TD></TR></TABLE><br>
 


<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_START -->
<TABLE ALIGN="LEFT" BORDER="0" WIDTH="195" summary="about the author" class="left">
<TR>
<TD>

<img src="../../common/images2/MajidHameed.jpg" alt="[Photo of the Author]" height="177" width="120">
<BR>von  Majid Hameed <br> <small>&lt;hameed.majid(at)gmail.com&gt;</small>
<BR><BR>
<I>&Uuml;ber den Autor:</I><BR>
<!-- aboutauthor_start -->

Majid Hameed ist ein Bachelor-Student an der Abteilung f&uuml;r Informatik der Universit&auml;t von Karachi in Sindh, Pakistan. Seine Hauptinteressen sind K&uuml;nstliche Intelligenz, Betriebssysteme, Netzwerke, Programmierung und Computergrafik. Hameed beschreibt sich selbst als Linux-Enthusiast, der Linux seit 3,5 Jahren als Betriebssystem nutzt, einschlie&szlig;lich Red Hat 9, 8, 7.3 und
7.2, Slackware Linux 10 und 9.1, Slax, Mandrake Move 2, Knoppix 3.4,
Vector Linux 4.3 und andere.



<!-- aboutauthor_stop -->
<!-- TRANSLATED_TO de -->
<BR><BR><I>&Uuml;bersetzt ins Deutsche von:</I><BR>
Hermann J. Beckers <small>&lt;hjb-rheine(at)t-online.de&gt;</small>
<br>
<!--
 =LF=TRANSTO=de: Hermann J. Beckers
-->
<!-- TRANSLATED_TO_STOP -->
<!-- INDEX_START -->
<BR><i>Inhalt</i>:
<UL>
  <LI><A HREF="#363lfindex0">Einf&uuml;hrung</A></LI>
  <LI><A HREF="#363lfindex1">Hintergrund</A></LI>
  <LI><A HREF="#363lfindex2">Beschreibung</A></LI>
  <LI><A HREF="#363lfindex3">Was ist ein PXE-Boot?</A></LI>
  <LI><A HREF="#363lfindex4">Was tun, wenn Ihre Netzwerk-Karte nicht PXE-f&auml;hig ist?</A></LI>
  <LI><A HREF="#363lfindex5">Der Abruf von ParallelKnoppix</A></LI>
  <LI><A HREF="#363lfindex6">Wie funktioniert es?</A></LI>
  <LI><A HREF="#363lfindex7">Was ist zu tun, wenn mehrere DHCP-Server aktiv sind ?</A></LI>
  <LI><A HREF="#363lfindex8">Wie es funktioniert (Zusammenfassung)</A></LI>
  <LI><A HREF="#363lfindex9">Meine Erfahrungen</A></LI>
  <LI><A HREF="#363lfindex10">Zusammenfassung</A></LI>
  <LI><A HREF="#363lfindex11">Referenzen</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=363">Talkback f&uuml;r diesen Artikel</A></LI>
</UL>

</TD></TR></TABLE>
<!-- INDEX_STOP -->
<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_STOP -->
<!-- HEAD_OF_THE_ARTICLE_START -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>ParallelKnoppix</H2>
 <img src="../../common/images2/article363/parallelknoppix.png" alt="[Illustration]" height="172" hspace="10" width="277">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Zusammenfassung</i>:
<P>
<!-- articleabstract_start -->

ParallelKnoppix ist eine auf Knoppix basierende Live-CD; Knoppix selbst ist ebenfalls eine Live-CD, die auf der Debian Linux-Distribution basiert. ParallelKnoppix erm&ouml;glicht es, innerhalb von Minuten einen Linux-Cluster zu erzeugen, der mit Programmen und Werkzeugen f&uuml;r parallele Programmierung wie MPI ausgestattet ist. Es spart eine Menge Zeit bei der Konfiguration der Betriebssystem-Umgebung. Die bestehende Umgebung wird durch ParallelKnoppix nicht beeintr&auml;chtigt, da es sich um eine Live-CD handelt. Nur auf dem Master-Knoten wird ein Verzeichnis erzeugt, das nach einem Neustart gel&ouml;scht werden kann, wenn Sie dies w&uuml;nschen.


<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- HEAD_OF_THE_ARTICLE_STOP -->
<!-- BODY_OF_THE_ARTICLE_START -->


<A NAME="363lfindex0">&nbsp;</A>
<H2>Einf&uuml;hrung</H2>

"ParallelKnoppix ist eine Neuzusammstellung von Knoppix, die das Einrichten eines Clusters von Maschinen f&uuml;r Parallelverarbeitung mittels der LAM-MPI- und/oder MPICH-Implementationen von MPI erm&ouml;glicht. Das Einrichten und Starten des Clusters ben&ouml;tigt weniger als 15 Minuten, wenn die Maschinen &uuml;ber PXE-f&auml;hige Netzwerkkarten verf&uuml;gen." --&gt; aus
<a href="http://pareto.uab.es/mcreel/ParallelKnoppix/">http://pareto.uab.es/mcreel/ParallelKnoppix/</a>

<A NAME="363lfindex1">&nbsp;</A>
<H2>Hintergrund</H2>

Clustering ist eine der preiswertesten Techniken, um Parallelit&auml;t zu erreichen. Clustering mittels Linux ist eine der besonderen Linuxeigenschaften. Universit&auml;ten und Organisationen imitieren Super-Computer durch die PC-Vernetzung mittels Ethernet-Karten unter Linux. Linux wird von der wissenschaftlichen Gemeinschaft zur Durchf&uuml;hrung ihrer Forschungen benutzt, da Linux mit einer Anzahl von wissenschaftlichen Programmen wie LAM, PI, PVM und weiteren ausgestattet ist. Daher ist Linux bestens f&uuml;r die Parallelverarbeitung geeignet. Das Problem ist jedoch, das Wissenschaftler und Programmierer eine Menge mit der Vorkonfiguration der Linux-Umgebung zu tun haben. Dies macht ihre Aufgabe langsam und komplex. Das Konfigurationsproblem wird noch verschlimmert, wenn die bestehende Umgebung nicht Linux-(d. h. Windows-)basierend ist.
<br><br>
Nun haben einige Linux-Gurus dieses Problem gel&ouml;st und Live-CDs entwickelt. Der Forscher kann nun eine Live-CD f&uuml;r seine Parallelverarbeitung w&auml;hlen, ohne sich sehr lang um die Konfiguration k&uuml;mmern zu m&uuml;ssen und der Cluster ist innerhalb einiger (7- 8) Minuten bereit.

<br><br>
Eine der Live-CDs f&uuml;r Parallelverarbeitung ist ParallelKnoppix.
<br><br>

Andere Live-CDs f&uuml;r Parallelberechnungen sind BCCD und ClusterKnoppix.
<A NAME="363lfindex2">&nbsp;</A>
<H2>Beschreibung</H2>

Genau wie sein Vorg&auml;nger (d. h. Knoppix) erkennt ParallelKnoppix automatisch s&auml;mtliche Hardware und Peripherieger&auml;te. Ich habe es auf einem D865GBF Intel-Board, einem PIV-Board und Intel 810C, einem PIII-Board getestet und ParallelKnoppix konfigurierte s&auml;mtliche Hardware automatisch; es musste nichts von Hand erledigt werden. Die mittels ParallelKnoppix konfigurierten Computer verf&uuml;gen &uuml;ber ein gemeinsam genutztes Verzeichnis, das auf dem Master-Knoten angelegt und mittels NFS (Network File System) bereitgestellt wird. Der Master-Knoten wird von der CD gebootet und die Client-Rechner &uuml;ber das Netzwerk (DHCP l&auml;uft auf dem Master-Knoten). Die Clients verf&uuml;gen &uuml;ber ein PXE-f&auml;higes BIOS mit PXE-f&auml;higen Netzwerkkarten.

<br><br>
Jeder f&uuml;r LAM/MPI ben&ouml;tigte Dienst wird automatisch konfiguriert (LAM/MPI ist eine f&uuml;r Parallel-Verarbeitung benutzte Nachrichten-basierte Schnittstellen-Spezifikation). Wie DHCP, NFS, SSH (f&uuml;r Passwort-freie Anmeldung) und schon k&ouml;nnen Sie mit MPI-Programmen und einigen anderen Parallel-Anwendungen experimentieren.

<br><br>
Die Einrichtung von ParallelKnoppix ist nicht sehr sicher, da die Passw&ouml;rter auf der Live-CD sowohl f&uuml;r einen Benutzer als auch f&uuml;r root &ouml;ffentlich bekannt sind. Jeder, der etwas Kenntnis &uuml;ber ParallelKnoppix hat, kann Zugriff auf den ParallelKnoppix-Cluster bekommen. Die Einfachheit der Einrichtung bedingt Kompromisse bei der Sicherheit. Es ist ein Ausgleich zwischen einfacher Benutzbarkeit und der Sicherheit.

<A NAME="363lfindex3">&nbsp;</A>
<H2>Was ist ein PXE-Boot?</H2>


PXE-Boot ist ein Akronym f&uuml;r Preboot Execution Environment-Boot. PXE ist eine Technik, die benutzt wird, um einen PC &uuml;ber ein Netzwerk zu starten. PXE wird vom System-BIOS unterst&uuml;tzt und die Netzwerk-Karte muss PXE-f&auml;hig sein.

<A NAME="363lfindex4">&nbsp;</A>
<H2>Was tun, wenn Ihre Netzwerk-Karte nicht PXE-f&auml;hig ist?</H2>


Dann m&uuml;ssen Sie Etherboot-Abbilder benutzen oder eine CD mit den Abbildern brennen. ROM-o-matic.net generiert Etherboot ROM-Abbilder dynamisch. http://rom-o-matic.net/

<A NAME="363lfindex5">&nbsp;</A>
<H2>Der Abruf von ParallelKnoppix</H2>


<pre class="code">ISO-Dateiabruf

FTP-Link

http://pareto.uab.es/mcreel/ParallelKnoppix/parallelknoppix.iso

HTTP-Link

ftp://volcano.uab.es/pub/parallelknoppix.iso

Abruf der MD5SUM-Pr&uuml;fsummendatei

http://pareto.uab.es/mcreel/ParallelKnoppix/parallelknoppix-2004-12-16.iso.md5

&Uuml;berpr&uuml;fen Sie die Webseite http://pareto.uab.es/mcreel/ParallelKnoppix/,<br> wenn die obigen Links nicht mehr g&uuml;ltig sind.
</pre>
Nach dem Abruf der ISO-Abbilder sollten Sie die MD5-Pr&uuml;fsummen f&uuml;r die ISO-Abbilder testen, damit sicher gestellt ist, das der Abruf erfolgreich war. Starten Sie dazu das md5sum-Programm in einer Shell gegen die ISO-Abbilder und  vergleichen Sie die zur&uuml;ckgegebenen Werte mit der md5-Datei (unten finden Sie einen Link zum Abruf). Nachstehend die korrekte Syntax f&uuml;r den md5sum-Befehl.

<pre class="code">md5sum "isofilename"
</pre>

Ersetzen Sie im obigen Befehl "isofilename" mit dem korrekten Dateinamen.

<br><br>
Wenn Sie aus irgendeinem Grund nicht Linux benutzen, sollten Sie md5Summer verwenden, einen MD5-Generator f&uuml;r Windows, nachstehend der Link.

<br><br>
http://www.md5summer.com/

<br><br>
Hinweis. Das Schreiben der ISOs auf CD erfordert ein Programm wie cdrecord.

<A NAME="363lfindex6">&nbsp;</A>
<H2>Wie funktioniert es?</H2>


Es gibt ein nettes Tutorial, voll von Schritt-f&uuml;r-Schritt-Bildschirmfotos der Konfiguration. Nachstehend der Link zum Tutorial.
<br><br>
Parallel Knoppix Tutorial - HTML-Version

<br><br>
<a href="http://pareto.uab.es/mcreel/ParallelKnoppix/Tutorial/Tutorial.html">http://pareto.uab.es/mcreel/ParallelKnoppix/Tutorial/Tutorial.html</a>

<br><br>
Parallel Knoppix Tutorial - PDF-Version

<br><br>
<a href="http://pareto.uab.es/wp/2004/62604.pdf">http://pareto.uab.es/wp/2004/62604.pdf</a>

<br><br>
Wenn Sie Ihr CD-Rom f&uuml;r die Knoten exportiert haben, kann es gut mit 50 Knoten klar kommen; mehr als 50 Knoten sind nicht getestet. Ich habe selbst nur 5 Knoten getestet.

<A NAME="363lfindex7">&nbsp;</A>
<H2>Was ist zu tun, wenn mehrere DHCP-Server aktiv sind ?</H2>


"Wenn Sie ParallelKnoppix an einer Universit&auml;t benutzen (wie ich), wird dort bestimmt ein offizieller DHCP-Server und evtl. auch ein PXE-Server existieren. Wenn Sie versuchen, die Knoten &uuml;ber den Terminalserver zu starten, werden die Knoten oft vom vorhandenen PXE-Server booten und wohl auch ihre IP-Adressen von dem offiziellen Server und nicht von dem DHCP-Server erhalten, der auf dem von der ParallelKnoppix-CD gebooteten Computer l&auml;uft. Die bis jetzt von mir benutzte L&ouml;sung ist, die als Knoten benutzten Computer physisch von den vorhandenen PXE- und/oder DHCP-Servern zu trennen, oder die Administratoren zu bitten, tempor&auml;r diese Server zu stoppen. Wenn jemand eine elegantere M&ouml;glichkeit kennt, w&uuml;rde ich gerne davon h&ouml;ren. Ich denke, das bedeutet Herumspielen mit miniroot.gz und die Benutzung von rom-o-matic zum Erzeugen des PXE-Boot-Roms. Zu schrecklich, um ernsthaft dar&uuml;ber nachzudenken ... zumindest f&uuml;r mich." --&gt; aus http://pareto.uab.es/mcreel/ParallelKnoppix/

<A NAME="363lfindex8">&nbsp;</A>
<H2>Wie es funktioniert (Zusammenfassung)</H2>


Die ParallelKnoppix-Live-CD wird zum Starten eines Master-Knotens genutzt. Auf diesem Master-Knoten wird ein Skript ausgef&uuml;hrt, das einen DHCP-Server einrichtet, ein gemeinsames Verzeichnis wird f&uuml;r alle Knoten mittels NFS exportiert und &ouml;ffentliche Schl&uuml;ssel f&uuml;r LAM generiert, damit SSH einwandfrei arbeitet (Passwort-lose Anmeldung). Nachdem der DHCP-Server l&auml;uft, werden die Clients mittels PXE-Boot gestartet. Nach dem erfolgreichen Start wird das Verzeichnis mit Beispielprogrammen in das per NFS gemeinsam genutzte Verzeichnis eingef&uuml;gt und parallele Programme werden parallel auf mehreren PCs ausgef&uuml;hrt.

<A NAME="363lfindex9">&nbsp;</A>
<H2>Meine Erfahrungen</H2>


Ich bin ein Bachelor-Student der Informatik und bekam ein Projekt zur L&ouml;sung eines mathematischen Problems mittels MPI im Labor f&uuml;r Parallelverarbeitung. Ich w&auml;hlte ParallelKnoppix als Alternative, um mein MPI-Programm in einer Linuxumgebung zu demonstrieren. Der Master-Knoten wird &uuml;ber die ParallelKnoppix-CD gestartet. W&auml;hrend des Bootens werden Sie nach der Resolution gefragt; geben Sie einfach "6" ein, weil dies die maximal unterst&uuml;tzte Aufl&ouml;sung ist. Nach dem Booten des Master-Knotens startete ich das ParallelKnoppix-Setupskript mittels
K&gt;ParallelKnoopixx&gt;Setup ParallelKnoppix (siehe das obige Tutorial). Nachdem das Skript den DHCP-Server startete, schaltete  ich meine Client-Knoten an und sie booteten mittels PXE. Danach waren alle Knoten erfolgreich gestartet.
<br><br>
Ich kopierte mein Programm in das Verzeichnis  "parallel_knoppix_working" und benutzte dann ein Terminal, um mein MPI-Programm parallel laufen zu lassen.

<pre class="code">F&uuml;r die Kompilation benutzte ich

mpicc myprogram.c -o myprogram.bin

und zur Ausf&uuml;hrung

mpirun C myprogram.bin
</pre>

<A NAME="363lfindex10">&nbsp;</A>
<H2>Zusammenfassung</H2>


"Die ParallelKnoppix-CD bietet eine sehr einfache und schnelle M&ouml;glichkeit, einen Cluster verschiedenartiger PCs der IA-32-Architektur einzurichten. Sie ist nicht daf&uuml;r gedacht, einen stabilen Cluster f&uuml;r verschiedene Benutzer zu bieten, sondern ist ein Hilfsmittel f&uuml;r die schnelle Errichtung eines Clusters f&uuml;r die individuelle Benutzung. Die CD selbst kann angepasst werden und die
Konfigurations- und Arbeitsdateien k&ouml;nnen wieder verwandt werden, so dass dies eine langfristige L&ouml;sung f&uuml;r individuelle Benutzer bietet." Aus dem ParallelKnoppix-Tutorial von Michael Creel

<A NAME="363lfindex11">&nbsp;</A>
<H2>Referenzen</H2>


<ul>
<li>Webseite zu ParallelKnoppix <a href="http://pareto.uab.es/mcreel/ParallelKnoppix/">http://pareto.uab.es/mcreel/ParallelKnoppix/</a>

<br>
<br>
</li><li>High Performance Linux-Cluster mit OSCAR, Rocks, OpenMosix und MPI von Joseph D. Sloan,

Publisher: O'Reilly Pub Date: November 2004

<a href="http://safari.oreilly.com/0596005709">http://safari.oreilly.com/0596005709</a>
<br>
<br>


</li><li>K N O P P I X
<pre>Webseiten:
http://www.knoppix.org
http://www.Knoppix.com
http://www.Knoppix.net

Offizielle Webseite
http://www.knopper.net/knoppix/index-en.html
</pre>
<br>
<br>

</li><li> ROM-o-matic.net generiert dynamisch Etherboot ROM-Abbilder.

<a href="http://rom-o-matic.net/">http://rom-o-matic.net/</a>
<br>
<br>

</li><li>Diskussionspapier zu Parallel Knoppix von Michael Creel (14th October 2004):

http://pareto.uab.es/wp/2004/62504.pdf
<br>
<br>

</li><li>Ein detailliertes Tutorial mit vielen Bildschirmfotos, die die Benutzung von ParallelKnoppix zeigen Michael Creel (15th December 2004):

http://pareto.uab.es/wp/2004/62604.pdf

<br>
<br>
</li><li>LAM/MPI Parallel Computing

<a href="http://www.lam-mpi.org/">http://www.lam-mpi.org/</a>

<br>
<br>
</li><li>LAM/MPI User's Guide:

Ein vollst&auml;ndiges Benutzer-Handbuch f&uuml;r LAM/MPI. Empfohlene Lekt&uuml;re f&uuml;r alle LAM/MPI-Benutzer.

<a href="http://www.lam-mpi.org/download/files/7.1.1-user.pdf">http://www.lam-mpi.org/download/files/7.1.1-user.pdf</a>
</li></ul>


<!-- vim: set sw=2 ts=2 et tw=74: -->

<!-- BODY_OF_THE_ARTICLE_STOP -->
<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback f&uuml;r diesen Artikel</h2>
Jeder Artikel hat seine eigene Seite f&uuml;r Kommentare und R&uuml;ckmeldungen. Auf dieser Seite kann jeder eigene Kommentare abgeben und die Kommentare anderer Leser sehen:
<center>
    <table width="250" border=0><tr><td>
    <div class="tbbutton"><A class="nodec" href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=363">&nbsp;Talkback Seite&nbsp;</a></div>
    </td></tr></table>
</center>

<br clear="all">
<HR size="2" noshade>
<table width="250" border=0><tr><td>
<div class="bbutton"><a class="nodec" href="../../index.shtml">&lt;--, LF Home</a></div>
</td><td>
<div class="bbutton"><a class="nodec" href="index.shtml">Zum index dieser Ausgabe</a></div>
</td></tr></table>
<br clear="all">
<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">Der LinuxFocus Redaktion schreiben</A>
<BR><FONT COLOR="#1111aa"><a href="../../common/copy.html">&copy; Majid Hameed</a><br>&quot;some rights reserved&quot; see <a href="../../license/index.shtml">linuxfocus.org/license/</a><br><a href="http://www.linuxfocus.org">http://www.LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Autoren und &Uuml;bersetzer:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Majid Hameed <small>&lt;hameed.majid(at)gmail.com&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; de: Hermann J. Beckers &lt;hjb-rheine(at)t-online.de&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2005-01-09, generated by lfparser version 2.51</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
