<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<TITLE>LinuxFocus Index</TITLE>
<style type="text/css">
<!--
td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
a.nodec { text-decoration:none }
a.l { color:#555 }
div.l {  color:#666 }
p.indent { margin: 1px 1px 1px 0.5cm;}
-->
</style>
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000">


<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="index.shtml"><FONT color=
                 "#DDDDDD" size="-1">Sommaire</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="map.html"><FONT color=
                 "#DDDDDD" size="-1">Carte</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="indice.html"><FONT color=
                 "#DDDDDD" size="-1">Index</FONT></A> &nbsp;|&nbsp; <A class="nodec" href="Search/index.html"><FONT color=
                 "#DDDDDD" size="-1">Recherche</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="News/index.shtml"><FONT color=
           "#FFFFFF">Nouvelles</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="Archives/index.html"><FONT color=
           "#FFFFFF">Archives</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="Links/index.html"><FONT color=
           "#FFFFFF">Liens</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="aboutus.html"><FONT color=
           "#FFFFFF">A propos</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->
<H1>Index LinuxFocus par num&eacute;ro</H1>
<p>Liste de tous les articles de LinuxFocus class&eacute;s par num&eacute;ro.</p>
<HR noshade="noshade" size=2>


<h2><a href="../English/September2005/index.shtml">2005/09</a></h2>
<UL>
<LI><img src="../common/images/frame_tuxgrey.gif" width="27" height="32" alt="[not translated]"> <A href="../English/September2005/article389.shtml">A digital DC power supply -- part 3: command control from the PC</A><br>A very small an really powerful DC power supply for your hobby lab. In this third part. We make it possible to remotly control the DC power supply via a command line interface.</p>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="August2005/index.shtml">2005/08</a></h2>
<UL>
<LI><p class="indent"><A href="August2005/article386.shtml">Truc LF: #defines pour écrire du code C portable</A><br>Comment obtenir une liste des defines disponibles.</p><br>
</li>
<LI><p class="indent"><A href="August2005/article387.shtml">Automatiser la création de graphes avec Graphviz</A><br>Graphviz est un logiciel de visualisation de graphes en ligne de commande.</p><br>
</li>
<LI><p class="indent"><A href="August2005/article388.shtml">Simulation d'ADN assistée par ordinateur, en utilisant Linux et Perl</A><br>Cet article montre une manière de générer n séquences d'ADN avec s nucléotides, avec Perl.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="July2005/index.shtml">2005/07</a></h2>
<UL>
<LI><p class="indent"><A href="July2005/article383.shtml">Truc LF: Souris USB et portables</A><br>Comment faire fonctionner une souris USB sans redémarrer le serveur X.</p><br>
</li>
<LI><p class="indent"><A href="July2005/article384.shtml">Une alimentation numérique CC -- partie 2: le logiciel</A><br>Comment fonctionne le logiciel.</p><br>
</li>
<LI><p class="indent"><A href="July2005/article385.shtml">Lecture: The Linux Enterprise Cluster</A><br>La revue du livre "The Linux Enterprise Cluster" de No Starch press.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="June2005/index.shtml">2005/06</a></h2>
<UL>
<LI><p class="indent"><A href="June2005/article378.shtml">Truc LF: Ne me bipez pas</A><br>Comment faire cesser les bips de votre ordinateur Linux.</p><br>
</li>
<LI><p class="indent"><A href="June2005/article379.shtml">Une alimentation numérique CC</A><br>Une alimentation CC très petite mais puissante pour votre laboratoire. Elle possède beaucoup des fonctionctionalités que vous trouvez sur des alimentations très chères. Celle-ci est bon marché, petite et facile à contruire.</p><br>
</li>
<LI><p class="indent"><A href="June2005/article380.shtml">Truc LF: Utiliser Acrobat 7 avec kde et kprinter</A><br>Comment conourner un bogue de la version 7 de acroread.</p><br>
</li>
<LI><p class="indent"><A href="June2005/article381.shtml">Logiciel défectueux</A><br>La mesure de la densité de défauts d'un logiciel sert à estimer sa qualité. Est-ce correct?</p><br>
</li>
<LI><p class="indent"><A href="June2005/article382.shtml">Une chaîne d'outils pour la transformation du papier en HTML</A><br>Ou comment convertir un vieux magazine papier en un document html.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="May2005/index.shtml">2005/05</a></h2>
<UL>
<LI><p class="indent"><A href="May2005/article376.shtml">Truc LF: Extensions firefox essentielles</A><br>Deux extensions firefox très intéressantes.</p><br>
</li>
<LI><p class="indent"><A href="May2005/article377.shtml">Naviguer avec snavigator</A><br>Cet article présente snavigator, un analyseur de code puissant avec des outils pour les références croisées et le refaçonnage.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="April2005/index.shtml">2005/04</a></h2>
<UL>
<LI><p class="indent"><A href="April2005/article372.shtml">Bayonne: le projet opensource pour le téléphone et les services IVR</A><br>GNU Bayonne est un serveur d'aplication ajustable pour la téléphonie.     </p><br>
</li>
<LI><p class="indent"><A href="April2005/article373.shtml">Truc LF: résoudre le problème de l'horrible  touche</A><br>De meilleures alternatives à la touche Windows.</p><br>
</li>
<LI><p class="indent"><A href="April2005/article374.shtml">LINUX &amp; PERL, des outils informatiques pour l'étude et l'analyse d'informations biologiques</A><br>Comment extraire facilement, avec Perl, des informations des bases de données  des séquences d'ADN, d'ARN et de proteïnes.</p><br>
</li>
<LI><p class="indent"><A href="April2005/article375.shtml">lcdproc -- Affichage LCD facile à utiliser et facile à construire</A><br>Où comment utiliser lcdproc pour connecter un afficheur LCD et 2 boutons à un PC Linux.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="March2005/index.shtml">2005/03</a></h2>
<UL>
<LI><p class="indent"><A href="March2005/article369.shtml">Partie 2 -- Un thermomètre numérique ou parlez I2C à votre microcontrôleur Atmel</A><br>Dans cette seconde partie de l'article, nous allons connecter une afficheur LCD et je vous explique comment fonctionne le logiciel.</p><br>
</li>
<LI><p class="indent"><A href="March2005/article370.shtml">Truc LF :Cloner complètement des PC par le réseau</A><br>Cet article explique comme cloner des partitions avec dump et restore.</p><br>
</li>
<LI><p class="indent"><A href="March2005/article371.shtml">Optimiser les programmes C/C++ en utilisant GProf profiler</A><br>Une des choses les plus importantes à garder en mémoire lors de l'optimisation d'une application est de la faire là où c'est important.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="February2005/index.shtml">2005/02</a></h2>
<UL>
<LI><p class="indent"><A href="February2005/article365.shtml">Un thermomètre numérique ou parlez I2C à votre microcontrôleur Atmel</A><br>Comment connecter un microcontrôleur à un PC sous Linux par une liaison RS232 interface sans circuit MAX232.</p><br>
</li>
<LI><p class="indent"><A href="February2005/article366.shtml">Truc LF: Générer des PDF depuis des documents html</A><br>Générer des PDF depuis des documents html avec toutes les images n'est pas si facile, voici quelques trucs pour le faire.</p><br>
</li>
<LI><p class="indent"><A href="February2005/article367.shtml">Écrivez votre propre comparateur pour netfilter</A><br>Le canevas iptables/netfilter nous donne la possiblité d'ajouter des fonctionnalités.</p><br>
</li>
<LI><p class="indent"><A href="February2005/article368.shtml">Présentation professionnelle de Tex(te) avec LyX</A><br>Cet article est écrit pour les personnes qui ont beaucoup d'édition/de présentation de textes à faire et qui sont d'abord intéressés par une édition de texte rapide, fiable avec une sortie papier agréable.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="January2005/index.shtml">2005/01</a></h2>
<UL>
<LI><p class="indent"><A href="January2005/article362.shtml">Truc LF: Les marque-pages dynamiques sous LinuxFocus</A><br>Truc LinuxFocus de Janvier 2005.</p><br>
</li>
<LI><p class="indent"><A href="January2005/article363.shtml">ParallelKnoppix</A><br>Un CD Live basé sur Knoppix qui fournit un Cluster Linux prêt pour MPI et autres Calculs Parallèle en moins de 15 minutes!</p><br>
</li>
<LI><p class="indent"><A href="January2005/article364.shtml">Contrôler des signatures gpg des courriels avec Sylpheed-Claws</A><br>Comment installer un greffon gpg et contrôler une signature de courriel avec Sylpheed-Claws en utilisant quelques commandes de bash par tubes.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="December2004/index.shtml">2004/12</a></h2>
<UL>
<LI><p class="indent"><A href="December2004/article354.shtml">Une introduction à SPF</A><br>SPF est l'acronyme de Sender Policy Framework (Cadre de Politique d'Expéditeur). SPF vise à être une norme anti-contrefaçon pour prévenir la contrefaçon d'adresses de courriels.</p><br>
</li>
<LI><p class="indent"><A href="December2004/article355.shtml">Utiliser gEDA</A><br>gEDA est une chaîne d'outils pour la conception de circuits électroniques.</p><br>
</li>
<LI><p class="indent"><A href="December2004/article358.shtml">Truc LF: raccourcis claviers emacs pour éditer les url dans firefox</A><br>Truc LinuxFocus de Décembre 2004.</p><br>
</li>
<LI><p class="indent"><A href="December2004/article359.shtml">Fn-F12: Geler un laptop Thinkpad T20 d'IBM</A><br>Cet article explique comment faire fonctionner l'hibernation (suspend-to-disk) sur un IBM Thinkpad T20 sans MS-Windows installé.</p><br>
</li>
<LI><p class="indent"><A href="December2004/article360.shtml">Checkinstall</A><br>Checkinstall est un utilitaire pour construire automatiquement les paquets RPM/Debian/Slackware depuis les sources tar.gz.</p><br>
</li>
<LI><p class="indent"><A href="December2004/article361.shtml">Réseaux sans fils sous Linux</A><br>Dans cet article, l'auteur détaille l'installation de pilote et l'utilisation de quelques cartes sans fil ainsi que des éléments sur l'authetification basée sur les méthodes 802.1x.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="November2004/index.shtml">2004/11</a></h2>
<UL>
<LI><p class="indent"><A href="November2004/article352.shtml">Programmer les microcontrôleurs AVR avec GCC, libc 1.0.4</A><br>Comment programmer les micro-contrôleurs AVR d'Atmel avec GCC. Mise à jour de l'article de Mars 2004 pour libc 1.0.4.</p><br>
</li>
<LI><p class="indent"><A href="November2004/article353.shtml">Truc LF: déconnecter le lissage des polices</A><br>Truc Linuxfocus pour Novembre 2004.</p><br>
</li>
<LI><p class="indent"><A href="November2004/article356.shtml">Prêt à connaître un compilateur pascal libre: Free Pascal</A><br>Free Pascal permet la combinaison de la programmation en mlode texte et orienté objet aussi puissant que RAD Delphi.</p><br>
</li>
<LI><p class="indent"><A href="November2004/article357.shtml">Truc LF: Personnaliser motd &amp; issue</A><br>Second Truc LinuxFocus pour Novembre 2004.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="October2004/index.shtml">2004/10</a></h2>
<UL>
<LI><p class="indent"><A href="October2004/article350.shtml">Logiciel de développement indépendant de la plate-forme</A><br>Cet article passe en revue les différentes possibilités pour construire des interfaces utilisateur indépendantes de la plate-forme.</p><br>
</li>
<LI><p class="indent"><A href="October2004/article351.shtml">Truc LF: Changer la configuration du clavier à la volée</A><br>Truc Linuxfocus pour Octobre 2004.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="September2004/index.shtml">2004/09</a></h2>
<UL>
<LI><p class="indent"><A href="September2004/article345.shtml">Linux pour la Science - Ou comment un outil utile pour les r&eacute;seaux neuraux a &eacute;t&eacute; d&eacute;velopp&eacute;</A><br>Cet article illustre la grande utilit&eacute; des logiciels bas&eacute;s sur Linux, dans le cadre du d&eacute;veloppement scientifique.</p><br>
</li>
<LI><p class="indent"><A href="September2004/article346.shtml">darkstat - un analyseur de traffic r&eacute;seau</A><br>Nous vous pr&eacute;sentons dans cet article le logiciel d'analyse de traffic r&eacute;seau "darkstat", que vous saurez ensuite installer et utiliser.</p><br>
</li>
<LI><p class="indent"><A href="September2004/article347.shtml">Une simple animation</A><br>Cr&eacute;er une animation toute simple est un art aussi simple qu'amusant, pour les enfants comme pour les plus grands.</p><br>
</li>
<LI><p class="indent"><A href="September2004/article348.shtml">Cr&eacute;er des vues panoramiques, avec Hugin, Enblend et le Gimp</A><br>Vous apprendrez dans cet article &agrave; r&eacute;aliser des vues panoramiques &agrave; l'aide des trois logiciels pr&eacute;-cit&eacute;s.</p><br>
</li>
<LI><p class="indent"><A href="September2004/article349.shtml">Le myst&egrave;re des points de montage</A><br>Cet article explique le concept de point de montage, avec l'espoir non dissimul&eacute; d'offrir une information propre &agrave; satisfaire la curiosit&eacute; des novices comme des utilisateurs plus exp&eacute;riment&eacute;s.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="July2004/index.shtml">2004/07</a></h2>
<UL>
<LI><p class="indent"><A href="July2004/article283.shtml">Entretien avec Jeff Dike</A><br>UML (User Mode Linux, un Linux dans Linux) est l'une des grandes nouveaut&eacute;s apport&eacute;es &agrave; la s&eacute;rie 2.6 des noyaux Linux. Je vous propose ici une interview de Jeff Dike, le cr&eacute;ateur d'UML.</p><br>
</li>
<LI><p class="indent"><A href="July2004/article340.shtml">Perte de donn&eacute;es : le pire des sc&eacute;narii</A><br>&Eacute;tude d'un cas r&eacute;el de perte de donn&eacute;es, fort heureusement bien termin&eacute; gr&acirc;ce &agrave reiserfsck. &Eacute;loge des syst&egrave;mes de fichiers journalis&eacute;s et des outils associ&eacute;s.</p><br>
</li>
<LI><p class="indent"><A href="July2004/article341.shtml">vsftpd - Pr&eacute;sentation d'un d&eacute;mon FTP ultra-s&eacute;ris&eacute;</A><br>Cet article vous propose une br&egrave;ve introduction au serveur FTP s&eacute;curis&eacute; vsftpd. Apr&egrave;s une description g&eacute;n&eacute;rale de FTP et vsftpd, vous en apprendrez plus sur l'installation, la configuration et les options de d&eacute;marrage du programme.</p><br>
</li>
<LI><p class="indent"><A href="July2004/article342.shtml">Surveillance de la temp&eacute;rature avec Linux (2)</A><br>Dans ce second article, nous verrons comment enregistrer les donn&eacute;es dans une base MySQL puis en obtenir une repr&eacute;sentation graphique.</p><br>
</li>
<LI><p class="indent"><A href="July2004/article343.shtml">Pourquoi &ccedil;a ne marche pas !? Comment rep&eacute;rer et corriger les erreurs dans une application Linux</A><br>S'il on entend ici et l&agrave; qu'il est particuli&egrave;rement ais&eacute; de trouver et corriger des bugs dans les programmes &eacute;crits pour Linux, il n'en est pas moins difficile de trouver de la documentation sur la fa&ccedil;on de s'y prendre.</p><br>
</li>
<LI><p class="indent"><A href="July2004/article344.shtml">Dia, un programme de cr&eacute;ation de diagrammes</A><br>Dia est un programme d'&eacute;dition de sch&eacute;mas bas&eacute; sur Gnome.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="May2004/index.shtml">2004/05</a></h2>
<UL>
<LI><p class="indent"><A href="May2004/article335.shtml">Le shell en couleur : du bon usage des codes couleur ANSI</A><br>Dans un terminal compatible ANSI (xterm, rxvt, konsole...), il est possible d'afficher un texte en couleur. Cet article explique comment faire.</p><br>
</li>
<LI><p class="indent"><A href="May2004/article336.shtml">Gentoo Linux</A><br>Gentoo Linux est une distribution bas&eacute;e sur un syst&egrave;me de paquetages sources. Ne serait-ce que sur ce point, elle est tr&egrave;s diff&eacute;rente des distributions commerciales bien connues.</p><br>
</li>
<LI><p class="indent"><A href="May2004/article337.shtml">shivalik -- sauvegarder facilement sa configuration (ou comment se jouer de la loi de Murphy)</A><br>Il existe pl&eacute;thore de HOWTOs traitant des m&eacute;thodes &agrave; mettre en oeuvre pour r&eacute;cuperer un syst&egrave;me endommag&eacute;, mais aucun ne vous explique ce que vous pouvez faire en pr&eacute;vision du d&eacute;sastre. Cet article vous propose quelques suggestions pour votre politique de sauvegarde.</p><br>
</li>
<LI><p class="indent"><A href="May2004/article338.shtml">Communiquer avec un processus en cours</A><br>RTA (Run Time Access) et une biblioth&egrave;que qui vous permet de voir les structures de donn&eacute;es de votre programme dans une base de donn&eacute;es PostgreSQL ou dans un syst&egrave;me de fichiers virtuel (analogue &agrave; /proc).</p><br>
</li>
<LI><p class="indent"><A href="May2004/article339.shtml">La 3D avec Blender : mod&eacute;liser une montre</A><br>Nous allons dans cet article mod&eacute;liser une montre avec Blender.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="March2004/index.shtml">2004/03</a></h2>
<UL>
<LI><p class="indent"><A href="March2004/article326.shtml">Rsync: Le meilleur des syst&egrave;mes de sauvegarde</A><br>La sauvegarde est un domaine d'autant plus d&eacute;licat qu'elle est souvent n&eacute;glig&eacute;e. Cet article nous propose une solution bas&eacute;e sur rsync, un mod&egrave;le de simplicit&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="March2004/article328.shtml">Linux sur S/390 (les IBM z-Series)</A><br>Le S/390 est un ordinateur IBM tr&egrave;s pris&eacute; dans les entreprises et sur lequel on peut faire tourner Linux.</p><br>
</li>
<LI><p class="indent"><A href="March2004/article329.shtml">Gambas: le Basic pour Linux</A><br>Gambas est un environnement de programmation Basic pour Linux.</p><br>
</li>
<LI><p class="indent"><A href="March2004/article330.shtml">uucpssh.org: votre messagerie sous Linux avec UUCP</A><br>Dans le monde de Windows, on utilise le protocole POP3 ou IMAP pour la r&eacute;ception des messages, et SMTP pour leur envoi. Cela peut &ecirc;tre la cause de bien des maux de t&ecirc;te, d'autant plus si vous utilisez plusieurs FAI.</p><br>
</li>
<LI><p class="indent"><A href="March2004/article331.shtml">Introduction &agrave; TclMySQL</A><br>La biblioth&egrave;que TclMySQL permet d'interfacer vos programmes Tcl avec une base de donn&eacute;es MySQL.</p><br>
</li>
<LI><p class="indent"><A href="March2004/article332.shtml">Programmer des interfaces graphiques avec GTK - Partie III</A><br>Dans cette s&eacute;rie d'articles; nous allons apprendre comment &eacute;crire des interfaces graphiques (GUIs) utilisant GTK.</p><br>
</li>
<LI><p class="indent"><A href="March2004/article333.shtml">Tuxpaint : Un programme de dessin pour les enfants</A><br>Tux paint est un programme de dessin destin&eacute; aux enfants. Amusant et bien con&ccedil;u, il peut aussi charmer les plus grands !</p><br>
</li>
<LI><p class="indent"><A href="March2004/article334.shtml">Les statistiques vous int&eacute;ressent ?</A><br>La plupart des programmes de statistiques sont de vraies usines &agrave; gaz, imposant &agrave; l'utilisateur un long processus d'apprentissage. Et encore leur prix est-il parfois prohibitif ! Si vous cherchez une alternative, essayez donc Salstat.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="January2004/index.shtml">2004/01</a></h2>
<UL>
<LI><p class="indent"><A href="January2004/article319.shtml">Les calculatrices NPI sous Linux</A><br>Cet article pr&eacute;sentera les diff&eacute;rentes calculatrices &agrave; notation postfix&eacute;e disponibles sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="January2004/article320.shtml">Suivre les rouages internes de Linux avec Syscalltracker</A><br>Cet article nous montre comment "d&eacute;boguer" vos programmes au niveau des appels syst&egrave;me.</p><br>
</li>
<LI><p class="indent"><A href="January2004/article321.shtml">StoreBackup, la solution de sauvegarde non conventionnelle</A><br>storeBackup est un outil de sauvegarde tr&egrave;s souple.</p><br>
</li>
<LI><p class="indent"><A href="January2004/article322.shtml">Faisons un peu d'&eacute;lectronique</A><br>Des logiciels pour cr&eacute;er des circuits &eacute;lectroniques ? Oui, c'est aussi disponible sous Linux. Cet article vous montrera ce dont vous avez besoin.</p><br>
</li>
<LI><p class="indent"><A href="January2004/article323.shtml">Test: les portables pr&eacute;install&eacute;s par LinuxCertified</A><br>Voici une pr&eacute;sentation des portables fournis par linuxcertified.com</p><br>
</li>
<LI><p class="indent"><A href="January2004/article324.shtml">Comprendre le syst&egrave;me de fichiers /proc</A><br>Le syst&egrave;me de fichiers /proc est un syst&egrave;me de fichiers virtuel fournissant une multitude d'informations concernant les mat&eacute;riels ainsi que sur les m&eacute;canismes internes du noyau.</p><br>
</li>
<LI><p class="indent"><A href="January2004/article325.shtml">La 3D avec Blender: mod&eacute;liser un coffre</A><br>Dans cet article nous mod&eacute;lisons un coffre au tr&eacute;sor avec Blender.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="November2003/index.shtml">2003/11</a></h2>
<UL>
<LI><p class="indent"><A href="November2003/article309.shtml">&Eacute;crire des pages de manuel</A><br>Cette article explique comment &eacute;crire vos propres pages de manuel.</p><br>
</li>
<LI><p class="indent"><A href="November2003/article313.shtml">Lecture: L'Art de la programmation UNIX</A><br>Une revue du livre "L'Art de la programmation UNIX" &eacute;crit par Eric S. Raymond.</p><br>
</li>
<LI><p class="indent"><A href="November2003/article314.shtml">GIMP: Fabriquez vos propres pinceaux</A><br>Cet article traite des diff&eacute;rents types de pinceaux que poss&egrave;de The Gimp et montre comment en cr&eacute;er.</p><br>
</li>
<LI><p class="indent"><A href="November2003/article315.shtml">Surveillance de la temp&eacute;rature avec Linux</A><br>Cette article explique comment en d&eacute;pensant 10 vous pouvez avoir un moniteur de temp&eacute;rature sur votre serveur.</p><br>
</li>
<LI><p class="indent"><A href="November2003/article316.shtml">Programmation en temps partag&eacute; - Files d'attente de messages (3)</A><br>Voici le dernier article de cette s&eacute;rie traitant de la programmation en temps partag&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="November2003/article317.shtml">Un Fax Numeris avec Linux</A><br>Cet article d&eacute;crit la fa&ccedil;on d'utiliser votre machine Linux en tant que Fax Numeris.</p><br>
</li>
<LI><p class="indent"><A href="November2003/article318.shtml">La 3D avec Blender: une pi&egrave;ce avec des jouets</A><br>Dans cette troisi&egrave;me partie de notre s&eacute;rie concernant Blender, nous positionnerons notre train dans une chambre d'enfant et nous mod&eacute;liserons quelques jouets de plus.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="September2003/index.shtml">2003/09</a></h2>
<UL>
<LI><p class="indent"><A href="September2003/article304.shtml">L'API C de MySQL</A><br>Nous allons apprendre dans cet article comment utiliser l'API C de MySQL, autrement dit, les fonctions C d'interface vers MySQL.</p><br>
</li>
<LI><p class="indent"><A href="September2003/article306.shtml">Linux sur le bureau : Un ordinateur pour maman</A><br>Ma maman appartient &agrave; une g&eacute;n&eacute;ration qui a grandi sans ordinateur. Elle utilise Linux sur le bureau maintenant et elle aime &ccedil;a.</p><br>
</li>
<LI><p class="indent"><A href="September2003/article307.shtml">La 3D avec Blender: Un petit train</A><br>Dans le second article de notre s&eacute;rie concernant la mod&eacute;lisation avec Blender, nous allons cr&eacute;er un petit train.</p><br>
</li>
<LI><p class="indent"><A href="September2003/article308.shtml">Avoir automatiquement du mail avec un routeur fli4l</A><br>Comment r&eacute;cup&eacute;rer des m&egrave;l avec un routeur &lt;i&gt;appel-&agrave;-la-demande&lt;/i&gt;fournit par www.fli4l.de et tenant sur une disquette.</p><br>
</li>
<LI><p class="indent"><A href="September2003/article310.shtml">Un petit guide pour l'installation de CVW sur Linux</A><br>CVW pour Collaborative Virtual Workspaces (Espaces de travail collaboratifs virtuels) est un des plus beaux outils open sources disponible pour le d&eacute;veloppement de l'&eacute;ducation virtuelle.</p><br>
</li>
<LI><p class="indent"><A href="September2003/article311.shtml">Manipulation de photos avec Gimp</A><br>Dans cette article nous verrons comment manipuler les photos avec the Gimp.</p><br>
</li>
<LI><p class="indent"><A href="September2003/article312.shtml">Les espaces de travail collaboratifs virtuels et leurs avantages</A><br>Il s'agit de fournir des informations concernant le projet d'apprentissage virtuel de l'Universit&eacute; de Santiago de Cali.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="July2003/index.shtml">2003/07</a></h2>
<UL>
<LI><p class="indent"><A href="July2003/article294.shtml">IDS - Syst&egrave;me de D&eacute;tection d'Intrusion, Partie II</A><br>Dans cet article nous pr&eacute;sentons les m&eacute;thodes pour d&eacute;tecter une intrusion et d&eacute;taillons les moyens de r&eacute;pondre &agrave; une telle attaque.</p><br>
</li>
<LI><p class="indent"><A href="July2003/article297.shtml">Construire un robot autonome d&eacute;tecteur de lumi&egrave;re</A><br>Dans cet article nous d&eacute;crivons comment construire un robot autonome avec un micro-contr&ocirc;leur qui essaiera toujours de se diriger vers le point le plus lumineux.</p><br>
</li>
<LI><p class="indent"><A href="July2003/article299.shtml">Un tour des "petites applications" GNUstep</A><br>Un tr&egrave;s bref tour d'horizon des petits "outils" de GNUstep.</p><br>
</li>
<LI><p class="indent"><A href="July2003/article300.shtml">Un analyseur de 1 bit</A><br>Cet article d&eacute;crit un analyseur de 1 bit qui &eacute;chantillonne les donn&eacute;es et les envoie vers une machine Linux par le port RS232.</p><br>
</li>
<LI><p class="indent"><A href="July2003/article301.shtml">Essai : Textmaker</A><br>Le traitement de texte Textmaker est maintenant disponible pour Linux. Etudions ses caract&eacute;ristiques.</p><br>
</li>
<LI><p class="indent"><A href="July2003/article302.shtml">Lecture : ma&icirc;triser RedHat Linux 9</A><br>Voici une pr&eacute;sentation du livre Ma&icirc;triser Red Hat Linux 9. par  Jang, Michael, Sybex.</p><br>
</li>
<LI><p class="indent"><A href="July2003/article303.shtml">Programmer des interfaces graphiques avec GTK - Partie II</A><br>Voici le deuxi&egrave;me article de la s&eacute;rie sur GTK. Cette fois, nous pr&eacute;sentons les bo&icirc;tes et les tableaux.</p><br>
</li>
<LI><p class="indent"><A href="July2003/article305.shtml">La 3D avec Blender : premiers pas</A><br>Blender est un programme de graphisme 3D "open source". Dans ce premier article d'une s&eacute;rie sur Blender, nous abordons les bases et construisons une sc&egrave;ne contenant une sph&egrave;re et un cube.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="May2003/index.shtml">2003/05</a></h2>
<UL>
<LI><p class="indent"><A href="May2003/article288.shtml">Concevoir un effet de d&eacute;filement de texte avec SDL</A><br>SDL est une simple couche destin&eacute;e &agrave; concevoir des repr&eacute;sentations graphiques rapides et portables.</p><br>
</li>
<LI><p class="indent"><A href="May2003/article289.shtml">Le filtrage de paquets sous Linux</A><br>Comment installer un pare-feu.</p><br>
</li>
<LI><p class="indent"><A href="May2003/article290.shtml">Un bref guide d'installation de Ximian Evolution</A><br>Comment installer Ximian Evolution sous Mandrake 9.x.</p><br>
</li>
<LI><p class="indent"><A href="May2003/article291.shtml">GWorkspace, le Workspace Manager de GNUstep</A><br>La notion de "Workspace Manager" (gestionnaire d'espace de travail) est apparue avec NeXT &agrave; la fin des ann&eacute;es 80. GWorkspace est la version libre de cette r&eacute;volution.</p><br>
</li>
<LI><p class="indent"><A href="May2003/article292.shtml">IDS - Syst&egrave;me de D&eacute;tection d'Intrusion, Partie I</A><br>Cet article pr&eacute;sente non seulement les architectures IDS mais les attaques classiques contre ces syst&egrave;mes sont &eacute;galement discut&eacute;es et analys&eacute;es.</p><br>
</li>
<LI><p class="indent"><A href="May2003/article293.shtml">Etude de cas</A><br>Formuler de grandes th&eacute;ories sur un site se voulant informatif, distrayant et commercialement viable est une chose. Transformer une passion en un site de commerce &eacute;lectronique solide est une toute autre chose.</p><br>
</li>
<LI><p class="indent"><A href="May2003/article295.shtml">Programmer des interfaces graphiques avec GTK</A><br>Voici le premier article d'une s&eacute;rie sur la programmation d'interfaces graphiques avec GTK.</p><br>
</li>
<LI><p class="indent"><A href="May2003/article296.shtml">Programmation en temps partag&eacute; - Files d'attente de messages (2)</A><br>Suite de la s&eacute;rie sur la programmation en temps partag&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="May2003/article298.shtml">CDROM 8cm Multiboot avec une distribution Knoppix adapt&eacute;e</A><br>Comment cr&eacute;er votre propre mini CD "bootable".</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="March2003/index.shtml">2003/03</a></h2>
<UL>
<LI><p class="indent"><A href="March2003/article271.shtml">Rudiments d'acoustique et de traitement du signal</A><br>Tout sur le son : la physique, les ondes, l'oreille humaine, le son num&eacute;rique...</p><br>
</li>
<LI><p class="indent"><A href="March2003/article273.shtml">Securiser vos connexions avec SSH</A><br>Cet article est une description approfondie de SSH.</p><br>
</li>
<LI><p class="indent"><A href="March2003/article280.shtml">Lecture : D&eacute;marrer avec les bases de donn&eacute;es PHP4</A><br>D&eacute;marrer avec les bases de donn&eacute;es PHP4 est un livre des Editions Wrox press.</p><br>
</li>
<LI><p class="indent"><A href="March2003/article282.shtml">Attaques externes</A><br>Cet article pr&eacute;sente les diff&eacute;rents types d'attaques externes susceptibles d'&ecirc;tre utilis&eacute;s par un pirate.</p><br>
</li>
<LI><p class="indent"><A href="March2003/article284.shtml">Mesurer la pression atmosph&eacute;rique avec Linux</A><br>Cet article d&eacute;crit une solution &agrave; petit prix pour mesurer la pression atmosph&eacute;rique avec un ordinateur sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="March2003/article285.shtml">Acc&eacute;der &agrave; PostgreSQL avec JDBC par un tunnel SSL Java</A><br>Cet article montre comment d&eacute;finir un acc&egrave;s JDBC &agrave; PostgreSQL sur RedHat 8.0 et comment cr&eacute;er un tunnel SSL afin de permettre un acc&egrave;s distant s&eacute;curis&eacute; &agrave; la base de donn&eacute;es.</p><br>
</li>
<LI><p class="indent"><A href="March2003/article286.shtml">Affichage LCD USB sous Linux avec "chien de garde" et boutons</A><br>Cet article explique comment modifier le syst&egrave;me d'affichage LCD pr&eacute;sent&eacute; en Mai 2002 afin de b&eacute;n&eacute;ficier de l'interface USB.</p><br>
</li>
<LI><p class="indent"><A href="March2003/article287.shtml">Programmation en temps partag&eacute; - Files d'attente de messages (1)</A><br>Suite de la s&eacute;rie sur la programmation en temps partag&eacute;.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="January2003/index.shtml">2003/01</a></h2>
<UL>
<LI><p class="indent"><A href="January2003/article269.shtml">G&eacute;rer le HTML avec Perl, HTML::TagReader</A><br>HTML::TagReader est un module Perl destin&eacute; &agrave; examiner un fichier balise par balise.</p><br>
</li>
<LI><p class="indent"><A href="January2003/article274.shtml">D&eacute;tection d'intrusion sous Debian GNU/Linux</A><br>Cet article pr&eacute;sente les techniques et les outils pour Debian GNU/Linux permettant de d&eacute;tecter les tentatives d'intrusion dans votre r&eacute;seau.</p><br>
</li>
<LI><p class="indent"><A href="January2003/article275.shtml">Etudes d&eacute;mographiques</A><br>Cet article pr&eacute;sente un programme de simulation pr&eacute;vu pour r&eacute;pondre &agrave; la question "Que sera la population dans 50 ou 100 ans ?"</p><br>
</li>
<LI><p class="indent"><A href="January2003/article276.shtml">Unix libre : les BSD(s)</A><br>Cet article pr&eacute;sente la famille des syst&egrave;mes Unix BSD libres.</p><br>
</li>
<LI><p class="indent"><A href="January2003/article277.shtml">Programmer en BASIC sous Unix</A><br>Pr&eacute;sentation des environnements, IDE, interpr&eacute;teurs et compilateurs BASIC sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="January2003/article278.shtml">Automatiser l'administration syst&egrave;me avec ssh et scp</A><br>Cet article pr&eacute;sente une utilisation de ssh et scp destin&eacute;e &agrave; automatiser les t&acirc;ches d'administration, comme configurer et installer des logiciels sur des syst&egrave;mes Linux.</p><br>
</li>
<LI><p class="indent"><A href="January2003/article279.shtml">Combattre le "spam"</A><br>Cet article Cet article explique comment lutter contre le "spam".</p><br>
</li>
<LI><p class="indent"><A href="January2003/article281.shtml">Programmation en temps partag&eacute; - Communications entre les processus</A><br>Deuxi&egrave;me article de la s&eacute;rie sur la programmation en temps partag&eacute;.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="November2002/index.shtml">2002/11</a></h2>
<UL>
<LI><p class="indent"><A href="November2002/article251.shtml">Une alimentation pilot&eacute;e par micro-contr&ocirc;leur</A><br>Dans cet article nous construisons une alimentation r&eacute;gul&eacute;e par micro-contr&ocirc;leur pour votre "laboratoire" personnel.</p><br>
</li>
<LI><p class="indent"><A href="November2002/article262.shtml">Mozilla diss&eacute;qu&eacute;</A><br>Une pr&eacute;sentation des navigateurs Mozilla.</p><br>
</li>
<LI><p class="indent"><A href="November2002/article263.shtml">Root-kits et int&eacute;grit&eacute;</A><br>Cet article pr&eacute;sente les diff&eacute;rentes op&eacute;rations r&eacute;alisables par un pirate lorsqu'il a r&eacute;ussi &agrave; entrer dans votre machine.</p><br>
</li>
<LI><p class="indent"><A href="November2002/article264.shtml">Allocation de port &agrave; s&eacute;curit&eacute; int&eacute;gr&eacute;e pour pilotes de p&eacute;riph&eacute;riques Linux</A><br>Ecrire un pilote de p&eacute;riph&eacute;rique est autant une t&acirc;che aventureuse qu'un d&eacute;fi.</p><br>
</li>
<LI><p class="indent"><A href="November2002/article265.shtml">Gorm et ProjectCenter, les outils RAD de GNUstep</A><br>RAD signifie Rapid Application Development (d&eacute;veloppement rapide d'application).</p><br>
</li>
<LI><p class="indent"><A href="November2002/article266.shtml">D&eacute;velopper des applications Gnome avec Python (Partie 3)</A><br>Cette s&eacute;rie d'articles est particuli&egrave;rement destin&eacute;e aux programmeurs d&eacute;butants qui utilisent Gnome et GNU/Linux.</p><br>
</li>
<LI><p class="indent"><A href="November2002/article267.shtml">(X)dialog: des shells qui parlent</A><br>Xdialog et dialog sont deux utilitaires classiques destin&eacute;s &agrave; doter vos scripts shell d'une interface graphique.</p><br>
</li>
<LI><p class="indent"><A href="November2002/article268.shtml">Utiliser PGPLOT pour du graphique interactif sous Linux</A><br>Dans cet article vous d&eacute;couvrirez comment &eacute;crire un programme graphique interactif en Fortran</p><br>
</li>
<LI><p class="indent"><A href="November2002/article270.shtml">Installer un syst&egrave;me LAMP</A><br>LAMP signifie Linux Apache MySQL PHP.</p><br>
</li>
<LI><p class="indent"><A href="November2002/article272.shtml">Programmation en temps partag&eacute; - Principes et introduction aux processus</A><br>Cette s&eacute;rie d'articles a pour but de pr&eacute;senter le concept de multi-t&acirc;ches et sa mise en oeuvre dans le syst&egrave;me d'exploitation Linux.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="September2002/index.shtml">2002/09</a></h2>
<UL>
<LI><p class="indent"><A href="September2002/article253.shtml">Compteur de fr&eacute;quence 1Hz-100Mhz avec affichage LCD et interface RS232</A><br>Cet article d&eacute;crit comment concevoir un compteur de fr&eacute;quence avec le micro-contr&ocirc;leur AT90S4433 et Linux.</p><br>
</li>
<LI><p class="indent"><A href="September2002/article255.shtml">Virus: nous sommes tous concern&eacute;s</A><br>Virus, Vers et Chevaux de Troie peuvent aussi devenir des menaces pour Linux.</p><br>
</li>
<LI><p class="indent"><A href="September2002/article257.shtml">Utiliser BibTeXML dans DocBook XML</A><br>BibTex est un syst&egrave;me qui permet d'inclure des r&eacute;f&eacute;rences depuis une base de donn&eacute;es (fichier) dans des documents Tex.</p><br>
</li>
<LI><p class="indent"><A href="September2002/article258.shtml">Comprendre l'affichage LCD HD44780</A><br>Cet article essaie d'expliquer le fonctionnement de l'affichage LCD HD44780.</p><br>
</li>
<LI><p class="indent"><A href="September2002/article259.shtml">Midi avec alsa</A><br>Cet article explique comment faire fonctionner Midi avec Alsa.</p><br>
</li>
<LI><p class="indent"><A href="September2002/article260.shtml">FreeBSD, une v&eacute;ritable alternative</A><br>Cet article est un bref tour d'horizon d'un autre Unix libre : FreeBSD.</p><br>
</li>
<LI><p class="indent"><A href="September2002/article261.shtml">L'heure du Jazz++</A><br>Jazz est un s&eacute;quenceur midi aux nombreuses fonctionnalit&eacute;s pour l'&eacute;dition et la composition de musique.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="July2002/index.shtml">2002/07</a></h2>
<UL>
<LI><p class="indent"><A href="July2002/article239.shtml">Chien de garde et bouton d'arr&ecirc;t</A><br>Il s'agit d'un simple circuit &agrave; connecter sur la ligne s&eacute;rie de votre serveur.</p><br>
</li>
<LI><p class="indent"><A href="July2002/article245.shtml">S&eacute;curiser un r&eacute;seau h&eacute;t&eacute;rog&egrave;ne avec des outils libres</A><br>Cet article pr&eacute;sente quelques aspects importants de la s&eacute;curit&eacute; des r&eacute;seaux locaux.</p><br>
</li>
<LI><p class="indent"><A href="July2002/article248.shtml">Mozilla et les Plugins</A><br>Comment param&eacute;trer Mozilla RC3 pour Real Player, Acrobat, Flash, et le plugin g&eacute;n&eacute;rique Plugger.</p><br>
</li>
<LI><p class="indent"><A href="July2002/article249.shtml">R&eacute;ception de fax avec efax</A><br>Installation d'Efax sur RedHat 7.2 pour envoyer et recevoir des fax.</p><br>
</li>
<LI><p class="indent"><A href="July2002/article250.shtml">Lecture : D&eacute;couvrir les bases de donn&eacute;es avec MySQL</A><br>D&eacute;couvrir les bases de donn&eacute;es avec MySQL est un nouveau livre des &eacute;ditions Wrox-press.</p><br>
</li>
<LI><p class="indent"><A href="July2002/article252.shtml">Compiler votre propre noyau Linux</A><br>Cet article explique comment le faire et montre &agrave; quel point c'est facile.</p><br>
</li>
<LI><p class="indent"><A href="July2002/article254.shtml">Lumi&egrave;re, Cam&eacute;ra, Action... Kino!</A><br>Connectez votre cam&eacute;ra &agrave; Linux par le firewire et d&eacute;couvrez le montage vid&eacute;o.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="May2002/index.shtml">2002/05</a></h2>
<UL>
<LI><p class="indent"><A href="May2002/article201.shtml">Editer des documents XML DocBook</A><br>Cet article d&eacute;crit l'utilisation de Kate et de son "plugin" XML  comme outil d'&eacute;dition de documents XML DocBook.</p><br>
</li>
<LI><p class="indent"><A href="May2002/article236.shtml">Un panneau de contr&ocirc;le LCD pour votre serveur Linux</A><br>Dans cet article nous utilisons un micro-contr&ocirc;leur Atmel pour fabriquer un panneau LCD pour notre serveur.</p><br>
</li>
<LI><p class="indent"><A href="May2002/article240.shtml">Utiliser un appareil photo num&eacute;rique Minolta Dimage 5 sous Linux</A><br>Voici une br&egrave;ve description sur l'installation des pilotes usb pour les appareils num&eacute;riques Minolta Dimage 5/7 sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="May2002/article241.shtml">GNUMail.app, la preuve de portabilit&eacute;</A><br>GNUMail.app est un clone du Mail.app de NeXT fonctionnant sous GNUstep et MacOS X.</p><br>
</li>
<LI><p class="indent"><A href="May2002/article242.shtml">D&eacute;couvrir XML</A><br>Cet article explique ce qu'est XML et &agrave; quoi il sert.</p><br>
</li>
<LI><p class="indent"><A href="May2002/article243.shtml">Introduction &agrave; la cryptographie</A><br>Cet article pr&eacute;sente la cryptographie et son fonctionnement.</p><br>
</li>
<LI><p class="indent"><A href="May2002/article244.shtml">D&eacute;couvrir l'univers</A><br>Cet article pr&eacute;sente 2 programmes pour Linux qui vous permettront d'explorer l'univers.</p><br>
</li>
<LI><p class="indent"><A href="May2002/article246.shtml">Essai de KDE 3</A><br>KDE vient de publier sa version 3. Cet article vous donnera une id&eacute;e de ce &agrave; quoi il ressemble pour que vous puissiez le tester.</p><br>
</li>
<LI><p class="indent"><A href="May2002/article247.shtml">Remplacer un serveur Windows NT/2000 par Linux et SAMBA</A><br>Cet article met l'accent sur un ensemble Linux et SAMBA permettant d'ex&eacute;cuter des services normalement fournis par les syst&egrave;mes Windows.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="March2002/index.shtml">2002/03</a></h2>
<UL>
<LI><p class="indent"><A href="March2002/article177.shtml">Configuration de Samba</A><br>Comment configurer Samba.</p><br>
</li>
<LI><p class="indent"><A href="March2002/article229.shtml">GCC - la base de tout</A><br>GCC est un tr&egrave;s bon compilateur mais la documentation est plut&ocirc;t complexe.</p><br>
</li>
<LI><p class="indent"><A href="March2002/article230.shtml">IOS, une nouvelle REBOLution</A><br>L'Internet Operating System de Rebol est un environnement ultra-l&eacute;ger d'applications collaboratives.</p><br>
</li>
<LI><p class="indent"><A href="March2002/article231.shtml">Programmer le Micro-contr&ocirc;leur AVR</A><br>Comment cr&eacute;er et installer un environnement de d&eacute;veloppement pour le Micro-contr&ocirc;leur RISC AVR 8 bits d'Atmel.</p><br>
</li>
<LI><p class="indent"><A href="March2002/article232.shtml">Lecture: Le manuel de qmail</A><br>qmail est un "mail transport agent".</p><br>
</li>
<LI><p class="indent"><A href="March2002/article233.shtml">Introduction &agrave; Ncurses</A><br>Ncurses est une biblioth&egrave;que qui permet de traiter les terminaux texte comme des fen&ecirc;tres.</p><br>
</li>
<LI><p class="indent"><A href="March2002/article235.shtml">Installer un Serveur Squid-Proxy</A><br>Un serveur proxy peut contribuer &agrave; acc&eacute;l&eacute;rer une connexion internet.</p><br>
</li>
<LI><p class="indent"><A href="March2002/article237.shtml">Jeu - Barrel Patrol 3D</A><br>Barrel Patrol 3D est un petit jeu en 3D, bas&eacute; sur Ripoff, un classique des jeux d'arcade des ann&eacute;es 80.</p><br>
</li>
<LI><p class="indent"><A href="March2002/article238.shtml">Jouer avec Dingbats et Gimp</A><br>Cet article montre comment cr&eacute;er des logos ou des images en quelques clics &agrave; partir des polices Dingbats.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="January2002/index.shtml">2002/01</a></h2>
<UL>
<LI><p class="indent"><A href="January2002/article132.shtml">QCAD: Dessin technique sous Linux</A><br>QCAD est un simple logiciel de CAO en 2D.</p><br>
</li>
<LI><p class="indent"><A href="January2002/article222.shtml">Ex&eacute;cuter des applications distantes avec X</A><br>Le X Window System (X11) de Linux est beaucoup plus qu'un syst&egrave;me de fen&ecirc;trage.</p><br>
</li>
<LI><p class="indent"><A href="January2002/article224.shtml">D&eacute;velopper des Applications Gnome avec Python (Partie 2)</A><br>L'auteur pr&eacute;sente un outil &eacute;ducatif pour &eacute;crire des interfaces graphiques Gnome avec Python.</p><br>
</li>
<LI><p class="indent"><A href="January2002/article225.shtml">Chrooter tous les services sous Linux</A><br>Les services "chroot&eacute;s" am&eacute;liorent la s&eacute;curit&eacute; en limitant les d&eacute;g&acirc;ts pouvant &ecirc;tre caus&eacute;s par un &eacute;ventuel intrus.</p><br>
</li>
<LI><p class="indent"><A href="January2002/article226.shtml">MySQL et Perl, le mariage de raison</A><br>Cet article montre la facilit&eacute; d'acc&egrave;s &agrave; une base MySQL gr&acirc;ce &agrave; perl.</p><br>
</li>
<LI><p class="indent"><A href="January2002/article227.shtml">Graver des CD sous Linux</A><br>Diff&eacute;rentes mani&egrave;res de graver des CD sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="January2002/article228.shtml">Lecture: Administration Syst&egrave;me de Linux</A><br>Guide d'utilisation.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="November2001/index.shtml">2001/11</a></h2>
<UL>
<LI><p class="indent"><A href="November2001/article116.shtml">Freefont,TrueType et Patterns dans Gimp</A><br>Cet article montre comment utiliser encore plus de polices et de "patterns" dans Gimp.</p><br>
</li>
<LI><p class="indent"><A href="November2001/article121.shtml">Gimp : utilisation des masques de calque</A><br>Les masques de calque de Gimp en font un outil universel pour toute sorte de "trucs".</p><br>
</li>
<LI><p class="indent"><A href="November2001/article163.shtml">Yellow Pages 3 : le c&ocirc;t&eacute; serveur</A><br>NIS est un service tr&egrave;s pratique pour la gestion des gros r&eacute;seaux dont il simplifie l'administration.</p><br>
</li>
<LI><p class="indent"><A href="November2001/article203.shtml">&Eacute;viter les failles de s&eacute;curit&eacute; d&egrave;s le d&eacute;veloppement d'une application - 6: les scripts CGI</A><br>Les scripts CGI sont rarement "attaqu&eacute;s", pourtant un programme CGI mal &eacute;crit peut conduire &agrave; une v&eacute;ritable faille de s&eacute;curit&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="November2001/article217.shtml">Nessus : une autre brique dans le mur (de la s&eacute;curit&eacute;)</A><br>Nessus est l'un des meilleurs scanners de s&eacute;curit&eacute; disponibles aujourd'hui.</p><br>
</li>
<LI><p class="indent"><A href="November2001/article218.shtml">Analyse de vos relev&eacute;s d'applications internet II - configurer les rapports</A><br>Cet article explique comment configurer les rapports dans Lire.</p><br>
</li>
<LI><p class="indent"><A href="November2001/article219.shtml">MOSIXVIEW, une interface graphique pour piloter le cluster* MOSIX</A><br>This article describes a management GUI for the MOSIX-Cluster technologie (www.mosix.org)</p><br>
</li>
<LI><p class="indent"><A href="November2001/article220.shtml">Super Mini Souris Optique Atek</A><br>C'est une souris miniature qui rend votre ordinateur portable aussi confortable qu'un ordinateur de bureau.</p><br>
</li>
<LI><p class="indent"><A href="November2001/article221.shtml">Une visite guid&eacute;e par Tux, du pays du pingouin</A><br>Explorez le pays du pingouin avec Tux comme guide.</p><br>
</li>
<LI><p class="indent"><A href="November2001/article223.shtml">Comment utiliser votre adaptateur ATEN UC-232A USB sous Linux</A><br>L' ATEN UC-232A est un adaptateur de ligne s&eacute;rie RS232 vers USB.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="September2001/index.shtml">2001/09</a></h2>
<UL>
<LI><p class="indent"><A href="September2001/article139.shtml">XMRM : Morphing sous Linux</A><br>XMRM (Multi Resolution Morphing for X) est un programme de morphing qui permet de cr&eacute;er des vid&eacute;os mpeg en utilisant la transformation d'une image en une autre.</p><br>
</li>
<LI><p class="indent"><A href="September2001/article198.shtml">&Eacute;viter les failles de s&eacute;curit&eacute; d&egrave;s le d&eacute;veloppement d'une application - 5: les "race conditions"</A><br>Cet article insiste sur les probl&egrave;mes relatifs au multi-t&acirc;ches et &agrave; l'acc&egrave;s exclusif aux ressources.</p><br>
</li>
<LI><p class="indent"><A href="September2001/article206.shtml">Utiliser XML et XSLT pour r&eacute;aliser LinuxFocus.org(/Nederlands)</A><br>Cet article pr&eacute;sente un syst&egrave;me de base de donn&eacute;es XML.</p><br>
</li>
<LI><p class="indent"><A href="September2001/article213.shtml">L'analyse des relev&eacute;s de transactions de vos applications Internet</A><br>Cet article pr&eacute;sente un nouvel outil d'analyse de fichiers log : Lire.</p><br>
</li>
<LI><p class="indent"><A href="September2001/article214.shtml">Psionic Portsentry 1.1, le d&eacute;fenseur des ports</A><br>Portsentry est un Syst&egrave;me de D&eacute;tection d'Intrusion (IDS) pour la surveillance des ports TCP/UDP.</p><br>
</li>
<LI><p class="indent"><A href="September2001/article215.shtml">Le courrier &eacute;lectronique par UUCP: la solution professionnelle pour les utilisateurs de modems</A><br>UUCP est un vieux protocole mais tr&egrave;s efficace dans la gestion du courrier &eacute;lectronique pour les connexions par modem.</p><br>
</li>
<LI><p class="indent"><A href="September2001/article216.shtml">Programmation Shell</A><br>Le shell a son propre et puissant langage de programmation. Cet article explique comment &eacute;crire des programmes shell mieux connus sous le nom de scripts.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="July2001/index.html">2001/07</a></h2>
<UL>
<LI><p class="indent"><A href="July2001/article148.shtml">Yellow Pages</A><br>Voici le premier article d'une s&eacute;rie consacr&eacute;e &agrave; NIS, pr&eacute;c&eacute;demment connu sous le nom de Yellow Pages.</p><br>
</li>
<LI><p class="indent"><A href="July2001/article162.shtml">Yellow Pages 2 : Le c&ocirc;t&eacute; client</A><br>Cet article d&eacute;crit l'installation de NIS c&ocirc;t&eacute; client.</p><br>
</li>
<LI><p class="indent"><A href="July2001/article170.shtml">Apprendre avec nmap</A><br>Voici une introduction au scanner de ports nmap.</p><br>
</li>
<LI><p class="indent"><A href="July2001/article191.shtml">&Eacute;viter les failles de s&eacute;curit&eacute; d&egrave;s le d&eacute;veloppement d'une application-4: les cha&icirc;nes de format</A><br>Cet article montre comment un simple printf peut devenir une faille de s&eacute;curit&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="July2001/article207.shtml">Chantons sur le web</A><br>Pr&eacute;sentation de la derni&egrave;re version du navigateur Opera pour Linux.</p><br>
</li>
<LI><p class="indent"><A href="July2001/article208.shtml">Lecture : Programmation professionnelle en Perl</A><br>Programmation professionnelle en Perl est un livre de Peter Wainwright Publi&eacute; aux &eacute;ditions Wrox press.</p><br>
</li>
<LI><p class="indent"><A href="July2001/article209.shtml">Compiler, configurer et installer un noyau Linux personnalis&eacute; pleinement op&eacute;rationnel</A><br>This article provides you with an extremely detailed and step-by-step process describing how to Compile, Configure and then Install a Customized Red Hat Linux Kernel.</p><br>
</li>
<LI><p class="indent"><A href="July2001/article210.shtml">Utilisations vari&eacute;es de Raid, /dev/ram et ramfs</A><br>Voici une introduction au nouveau Ramdisk dans le noyau 2.4.</p><br>
</li>
<LI><p class="indent"><A href="July2001/article211.shtml">Faites de la magie avec des images et le shell</A><br>ImageMagick poss&egrave;de des fonctions int&eacute;ressantes que vous ne trouverez pas dans les autres logiciels graphiques.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="May2001/index.shtml">2001/05</a></h2>
<UL>
<LI><p class="indent"><A href="May2001/article181.shtml">Faites-le avec make!</A><br>Cet article explique comment utiliser make.</p><br>
</li>
<LI><p class="indent"><A href="May2001/article190.shtml">&Eacute;viter les failles de s&eacute;curit&eacute; d&egrave;s le d&eacute;veloppement d'une application-3: d&eacute;bordements de buffer</A><br>Cet article explique comment exploiter des logiciels mal programm&eacute;s en utilisant les d&eacute;bordements de buffer.</p><br>
</li>
<LI><p class="indent"><A href="May2001/article194.shtml">Jeu - GLTron</A><br>GLTron est un jeu de courses en 3d.</p><br>
</li>
<LI><p class="indent"><A href="May2001/article200.shtml">Introduction &agrave; BORG</A><br>Borg transforme un ensemble de PC en une ferme de calcul pour le rendu.</p><br>
</li>
<LI><p class="indent"><A href="May2001/article202.shtml">Par le tunnel</A><br>Cet article parle de SSH et de ses bons amis.</p><br>
</li>
<LI><p class="indent"><A href="May2001/article204.shtml">L'enregistrement mp3 en temps r&eacute;el, 2&egrave;me partie</A><br>Editer des fichiers mp3 et autres "trucs"</p><br>
</li>
<LI><p class="indent"><A href="May2001/article205.shtml">Construire un robot pilot&eacute; par Linux</A><br>Dans cet article, vous apprenez &agrave; construire un petit insecte qui se d&eacute;place et &agrave; le piloter par Linux via le port parall&egrave;le. Apr&egrave;s lecture, vous serezcapable de piloter n'importe quel autre type d'&eacute;lectronique "maison" par l'interm&eacute;diaire du port parall&egrave;le.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="March2001/index.html">2001/03</a></h2>
<UL>
<LI><p class="indent"><A href="March2001/article108.shtml">POVRAY IV : utilisation des textures</A><br>Nous cr&eacute;ons un bureau avec de nombreux objets sur la table. Nous construisons la sc&egrave;ne en utilisant les textures.</p><br>
</li>
<LI><p class="indent"><A href="March2001/article178.shtml">Enregistrement de mp3 en temps r&eacute;el</A><br>Enregistrer de la musique au format mp3 vous permet de stocker de tr&egrave;s longs morceaux sans saturer votre espace disque.</p><br>
</li>
<LI><p class="indent"><A href="March2001/article183.shtml">&Eacute;viter les failles de s&eacute;curit&eacute; d&egrave;s le d&eacute;veloppement d'une application-2: m&eacute;moire, pile et fonctions, shellcode</A><br>Ce second article n'est pas directement en rapport avec le sujet de la s&eacute;rie. Il pr&eacute;sente quelques concepts avant de d&eacute;crire la crainte de tout administrateur : les Buffer Overflows. Nous y d&eacute;couvrons l'organisation de la m&eacute;moire, de la pile et la mani&egrave;re d'appeler une fonction. Suit une pr&eacute;sentation de l'outil utilis&eacute; pour les intrusions : le shellcode.</p><br>
</li>
<LI><p class="indent"><A href="March2001/article192.shtml">Utiliser diff&eacute;rents FAIs pour votre acc&egrave;s Internet</A><br>Dans cet article, nous cr&eacute;ons des fichiers de configuration afin de choisir parmi diff&eacute;rents Fournisseurs d'Acc&egrave;s &agrave; Internet. Nous &eacute;tendons la configuration, non seulement &agrave; un seul PC mais &agrave; un r&eacute;seau entier en utilisant l'IP masquerading. Un proxy DNS sera utilis&eacute; pour rendre invisible les changements d'adresse IP &agrave; l'int&eacute;rieur du r&eacute;seau masqu&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="March2001/article193.shtml">Jeu - Penguin Command</A><br>Penguin Command est un clone de "Missile Command" mais il a un meilleur son et un meilleur graphisme.</p><br>
</li>
<LI><p class="indent"><A href="March2001/article195.shtml">GNUstep, l'OpenStep open source</A><br>GNUstep est un environnement tr&egrave;s semblable aux fameux NeXTStep/OpenStep</p><br>
</li>
<LI><p class="indent"><A href="March2001/article196.shtml">Le Serveur de Fax facile !</A><br>Comment installer un serveur de fax pour Linux et Windows avec Hylafax.</p><br>
</li>
<LI><p class="indent"><A href="March2001/article197.shtml">Lecture : Commencer &agrave; programmer Linux - Seconde Edition</A><br>Lecture de la "bible de programmation Linux" des &eacute;ditions Wrox press.</p><br>
</li>
<LI><p class="indent"><A href="March2001/article199.shtml">La r&eacute;plication de donn&eacute;es en temps r&eacute;el sous Linux</A><br>Cet article explique comment r&eacute;pliquer des donn&eacute;es en temps r&eacute;el afin d'&eacute;laborer des syst&egrave;mes de duplication fiables.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="January2001/index.html">2001/01</a></h2>
<UL>
<LI><p class="indent"><A href="January2001/article119.shtml">Les outils de s&eacute;lection de Gimp et la correction couleur</A><br>Cet article explique comment utiliser les puissants m&eacute;canismes de s&eacute;lection de Gimp.</p><br>
</li>
<LI><p class="indent"><A href="January2001/article141.shtml">automount et autofs</A><br>Automount et autofs sont des outils puissants facilitant la gestion des syst&egrave;mes de fichiers.</p><br>
</li>
<LI><p class="indent"><A href="January2001/article144.shtml">Multicast</A><br>Cet article est une introduction aux technologies multicast sur les r&eacute;seaux TCP/IP.</p><br>
</li>
<LI><p class="indent"><A href="January2001/article157.shtml">Slackware 7.0 partie II : Guide de Configuration</A><br>Apr&egrave;s l'installation dans la premi&egrave;re partie, l'auteur d&eacute;crit quelques t&acirc;ches de configuration &eacute;l&eacute;mentaires pour sa distribution Linux favorite. Il explique comment configurer X, comment compiler un noyau (et comment l'utiliser avec lilo), comment g&eacute;rer les comptes utilisateurs, comment se connecter &agrave; l'Internet et comment s&eacute;curiser au minimum le syst&egrave;me.</p><br>
</li>
<LI><p class="indent"><A href="January2001/article180.shtml">Outils de s&eacute;curit&eacute;</A><br>Des outils libres pour s&eacute;curiser les syst&egrave;mes.</p><br>
</li>
<LI><p class="indent"><A href="January2001/article182.shtml">&Eacute;viter les failles de s&eacute;curit&eacute; d&egrave;s le d&eacute;veloppement d'une application - 1&egrave;re partie</A><br>Voici le premier article d'une s&eacute;rie consacr&eacute;e aux failles de s&eacute;curit&eacute; pouvant appara&icirc;tre dans un programme. Cette s&eacute;rie montrera comment &eacute;viter les failles de s&eacute;curit&eacute; en changeant un peu les habitudes de programmation. Nous parlerons dans celui-ci, des privil&egrave;ges, des UID et EUID, avant d'aborder l'ex&eacute;cution de commandes externes.</p><br>
</li>
<LI><p class="indent"><A href="January2001/article186.shtml">Un bouton d'arr&ecirc;t sur le port s&eacute;rie</A><br>Dans cet article nous concevons un interrupteur permettant de se connecter &agrave; un serveur par le port s&eacute;rie ou d'&eacute;teindre ce serveur, si n&eacute;cessaire.</p><br>
</li>
<LI><p class="indent"><A href="January2001/article187.shtml">Lecture : HTML &amp; XHTML, O'Reilly</A><br>Pr&eacute;sentation du livre d'O'Reilly sur HTML &amp; XHTML.</p><br>
</li>
<LI><p class="indent"><A href="January2001/article189.shtml">Jeu - Tux Racer</A><br>Tux Racer est un jeu d'arcade tr&egrave;s rapide. Notre mascotte Linux pr&eacute;f&eacute;r&eacute;e doit descendre des collines enneig&eacute;es, en essayant d'attraper un maximum de harengs tout en finissant sa course dans les d&eacute;lais.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="November2000/index.html">2000/11</a></h2>
<UL>
<LI><p class="indent"><A href="November2000/article123.shtml">D&eacute;couvrir Ted</A><br>Ted est un traitement de texte "l&eacute;ger".</p><br>
</li>
<LI><p class="indent"><A href="November2000/article131.shtml">Utilitaires GNU</A><br>Les utilitaires GNU sont des commandes standard disponibles sur la plupart des syst&egrave;mes Unix.</p><br>
</li>
<LI><p class="indent"><A href="November2000/article164.shtml">NFS - Network File System</A><br>Voici une introduction &agrave; NFS, un syst&egrave;me de fichiers r&eacute;seau devenu un standard avec le temps.</p><br>
</li>
<LI><p class="indent"><A href="November2000/article174.shtml">Introduction &agrave; Tk</A><br>Tk est le toolkit graphique de Tcl. Il est tr&egrave;s r&eacute;pandu et a &eacute;t&eacute; port&eacute; sur beaucoup d'autres langages de programmation et de script.</p><br>
</li>
<LI><p class="indent"><A href="November2000/article175.shtml">xinetd</A><br>xinetd est une version &eacute;volu&eacute;e d'inetd et peut am&eacute;liorer la s&eacute;curit&eacute; de votre syst&egrave;me Linux de mani&egrave;re significative.</p><br>
</li>
<LI><p class="indent"><A href="November2000/article176.shtml">Il &eacute;tait une fois... ou Unix commercial vs. Unix libre et plus!</A><br>Pourquoi choisir un Unix commercial ou un Unix libre.</p><br>
</li>
<LI><p class="indent"><A href="November2000/article179.shtml">Syst&egrave;mes &agrave; haute disponibilit&eacute; sous Linux</A><br>Comment mettre en place des syst&egrave;mes &agrave; Haute Disponibilit&eacute; sous Linux dans le cadre d'une mission critique.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="September2000/index.html">2000/09</a></h2>
<UL>
<LI><p class="indent"><A href="September2000/article154.shtml">Slackware 7.0 partie I : Guide d'Installation</A><br>L'auteur explique en d&eacute;tail l'installation de la distribution Linux Slackware 7.0.</p><br>
</li>
<LI><p class="indent"><A href="September2000/article158.shtml">Applications : MagicPoint</A><br>MagicPoint est l'un des rares logiciels libres permettant de r&eacute;aliser une pr&eacute;sentation sous X-window.</p><br>
</li>
<LI><p class="indent"><A href="September2000/article166.shtml">Bastille-Linux</A><br>Bastille-Linux n'est pas une nouvelle distribution de Linux mais un ensemble de scripts qui permet de mieux prot&eacute;ger son syst&egrave;me de vuln&eacute;rabilit&eacute;s potentielles.</p><br>
</li>
<LI><p class="indent"><A href="September2000/article167.shtml">Lecture: Professional PHP Programming</A><br>Cet article pr&eacute;sente le livre Professional PHP Programming de la collection Programmer to programmer, &eacute;ditions WROX.</p><br>
</li>
<LI><p class="indent"><A href="September2000/article168.shtml">Une Approche de Vector Linux</A><br>Revue d'une mini distribution Linux.</p><br>
</li>
<LI><p class="indent"><A href="September2000/article169.shtml">REBOL le rebelle</A><br>Nous pourrions dire que Rebol est un langage de messagerie, mais en fait, il est beaucoup plus que cela.</p><br>
</li>
<LI><p class="indent"><A href="September2000/article171.shtml">Comment rapporter les bogues sous Debian 2.2</A><br>Cet article d&eacute;crit comment les utilisateurs de Debian peuvent aider la communaut&eacute; en signalant les "bugs" trouv&eacute;s.</p><br>
</li>
<LI><p class="indent"><A href="September2000/article173.shtml">Cr&eacute;er un service de FAI modulable avec des logiciels libres</A><br>Cr&eacute;er un serveur pour FAI avec LDAP et Linux.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="July2000/index.html">2000/07</a></h2>
<UL>
<LI><p class="indent"><A href="July2000/article113.shtml">La Pseudo 3D avec Gimp</A><br>Comment utiliser Gimp pour des images 3D.</p><br>
</li>
<LI><p class="indent"><A href="July2000/article155.shtml">Virtual Network Computing, ou VNC</A><br>Le r&ecirc;ve de l'administrateur r&eacute;seau devenu r&eacute;alit&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="July2000/article156.shtml">Une Introduction au module Perl XML::XSLT</A><br>Une Introduction au module Perl XML::XSLT.</p><br>
</li>
<LI><p class="indent"><A href="July2000/article159.shtml">Introduction &agrave; LDAP sous Linux</A><br>Cet article explique l'utilisation du Lightweight Directory Access Protocol sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="July2000/article160.shtml">D&eacute;velopper des Applications Gnome avec Python (1&egrave;re Partie)</A><br>Cet article est particuli&egrave;rement destin&eacute; aux d&eacute;butants en programmation Gnome et GNU/Linux. Il montre comment utiliser Python et le g&eacute;n&eacute;rateur d'interface Glade pour cr&eacute;er des applications graphiques.</p><br>
</li>
<LI><p class="indent"><A href="July2000/article161.shtml">Installation des paquetages Debian de LinuxFocus</A><br>Un article sur l'installation de paquets Debian de LinuxFocus.</p><br>
</li>
<LI><p class="indent"><A href="July2000/article165.shtml">Utiliser un Afficheur LCD avec Linux</A><br>Cet article montre comment utiliser la carte d'affichage s&eacute;rie BLC2021 de Matrix Orbital sous Linux.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="May2000/index.html">2000/05</a></h2>
<UL>
<LI><p class="indent"><A href="May2000/article122.shtml">Apache 1</A><br>Cet article est une introduction au protocole HTTP et il retrace bri&egrave;vement l'histoire du World Wide Web.</p><br>
</li>
<LI><p class="indent"><A href="May2000/article130.shtml">Configurer votre serveur local avec sendmail et fetchmail</A><br>Sendmail est un logiciel puissant mais complexe. Cet article explique comment configurer sendmail et fetchmail sur sa machine personnelle.</p><br>
</li>
<LI><p class="indent"><A href="May2000/article149.shtml">Arkeia, une solution de sauvegarde r&eacute;seau commerciale et professionnelle</A><br>Arkeia 4.2.3-1 est la derni&egrave;re version d'une solution de sauvegarde r&eacute;seau commerciale et professionnelle de Knox Software.</p><br>
</li>
<LI><p class="indent"><A href="May2000/article150.shtml">Faire un DHCP automatiquement</A><br>Cet article explique comment configurer facilement un serveur DHCP.</p><br>
</li>
<LI><p class="indent"><A href="May2000/article151.shtml">Configurer le masquage d'IP (IP-Masquerading)</A><br>L'IP-Masquerading offre la possibilit&eacute; de connecter plusieurs ordinateurs &agrave; l'Internet en utilisant une machine Linux ayant seulement une adresse IP publique.</p><br>
</li>
<LI><p class="indent"><A href="May2000/article152.shtml">Cr&eacute;er des documents PDF avec DocBook</A><br>Cet article explique comment utiliser DocBook pour g&eacute;n&eacute;rer des documents PDF. Il montre comment &eacute;diter des articles avec DocBook et les transformer en documents PDF.</p><br>
</li>
<LI><p class="indent"><A href="May2000/article153.shtml">Ma&icirc;triser l'&eacute;diteur VI</A><br>VI est un &eacute;diteur en mode texte pris&eacute; par de nombreux utilisateurs d'Unix. VI poss&egrave;de des caract&eacute;ristiques tr&egrave;s puissantes facilitant la t&acirc;che des programmeurs, mais de nombreux d&eacute;butants h&eacute;sitent &agrave; l'utiliser se sentant d&eacute;pass&eacute;s par sa richesse. Ce tutoriel est donc destin&eacute; &agrave; ces d&eacute;butants.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="March2000/index.html">2000/03</a></h2>
<UL>
<LI><p class="indent"><A href="March2000/article137.shtml">RT-Linux partie III</A><br>Dans cet article, un simple circuit &eacute;lectrique est utilis&eacute; pour g&eacute;rer des processus &agrave; partir d'une commande &agrave; distance &agrave; infra-rouge.</p><br>
</li>
<LI><p class="indent"><A href="March2000/article138.shtml">NEdit, l'&eacute;diteur universel du monde Unix</A><br>Nedit est un remarquable &eacute;diteur. Malheureusement il ne fait pas partie des distributions Linux et par cons&eacute;quent il est moins connu que les autres &eacute;diteurs.</p><br>
</li>
<LI><p class="indent"><A href="March2000/article140.shtml">Essai: SNiFF+ pour Linux</A><br>SNiFF+ est un environnement de d&eacute;veloppement int&eacute;gr&eacute; (IDE) pour Linux. TakeFive Software propose une version librement t&eacute;l&eacute;chargeable (limit&eacute;e &agrave; 200 fichiers).</p><br>
</li>
<LI><p class="indent"><A href="March2000/article142.shtml">RedHat Linux 5.2 + SCO Openserver 5.0.5 + Windows NT 4.0 (ou &eacute;quivalent)</A><br>Comment d&eacute;marrer 3 syst&egrave;mes d'exploitation diff&eacute;rents.</p><br>
</li>
<LI><p class="indent"><A href="March2000/article146.shtml">Le kit uCsimm</A><br>Cet article decrit le kit uCsimm et le projet UClinux: Porter le noyau linux sur des machines sans MMU (memory management unit).</p><br>
</li>
<LI><p class="indent"><A href="March2000/article147.shtml">Utiliser Apache ProxyPass pour acc&egrave;der &agrave; des serveurs cach&eacute;s derri&egrave;re un h&ocirc;te de Masquage</A><br>Cet article montre comment rendre un serveur web accessible derri&egrave;re un firewall sans en modifier les r&egrave;gles ou compromettre la s&eacute;curit&eacute;.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="January2000/index.html">2000/01</a></h2>
<UL>
<LI><p class="indent"><A href="January2000/article127.shtml">FSViewer, un gestionnaire de fichiers pour Window Maker</A><br>Parmi les outils r&eacute;volutionnaires de NeXTStep, le premier par ordre d'apparition &agrave; l'&eacute;cran &eacute;tait sans conteste le File Viewer.L'innovation venait du fait que l'on savait toujours o&ugrave; on se trouvait gr&acirc;ce au chemin d'ic&ocirc;nes.</p><br>
</li>
<LI><p class="indent"><A href="January2000/article128.shtml">Window Maker ou NeXTStep, le retour</A><br>Window Maker 0.61.1 est la derni&egrave;re version d'un gestionnaire de fen&ecirc;tres (window manager) &agrave; l'apparence NeXT.</p><br>
</li>
<LI><p class="indent"><A href="January2000/article129.shtml">Recycler des adresses IP avec Apache</A><br>Cet article montre comment g&eacute;rer plusieurs serveurs web virtuels en utilisant la m&ecirc;me adresse IP avec Apache sous Unix/Linux.</p><br>
</li>
<LI><p class="indent"><A href="January2000/article133.shtml">VXE, un outil de s&eacute;curit&eacute; pour Linux</A><br>Serge Lozovsky pr&eacute;sent un logiciel qu'il a d&eacute;velopp&eacute; pour am&eacute;liorer la s&eacute;curit&eacute; des syst&egrave;mes UNIX.</p><br>
</li>
<LI><p class="indent"><A href="January2000/article134.shtml">Un r&eacute;seau &agrave; la maison, lexique et vue d'ensemble</A><br>Cet article explique la partie mat&eacute;rielle et la terminologie r&eacute;seau.</p><br>
</li>
<LI><p class="indent"><A href="January2000/article135.shtml">Comment partager son disque dur en vue d'une installation de Linux</A><br>Thomas explique comment il a choisi de partitionner son disque dur.</p><br>
</li>
<LI><p class="indent"><A href="January2000/article136.shtml">Perl partie III</A><br>Cet article explique comment utiliser les tableaux de variables dans Perl.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="November1999/index.html">1999/11</a></h2>
<UL>
<LI><p class="indent"><A href="November1999/article112.html">Cr&eacute;er des effets de feu avec GIMP</A><br>Comment cr&eacute;er des effets de feu dans GIMP en cinq &eacute;tapes.</p><br>
</li>
<LI><p class="indent"><A href="November1999/article117.html">Jeu : Test - FreeCiv</A><br>FreeCiv est un clone libre du tr&egrave;s populaire Civilisation de Sid Meier.</p><br>
</li>
<LI><p class="indent"><A href="November1999/article118.html">L'obsession secr&egrave;te de Tux - Jouer sous Linux</A><br>C'est un petit aper&ccedil;u des jeux sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="November1999/article120.html">Sketch, dessin vectoriel sous Linux</A><br>Les avantages du vectoriel sur le bitmap viennent du fait que les fichiers sont plus petits et que l'image peut &ecirc;tre agrandie sans que le rendu soit alt&eacute;r&eacute; (pixellisation). Sketch est &eacute;crit en Python, un langage de programmation interpr&eacute;t&eacute; et orient&eacute; objet.</p><br>
</li>
<LI><p class="indent"><A href="November1999/article124.html">Comment utiliser un disque Ram sous Linux</A><br>Cet article montre comment utiliser la Ram comme disque virtuel.</p><br>
</li>
<LI><p class="indent"><A href="November1999/article125.html">Optimiser de petites bases de donn&eacute;es sous Linux</A><br>Un disque virtuel peut-&ecirc;tre utilis&eacute; pour rendre de petites bases de donn&eacute;es PostgreSL vraiment rapides.</p><br>
</li>
<LI><p class="indent"><A href="November1999/article126.html">Perl partie II</A><br>Dans la seconde partie du tutoriel Perl nous &eacute;crivons un vrai programme.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="September1999/index.html">1999/09</a></h2>
<UL>
<LI><p class="indent"><A href="September1999/article103.html">La pratique d'awk par l'exemple: Introduction rapide</A><br>Exemples d'utilisation d'AWK</p><br>
</li>
<LI><p class="indent"><A href="September1999/article105.html">Nerdbank - une initiative bancaire pour des interfaces logicielles libres dans le commerce &eacute;lectronique</A><br>Nerdbank est une initiative bancaire pour des interfaces logicielles libres dans le commerce &eacute;lectronique.</p><br>
</li>
<LI><p class="indent"><A href="September1999/article106.html">Comment utiliser votre lecteur de CD-ROM avec Linux</A><br>Comment utiliser votre CD-ROM sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="September1999/article109.html">Dialog - un langage de programmation pour les dialogues.</A><br>Dialog est un langage de programmation pour cr&eacute;er des dialogues dans les jeux et les simulations.</p><br>
</li>
<LI><p class="indent"><A href="September1999/article110.html">La syntax du langage Tcl</A><br>Cet article explique les concepts de base et la syntaxe du langage Tcl.</p><br>
</li>
<LI><p class="indent"><A href="September1999/article111.html">Construire des fichiers avec des macros m4</A><br>Cet article montre comment utiliser les macros m4.</p><br>
</li>
<LI><p class="indent"><A href="September1999/article114.html">Perl partie I</A><br>C'est le d&eacute;but d'un tutoriel Perl.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="July1999/index.html">1999/07</a></h2>
<UL>
<LI><p class="indent"><A href="July1999/article79.html">Interview de Dennis M. Ritchie</A><br>Dennis Ritchie a d&eacute;velopp&eacute; le C et Unix.</p><br>
</li>
<LI><p class="indent"><A href="July1999/article80.html">PostScript Part II: La pile des op&eacute;randes</A><br>La pile des op&eacute;randes dans le langage PostScript.</p><br>
</li>
<LI><p class="indent"><A href="July1999/article81.html">Renderman Partie III</A><br>Cet article &eacute;tudie les possibilit&eacute;s de mod&eacute;lisation et d'animation d'une sc&egrave;ne en utilisant C or C++.</p><br>
</li>
<LI><p class="indent"><A href="July1999/article82.html">Le projet F-CPU: "Encore mieux"</A><br>Le projet fPU essaie de d&eacute;velopper un microprocesseur suivant le m&ecirc;me sch&eacute;ma que celui qui guide d'importants projets de logiciel libre.</p><br>
</li>
<LI><p class="indent"><A href="July1999/article83.html">Le Japonais sous Linux Part I</A><br>Cet article est un rapide survol de la marche &agrave; suivre pour que votre Linux parle Japonais.</p><br>
</li>
<LI><p class="indent"><A href="July1999/article100.html">PostScript III, Tableaux, Variables, Boucles et d&eacute;finitions de Macros</A><br>Suite des deux articles pr&eacute;c&eacute;dents sur postscript.</p><br>
</li>
<LI><p class="indent"><A href="July1999/article101.html">Comment retirer Windows</A><br>Cet article d&eacute;crit comment retirer Windows et attribuer l'espace disque &agrave; Linux sans r&eacute;installer.</p><br>
</li>
<LI><p class="indent"><A href="July1999/article104.html">Commandes shell particuli&egrave;res</A><br>Quelques r&eacute;ponses int&eacute;ressantes de votre c-shell Unix.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="January1999/index.html">1999/01</a></h2>
<UL>
<LI><p class="indent"><A href="January1999/article73.html">Un V&eacute;hicule Autoguid&eacute; bas&eacute; sur Linux</A><br>Cet article d&eacute;crit un robot bas&eacute; sur Linux.</p><br>
</li>
<LI><p class="indent"><A href="January1999/article74.html">Installation et Configuration d'un Syst&egrave;me RAID</A><br>RAID (Redundant Array of Inexpensive Disks) est un enesemble permettant d'organiser plusieurs disques en une seule entit&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="January1999/article75.html">Le clavier "Happy Hacking"</A><br>Le clavier Happy Hacking.</p><br>
</li>
<LI><p class="indent"><A href="January1999/article76.html">PG2CGI: Acc&eacute;der &agrave; une base de donn&eacute;es depuis le web</A><br>Nous d&eacute;crivons un nouveau programme permettant l'acc&egrave;s &agrave; une base de donn&eacute;es &agrave; partir de pages HTML.</p><br>
</li>
<LI><p class="indent"><A href="January1999/article77.html">Droits d'acc&egrave;s des fichiers</A><br>Cet article est divis&eacute; en deux parties : la premi&egrave;re (les permissions d'acc&egrave;s aux fichiers) est une br&egrave;ve introduction &agrave; ce concept sous Unix. La seconde partie (T-bit, SUID et SGID) concerne des caract&eacute;ristiques plus avanc&eacute;es de Linux.</p><br>
</li>
<LI><p class="indent"><A href="January1999/article78.html">Java. Partie II</A><br>La seconde partie du tutoriel Java.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="November1998/index.html">1998/11</a></h2>
<UL>
<LI><p class="indent"><A href="November1998/article68.html">Commandes de base d'UNIX</A><br>Simple introduction &agrave; quelques outils de base d'UNIX.</p><br>
</li>
<LI><p class="indent"><A href="November1998/article69.html">Interview de David Bagley</A><br>David Bagley est l'actuel mainteneur de xlock, un &eacute;conomiseur d'&eacute;cran s&eacute;curis&eacute; pour X Window.</p><br>
</li>
<LI><p class="indent"><A href="November1998/article70.html">GNU/Linux sur Fujitsu 635T</A><br>Comment installer Linux sur un Fujitsu 635T laptop</p><br>
</li>
<LI><p class="indent"><A href="November1998/article71.html">Linux sur un Sony Vaio 505gx</A><br>Comment installer Linux sur un Sony Vaio 505gx</p><br>
</li>
<LI><p class="indent"><A href="November1998/article72.html">Graphisme facile: un guide pour d&eacute;butants sur la SVGAlib</A><br>SVGAlib est une simple biblioth&egrave;que graphique.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="October1998/index.html">1998/10</a></h2>
<UL>
<LI><p class="indent"><A href="October1998/article67.html">Linux outil &eacute;ducatif pour les classes pr&eacute;paratoires</A><br>Les auteurs d&eacute;crivent pour la premi&egrave;re fois comment linux est en train de changer le "visage" des laboratoires de recherche dans les institutions d'&eacute;ducation en Turquie.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="September1998/index.html">1998/09</a></h2>
<UL>
<LI><p class="indent"><A href="September1998/article63.html">Une introduction au Network Booting et &agrave; l'Etherboot</A><br>Cet article technique explique comment utiliser le bootstrap &agrave; partir d'un programme stock&eacute; en m&eacute;moire non volatile sans acc&egrave;der &agrave; votre disque dur.</p><br>
</li>
<LI><p class="indent"><A href="September1998/article64.html">Recherche de fichiers</A><br>Comment rechercher des fichiers par nom ou contenu.</p><br>
</li>
<LI><p class="indent"><A href="September1998/article65.html">Linux en Chinois</A><br>Comment activer la locale Chinoise sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="September1998/article66.html">Interview de Juan Jose Amor</A><br>Juan Jose Amor Iglesias est le coordinateur du projet LuCAS.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="July1998/index.html">1998/07</a></h2>
<UL>
<LI><p class="indent"><A href="July1998/article50.html">Cr&eacute;ation de Structures r&eacute;cursives. POVRAY III</A><br>L'auteur explore l'utilisation de structures it&eacute;ratives dans POVRAY et les tr&egrave;s belles images qu'elles peuvent g&eacute;n&eacute;rer.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article51.html">Cr&eacute;ation et Edition d'Animations avec GIMP</A><br>Simples techniques pour cr&eacute;er et &eacute;diter des animations en utilisant Gimp.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article52.html">Enlightenment</A><br>Enlightenment est un gestionnaire de fen&ecirc;tres fortement param&eacute;trable pour Linux. Cet article expose les fonctionnalit&eacute;s, l'installation, et la personnalisation d'Enlightenment.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article53.html">Expressions r&eacute;guli&egrave;res</A><br>Les expressions r&eacute;guli&egrave;res sont des crit&egrave;res de recherche avanc&eacute;s. Cet article est une introduction.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article54.html">Linux parmi les artistes de la BUF COMPAGNIE</A><br>La BUF Company est une des plus grandes soci&eacute;t&eacute;s d'imagerie dans le milieu du cin&eacute;ma.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article55.html">La suite de StarOffice (Le traitement de texte)</A><br>C'est le deuxi&egrave;me article sur la suite StarOffice.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article56.html">Real-Time Linux II</A><br>Dans cette deuxi&egrave;me partie d&eacute;di&eacute;e au Temps-R&eacute;el sous Linux, nous essayons d'offrir une vision plus pratique de RT-Linux.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article57.html">Programmer avec Java. Part I</A><br>Premier article d'une s&eacute;rie sur la programmation Java.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article58.html">SQL Tutorial Part II</A><br>La Partie II de ce tutoriel pr&eacute;sente quelques commandes de base du langage SQL.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article59.html">MySQL.  Un serveur de base de donn&eacute;es</A><br>MySQL est un serveur de base de donn&eacute;es SQL (langage de requ&ecirc;tes structur&eacute;) support&eacute; par un certain nombre de plate-formes, y compris Linux.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article60.html">Am&eacute;lioration de la s&eacute;curit&eacute; sur les distributions Linux courantes</A><br>Comment modifier une distribution Linux pour en am&eacute;liorer la s&eacute;curit&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article61.html">TCPD et Firewalls avec IPFWADM</A><br>Comment configurer les services d'inetd de mani&egrave;re &agrave; am&eacute;liorer la s&eacute;curit&eacute; du syst&egrave;me.</p><br>
</li>
<LI><p class="indent"><A href="July1998/article62.html">RenderMan: Les bases pour le positionnement des cam&eacute;ras</A><br>M&ecirc;me si le positionnement n'est pas aussi intuitif que dans Pov-Ray, il est mieux pour d&eacute;crire les trajectoires des cam&eacute;ras.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="May1998/index.html">1998/05</a></h2>
<UL>
<LI><p class="indent"><A href="May1998/article35.html">MindsEye: Mod&eacute;lisation 3D</A><br>Deux ans plus t&ocirc;t, lorsque Linux &eacute;tait encore r&eacute;serv&eacute; aux passionn&eacute;s, l'id&eacute;e de d&eacute;velopper un programme de 3D pour Linux a commenc&eacute; &agrave; germer.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article36.html">Ecrire du texte avec Gimp</A><br>Comparatif : Photoshop et Gimp.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article37.html">Cr&eacute;er une version (utile) de Linux</A><br>Lisez cet article et apprenez comment cr&eacute;er vos propres disques de boot/root sous Linux.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article38.html">Introduction &agrave; SQL. (SQL Part I) et installation de PostgreSQL</A><br>Un tutoriel SQL destin&eacute; aux d&eacute;veloppeurs d&eacute;butants de bases de donn&eacute;es.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article39.html">Le gestionnaire X Display</A><br>Le gestionnaire X Display est un d&eacute;mon sur une machine h&ocirc;te et g&egrave;re de multiples affichages X.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article40.html">StarOffice pour Linux</A><br>Cet article survole les applications disponibles dans la suite StarOffice 4.0. L'auteur essaye une application pour la cr&eacute;ation de pr&eacute;sentations (quelque chose de tr&egrave;s similaire &agrave; PowerPoint de Microsoft).</p><br>
</li>
<LI><p class="indent"><A href="May1998/article41.html">Microsoft Windows NT Server 4.0 contre UNIX</A><br>Le but de cet article est de donner aux gestionnaires d'entreprises les renseignements dont ils ont besoin afin qu'ils puissent prendre des d&eacute;cisions intelligentes en ce qui concerne l'achat de mat&eacute;riel et de logiciels pour leurs serveurs.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article42.html">RenderMan</A><br>Qui n'a pas entendu parler de Pixar? Qui n'a pas vu "Toy Story"? Pixar a d&eacute;velopp&eacute; RenderMan.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article43.html">Le langage Postscript</A><br>C'est le premier article d'une s&eacute;rie sur PostScript.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article44.html">Real-Time Linux</A><br>Concepts de base de Temps-R&eacute;el.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article45.html">Introduction au DNS</A><br>Vous vous &ecirc;tes peut-&ecirc;tre demand&eacute;s ce qui se passe en coulisses lorsque vous tapez une URL dans Netscape. Cet article vous aidera &agrave; comprendre le processus de recherche de nom.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article46.html">OpenGL: la sc&egrave;ne 3D</A><br>Explore les rudiments du rendu 3D sous OpenGL.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article47.html">GLUT: utiliser les menus</A><br>Notre s&eacute;rie sur le GL Utility Toolkit continue, en &eacute;tudiant l'interface de programmation de menus &agrave; l'aide d'un exemple simple.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article48.html">POVRAY II: Notions de base</A><br>C'est le second article d'une s&eacute;rie sur Povray. Cette fois, nous &eacute;tudions les concepts g&eacute;n&eacute;raux et commencons &agrave; d&eacute;crire les &eacute;l&eacute;ments de base du langage.</p><br>
</li>
<LI><p class="indent"><A href="May1998/article49.html">Ecrire du texte avec PhotoShop</A><br>Un comparatif entre Photoshop et Gimp.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="March1998/index.html">1998/03</a></h2>
<UL>
<LI><p class="indent"><A href="March1998/article23.html">OpenGL &amp; GLUT avec Voodoo 3Dfx</A><br>Comment programmer OpenGL avec une carte Voodoo 3Dfx.</p><br>
</li>
<LI><p class="indent"><A href="March1998/article24.html">Configurer X</A><br>A quoi servent les fichiers "."?</p><br>
</li>
<LI><p class="indent"><A href="March1998/article25.html">Interview de Miguel de Icaza</A><br>Miguel de Icaza nous fait part de ses id&eacute;es.</p><br>
</li>
<LI><p class="indent"><A href="March1998/article26.html">Par la fen&ecirc;tre</A><br>Quelques remarques sur les gestionnaires de fen&ecirc;tres.</p><br>
</li>
<LI><p class="indent"><A href="March1998/article27.html">Interview de Linus Torvalds</A><br>Linus Torvalds parle du pass&eacute; et du futur de Linux.</p><br>
</li>
<LI><p class="indent"><A href="March1998/article28.html">Programmation d'OpenGL</A><br>L'auteur d&eacute;crit les capacit&eacute;s de rendu de ligne d'OpenGL.</p><br>
</li>
<LI><p class="indent"><A href="March1998/article29.html">Programmation de GLUT: gestion des fen&ecirc;tres</A><br>Cet article explique l'utilisation de la gestion des fen&ecirc;tres sub-API avec GLUT.</p><br>
</li>
<LI><p class="indent"><A href="March1998/article30.html">POVRAY I: Premiers pas</A><br>Cet article est le premier d'une s&eacute;rie sur Povray.</p><br>
</li>
<LI><p class="indent"><A href="March1998/article31.html">A la d&eacute;couverte de Lyx</A><br>Lyx est un Editeur avec de merveilleuses possibilit&eacute;s. Ismael passe cette application en revue pour nous.</p><br>
</li>
<LI><p class="indent"><A href="March1998/article32.html">Compiler, installer et configurer sendmail 8.8.x</A><br>Mini HOWTO de sendmail</p><br>
</li>
<LI><p class="indent"><A href="March1998/article33.html">Photocomposition avec Photoshop</A><br>Comparatif : Photoshop et Gimp.</p><br>
</li>
<LI><p class="indent"><A href="March1998/article34.html">Photocomposition avec The Gimp</A><br>Comparatif : Photoshop et Gimp.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="January1998/index.html">1998/01</a></h2>
<UL>
<LI><p class="indent"><A href="January1998/article10.html">Straight from the Horse's Mouth</A><br>Bill Gates et le support des utilisateurs.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article11.html">Profile sur Alpha</A><br>Trucs pour les utilisateurs de DEC-Alpha.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article12.html">Installer un ZIP sur une plate-forme Alpha</A><br>Trucs pour les utilisateurs de DEC-Alpha.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article13.html">ECC2-79 "crack&eacute;": Alpha Linux l'a fait</A><br>Quelques lignes sur un groupe de passion&eacute;s d'Alpha Linux qui ont "crack&eacute;" ECC2-79.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article14.html">Courrier de nos lecteurs</A><br>Le premier courrier de nos lecteurs.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article15.html">Qu'est-ce qu'OpenGL?</A><br>Premier article d'une s&eacute;rie sur OpenGL.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article16.html">Programmation de GLUT:Fen&ecirc;tres et Animations</A><br>GLUT est le GL Utility Toolkit, developp&eacute; par Mark Kilgard.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article17.html">Programmation OpenGL: Rendu de polygones simples</A><br>L'auteur d&eacute;crit les premiers pas dans une application OpenGL et nous explique comment rendre des polygones simples en 2D.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article18.html">Cartes 3Dfx</A><br>3Dfx est en train de changer le monde du graphisme de qualit&eacute;.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article19.html">Les secrets du noyau</A><br>Une br&egrave;ve description du noyau de Linux.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article20.html">Debugger du code avec ddd</A><br>ddd est un superbe "debugger" graphique.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article21.html">Gestion et supervision de r&eacute;seau sous Linux</A><br>Quelques outils pratiques pour g&eacute;rer les r&eacute;seaux d'aujourd'hui.</p><br>
</li>
<LI><p class="indent"><A href="January1998/article22.html">Linux dans une machine &agrave; CPU Alpha</A><br>L'auteur nous fait partager son exp&eacute;rience de l'installation de Linux sur une machine Alpha PC.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<h2><a href="November1997/index.html">1997/11</a></h2>
<UL>
<LI><p class="indent"><A href="November1997/article1.html">A propos de Linux</A><br>Un bref historique de Linux</p><br>
</li>
<LI><p class="indent"><A href="November1997/article2.html">Installation des Manpages-es</A><br>Comment mettre en place les man-pages des commandes Linux essentielles en Espagnol.</p><br>
</li>
<LI><p class="indent"><A href="November1997/article3.html">Connexion &agrave; l'Internet</A><br>Les probl&egrave;mes rencontr&eacute;s par les utilisateurs &agrave; leur d&eacute;but sous Linux : la connexion &agrave; l'Internet.</p><br>
</li>
<LI><p class="indent"><A href="November1997/article4.html">J'ai install&eacute; Linux, et ensuite?</A><br>Cet article pr&eacute;sente aux nouveaux utilisateurs les probl&egrave;mes auxquels ils seront confront&eacute;s apr&egrave;s installation de Linux.</p><br>
</li>
<LI><p class="indent"><A href="November1997/article5.html">Quelques trucs</A><br>Bon...voici quelques remarques, trucs, quelques uns sont sp&eacute;cifiques aux utilisateurs ne parlant pas anglais et par cons&eacute;quent sans r&eacute;ponses dans la documentation habituelle.</p><br>
</li>
<LI><p class="indent"><A href="November1997/article6.html">Cr&eacute;er des biblioth&egrave;ques partag&eacute;es</A><br>Comment compiler et g&eacute;n&eacute;rer des biblioth&egrave;ques partag&eacute;es.</p><br>
</li>
<LI><p class="indent"><A href="November1997/article7.html">PGP sous Linux</A><br>L'auteur nous pr&eacute;sente PGP.</p><br>
</li>
<LI><p class="indent"><A href="November1997/article8.html">G&eacute;rer votre courrier</A><br>Triez votre courrier en dossiers, r&eacute;ponses automatiques, listes de diffusion, apprenez &agrave; faire tout cela et m&ecirc;me plus avec procmail.</p><br>
</li>
<LI><p class="indent"><A href="November1997/article9.html">Linux dans les h&ocirc;pitaux</A><br>Linux signifie commerce, voyez comment il est utilis&eacute; dans le milieu hospitalier.</p><br>
</li>
</UL>
<HR noshade="noshade" size=2>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#AAAAAA">
<A class="nodec" HREF="../common/lfteam.html">Pages maintenues par l'&eacute;quipe d'&eacute;dition de LinuxFocus</A>
<BR>&copy; LinuxFocus 
</TD></TR></TABLE></CENTER>
<!-- vim: set sw=4 ts=4 et: -->
</BODY></HTML>

