<HTML
><HEAD
><TITLE
>Miestne nastavenia</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.63
"><LINK
REL="HOME"
TITLE="Slovak-HOWTO"
HREF="index.html"><LINK
REL="PREVIOUS"
TITLE="Úvodné informácie"
HREF="intro.html"><LINK
REL="NEXT"
TITLE="Nastavenia konzoly"
HREF="console.html"></HEAD
><BODY
CLASS="SECTION"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Slovak-HOWTO</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="intro.html"
>Predchádzajúci</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="console.html"
>&#270;al&#353;í</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECTION"
><H1
CLASS="SECTION"
><A
NAME="LOCALES"
>2. Miestne nastavenia</A
></H1
><DIV
CLASS="SECTION"
><H2
CLASS="SECTION"
><A
NAME="AEN99"
>2.1. Princípy miestnych nastavení</A
></H2
><P
>Podpora miestnych nastavení je dnes mimoriadne dôle&#382;itým faktorom, ktorý charakterizuje
      jednotlivé opera&#269;né systémy. &#268;asy, ke&#271; boli &#318;udia &#353;tastní, &#382;e to nie&#269;o pí&#353;e, sú nenávratne
      pre&#269; a pou&#382;ívatelia vy&#382;adujú podporu svojich miestnych nastavení. V <SPAN
CLASS="ACRONYM"
>GNU</SPAN
>
      systémoch je táto podpora implementovaná priamo do &#353;tandardnej kni&#382;nice jazyka
      <SPAN
CLASS="ACRONYM"
>C</SPAN
> -- <SPAN
CLASS="ACRONYM"
>GNU</SPAN
> libc. Táto podpora je navrhnutá tak, aby
      zoh&#318;ad&#328;ovala v&#353;etky po&#382;iadavky kladené na nastavenia pre akúko&#318;vek krajinu a akýko&#318;vek
      jazyk.</P
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="AEN105"
>2.1.1. Ciele a prostriedky</A
></H3
><P
>Rôzne krajiny a kultúry majú odli&#353;né pravidlá komunikácie. Tieto pravidlá mô&#382;u by&#357;
	malého rozsahu, napr. formát dátumu a &#269;asu, a&#382; po ve&#318;mi koplexné ako je jazyk, ktorým
	hovoria.</P
><P
>Internacionalizácia softvéru znamená programova&#357; ho tak, aby bol schopný pracova&#357; s
	pou&#382;ivate&#318;ovými miestnymi nastaveniami. V <SPAN
CLASS="ACRONYM"
>ISO</SPAN
> <SPAN
CLASS="ACRONYM"
>C</SPAN
>
	pracuje internacionalizácia v zmysle <I
CLASS="FIRSTTERM"
>locales</I
>. Ka&#382;dé locale (miestne
	nastavenia) &#353;pecifikuje skupinu pravidiel, jedno pravidlo pre ka&#382;dý u&#269;el. U&#382;ívate&#318; si zvolí
	skupinu pravidiel &#353;pecifikovaním locale (pomocou systémových premenných).</P
><P
>V&#353;etky programy dedia nastavené locale v rámci ich prostredia. Pod podmienkou, &#382;e
	programy sú napísané tak, &#382;e akceptujú nastavené locales, mô&#382;u sa riadi&#357; pravidlami, ktoré
	uprednost&#328;uje pou&#382;ívate&#318;.</P
></DIV
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="AEN113"
>2.1.2. Kategórie a ich funkcie</A
></H3
><P
>Táto &#269;as&#357; popisuje jednotlivé premenné, ktoré ovplyv&#328;ujú miestne nastavenia a ktorými
	sa riadia aj funkcie kni&#382;nice <SPAN
CLASS="ACRONYM"
>GNU</SPAN
> libc.</P
><P
>Nastavenie premennej prostredia sa robí pomocou príkazu shellu
	<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>bash$ export LC_PREMENNA=sk

tcsh$ setenv LC_PREMENNA sk
	</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
><TT
CLASS="ENVAR"
>LC_PREMENNA</TT
> je jedna z nasledujúcich:
	<P
></P
><UL
><LI
><P
><TT
CLASS="ENVAR"
>LC_COLLATE</TT
> --- Triedenie re&#357;azcov. Nastavením tejto premennej
	      mo&#382;no prinúti&#357; aplikácie, napr. <B
CLASS="COMMAND"
>sort</B
>, <B
CLASS="COMMAND"
>ls</B
> a iné,
	      aby pri porovnávaní re&#357;azcov brali do úvahy miestne rozlo&#382;enie jednotlivých písmen v
	      abecede. Sloven&#269;ina má napríklad hne&#271; nieko&#318;ko znakov, ktoré by pri triedení pod&#318;a
	      &#269;íselnej hodnoty znaku spôsobovali problémy. Slovenské nastavenia triedenia povedia
	      funkciam <TT
CLASS="FUNCTION"
>strcoll</TT
> a <TT
CLASS="FUNCTION"
>strxfrm</TT
>, &#382;e napríklad
	      <TT
CLASS="LITERAL"
>ch</TT
> je jedno písmeno a nasleduje hne&#271; za <TT
CLASS="LITERAL"
>h</TT
> a nie
	      za <TT
CLASS="LITERAL"
>c</TT
>, &#382;e &#353;iroké <TT
CLASS="LITERAL"
>ä</TT
> nasleduje za dlhým
	      <TT
CLASS="LITERAL"
>á</TT
> a to zase za oby&#269;ajným <TT
CLASS="LITERAL"
>a</TT
>. Skúste si to na
	      príkaze <B
CLASS="COMMAND"
>sort</B
>.  Zadajte písmená <TT
CLASS="LITERAL"
>cc ch hh</TT
>, potom
	      zme&#328;te <TT
CLASS="ENVAR"
>LC_COLLATE</TT
> príkazom
	      <TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>bash$ export LC_COLLATE=sk

tcsh$ setenv LC_COLLATE sk
	      </PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>Skúste to so <B
CLASS="COMMAND"
>sort</B
> znovu a porovnajte výsledok...</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LC_CTYPE</TT
> --- Klasifikácia a prevod znakov, multibyte. Správne
	      nastavenie tejto premennej je nutné pre korektné rozli&#353;ovanie znakov abecedy
	      jednotlivých jazykov, ur&#269;enie &#269;íslic, tzv. bielych znakov, prevod malých písmen na
	      ve&#318;ké, at&#271;. Najvhodnej&#353;ie je túto premennú nenastavova&#357; a tým umo&#382;ni&#357;, aby bola jej
	      hodnota prebratá od premenných <TT
CLASS="ENVAR"
>LC_ALL</TT
> alebo <TT
CLASS="ENVAR"
>LANG</TT
>
	      (vi&#271; &#271;alej). Ak ale nechcete pou&#382;íva&#357; slovenské nastavenia, len ma&#357; správne zobrazené
	      slovenské fonty a funk&#269;nú slovenskú klávesnicu na konzole aj pod iXami, nastavte iba
	      túto premennú.</P
><DIV
CLASS="WARNING"
><P
></P
><TABLE
CLASS="WARNING"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Varovanie"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>V&#382;dy si bu&#271;te stopercentne istí, &#382;e máte túto premennú nastavenú (bu&#271; cez
		<TT
CLASS="ENVAR"
>LC_ALL</TT
>, <TT
CLASS="ENVAR"
>LANG</TT
> alebo priamo), lebo inak nemá zmysel
		&#269;íta&#357; &#271;alej! Ono <SPAN
CLASS="QUOTE"
>&#8222;klasifikácia a prevod znakov&#8220;</SPAN
> neznie nejako lákavo,
		ale vedzte, &#382;e je to sakramentsky dôle&#382;ité pre &#382;ivot slovenských písmeniek vo va&#353;om
		Linuxe!</P
></TD
></TR
></TABLE
></DIV
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LC_MONETARY</TT
>, <TT
CLASS="ENVAR"
>LC_NUMERIC</TT
> --- Formát pe&#328;a&#382;ných a
	      &#269;íselných hodnôt.  Umo&#382;&#328;uje meni&#357; skupinu nastavení, ktoré sa pou&#382;ijú pri formátovaní
	      pe&#328;a&#382;ných hodnôt alebo v&#353;etkých ostatných &#269;íselných hodnôt. Sú to desatinná &#269;iarka,
	      odde&#318;ova&#269; tisícov, zoskupovanie &#269;íslic, znamienka pre kladné a zaporné hodnoty,
	      at&#271;.</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LC_TIME</TT
> --- Formátovanie dátumu a &#269;asu. Nastavenia odde&#318;ova&#269;ov
	      medzi hodinami, minútami a sekundami, názvy dní, poradie rok, mesiac a de&#328; v dátume,
	      ...</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LC_MESSAGES</TT
> --- Výber jazyka, pou&#382;itého u&#382;ívate&#318;ským rozhraním na
	      preklad hlá&#353;ok programov. Toto je presne tá premenná, ktorá prinúti aplikácie hovori&#357;
	      po slovensky. Vi&#271; &#271;al&#353;ie kapitoly.</P
></LI
></UL
>
      </P
><P
>S prekladom hlásení programov, hlavne s umiestnením súborov s prelo&#382;enými re&#357;azcami,
	súvisí premenná <TT
CLASS="ENVAR"
>NLSPATH</TT
>. Mala by obsahova&#357; dvojbodkami oddelený zoznam
	adresárov, v ktorých sa budú h&#318;ada&#357; <TT
CLASS="FILENAME"
>.mo</TT
> súbory pre miestne nastavenia
	dané premennou <TT
CLASS="ENVAR"
>LC_MESSAGES</TT
>. Premennú <TT
CLASS="ENVAR"
>NLSPATH</TT
> je v&#353;ak
	potrebné nastavova&#357; len vo výnimo&#269;ných prípadoch, preto&#382;e aplikácie h&#318;adajú preklady svojich
	hlásení v &#353;tandardných adresároch pre tieto súbory.</P
><P
>Okrem týchto premenných bolo implementovaných nieko&#318;ko &#271;al&#353;ích, ktoré zatia&#318; nie sú
	zdokumentované (<I
CLASS="CITETITLE"
>The GNU C Library Reference Manual</I
>). Ich význam je
	zrejmý z názvu, tak&#382;e uvediem aj svoju dedukciu.</P
><P
></P
><UL
><LI
><P
><TT
CLASS="ENVAR"
>LC_PAPER</TT
> --- Formát papiera. V na&#353;ich zemepisných &#353;írkach sa
	    napríklad pou&#382;íva formát <SPAN
CLASS="ACRONYM"
>A4</SPAN
>, v Amerike je to
	    Letter, at&#271;. Pozor, táto premenná neobsahuje priamo názov formátu, ale (tak, ako v&#353;etky
	    <TT
CLASS="ENVAR"
>LC_</TT
> premenné), skratku miestneho nastavenia, teda u nás to bude
	    <TT
CLASS="CONSTANT"
>sk</TT
>. Ak by sme chceli pou&#382;íva&#357; formát Letter, museli by sme túto
	    premennú nastavi&#357; na kód miestneho nastavenia niektorej z krajín, ktorá pou&#382;íva takýto
	    formát, napríklad <TT
CLASS="CONSTANT"
>us</TT
>. V tomto prípade je nutné nain&#353;talova&#357; balík s
	    miestnymi nastaveniami pre túto krajinu (<SPAN
CLASS="APPLICATION"
>locales-us</SPAN
>).
	    </P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LC_NAME</TT
> --- Formát mena a priezviska. U nás má ka&#382;dý dve mená,
	    pí&#353;u sa v poradí meno, priezvisko. V Rusku majú zase tri mená v poradí meno,
	    otcovo-meno, priezvisko. V Ma&#271;arsku majú dve mená tak ako u nás, ale pí&#353;u sa v opa&#269;nom
	    poradí. O tom je táto premenná. Asi...</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LC_ADDRESS</TT
> --- Spôsob zápisu adresy. Poradie ulice a popisného
	    &#269;ísla domu, ZIP kód, PS&#268; apod.</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LC_TELEPHONE</TT
> --- Formát telefónnych a faxových &#269;ísel.  Ur&#269;uje
	    zoskupovanie &#269;íslic, ich oddelovanie, po&#269;et &#269;ísel predvo&#318;by, ...</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LC_MEASUREMENT</TT
> --- Miery. Jednotky hmotnosti, objemu, teploty a
	    d&#314;&#382;ky, pou&#382;ívané v tej ktorej krajine. Program napísaný v <SPAN
CLASS="ACRONYM"
>USA</SPAN
> bude
	    pravdepodobne po&#269;íta&#357; s galónmi vody, ale ak je správne napísaný, s premennou
	    <TT
CLASS="ENVAR"
>LC_MEASUREMENT</TT
> nastavenou na <SPAN
CLASS="QUOTE"
>&#8222;sk&#8220;</SPAN
> bude zobrazova&#357; litre v
	    správnom pomere. To isté platí napríklad pre prevod teploty vo Fahrenheitovej stupnici
	    na stupne Celsia.</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LC_IDENTIFICATION</TT
> --- Az apád, tak toto neviem. Rodné &#269;íslo?
	    &#268;íslo sociálneho poistenia? &#268;íslo topánok?</P
></LI
></UL
></DIV
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="AEN198"
>2.1.3. &#270;al&#353;ie premenné</A
></H3
><P
></P
><UL
><LI
><P
><TT
CLASS="ENVAR"
>LC_ALL</TT
> --- Ak je táto premenná nastavená, pou&#382;ije sa jej hodnota
	    pre v&#353;etky vy&#353;&#353;ie spomenuté skupiny locales, bez oh&#318;adu na hodnotu príslu&#353;ných
	    premenných.</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LANG</TT
> --- Hodnota tejto premennej sa pou&#382;ije pre tie skupiny
	    locales, ktoré nemajú príslu&#353;nú premennú nastavenú.</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LANGUAGE</TT
> --- Alternatívne miestne nastavenia. Táto premenná mô&#382;e
	    obsahova&#357; usporiadaný zoznam kódov miestnych nastavení oddelených dvojbodkami. Súbory s
	    prekladmi hlá&#353;ok programov sa budú h&#318;ada&#357; v poradí, v akom sú ur&#269;ené v tomto zozname. Ak
	    sa nepodarí nájs&#357; súbor s prelo&#382;enými hlá&#353;kami programu v jednom jazyku, pou&#382;ije sa
	    súbor pre nasledujúci jazyk v zozname <TT
CLASS="ENVAR"
>LANGUAGE</TT
>.  Navy&#353;e, ak sa súbor pre
	    prvý jazyk aj nájde, ale niektorý re&#357;azec z neho nie je prelo&#382;ený, nepou&#382;ije sa pôvodný
	    (anglický), ale najskôr sa pokúsi nájs&#357; preklad daného re&#357;azca v súbore pre &#271;al&#353;í jazyk
	    v zozname <TT
CLASS="ENVAR"
>LANGUAGE</TT
>.  To je výhodné pre &#318;udí, ktorí okrem svojho jazyka
	    ovládajú nejaký iný lep&#353;ie ako angli&#269;tinu, v ktorej sú zvy&#269;ajne programy originálne
	    napísané. Napríklad Slovák by mohol ma&#357; nastavené
	    <TT
CLASS="COMPUTEROUTPUT"
>LANGUAGE="sk:cz"</TT
> a Szolvák z Komárom zase
	    <TT
CLASS="COMPUTEROUTPUT"
>LANGUAGE="hu:sk"</TT
>.</P
><DIV
CLASS="CAUTION"
><P
></P
><TABLE
CLASS="CAUTION"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/caution.gif"
HSPACE="5"
ALT="Výstraha"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Premenná <TT
CLASS="ENVAR"
>LANGUAGE</TT
> ovplyv&#328;uje len premennú
	      <TT
CLASS="ENVAR"
>LC_MESSAGES</TT
>! Pre správnu funkciu je nutné nastavi&#357; aj ostatné premenné
	      (minimálne <TT
CLASS="ENVAR"
>LC_CTYPE</TT
>).</P
></TD
></TR
></TABLE
></DIV
></LI
><LI
><P
><TT
CLASS="ENVAR"
>LINGUAS</TT
> --- Táto premenná nemá &#353;peciálny význam z h&#318;adiska
	    <SPAN
CLASS="ACRONYM"
>GNU</SPAN
> libc, ale zvykne sa pou&#382;íva&#357; pri in&#353;talácii programov (zo
	    zdrojákov). Medzerami oddelený zoznam kódov miestnych nastavení ur&#269;uje jazyky, pre ktoré
	    si u&#382;ívate&#318; &#382;elá in&#353;talova&#357; preklady re&#357;azcov aplikácie. Príklad:
	    <TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>bash$ export LINGUAS="sk cz"
bash$ ./configure
bash$ make install
	    </PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>Tieto príkazy skompilujú a nain&#353;talujú aplikáciu s podporou sloven&#269;iny a &#269;e&#353;tiny.
	    In&#353;tala&#269;né skripty obvykle tie&#382; kontrolujú obsah premenných <TT
CLASS="ENVAR"
>LANG</TT
> a
	    <TT
CLASS="ENVAR"
>LC_ALL</TT
>, tieto ale mô&#382;u obsahova&#357; len jeden kód miestnych
	    nastavení.</P
></LI
><LI
><P
><TT
CLASS="ENVAR"
>RPM_INSTALL_LANG</TT
> --- &#268;astej&#353;ie ako zo zdrojového kódu sa aplikácie
	    in&#353;talujú z rôznych balíkov (rpm, deb, ...). Kvôli &#353;etreniu miestom na disku (a logike
	    -- málokto ovláda tridsa&#357; re&#269;í) je v <SPAN
CLASS="ACRONYM"
>RPM4</SPAN
> mo&#382;né ur&#269;i&#357; jazyk, ktorého
	    prelo&#382;ené hlá&#353;ky sa budú in&#353;talova&#357;. Preto odporú&#269;am do súboru
	    <TT
CLASS="FILENAME"
>.bash_profile</TT
> (<TT
CLASS="FILENAME"
>.login</TT
>) u&#382;ívate&#318;a, ktorý
	    in&#353;taluje balíky (root), vlo&#382;i&#357; nasledovný riadok:
	    <TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>bash$ export RPM_INSTALL_LANG=sk

tcsh$ setenv RPM_INSTALL_LANG "sk"
	    </PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>Ak sa vám nebodaj stane taká vec, &#382;e nain&#353;talujete celý opera&#269;ný systém a a&#382;
	    potom sa dozviete o tejto premennej (tak, ako sa to stalo aj mne), skúste skript uvedený
	    v &#269;asti <A
HREF="apps.html#APPS-RPM4"
><I
>RPM4</I
></A
>.</P
></LI
></UL
></DIV
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="AEN236"
>2.1.4. Priorita premenných</A
></H3
><P
>Miestne nastavenia sa ur&#269;ujú zo spomenutých premenných, pri&#269;om tieto sa vyhodnocujú v
	tomto poradí:
	<P
></P
><TABLE
BORDER="0"
><TBODY
><TR
><TD
><TT
CLASS="ENVAR"
>LANGUAGE</TT
> --- ovplyv&#328;uje len <TT
CLASS="ENVAR"
>LC_MESSAGES</TT
>
	  </TD
></TR
><TR
><TD
><TT
CLASS="ENVAR"
>LC_ALL</TT
></TD
></TR
><TR
><TD
><TT
CLASS="ENVAR"
>LC_*</TT
></TD
></TR
><TR
><TD
><TT
CLASS="ENVAR"
>LANG</TT
></TD
></TR
></TBODY
></TABLE
><P
></P
></P
><P
>To znamená asi to&#318;ko, &#382;e ke&#271; raz nastavíte <TT
CLASS="ENVAR"
>LC_ALL</TT
>, jednotlivé
	premenné <TT
CLASS="ENVAR"
>LC_*</TT
> sa u&#382; neberú do úvahy. Na druhej strane, ak máte
	napríklad nastavené len niektoré z <TT
CLASS="ENVAR"
>LC_*</TT
>, ostatné sa nastavia na hodnotu
	premennej <TT
CLASS="ENVAR"
>LANG</TT
>.</P
></DIV
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="AEN254"
>2.1.5. Kódy miestnych nastavení</A
></H3
><P
>Premenné, ktoré ovplyv&#328;ujú miestne nastavenia, sa nap&#314;&#328;ajú kódmi miestnych nastavení.
	Kódy miestnych nastavení sú re&#357;azce, ktorých formát sa riadi nieko&#318;kými pravidlami.
	V&#353;eobecný tvar je:
	<TABLE
BORDER="0"
BGCOLOR="#6495ED"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SYNOPSIS"
>jazyk[_územie[.kódovanie]][@modifikátor]
	</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
><TT
CLASS="ENVAR"
>jazyk</TT
> je napr. <TT
CLASS="CONSTANT"
>sk</TT
> pre sloven&#269;inu,
	<TT
CLASS="CONSTANT"
>cs</TT
> pre &#269;e&#353;tinu, <TT
CLASS="CONSTANT"
>hu</TT
> pre ma&#271;ar&#269;inu, územie je
	<TT
CLASS="CONSTANT"
>SK</TT
> pre Slovensko, <TT
CLASS="CONSTANT"
>CZ</TT
> pre &#268;eskú republiku,
	<TT
CLASS="CONSTANT"
>HU</TT
> pre Ma&#271;arsko, kódovanie je <TT
CLASS="CONSTANT"
>ISO-8859-2</TT
> pre
	v&#353;etky stredoeurópske jazyky (je mo&#382;ne pou&#382;i&#357; nieko&#318;ko formátov na zadanie kódovania) a
	modifikátor slu&#382;i na povolenie alebo zakázanie niektorých funkcií. Tie sú dané v definíciach
	miestnych nastavení. Napríklad, pre Ve&#318;kú Britániu je modifikátorom re&#357;azec
	<TT
CLASS="CONSTANT"
>euro</TT
> a pri jeho pou&#382;ití sa ako pe&#328;a&#382;ná mena bude pou&#382;íva&#357; euro namiesto
	libry. To znamená, &#382;e sa musí pou&#382;i&#357; kódovanie <TT
CLASS="CONSTANT"
>iso-8859-15</TT
>, ktoré
	definuje znaky euro a cent.</P
><P
>Príklady kódov miestnych nastavení (ka&#382;dý z týchto re&#357;azcov je mo&#382;né priradi&#357; premenným
	miestnych nastavení, ale naj&#269;astej&#353;ie sa pou&#382;ívajú len dvojpísmenkové skratky v poslednom
	st&#314;pci):
	<DIV
CLASS="TABLE"
><A
NAME="AEN270"
></A
><P
><B
>Tabu&#318;ka 1. Príklady kódov miestnych nastavení</B
></P
><TABLE
BORDER="1"
CLASS="CALSTABLE"
><TBODY
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
>sk_SK.ISO-8859-2</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>sk_SK</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>sk</TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
>cs_CZ.ISO-8859-2</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>cs_CZ@-ch</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>cs@-ch</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>cs</TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
>en_GB.iso8859</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>en_GB</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>en@euro</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>en</TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
>ja_JP.ujis</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>ja_JP.EUC</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>ja_JP</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
>ja</TD
></TR
></TBODY
></TABLE
></DIV
></P
><P
>Nemali by sme zabudnú&#357; na dve &#353;tandardné locales, ktoré sa pou&#382;ijú, ak nie sú systémové
	premenné nastavené a programy ich pou&#382;ívajú do doby, kým sa inicializuje lokalizácia.
	Tvrdím, &#382;e sa pou&#382;ijú obe, preto&#382;e momentálne sú toto&#382;né, ale v budúcnosti sa mô&#382;u v tejto
	oblasti &#353;tandardy <SPAN
CLASS="ACRONYM"
>ISO</SPAN
> <SPAN
CLASS="ACRONYM"
>C</SPAN
> a <SPAN
CLASS="ACRONYM"
>POSIX</SPAN
>
	odli&#353;ova&#357; a potom to bude zále&#382;a&#357; na konfigurácii systému.
	<P
></P
><TABLE
BORDER="0"
><TBODY
><TR
><TD
><TT
CLASS="CONSTANT"
>C</TT
> --- nastavenia pod&#318;a &#353;tandardu <SPAN
CLASS="ACRONYM"
>ISO</SPAN
>
	    <SPAN
CLASS="ACRONYM"
>C</SPAN
>.</TD
></TR
><TR
><TD
><TT
CLASS="CONSTANT"
>POSIX</TT
> --- nastavenia pod&#318;a &#353;tandardu
	    <SPAN
CLASS="ACRONYM"
>POSIX</SPAN
>. V sú&#269;asnosti je to alias pre nastavenia
	    <TT
CLASS="CONSTANT"
>C</TT
>.</TD
></TR
></TBODY
></TABLE
><P
></P
></P
></DIV
></DIV
><DIV
CLASS="SECTION"
><H2
CLASS="SECTION"
><A
NAME="LOCALES-SLOVAKIA"
>2.2. Miestne nastavenia pre Slovensko</A
></H2
><P
>V prvom rade treba nain&#353;talova&#357; balík s podporou miestnych nastavení, ktorý má názov
      <SPAN
CLASS="APPLICATION"
>locales</SPAN
> a tie&#382; balík s podporou priamo pre Slovensko ---
      <SPAN
CLASS="APPLICATION"
>locales-sk</SPAN
>. Ak máte záujem pou&#382;íva&#357; aj podporu pre nejaký iný jazyk
      (na na&#353;om území je aktuálna najmä &#269;e&#353;tina a ma&#271;ar&#269;ina), musíte tie&#382; nain&#353;talova&#357; balíky pre
      tieto jazyky.</P
><P
>V druhom rade si musíte nain&#353;talova&#357; balíky s podporou miestnych nastavení a priamo
      sloven&#269;iny (sú to <SPAN
CLASS="APPLICATION"
>locales</SPAN
> a <SPAN
CLASS="APPLICATION"
>locales-sk</SPAN
>).
      </P
><P
>V &#271;al&#353;om kroku si nezabudnite nain&#353;talova&#357; balíky <SPAN
CLASS="APPLICATION"
>locales</SPAN
> a
      <SPAN
CLASS="APPLICATION"
>locales-sk</SPAN
>. Takisto, pre ka&#382;dý jazyk, ktorý sa chystáte pou&#382;íva&#357;,
      si nain&#353;talujte balík s podporou miestnych nastavení.</P
><P
>V prípade problémov s miestnymi nastaveniami sa dr&#382;te predchádzajúcich troch krokov.
      </P
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="AEN319"
>2.2.1. Súbory s miestnymi nastaveniami</A
></H3
><P
>Prejdime sa teraz trochu po na&#353;ich adresároch. Prvý nav&#353;tívime <TT
CLASS="FILENAME"
>/usr/share/locale/sk</TT
>. Na prvý poh&#318;ad vidno, &#382;e adresár a
	súbory v tomto adresári majú mená toto&#382;né s premennými, pomocou ktorých sa nastavujú
	jednotlivé kategórie miestnych nastavení.  Je to preto, lebo práve z týchto súborov sa
	na&#269;ítajú nastavenia, ke&#271; je daná premenná nastavená na hodnotu <TT
CLASS="CONSTANT"
>sk</TT
>.
	Okrem nich tu mô&#382;e by&#357; e&#353;te súbor <TT
CLASS="FILENAME"
>charset</TT
>, ktorý obsahuje len jeden
	riadok s re&#357;azcom <TT
CLASS="COMPUTEROUTPUT"
>iso-8859-2</TT
>. Ten hovorí, aké kódovanie
	znakov sa má pou&#382;i&#357; pre dané miestne nastavenia.</P
><P
>V&#353;etky súbory v tomto adresári sú binárne dáta a adresár <TT
CLASS="ENVAR"
>LC_MESSAGES</TT
>
	obsahuje súbory, ktorých mená sú toto&#382;né s názvami niektorých balíkov nain&#353;talovaných na
	va&#353;om systéme, s príponou mo. Sú to preklady re&#357;azcov z jednotlivých aplikácií. O nich si
	povieme neskôr. Teraz by sme mohli zisti&#357;, &#269;o vlastne obsahujú súbory <TT
CLASS="ENVAR"
>LC_*</TT
>.
        </P
><P
>Presu&#328;me sa do adresára <TT
CLASS="FILENAME"
>/usr/share/i18n/</TT
>. Tu, v
	textovom súbore <TT
CLASS="FILENAME"
>sk_SK</TT
> v podadresári
	<TT
CLASS="FILENAME"
>locales/</TT
> sa kone&#269;ne nachádzajú slovenské miestne
	nastavenia v &#269;itate&#318;nej (a editovate&#318;nej) forme. Súbory v tomto adresári majú presne danú
	&#353;truktúru, ktorá je popísaná v manuálovej stránke locale(5). Pre be&#382;ného pou&#382;ívate&#318;a nemá
	zmysel meni&#357; nastavenia v tomto súbore, ke&#271;&#382;e ide o &#353;tandardné nastavenia, ktoré sa
	pou&#382;ívajú na celom Slovensku. Ale, proti Gustovi &#382;iadna putika! Ak sa teda rozhodnete zmeni&#357;
	nie&#269;o v tomto súbore, musíte aktualizova&#357; súbory v prvom spomínanom adresári
	<TT
CLASS="FILENAME"
>/usr/share/locales/sk/</TT
> príkazom, ktorý údaje v súbore
	<TT
CLASS="FILENAME"
>sk_SK</TT
> skompiluje a ulo&#382;í do súborov
	<TT
CLASS="ENVAR"
>LC_COLLATE</TT
>, <TT
CLASS="ENVAR"
>LC_CTYPE</TT
>, ...
	<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>sh$ localedef -i sk_SK -f ISO-8859-2 sk_SK
	</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>V podadresári <TT
CLASS="FILENAME"
>/usr/share/i18n/charmaps/</TT
> sa
	nachádzajú súbory s popismi jednotlivých kódovani znakov. Pre Slovensko je aktuálny
	<TT
CLASS="FILENAME"
>ISO-8859-2</TT
> (&#269;o je aj obsah spomínaneho súboru
	<TT
CLASS="FILENAME"
>charset</TT
>).</P
><P
>V adresári <TT
CLASS="FILENAME"
>/usr/share/locale/</TT
> sa nachádza súbor
	<TT
CLASS="FILENAME"
>locale.alias</TT
>, ktorý definuje tzv. <I
CLASS="FIRSTTERM"
>aliasy</I
> pre
	kódy miestnych nastavení. Pre správnu funkciu slovenských miestnych nastavení by mal
	obsahova&#357; tieto dva riadky:
	<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>sk              sk_SK.ISO-8859-2
slovak          sk_SK.ISO-8859-2
	</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>To zabezpe&#269;í, &#382;e aj ke&#271; nezadáte kódovanie znakov, bude pou&#382;ité iso-8859-2. Druhý riadok
	má na svedomí to, &#382;e namiesto sk mo&#382;no zada&#357; slovak.</P
><DIV
CLASS="WARNING"
><P
></P
><TABLE
CLASS="WARNING"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.gif"
HSPACE="5"
ALT="Varovanie"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Ale na aliasy typu <TT
CLASS="CONSTANT"
>slovak</TT
> si dávajte bacha! Niektoré
	  aplikácie, ktoré v súvislosti s miestnymi nastaveniami nevyu&#382;ívajú slu&#382;by libc, toti&#382; na
	  aliasy ka&#353;&#318;ú a zaujímajú ich len prvé dva znaky nastavených premenných. A tak sa zo
	  <TT
CLASS="CONSTANT"
>slovak</TT
> stane <TT
CLASS="CONSTANT"
>sl</TT
>, &#269;o je Slovinsko. Pozitívne je,
	  &#382;e pre sloven&#269;inu mô&#382;ete nastavi&#357; premennú napríklad na hodnotu
	  <TT
CLASS="CONSTANT"
>skaderukaskadenoha</TT
>.</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="AEN358"
>2.2.2. Konfigurácia miestnych nastavení</A
></H3
><P
>Nastavenia internacionalizácie sa (v <SPAN
CLASS="SYSTEMITEM"
>RedHat</SPAN
> a
	<SPAN
CLASS="SYSTEMITEM"
>Mandrake</SPAN
>) nachádzajú v súbore
	<TT
CLASS="FILENAME"
>/etc/sysconfig/i18n</TT
>. Je to ve&#318;mi u&#382;ito&#269;ný súbor, ktorý si rýchlo
	ob&#318;úbite. Mo&#382;no v &#328;om nastavi&#357; v&#353;etko, &#269;o sa kedy týkalo internacionalizácie, národných
	fontov a rozlo&#382;ení kláves.  Tento súbor v&#353;ak len definuje systémové premenné a zvykne sa
	vklada&#357; (<TT
CLASS="COMPUTEROUTPUT"
>source  /etc/sysconfig/i18n</TT
>) do inicializa&#269;ných
	skriptov.  Exportovanie premenných (odovzdanie ostatným aplikáciám) má na starosti skript
	<TT
CLASS="FILENAME"
>/etc/profile.d/lang.sh</TT
> (<SPAN
CLASS="APPLICATION"
>bash</SPAN
>) alebo
	<TT
CLASS="FILENAME"
>/etc/profile.d/lang.csh</TT
> (<SPAN
CLASS="APPLICATION"
>tcsh</SPAN
>). Tento sa
	vykoná pri ka&#382;dom &#353;tarte shellu, typicky je volaný z <TT
CLASS="FILENAME"
>/etc/profile</TT
>
	(<SPAN
CLASS="APPLICATION"
>bash</SPAN
>) alebo <TT
CLASS="FILENAME"
>/etc/csh.cshrc</TT
>
	(<SPAN
CLASS="APPLICATION"
>tcsh</SPAN
>).</P
><P
>Súbor <TT
CLASS="FILENAME"
>/etc/sysconfig/i18n</TT
> definuje nastavenia pre celý systém.
	Tieto sa pou&#382;ijú, ak sa nenájde súbor s u&#382;ívate&#318;ovými nastaveniami. Ka&#382;dý u&#382;ívate&#318; si mô&#382;e
	ur&#269;i&#357; svoje vlastné nastavenia v súbore <TT
CLASS="FILENAME"
>.i18n</TT
> v jeho domovskom
	adresári.  Nastavenia sa v&#382;dy &#269;ítajú len z jedného z týchto súborov, teda ak má u&#382;ívate&#318;
	svoj vlastný súbor <TT
CLASS="FILENAME"
>&#732;/.i18n</TT
>, nastavenia zo súboru
	<TT
CLASS="FILENAME"
>/etc/sysconfig/i18n</TT
> sa ignorujú.</P
><P
>U&#382;ívate&#318; si mô&#382;e zmeni&#357; nastavenia aj ru&#269;ne, kedyko&#318;vek sa mu zachce, nastavením
	premenných prostredia
	<TT
CLASS="ENVAR"
>LC_MESSAGES</TT
>, <TT
CLASS="ENVAR"
>LANG</TT
>, at&#271;.</P
><P
>Vypnú&#357; nejaké nastavenie je mo&#382;né príkazom
	<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>sh$ unset LC_MESSAGES LANG
	</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>Tým sa zru&#353;ia nastavenia daných premenných (a pou&#382;ije sa &#353;tandardné locale
	<TT
CLASS="CONSTANT"
>C</TT
> alebo <TT
CLASS="CONSTANT"
>POSIX</TT
>).</P
><P
>Ak máte napríklad nastavené premenné <TT
CLASS="COMPUTEROUTPUT"
>LC_ALL=sk</TT
> a
	<TT
CLASS="COMPUTEROUTPUT"
>LC_MESSAGES=cz</TT
>, tak po príkaze <TT
CLASS="COMPUTEROUTPUT"
>unset
	LC_ALL</TT
> nebudete ma&#357; hlásenia programov v angli&#269;tine, ale &#269;e&#353;tine. Preto, ak
	chcete vypnú&#357; nejaké nastavenia, v&#382;dy musíte príkazom unset zru&#353;i&#357; nastavenia v&#353;etkých
	premenných, ktoré mô&#382;u ovplyv&#328;ova&#357; dané miestne nastavenia.</P
><DIV
CLASS="NOTE"
><P
></P
><TABLE
CLASS="NOTE"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.gif"
HSPACE="5"
ALT="Poznámka"></TD
><TH
ALIGN="LEFT"
VALIGN="CENTER"
><B
>export/setenv</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Neodpustím si malú poznámku k príkazu <B
CLASS="COMMAND"
>export</B
>. Je to vstavaná
	  funkcia v&#353;etkých shellov kompatibilných s klasickým <SPAN
CLASS="APPLICATION"
>sh</SPAN
> (teda aj
	  <SPAN
CLASS="APPLICATION"
>bash</SPAN
>). Pre shelly typu <SPAN
CLASS="APPLICATION"
>tcsh</SPAN
> je
	  ekvivalentom príkaz <B
CLASS="COMMAND"
>setenv</B
>.</P
><P
>Je dôle&#382;ité uvedomi&#357; si, &#269;o presne tento príkaz robí s premennými. V dokumentácii k
	  bashu sa hovorí, &#382;e <B
CLASS="COMMAND"
>export</B
> ozna&#269;í premennú, aby bola odovzdaná detským
	  (<I
CLASS="FOREIGNPHRASE"
>child</I
>) procesom v rámci prostredia
	  (<I
CLASS="FOREIGNPHRASE"
>environment</I
>). To znamená asi to&#318;ko, &#382;e ke&#271; spustíte napr.
	  iXy z materského procesu <SPAN
CLASS="SYSTEMITEM"
>bash</SPAN
>, ktorý pri &#353;tarte
	  exportoval premennú <TT
CLASS="COMPUTEROUTPUT"
>LANG=sk</TT
>, v&#353;etky aplikácie v prostredí
	  <SPAN
CLASS="APPLICATION"
>X Window System</SPAN
> budú dedi&#357; toto nastavenie a teda (ak to sami
	  podporujú) budú fungova&#357; po slovensky. Ak budete chcie&#357; spusti&#357; aplikáciu bez slovenských
	  nastavení, musíte v <SPAN
CLASS="APPLICATION"
>xterme</SPAN
> zada&#357; príkaz <TT
CLASS="COMPUTEROUTPUT"
>unset
	  LANG</TT
> (<TT
CLASS="COMPUTEROUTPUT"
>unsetenv LANG</TT
> pre
	  <SPAN
CLASS="APPLICATION"
>tcsh</SPAN
>), &#269;ím pre v&#353;etky detské procesy
	  <SPAN
CLASS="APPLICATION"
>xtermu</SPAN
> (presnej&#353;ie shellu, ktorý je v &#328;om spustený), zru&#353;íte
	  nastavenie premennej <TT
CLASS="ENVAR"
>LANG</TT
>. Potom aplikácie spustené priamo z tohto xtermu
	  budú fungova&#357; bez podpory sloven&#269;iny. Trochu sa s tým pohrajte.</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="AEN415"
>2.2.3. Nastavenie &#269;asovej zóny</A
></H3
><P
>S miestnymi nastaveniami úzko súvisí aj nastavenie &#269;asovej zóny. Vedel by som o tom
	rozpráva&#357; celé hodiny, ale ono by to muselo by&#357; zlo&#382;itej&#353;ie ako len nastavenie jednej
	premennej... A to takto:
	<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>bash$ export TZ="Europe/Bratislava"

tcsh$ setenv TZ "Europe/Bratislava"
	</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>Toto nastavenie ovplyv&#328;uje len &#269;asový posun oproti hardverovým hodinám.  (Mimochodom,
	odporú&#269;am hardverové hodiny nastavené na greenwichský svetový &#269;as, &#269;ím tie&#382; odpadajú
	problémy s prechodom medzi letným a zimným &#269;asom at&#271;. ale o tom sú popísané iné súbory.)
	Toto celé je dos&#357; dobrá vec, hlavne ak mate prístup k po&#269;íta&#269;u v inej &#269;asovej zóne, ale
	chcete pracova&#357; s &#269;asom v stredoeurópskej zóne. Do svojho súboru
	<TT
CLASS="FILENAME"
>.bash_profile</TT
> (<TT
CLASS="FILENAME"
>.login</TT
> pre
	<SPAN
CLASS="APPLICATION"
>tcsh</SPAN
>) vlo&#382;te vy&#353;&#353;ie uvedený riadok.</P
></DIV
></DIV
><DIV
CLASS="SECTION"
><H2
CLASS="SECTION"
><A
NAME="LOCALES-EXAMPLES"
>2.3. Príklady miestnych nastavení</A
></H2
><P
></P
><UL
><LI
><P
>U&#382;ívate&#318; je síce zo stredného Slovenska, ale u&#382; ke&#271; s ním bola jeho mama tehotná,
	  pú&#353;&#357;ala mu do brucha kurzy angli&#269;tiny. Nemá teda zmysel pou&#382;íva&#357; slovenské nastavenia, a&#382;
	  na krajné prípady, napr. slovenské fonty v <SPAN
CLASS="APPLICATION"
>Gimpe</SPAN
>. Darujte mu
	  súbor <TT
CLASS="FILENAME"
>.i18n</TT
> s nasledovným obsahom (aj na takéto malé oné potrebuje
	  <SPAN
CLASS="APPLICATION"
>locales-sk</SPAN
>):
	  <TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>LC_CTYPE=sk
	  </PRE
></FONT
></TD
></TR
></TABLE
></P
></LI
><LI
><P
>U&#382;ívate&#318; je normálny, má rád svoj materinský jazyk, ale netrápi ho, ke&#271; má polovicu
	  aplikácií po slovensky a polovicu po anglicky. Po &#269;esky vie. Toto ho pote&#353;í (nezabudnite
	  mu potajomky nain&#353;talova&#357; aj <SPAN
CLASS="APPLICATION"
>locales-cs</SPAN
>):
	  <TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>LANGUAGE=sk:cs
LANG=sk
	  </PRE
></FONT
></TD
></TR
></TABLE
></P
></LI
><LI
><P
>U&#382;ívate&#318; je z blízkeho juhu, jeho ob&#318;úbené pleso je Balaton, v&#353;etky hlá&#353;ky chce po
	  ma&#271;arsky, ak sa inak nedá, pochopí aj sloven&#269;inu. Nesmieme zabudnú&#357; na jeho miernu
	  schizofreniu, pri&#269;om jedno jeho ja potrebuje slovenské triedenie re&#357;azcov a druhé nevie
	  &#382;i&#357; bez formátovania dátumu a &#269;asu v &#269;e&#353;tine. Nikdy sa nesmie zabudnú&#357; na in&#353;taláciu
	  prekladov hlá&#353;ok pre ma&#271;ar&#269;inu, &#269;e&#353;tinu a sloven&#269;inu z balíkov, ktoré podporujú premennú
	  LINGUAS. Treba ho tie&#382; presved&#269;i&#357;, &#382;e in&#353;talácia
	  <SPAN
CLASS="APPLICATION"
>locales-{sk,hu,cs}</SPAN
> nepredstavuje bezpe&#269;nostné riziko:
	  <TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>LANGUAGE=hu:sk:cs
LC_COLLATE=sk
LC_TIME=cs
LANG=hu
LINGUAS="hu cs sk"
	  </PRE
></FONT
></TD
></TR
></TABLE
></P
></LI
></UL
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="intro.html"
>Predchádzajúci</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
>Domov</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="console.html"
>&#270;al&#353;í</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Úvodné informácie</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
>&nbsp;</TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Nastavenia konzoly</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>