<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.52">
 <META NAME="LFCATEGORY" CONTENT="SystemAdministration">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf385, SystemAdministration: Critique de livre : The Linux Enterprise Cluster</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 table.left { margin-right:0.3cm }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 div.tbbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   margin: 2px 5px 2px 5px;
   text-align: center;
   width: 20em;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
 div.bbutton {
   background: #ddd;
   border-right: 1px solid #aaa;
   border-bottom: 1px solid #aaa;
   float: left;
   margin: 2px 5px 2px 5px;
   text-align: center;
   line-height: 1.2em;
   padding: 2px;
   font-size: 12px;
   white-space: nowrap;
   color: #555;
 }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Tom Uijldert
 =LF=CAT___: SystemAdministration
 =LF=TITLE_: Critique de livre : The Linux Enterprise Cluster
 =LF=NUMBER: 385
 =LF=ANAME_: article385.shtml
 =LF=PARSER: 2.52
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, current, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><a href="../../index.shtml"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></a></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 
                 <A class="nodec" href="../../index.shtml"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Carte</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Index</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/index.html"><FONT color=
                 "#DDDDDD" size="2">Recherche</FONT></A> </TD>
                 
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/index.shtml"><FONT color=
           "#FFFFFF">Nouvelles</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/index.html"><FONT color=
           "#FFFFFF">Archives</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/index.html"><FONT color=
           "#FFFFFF">Liens</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">A propos</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfdynahead ver 1.5 --><TABLE ALIGN="right" border=0><TR><TD ALIGN="right"><FONT SIZE="-1" FACE="Arial,Helvetica">Ce document est disponible en: <A href="../../English/July2005/article385.shtml">English</a> &nbsp;<A href="../../Francais/July2005/article385.shtml">Francais</a> &nbsp;</FONT></TD></TR></TABLE><br>
 


<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_START -->
<TABLE ALIGN="LEFT" BORDER="0" WIDTH="195" summary="about the author" class="left">
<TR>
<TD>

<img src="../../common/images/white.gif" alt="[Photo of the Author]" width="100" height="100">
<BR>par  Tom Uijldert <br> <small>&lt;tom.uijldert(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>L&acute;auteur:</I><BR>
<!-- aboutauthor_start -->
<p>Tom est l'un des membres de l'&eacute;quipe n&eacute;erlandophone de Linuxfocus et se
bat avec les clusters depuis que Digital en a cr&eacute;e l'id&eacute;e.</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED_TO fr -->
<BR><BR><I>Traduit en Français par:</I><BR>
Laurent RICHARD <small>&lt;kouran(at)linuxmail.org&gt;</small>
<br>
<!--
 =LF=TRANSTO=fr: Laurent RICHARD
-->
<!-- TRANSLATED_TO_STOP -->
<!-- INDEX_START -->
<BR><i>Sommaire</i>:
<UL>
  <LI><A HREF="#385lfindex0">Clustering</A></LI>
  <LI><A HREF="#385lfindex1">Histoire</A></LI>
  <LI><A HREF="#385lfindex2">Le livre</A></LI>
  <LI><A HREF="#385lfindex3">Le verdict</A></LI>
  <LI><A HREF="#385lfindex4">En conclusion</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=385">Talkback form for this article</A></LI>
</UL>

</TD></TR></TABLE>
<!-- INDEX_STOP -->
<!-- SHORT_BIO_ABOUT_THE_AUTHOR_AND_INDEX_STOP -->
<!-- HEAD_OF_THE_ARTICLE_START -->
<br>&nbsp;
<table border="0"><tr><td>
<!-- tr_staticssi include virtual -->
<!-- tr_staticssi exec cmd -->
<!-- addedByLfPdf ver 0.1 -->
<TABLE style="border-style:outset; border-width:1px" align="right" bgcolor="#ff9616" cellspacing="1"><TR><TD bgcolor="#ff9616">
        <a href="../Archives/lf-2005_07-0385.pdf"><small>PDF</small></a>
        </TD></TR></TABLE>
         

<H2>Critique de livre : The Linux Enterprise Cluster</H2>
 <img src="../../common/images2/article385.gif" alt="Linux Enterprise Cluster" hspace="10" width="157" height="207">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>R&eacute;sum&eacute;</i>:
<P>
<!-- articleabstract_start -->

    « The Linux Enterprise Cluster » est publi&eacute; par No Starch (<a
    href="http://nostarch.com/">http://nostarch.com/</a>). ISBN:
    1-59327-036-4. Auteur : Karl Kopper.

    
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- HEAD_OF_THE_ARTICLE_STOP -->
<!-- BODY_OF_THE_ARTICLE_START -->


    <A NAME="385lfindex0">&nbsp;</A>
<H2>Clustering</H2>


    <p><em>L'art de la juxtaposition de syst&egrave;mes informatiques courants afin de
les faire agir comme une seule entit&eacute;</em>.</p>

    <p>Voici, grosso modo, ce qu'est le clustering.<br>
    Voyons maintenant ce qui pourrait vous pousser &agrave; en faire ?</p>

    <p>Et bien, 2 raisons possibles :</p>

    <ol>
      <li>
        <dl>
          <dd>Vous n'avez pas assez de puissance de processeur (ou pas assez d'argent pour l'obtenir), donc vous combinez plusieurs ordinateurs moins chers afin d'arriver &agrave; une puissance &eacute;quivalente.</dd>
        </dl>
      </li>

      <li>
        <dl>
          <dd style="margin-bottom: 0.5cm">Il y a sur votre syst&egrave;me certains
programmes « critiques », c'est-&agrave;-dire que vous
ne pouvez <em>vraiment</em> pas vous permettre qu'ils soient arr&ecirc;t&eacute;s (le temps,
c'est de l'argent). D&egrave;s lors, vous devez mettre en place une configuration o&ugrave; un
ordinateur (ou une partie de celui-ci) peut tomber en panne mais o&ugrave; le syst&egrave;me
dans son ensemble continue &agrave; tourner (ce qui est aussi appel&eacute; de la haute
 disponibilit&eacute;).</dd>
        </dl>
      </li>
    </ol>

    <p>Le premier exemple illustre le cas des universit&eacute;s et de leurs
d&eacute;partements de recherches et d&eacute;veloppements. Ils n'ont jamais assez de fonds
mais ont <strong>absolument</strong> besoin de puissance de processeurs. Des
 projets comme <a
    href="http://www.beowulf.org/">beowulf</a> ou <a href=
    "http://pareto.uab.es/mcreel/ParallelKnoppix/">ParallelKnoppix</a>
    tiennent compte de cela.</p>

    <p>Le second cas correspond &agrave; l'univers des soci&eacute;t&eacute;s (ou
<em>entreprises</em>). Le financement n'est g&eacute;n&eacute;ralement pas un probl&egrave;me mais
le temps durant lequel le syst&egrave;me est hors service <em>en est un</em>. Imaginez
votre d&eacute;partement de d&eacute;veloppement avec dans celui-ci 60 personnes qui
n'attendent qu'une chose : que le syst&egrave;me redevienne disponible. Ou bien un
bureau avec une douzaine de personnel administratifs qui attendent que la base
de donn&eacute;es soit &agrave; nouveau accessible. Le temps o&ugrave; le syst&egrave;me n'est pas
accessible peut donc revenir tr&egrave;s cher et c'est le sujet de ce livre.</p>

    <p>Le livre se concentre sur la mise en place de clusters de <em>type
entreprise</em>, &eacute;galement appel&eacute;e haute disponibilit&eacute;, qui permettra d'assurer
le service. De toutes les fa&ccedil;ons, ce livre va droit au but. N'esp&eacute;rez pas lire
de la prose sur les bienfaits de la haute disponibilit&eacute;. Ce livre fait ce que
 l'on attend de lui : montrer comment mettre en place cette satan&eacute;e chose et en
assurer la maintenance.</p>

    <p>Si vous &ecirc;tes &agrave; la recherche de r&eacute;sum&eacute;s ou d'une introduction aux syst&egrave;mes
 de haute disponibilit&eacute;, passez votre chemin, vous ne trouverez pas votre
bonheur ici.</p>

    <p>Si par contre, vous avez un chef derri&egrave;re votre dos pr&ecirc;t &agrave; faire une
 crise de nerfs, vocif&eacute;rant : « Le syst&egrave;me est encore hors service et
cela me co&ucirc;te une fortune ! Pourquoi est-ce que je vous paye ? »
 alors, ce livre est ce dont vous avez besoin.<br>
    Entrons un peu plus dans les d&eacute;tails.</p>

    <A NAME="385lfindex1">&nbsp;</A>
<H2>Histoire</H2>


    <p>La l&eacute;gende veut que la soci&eacute;t&eacute; d'informatique <dfn>HP</dfn> (auparavant
connue sous le nom de <dfn>Compaq</dfn>, elle-m&ecirc;me pr&eacute;c&eacute;demment connue sous le
nom de <dfn>Digital Equipment Corporation</dfn>, « what's in a
    name? ») n'a pas &eacute;t&eacute; capable, en cette &egrave;re des terminaux et
des mainframes, de rivaliser avec la puissance des processeurs pour mainframe de
la soci&eacute;t&eacute; IBM. Ainsi naquit l'id&eacute;e de mettre en parall&egrave;le leur micro-ordinateurs
 afin qu'ils puissent proposer &agrave; leurs clients une solution rivalisant avec les
offres des mainframes. </p>

    <p>Je doute qu'ils aient pu persuad&eacute; un seul client de chez IBM avec ce
syst&egrave;me mais cela leur a permis de <em>vraiment</em> trouver quelque
chose d'int&eacute;ressant. Lorsque un terminal tombait en panne, les autres
continuaient &agrave; fonctionner. Le pire qui pouvait arriver &eacute;tait qu'un utilisateur
doive s'authentifier &agrave; nouveau car il &eacute;tait li&eacute; &agrave; l'ordinateur en panne. Un
syst&egrave;me &agrave; haute disponibilit&eacute; &eacute;tait n&eacute;.</p>

    <p>A l'heure actuelle, je ne suis pas s&ucirc;r que cette histoire soit vraie et/ou si
c'est une l&eacute;gende urbaine mais c'est une belle petite histoire donc je m'en
servirai jusqu'&agrave; ce que j'en trouve une meilleure.</p>

    <p>La mise en cluster est une op&eacute;ration complexe et sp&eacute;cialis&eacute;e. Cela est
bien prouv&eacute; par le fait que les revendeurs de Unix commerciaux ne sont pas
encore parvenus &agrave; trouver une solution qui puisse rivaliser avec la solution
(Open) VMS (oui, m&ecirc;me les syst&egrave;mes Unix de Digital lui-m&ecirc;me n'arrivaient
pas &agrave; &eacute;galer les clusters VMS). Maintenant, la communaut&eacute; open source a un coup
&agrave; jouer &agrave; ce niveau.</p>

    <A NAME="385lfindex2">&nbsp;</A>
<H2>Le livre</H2>


    <p>L'ouvrage a une construction quelque peu bizarre. Vous pourriez vous
attendre &agrave; commencer par une description g&eacute;n&eacute;rale du but du livre, le contexte
et la th&eacute;orie et puis, graduellement, se diriger vers des questions plus
pratiques.<br>
    Et bien pas du tout. Cela est bien renseign&eacute; : « Nous allons construire
 un cluster et en voici la recette :... ». La premi&egrave;re partie commence
avec quelques bases de Linux comme la compilation de noyaux, l'installation de
paquetages et la configuration d'un r&eacute;seau standard et ce que vous devrez
ma&icirc;triser avant de passer &agrave; l'&eacute;tape suivante.</p>

    <p>L'&eacute;tape suivante contient essentiellement des bases suppl&eacute;mentaires
centr&eacute;es sur les paquets et les configurations qui conviennent
pour la haute disponibilit&eacute;. Sont inclus des th&eacute;matiques comme le clonage de
syst&egrave;mes, le paquet central et les <tt>stonith</tt>-devices.</p>

    <p>La partie 3 combine les pr&eacute;ceptes vus pour impl&eacute;menter des clusters haute
 disponibilit&eacute; utilisant la r&eacute;partition &eacute;quilibr&eacute;e de la charge de travail. Dans
 la fin de cette partie, tout se rejoint avec un peu de th&eacute;orie suppl&eacute;mentaire
sur les clusters (apr&egrave;s plus ou moins 200 pages de lecture).</p>

    <p>La derni&egrave;re partie traite de la mani&egrave;re de maintenir un cluster en &eacute;tat de
fonctionnement, comment l'administrer et surveiller ses performances.</p>

    <p>Donc, comme je vous le disais, une construction un peu &eacute;trange, mais qui
a besoin de lire un livre en suivant les chapitres dans l'ordre
pr&eacute;-&eacute;tabli ?</p>

    <A NAME="385lfindex3">&nbsp;</A>
<H2>Le verdict</H2>


    <p>Ceci est d'abord un livre <strong>par la pratique</strong>.<br>
    Je peux en trouver une copie corn&eacute;e dans une salle de serveur. Corn&eacute;e car
il est tellement consult&eacute; et utilis&eacute; par les administrateurs
syst&egrave;me afin de maintenir leurs clusters. Comme un livre de recette en fait.</p>

    <p>Ceci peut &ecirc;tre observ&eacute;, par exemple, dans l'imposante partie (la 4e) sur
la maintenance de clusters et leur surveillance. L&agrave; o&ugrave; beaucoup de livres
s'arr&ecirc;teraient apr&egrave;s le chapitre sur la configuration du cluster, celui-ci
n'oublie pas toute les phases importantes qui suivent l'impl&eacute;mentation.</p>


    <p>Une autre remarque concerne le nombre hallucinant de notes, notes de bas
de page, de trucs et d'astuces que ce livre fournit. <br>
    Voici une des perles rares de ce livre (page 322): « <cite>Vous pouvez
&eacute;crire un script qui en appelle un autre mais assurez vous d'abord de rediriger
l'&eacute;tat de sortie du script fils vers l'&eacute;tat de sortie du script principal sinon
SNMPD ne le verra pas.</cite> ».<br>
    Vous ne pouvez arriver &agrave; de telles genres de notes que si vous les avez
exp&eacute;riment&eacute;es par vous-m&ecirc;me et en vous y cassant la t&ecirc;te d'abord.<br>
    Ce livre <em>respire</em> ce genre de sang, transpiration et de larmes.
Je peux tr&egrave;s bien imaginer l'auteur en train de hacker sans cesse lors
d'installations et de configurations de nouveaux syst&egrave;mes pour finalement
trouver comment r&eacute;soudre les probl&egrave;mes en fournissant d'autres alternatives.
Tout ceci en r&eacute;digeant consciencieusement des notes sur chaque probl&egrave;me
rencontr&eacute;.</p>

    <p>En fin de compte, la preuve d&eacute;finitive m'a &eacute;t&eacute; donn&eacute; il y a quelques
jours. Apr&egrave;s avoir lu le livre, j'ai pu aider un coll&egrave;gue sur un probl&egrave;me
en appliquant quelques extrait du livre.</p>

    <A NAME="385lfindex4">&nbsp;</A>
<H2>En conclusion</H2>


    <p>Le cot&eacute; pratique de ce livre est &eacute;galement une de ses faiblesses. Il
ne vieillira pas bien. Pas mal de choses vont devoir &ecirc;tre r&eacute;&eacute;crites d'ici deux
&agrave; trois ans suite aux d&eacute;veloppements permanents dans la communaut&eacute; du libre,
aux changements de configurations, ... <br> Mais encore une fois, vous n'achetez
 pas un livre pour l'utiliser seulement dans quelques ann&eacute;es.</p>

    <p>De plus, le livre contient une multitude d'astuces ainsi qu'un
CD-ROM avec encore plus d'informations quant au t&eacute;l&eacute;chargement, au d&eacute;pannage,
&agrave; la configuration, aux paquets et aux scripts afin que vous puissiez tester
tout ce que vous avez envie d'exp&eacute;rimenter.<br>

Ce que je d&eacute;sirerais <em>par dessus tout</em>, c'est que, apr&egrave;s ce remarquable
travail, l'auteur aille encore plus loin avec ce livre et sa
connaissance du sujet et nous revienne avec une distribution compl&egrave;te du genre
de <em>EnterpriseKnoppix</em> contenant tous les outils n&eacute;cessaires pour r&eacute;aliser
un cluster de haute disponibilit&eacute;.</p>
  


<!-- BODY_OF_THE_ARTICLE_STOP -->
<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback form for this article</h2>
Every article has its own talkback page. On this page you can submit a comment or look at comments from other readers:
<center>
    <table width="250" border=0><tr><td>
    <div class="tbbutton"><A class="nodec" href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=385">&nbsp;talkback page&nbsp;</a></div>
    </td></tr></table>
</center>

<br clear="all">
<HR size="2" noshade>
<table width="250" border=0><tr><td>
<div class="bbutton"><a class="nodec" href="../../index.shtml">&lt;--, LF Sommaire</a></div>
</td><td>
<div class="bbutton"><a class="nodec" href="index.shtml">Sommaire de ce num&eacute;ro</a></div>
</td></tr></table>
<br clear="all">
<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">Site Web maintenu par l&acute;&eacute;quipe d&acute;&eacute;dition LinuxFocus</A>
<BR><FONT COLOR="#1111aa"><a href="../../common/copy.html">&copy; Tom Uijldert</a><br>&quot;some rights reserved&quot; see <a href="../../license/index.shtml">linuxfocus.org/license/</a><br><a href="http://www.linuxfocus.org">http://www.LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Translation information:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Tom Uijldert <small>&lt;tom.uijldert(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; fr: Laurent RICHARD &lt;kouran(at)linuxmail.org&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2005-09-20, generated by lfparser version 2.52</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
